; ModuleID = 'coreutils-8.27/src/b2sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.blake2b_state__ = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64, i8 }
%struct.blake2b_param__ = type { i8, i8, i8, i8, i32, i32, i32, i8, i8, [14 x i8], [16 x i8], [16 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [71 x i8] c"Usage: %s [OPTION]... [FILE]...\0APrint or check %s (%d-bit) checksums.\0A\00", align 1
@.str.2 = private unnamed_addr constant [7 x i8] c"BLAKE2\00", align 1
@.str.39 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 46, size: 32, elements: !32)
!31 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!33 = !DIEnumerator(name: "_ISupper", value: 256)
!34 = !DIEnumerator(name: "_ISlower", value: 512)
!35 = !DIEnumerator(name: "_ISalpha", value: 1024)
!36 = !DIEnumerator(name: "_ISdigit", value: 2048)
!37 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!38 = !DIEnumerator(name: "_ISspace", value: 8192)
!39 = !DIEnumerator(name: "_ISprint", value: 16384)
!40 = !DIEnumerator(name: "_ISgraph", value: 32768)
!41 = !DIEnumerator(name: "_ISblank", value: 1)
!42 = !DIEnumerator(name: "_IScntrl", value: 2)
!43 = !DIEnumerator(name: "_ISpunct", value: 4)
!44 = !DIEnumerator(name: "_ISalnum", value: 8)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !47, file: !46, line: 187, size: 32, elements: !57)
!46 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!47 = distinct !DISubprogram(name: "select_plural", scope: !46, file: !46, line: 183, type: !48, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !55)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !51}
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !52, line: 112, baseType: !53)
!52 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !54, line: 62, baseType: !50)
!54 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!55 = !{!56}
!56 = !DILocalVariable(name: "n", arg: 1, scope: !47, file: !46, line: 183, type: !51)
!57 = !{!58}
!58 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 45, size: 32, elements: !61)
!60 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!61 = !{!62, !63, !64, !65, !66, !67}
!62 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!63 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!64 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!65 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!66 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!67 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!68 = !{!69, !71, !72, !74, !75, !76, !78, !77}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !73, line: 62, baseType: !50)
!73 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!74 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!75 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!79 = !{!80, !83, !85, !87, !89, !91, !0, !112, !114, !116, !118, !120, !122, !127, !133, !237, !239, !247}
!80 = !DIGlobalVariableExpression(var: !81)
!81 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 131, type: !82, isLocal: true, isDefinition: true)
!82 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!83 = !DIGlobalVariableExpression(var: !84)
!84 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !2, file: !3, line: 134, type: !72, isLocal: true, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86)
!86 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !2, file: !3, line: 137, type: !72, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88)
!88 = distinct !DIGlobalVariable(name: "b2_algorithm", scope: !2, file: !3, line: 180, type: !5, isLocal: true, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90)
!90 = distinct !DIGlobalVariable(name: "b2_length", scope: !2, file: !3, line: 181, type: !51, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92)
!92 = distinct !DIGlobalVariable(name: "infomap", scope: !93, file: !46, line: 632, type: !109, isLocal: true, isDefinition: true)
!93 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !46, file: !46, line: 630, type: !94, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !98)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!98 = !{!99, !100, !101, !108}
!99 = !DILocalVariable(name: "program", arg: 1, scope: !93, file: !46, line: 630, type: !96)
!100 = !DILocalVariable(name: "node", scope: !93, file: !46, line: 642, type: !96)
!101 = !DILocalVariable(name: "map_prog", scope: !93, file: !46, line: 643, type: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !93, file: !46, line: 632, size: 128, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !104, file: !46, line: 632, baseType: !96, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !104, file: !46, line: 632, baseType: !96, size: 64, offset: 64)
!108 = !DILocalVariable(name: "lc_messages", scope: !93, file: !46, line: 655, type: !96)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 896, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 7)
!112 = !DIGlobalVariableExpression(var: !113)
!113 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 141, type: !82, isLocal: true, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115)
!115 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 145, type: !82, isLocal: true, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117)
!117 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 151, type: !82, isLocal: true, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119)
!119 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 148, type: !82, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121)
!121 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 155, type: !82, isLocal: true, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123)
!123 = distinct !DIGlobalVariable(name: "blake2_max_len", scope: !2, file: !3, line: 186, type: !124, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 1)
!127 = !DIGlobalVariableExpression(var: !128)
!128 = distinct !DIGlobalVariable(name: "algorithm_in_string", scope: !2, file: !3, line: 161, type: !129, isLocal: true, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, elements: !131)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!131 = !{!132}
!132 = !DISubrange(count: 2)
!133 = !DIGlobalVariableExpression(var: !134)
!134 = distinct !DIGlobalVariable(name: "bin2hex", scope: !135, file: !3, line: 723, type: !234, isLocal: true, isDefinition: true)
!135 = distinct !DISubprogram(name: "digest_check", scope: !3, file: !3, line: 644, type: !136, isLocal: true, isDefinition: true, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !138)
!136 = !DISubroutineType(types: !137)
!137 = !{!82, !96}
!138 = !{!139, !140, !193, !194, !195, !196, !197, !198, !199, !203, !204, !205, !206, !207, !208, !210, !211, !212, !216, !219, !220, !221, !225, !226, !232}
!139 = !DILocalVariable(name: "checkfile_name", arg: 1, scope: !135, file: !3, line: 644, type: !96)
!140 = !DILocalVariable(name: "checkfile_stream", scope: !135, file: !3, line: 646, type: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !143, line: 7, baseType: !144)
!143 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !145, line: 241, size: 1728, elements: !146)
!145 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !167, !168, !169, !170, !173, !174, !176, !178, !181, !183, !184, !185, !186, !187, !188, !189}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !144, file: !145, line: 242, baseType: !74, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !144, file: !145, line: 247, baseType: !69, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !144, file: !145, line: 248, baseType: !69, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !144, file: !145, line: 249, baseType: !69, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !144, file: !145, line: 250, baseType: !69, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !144, file: !145, line: 251, baseType: !69, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !144, file: !145, line: 252, baseType: !69, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !144, file: !145, line: 253, baseType: !69, size: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !144, file: !145, line: 254, baseType: !69, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !144, file: !145, line: 256, baseType: !69, size: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !144, file: !145, line: 257, baseType: !69, size: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !144, file: !145, line: 258, baseType: !69, size: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !144, file: !145, line: 260, baseType: !160, size: 64, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !145, line: 156, size: 192, elements: !162)
!162 = !{!163, !164, !166}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !161, file: !145, line: 157, baseType: !160, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !161, file: !145, line: 158, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !161, file: !145, line: 162, baseType: !74, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !144, file: !145, line: 262, baseType: !165, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !144, file: !145, line: 264, baseType: !74, size: 32, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !144, file: !145, line: 268, baseType: !74, size: 32, offset: 928)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !144, file: !145, line: 270, baseType: !171, size: 64, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !54, line: 140, baseType: !172)
!172 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !144, file: !145, line: 274, baseType: !78, size: 16, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !144, file: !145, line: 275, baseType: !175, size: 8, offset: 1040)
!175 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !144, file: !145, line: 276, baseType: !177, size: 8, offset: 1048)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8, elements: !125)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !144, file: !145, line: 280, baseType: !179, size: 64, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !145, line: 150, baseType: null)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !144, file: !145, line: 289, baseType: !182, size: 64, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !54, line: 141, baseType: !172)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !144, file: !145, line: 297, baseType: !71, size: 64, offset: 1216)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !144, file: !145, line: 298, baseType: !71, size: 64, offset: 1280)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !144, file: !145, line: 299, baseType: !71, size: 64, offset: 1344)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !144, file: !145, line: 300, baseType: !71, size: 64, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !144, file: !145, line: 302, baseType: !72, size: 64, offset: 1472)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !144, file: !145, line: 303, baseType: !74, size: 32, offset: 1536)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !144, file: !145, line: 305, baseType: !190, size: 160, offset: 1568)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 160, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 20)
!193 = !DILocalVariable(name: "n_misformatted_lines", scope: !135, file: !3, line: 647, type: !51)
!194 = !DILocalVariable(name: "n_improperly_formatted_lines", scope: !135, file: !3, line: 648, type: !51)
!195 = !DILocalVariable(name: "n_mismatched_checksums", scope: !135, file: !3, line: 649, type: !51)
!196 = !DILocalVariable(name: "n_open_or_read_failures", scope: !135, file: !3, line: 650, type: !51)
!197 = !DILocalVariable(name: "properly_formatted_lines", scope: !135, file: !3, line: 651, type: !82)
!198 = !DILocalVariable(name: "matched_checksums", scope: !135, file: !3, line: 652, type: !82)
!199 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !135, file: !3, line: 653, type: !200)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 576, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 72)
!203 = !DILocalVariable(name: "bin_buffer", scope: !135, file: !3, line: 655, type: !76)
!204 = !DILocalVariable(name: "line_number", scope: !135, file: !3, line: 656, type: !51)
!205 = !DILocalVariable(name: "line", scope: !135, file: !3, line: 657, type: !69)
!206 = !DILocalVariable(name: "line_chars_allocated", scope: !135, file: !3, line: 658, type: !72)
!207 = !DILocalVariable(name: "is_stdin", scope: !135, file: !3, line: 659, type: !82)
!208 = !DILocalVariable(name: "filename", scope: !209, file: !3, line: 682, type: !69)
!209 = distinct !DILexicalBlock(scope: !135, file: !3, line: 681, column: 5)
!210 = !DILocalVariable(name: "binary", scope: !209, file: !3, line: 683, type: !74)
!211 = !DILocalVariable(name: "hex_digest", scope: !209, file: !3, line: 684, type: !76)
!212 = !DILocalVariable(name: "line_length", scope: !209, file: !3, line: 685, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !214, line: 109, baseType: !215)
!214 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !54, line: 181, baseType: !172)
!216 = !DILocalVariable(name: "ok", scope: !217, file: !3, line: 727, type: !82)
!217 = distinct !DILexicalBlock(scope: !218, file: !3, line: 722, column: 9)
!218 = distinct !DILexicalBlock(scope: !209, file: !3, line: 704, column: 11)
!219 = !DILocalVariable(name: "missing", scope: !217, file: !3, line: 728, type: !82)
!220 = !DILocalVariable(name: "needs_escape", scope: !217, file: !3, line: 731, type: !82)
!221 = !DILocalVariable(name: "digest_bin_bytes", scope: !222, file: !3, line: 755, type: !72)
!222 = distinct !DILexicalBlock(scope: !223, file: !3, line: 754, column: 13)
!223 = distinct !DILexicalBlock(scope: !224, file: !3, line: 748, column: 20)
!224 = distinct !DILexicalBlock(scope: !217, file: !3, line: 737, column: 15)
!225 = !DILocalVariable(name: "cnt", scope: !222, file: !3, line: 756, type: !72)
!226 = !DILocalVariable(name: "__res", scope: !227, file: !3, line: 762, type: !74)
!227 = distinct !DILexicalBlock(scope: !228, file: !3, line: 762, column: 23)
!228 = distinct !DILexicalBlock(scope: !229, file: !3, line: 762, column: 23)
!229 = distinct !DILexicalBlock(scope: !230, file: !3, line: 761, column: 17)
!230 = distinct !DILexicalBlock(scope: !231, file: !3, line: 760, column: 15)
!231 = distinct !DILexicalBlock(scope: !222, file: !3, line: 760, column: 15)
!232 = !DILocalVariable(name: "__res", scope: !233, file: !3, line: 764, type: !74)
!233 = distinct !DILexicalBlock(scope: !228, file: !3, line: 764, column: 27)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 128, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 16)
!237 = !DIGlobalVariableExpression(var: !238)
!238 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 158, type: !74, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240)
!240 = distinct !DIGlobalVariable(name: "blake2fns", scope: !2, file: !3, line: 182, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 64, elements: !125)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2fn", file: !243, line: 17, baseType: !244)
!243 = !DIFile(filename: "src/blake2/b2sum.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!74, !141, !71, !72}
!247 = !DIGlobalVariableExpression(var: !248)
!248 = distinct !DIGlobalVariable(name: "algorithm_out_string", scope: !2, file: !3, line: 165, type: !129, isLocal: true, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 3328, elements: !259)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !252, line: 50, size: 256, elements: !253)
!252 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!253 = !{!254, !255, !256, !258}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !252, line: 52, baseType: !96, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !251, file: !252, line: 55, baseType: !74, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !251, file: !252, line: 56, baseType: !257, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !251, file: !252, line: 57, baseType: !74, size: 32, offset: 192)
!259 = !{!260}
!260 = !DISubrange(count: 13)
!261 = !DIGlobalVariableExpression(var: !262)
!262 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !263, file: !264, line: 23, type: !305, isLocal: true, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !265, retainedTypes: !274, globals: !285)
!264 = !DIFile(filename: "src/blake2/blake2b-ref.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!265 = !{!266}
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blake2b_constant", file: !267, line: 40, size: 32, elements: !268)
!267 = !DIFile(filename: "src/blake2/blake2.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!268 = !{!269, !270, !271, !272, !273}
!269 = !DIEnumerator(name: "BLAKE2B_BLOCKBYTES", value: 128)
!270 = !DIEnumerator(name: "BLAKE2B_OUTBYTES", value: 64)
!271 = !DIEnumerator(name: "BLAKE2B_KEYBYTES", value: 64)
!272 = !DIEnumerator(name: "BLAKE2B_SALTBYTES", value: 16)
!273 = !DIEnumerator(name: "BLAKE2B_PERSONALBYTES", value: 16)
!274 = !{!275, !277, !280, !71, !282, !284}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !278, line: 24, baseType: !279)
!278 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !54, line: 37, baseType: !77)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !278, line: 27, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !54, line: 44, baseType: !50)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!285 = !{!261, !286, !300}
!286 = !DIGlobalVariableExpression(var: !287)
!287 = distinct !DIGlobalVariable(name: "memset_v", scope: !288, file: !289, line: 156, type: !295, isLocal: true, isDefinition: true)
!288 = distinct !DISubprogram(name: "secure_zero_memory", scope: !289, file: !289, line: 154, type: !290, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: true, unit: !263, variables: !292)
!289 = !DIFile(filename: "src/blake2/blake2-impl.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!290 = !DISubroutineType(types: !291)
!291 = !{null, !71, !72}
!292 = !{!293, !294}
!293 = !DILocalVariable(name: "v", arg: 1, scope: !288, file: !289, line: 154, type: !71)
!294 = !DILocalVariable(name: "n", arg: 2, scope: !288, file: !289, line: 154, type: !72)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!71, !71, !74, !72}
!300 = !DIGlobalVariableExpression(var: !301)
!301 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !263, file: !264, line: 31, type: !302, isLocal: true, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 1536, elements: !303)
!303 = !{!304, !236}
!304 = !DISubrange(count: 12)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 512, elements: !307)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!307 = !{!308}
!308 = !DISubrange(count: 8)
!309 = !DIGlobalVariableExpression(var: !310)
!310 = distinct !DIGlobalVariable(name: "Version", scope: !311, file: !312, line: 2, type: !96, isLocal: false, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, globals: !314)
!312 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!313 = !{}
!314 = !{!309}
!315 = !DIGlobalVariableExpression(var: !316)
!316 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !317, file: !322, line: 69, type: !323, isLocal: false, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !319, retainedTypes: !320, globals: !321)
!318 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!319 = !{!8}
!320 = !{!71, !77}
!321 = !{!315}
!322 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !324, line: 55, baseType: !325)
!324 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{null}
!328 = !DIGlobalVariableExpression(var: !329)
!329 = distinct !DIGlobalVariable(name: "file_name", scope: !330, file: !335, line: 36, type: !96, isLocal: true, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, globals: !332)
!331 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!332 = !{!328, !333}
!333 = !DIGlobalVariableExpression(var: !334)
!334 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !330, file: !335, line: 46, type: !82, isLocal: true, isDefinition: true)
!335 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!336 = !DIGlobalVariableExpression(var: !337)
!337 = distinct !DIGlobalVariable(name: "exit_failure", scope: !338, file: !341, line: 24, type: !342, isLocal: false, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, globals: !340)
!339 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!340 = !{!336}
!341 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!342 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !74)
!343 = !DIGlobalVariableExpression(var: !344)
!344 = distinct !DIGlobalVariable(name: "program_name", scope: !345, file: !349, line: 33, type: !96, isLocal: false, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !347, globals: !348)
!346 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!347 = !{!71, !69}
!348 = !{!343}
!349 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!350 = !DIGlobalVariableExpression(var: !351)
!351 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !352, file: !364, line: 77, type: !397, isLocal: false, isDefinition: true)
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !354, retainedTypes: !360, globals: !361)
!353 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!354 = !{!8, !355, !30}
!355 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !9, line: 242, size: 32, elements: !356)
!356 = !{!357, !358, !359}
!357 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!358 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!359 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!360 = !{!74, !78, !72, !69}
!361 = !{!350, !362, !369, !379, !381, !386, !393, !395}
!362 = !DIGlobalVariableExpression(var: !363)
!363 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !352, file: !364, line: 93, type: !365, isLocal: false, isDefinition: true)
!364 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 320, elements: !367)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!367 = !{!368}
!368 = !DISubrange(count: 10)
!369 = !DIGlobalVariableExpression(var: !370)
!370 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !352, file: !364, line: 1043, type: !371, isLocal: false, isDefinition: true)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !364, line: 57, size: 448, elements: !372)
!372 = !{!373, !374, !375, !377, !378}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !371, file: !364, line: 60, baseType: !8, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !371, file: !364, line: 63, baseType: !74, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !371, file: !364, line: 67, baseType: !376, size: 256, offset: 64)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 256, elements: !307)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !371, file: !364, line: 70, baseType: !96, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !371, file: !364, line: 73, baseType: !96, size: 64, offset: 384)
!379 = !DIGlobalVariableExpression(var: !380)
!380 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !352, file: !364, line: 108, type: !371, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382)
!382 = distinct !DIGlobalVariable(name: "slot0", scope: !352, file: !364, line: 834, type: !383, isLocal: true, isDefinition: true)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 2048, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 256)
!386 = !DIGlobalVariableExpression(var: !387)
!387 = distinct !DIGlobalVariable(name: "slotvec", scope: !352, file: !364, line: 837, type: !388, isLocal: true, isDefinition: true)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !364, line: 826, size: 128, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !389, file: !364, line: 828, baseType: !72, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !389, file: !364, line: 829, baseType: !69, size: 64, offset: 64)
!393 = !DIGlobalVariableExpression(var: !394)
!394 = distinct !DIGlobalVariable(name: "nslots", scope: !352, file: !364, line: 835, type: !74, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396)
!396 = distinct !DIGlobalVariable(name: "slotvec0", scope: !352, file: !364, line: 836, type: !389, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 704, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 11)
!400 = !DIGlobalVariableExpression(var: !401)
!401 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !402, file: !405, line: 26, type: !406, isLocal: false, isDefinition: true)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, globals: !404)
!403 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!404 = !{!400}
!405 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 376, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 47)
!409 = !DIGlobalVariableExpression(var: !410)
!410 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !411, file: !412, line: 335, type: !74, isLocal: true, isDefinition: true)
!411 = distinct !DISubprogram(name: "rpl_fcntl", scope: !412, file: !412, line: 272, type: !413, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !415, variables: !418)
!412 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!413 = !DISubroutineType(types: !414)
!414 = !{!74, !74, !74, null}
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, globals: !417)
!416 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!417 = !{!409}
!418 = !{!419, !420, !421, !432, !433, !436, !439, !442}
!419 = !DILocalVariable(name: "fd", arg: 1, scope: !411, file: !412, line: 272, type: !74)
!420 = !DILocalVariable(name: "action", arg: 2, scope: !411, file: !412, line: 272, type: !74)
!421 = !DILocalVariable(name: "arg", scope: !411, file: !412, line: 274, type: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !423, line: 30, baseType: !424)
!423 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !416, line: 274, baseType: !425)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 192, elements: !125)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !416, line: 274, size: 192, elements: !427)
!427 = !{!428, !429, !430, !431}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !426, file: !416, line: 274, baseType: !75, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !426, file: !416, line: 274, baseType: !75, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !426, file: !416, line: 274, baseType: !71, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !426, file: !416, line: 274, baseType: !71, size: 64, offset: 128)
!432 = !DILocalVariable(name: "result", scope: !411, file: !412, line: 275, type: !74)
!433 = !DILocalVariable(name: "target", scope: !434, file: !412, line: 322, type: !74)
!434 = distinct !DILexicalBlock(scope: !435, file: !412, line: 321, column: 7)
!435 = distinct !DILexicalBlock(scope: !411, file: !412, line: 278, column: 5)
!436 = !DILocalVariable(name: "flags", scope: !437, file: !412, line: 359, type: !74)
!437 = distinct !DILexicalBlock(scope: !438, file: !412, line: 358, column: 11)
!438 = distinct !DILexicalBlock(scope: !434, file: !412, line: 357, column: 13)
!439 = !DILocalVariable(name: "saved_errno", scope: !440, file: !412, line: 362, type: !74)
!440 = distinct !DILexicalBlock(scope: !441, file: !412, line: 361, column: 15)
!441 = distinct !DILexicalBlock(scope: !437, file: !412, line: 360, column: 17)
!442 = !DILocalVariable(name: "p", scope: !443, file: !412, line: 404, type: !71)
!443 = distinct !DILexicalBlock(scope: !435, file: !412, line: 402, column: 7)
!444 = !DIGlobalVariableExpression(var: !445)
!445 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !446, file: !789, line: 120, type: !790, isLocal: true, isDefinition: true)
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !448, retainedTypes: !787, globals: !788)
!447 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!448 = !{!449}
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !450, line: 41, size: 32, elements: !451)
!450 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!451 = !{!452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!452 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!453 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!454 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!455 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!456 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!457 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!458 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!459 = !DIEnumerator(name: "DAY_1", value: 131079)
!460 = !DIEnumerator(name: "DAY_2", value: 131080)
!461 = !DIEnumerator(name: "DAY_3", value: 131081)
!462 = !DIEnumerator(name: "DAY_4", value: 131082)
!463 = !DIEnumerator(name: "DAY_5", value: 131083)
!464 = !DIEnumerator(name: "DAY_6", value: 131084)
!465 = !DIEnumerator(name: "DAY_7", value: 131085)
!466 = !DIEnumerator(name: "ABMON_1", value: 131086)
!467 = !DIEnumerator(name: "ABMON_2", value: 131087)
!468 = !DIEnumerator(name: "ABMON_3", value: 131088)
!469 = !DIEnumerator(name: "ABMON_4", value: 131089)
!470 = !DIEnumerator(name: "ABMON_5", value: 131090)
!471 = !DIEnumerator(name: "ABMON_6", value: 131091)
!472 = !DIEnumerator(name: "ABMON_7", value: 131092)
!473 = !DIEnumerator(name: "ABMON_8", value: 131093)
!474 = !DIEnumerator(name: "ABMON_9", value: 131094)
!475 = !DIEnumerator(name: "ABMON_10", value: 131095)
!476 = !DIEnumerator(name: "ABMON_11", value: 131096)
!477 = !DIEnumerator(name: "ABMON_12", value: 131097)
!478 = !DIEnumerator(name: "MON_1", value: 131098)
!479 = !DIEnumerator(name: "MON_2", value: 131099)
!480 = !DIEnumerator(name: "MON_3", value: 131100)
!481 = !DIEnumerator(name: "MON_4", value: 131101)
!482 = !DIEnumerator(name: "MON_5", value: 131102)
!483 = !DIEnumerator(name: "MON_6", value: 131103)
!484 = !DIEnumerator(name: "MON_7", value: 131104)
!485 = !DIEnumerator(name: "MON_8", value: 131105)
!486 = !DIEnumerator(name: "MON_9", value: 131106)
!487 = !DIEnumerator(name: "MON_10", value: 131107)
!488 = !DIEnumerator(name: "MON_11", value: 131108)
!489 = !DIEnumerator(name: "MON_12", value: 131109)
!490 = !DIEnumerator(name: "AM_STR", value: 131110)
!491 = !DIEnumerator(name: "PM_STR", value: 131111)
!492 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!493 = !DIEnumerator(name: "D_FMT", value: 131113)
!494 = !DIEnumerator(name: "T_FMT", value: 131114)
!495 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!496 = !DIEnumerator(name: "ERA", value: 131116)
!497 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!498 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!499 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!500 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!501 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!502 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!503 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!504 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!505 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!506 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!507 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!508 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!509 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!510 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!511 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!512 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!513 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!514 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!515 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!516 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!517 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!518 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!519 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!520 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!521 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!522 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!523 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!524 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!525 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!526 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!527 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!528 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!529 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!530 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!531 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!532 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!533 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!534 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!535 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!536 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!537 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!538 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!539 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!540 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!541 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!542 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!543 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!544 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!545 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!546 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!547 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!548 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!549 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!550 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!551 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!552 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!553 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!554 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!555 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!556 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!557 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!558 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!559 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!560 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!561 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!562 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!563 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!564 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!565 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!566 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!567 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!568 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!569 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!570 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!571 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!572 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!573 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!574 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!575 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!576 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!577 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!578 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!579 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!580 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!581 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!582 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!583 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!584 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!585 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!586 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!587 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!588 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!589 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!590 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!591 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!592 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!593 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!594 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!595 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!596 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!597 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!598 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!599 = !DIEnumerator(name: "CODESET", value: 14)
!600 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!601 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!602 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!603 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!604 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!605 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!606 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!607 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!608 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!609 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!610 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!611 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!612 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!613 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!614 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!615 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!616 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!617 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!618 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!619 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!620 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!621 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!622 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!623 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!624 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!625 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!626 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!627 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!628 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!629 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!630 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!631 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!632 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!633 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!634 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!635 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!636 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!637 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!638 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!639 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!640 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!641 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!642 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!643 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!644 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!645 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!646 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!647 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!648 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!649 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!650 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!651 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!652 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!653 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!654 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!655 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!656 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!657 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!658 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!659 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!660 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!661 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!662 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!663 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!664 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!665 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!666 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!667 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!668 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!669 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!670 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!671 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!672 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!673 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!674 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!675 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!676 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!677 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!678 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!679 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!680 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!681 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!682 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!683 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!684 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!685 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!686 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!687 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!688 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!689 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!690 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!691 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!692 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!693 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!694 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!695 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!696 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!697 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!698 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!699 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!700 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!701 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!702 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!703 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!704 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!705 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!706 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!707 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!708 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!709 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!710 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!711 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!712 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!713 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!714 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!715 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!716 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!717 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!718 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!719 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!720 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!721 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!722 = !DIEnumerator(name: "THOUSEP", value: 65537)
!723 = !DIEnumerator(name: "__GROUPING", value: 65538)
!724 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!725 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!726 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!727 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!728 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!729 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!730 = !DIEnumerator(name: "__YESSTR", value: 327682)
!731 = !DIEnumerator(name: "__NOSTR", value: 327683)
!732 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!733 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!734 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!735 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!736 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!737 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!738 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!739 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!740 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!741 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!742 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!743 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!744 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!745 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!746 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!747 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!748 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!749 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!750 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!751 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!752 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!753 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!754 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!755 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!756 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!757 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!758 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!759 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!760 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!761 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!762 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!763 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!764 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!765 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!766 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!767 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!768 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!769 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!770 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!771 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!772 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!773 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!774 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!775 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!776 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!777 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!778 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!779 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!780 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!781 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!782 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!783 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!784 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!785 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!786 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!787 = !{!71, !69, !76}
!788 = !{!444}
!789 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!790 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !96)
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !792, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !793, globals: !794)
!792 = !DIFile(filename: "src/blake2/b2sum.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!793 = !{!284}
!794 = !{!795}
!795 = !DIGlobalVariableExpression(var: !796)
!796 = distinct !DIGlobalVariable(name: "buffer_length", scope: !797, file: !792, line: 35, type: !865, isLocal: true, isDefinition: true)
!797 = distinct !DISubprogram(name: "blake2b_stream", scope: !792, file: !792, line: 30, type: !798, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, unit: !791, variables: !840)
!798 = !DISubroutineType(types: !799)
!799 = !{!74, !800, !71, !72}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !143, line: 7, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !145, line: 241, size: 1728, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !802, file: !145, line: 242, baseType: !74, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !802, file: !145, line: 247, baseType: !69, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !802, file: !145, line: 248, baseType: !69, size: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !802, file: !145, line: 249, baseType: !69, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !802, file: !145, line: 250, baseType: !69, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !802, file: !145, line: 251, baseType: !69, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !802, file: !145, line: 252, baseType: !69, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !802, file: !145, line: 253, baseType: !69, size: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !802, file: !145, line: 254, baseType: !69, size: 64, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !802, file: !145, line: 256, baseType: !69, size: 64, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !802, file: !145, line: 257, baseType: !69, size: 64, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !802, file: !145, line: 258, baseType: !69, size: 64, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !802, file: !145, line: 260, baseType: !817, size: 64, offset: 768)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !145, line: 156, size: 192, elements: !819)
!819 = !{!820, !821, !823}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !818, file: !145, line: 157, baseType: !817, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !818, file: !145, line: 158, baseType: !822, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !818, file: !145, line: 162, baseType: !74, size: 32, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !802, file: !145, line: 262, baseType: !822, size: 64, offset: 832)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !802, file: !145, line: 264, baseType: !74, size: 32, offset: 896)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !802, file: !145, line: 268, baseType: !74, size: 32, offset: 928)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !802, file: !145, line: 270, baseType: !171, size: 64, offset: 960)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !802, file: !145, line: 274, baseType: !78, size: 16, offset: 1024)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !802, file: !145, line: 275, baseType: !175, size: 8, offset: 1040)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !802, file: !145, line: 276, baseType: !177, size: 8, offset: 1048)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !802, file: !145, line: 280, baseType: !179, size: 64, offset: 1088)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !802, file: !145, line: 289, baseType: !182, size: 64, offset: 1152)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !802, file: !145, line: 297, baseType: !71, size: 64, offset: 1216)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !802, file: !145, line: 298, baseType: !71, size: 64, offset: 1280)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !802, file: !145, line: 299, baseType: !71, size: 64, offset: 1344)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !802, file: !145, line: 300, baseType: !71, size: 64, offset: 1408)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !802, file: !145, line: 302, baseType: !72, size: 64, offset: 1472)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !802, file: !145, line: 303, baseType: !74, size: 32, offset: 1536)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !802, file: !145, line: 305, baseType: !190, size: 160, offset: 1568)
!840 = !{!841, !842, !843, !844, !845, !846, !847, !864}
!841 = !DILocalVariable(name: "stream", arg: 1, scope: !797, file: !792, line: 30, type: !800)
!842 = !DILocalVariable(name: "resstream", arg: 2, scope: !797, file: !792, line: 30, type: !71)
!843 = !DILocalVariable(name: "outbytes", arg: 3, scope: !797, file: !792, line: 30, type: !72)
!844 = !DILocalVariable(name: "ret", scope: !797, file: !792, line: 32, type: !74)
!845 = !DILocalVariable(name: "sum", scope: !797, file: !792, line: 33, type: !72)
!846 = !DILocalVariable(name: "n", scope: !797, file: !792, line: 33, type: !72)
!847 = !DILocalVariable(name: "S", scope: !797, file: !792, line: 34, type: !848)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !849, size: 1984, elements: !125)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2b_state", file: !267, line: 69, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_state__", file: !267, line: 60, size: 1984, elements: !851)
!851 = !{!852, !854, !856, !857, !861, !862, !863}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !850, file: !267, line: 62, baseType: !853, size: 512)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 512, elements: !307)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !850, file: !267, line: 63, baseType: !855, size: 128, offset: 512)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 128, elements: !131)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !850, file: !267, line: 64, baseType: !855, size: 128, offset: 640)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !850, file: !267, line: 65, baseType: !858, size: 1024, offset: 768)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 1024, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !850, file: !267, line: 66, baseType: !72, size: 64, offset: 1792)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "outlen", scope: !850, file: !267, line: 67, baseType: !72, size: 64, offset: 1856)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "last_node", scope: !850, file: !267, line: 68, baseType: !277, size: 8, offset: 1920)
!864 = !DILocalVariable(name: "buffer", scope: !797, file: !792, line: 36, type: !284)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !868)
!867 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!868 = !{!59}
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313)
!870 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!871 = distinct !DICompileUnit(language: DW_LANG_C99, file: !872, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313)
!872 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!873 = distinct !DICompileUnit(language: DW_LANG_C99, file: !874, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !875, retainedTypes: !880)
!874 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!875 = !{!876}
!876 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !877, line: 41, size: 32, elements: !878)
!877 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!878 = !{!879}
!879 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!880 = !{!71}
!881 = distinct !DICompileUnit(language: DW_LANG_C99, file: !882, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !883, retainedTypes: !897)
!882 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!883 = !{!884}
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !886, file: !885, line: 192, size: 32, elements: !895)
!885 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!886 = distinct !DISubprogram(name: "x2nrealloc", scope: !885, file: !885, line: 180, type: !887, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !881, variables: !890)
!887 = !DISubroutineType(types: !888)
!888 = !{!71, !71, !889, !72}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!890 = !{!891, !892, !893, !894}
!891 = !DILocalVariable(name: "p", arg: 1, scope: !886, file: !885, line: 180, type: !71)
!892 = !DILocalVariable(name: "pn", arg: 2, scope: !886, file: !885, line: 180, type: !889)
!893 = !DILocalVariable(name: "s", arg: 3, scope: !886, file: !885, line: 180, type: !72)
!894 = !DILocalVariable(name: "n", scope: !886, file: !885, line: 182, type: !72)
!895 = !{!896}
!896 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!897 = !{!72, !69, !71}
!898 = distinct !DICompileUnit(language: DW_LANG_C99, file: !899, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313)
!899 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !902)
!901 = !DIFile(filename: "./lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!902 = !{!22}
!903 = distinct !DICompileUnit(language: DW_LANG_C99, file: !904, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !905, retainedTypes: !906)
!904 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!905 = !{!22, !30}
!906 = !{!74, !78}
!907 = distinct !DICompileUnit(language: DW_LANG_C99, file: !908, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !905, retainedTypes: !906)
!908 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !880)
!910 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!911 = distinct !DICompileUnit(language: DW_LANG_C99, file: !912, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313)
!912 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !880)
!914 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !880)
!916 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!917 = distinct !DICompileUnit(language: DW_LANG_C99, file: !918, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !919)
!918 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!919 = !{!72}
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313)
!921 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!922 = distinct !DICompileUnit(language: DW_LANG_C99, file: !923, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313)
!923 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!924 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!925 = !{i32 2, !"Dwarf Version", i32 4}
!926 = !{i32 2, !"Debug Info Version", i32 3}
!927 = !{i32 1, !"wchar_size", i32 4}
!928 = !{i32 7, !"PIC Level", i32 2}
!929 = !{i32 7, !"PIE Level", i32 2}
!930 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 223, type: !931, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !933)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !74}
!933 = !{!934}
!934 = !DILocalVariable(name: "status", arg: 1, scope: !930, file: !3, line: 223, type: !74)
!935 = !DIExpression()
!936 = !DILocation(line: 223, column: 12, scope: !930)
!937 = !DILocation(line: 225, column: 14, scope: !938)
!938 = distinct !DILexicalBlock(scope: !930, file: !3, line: 225, column: 7)
!939 = !DILocation(line: 225, column: 7, scope: !930)
!940 = !DILocation(line: 226, column: 5, scope: !941)
!941 = distinct !DILexicalBlock(scope: !938, file: !3, line: 226, column: 5)
!942 = !{!943, !943, i64 0}
!943 = !{!"any pointer", !944, i64 0}
!944 = !{!"omnipotent char", !945, i64 0}
!945 = !{!"Simple C/C++ TBAA"}
!946 = !DILocation(line: 229, column: 7, scope: !947)
!947 = distinct !DILexicalBlock(scope: !938, file: !3, line: 228, column: 5)
!948 = !DILocation(line: 580, column: 3, scope: !949, inlinedAt: !950)
!949 = distinct !DISubprogram(name: "emit_stdin_note", scope: !46, file: !46, line: 578, type: !326, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !313)
!950 = distinct !DILocation(line: 237, column: 7, scope: !947)
!951 = !DILocation(line: 244, column: 9, scope: !952)
!952 = distinct !DILexicalBlock(scope: !947, file: !3, line: 238, column: 11)
!953 = !DILocation(line: 249, column: 7, scope: !947)
!954 = !DILocation(line: 253, column: 9, scope: !947)
!955 = !DILocation(line: 258, column: 7, scope: !947)
!956 = !DILocation(line: 266, column: 9, scope: !957)
!957 = distinct !DILexicalBlock(scope: !947, file: !3, line: 261, column: 11)
!958 = !DILocation(line: 269, column: 7, scope: !947)
!959 = !DILocation(line: 279, column: 7, scope: !947)
!960 = !DILocation(line: 280, column: 7, scope: !947)
!961 = !DILocation(line: 281, column: 7, scope: !947)
!962 = !DILocation(line: 642, column: 15, scope: !93, inlinedAt: !963)
!963 = distinct !DILocation(line: 288, column: 7, scope: !947)
!964 = !DILocation(line: 651, column: 3, scope: !93, inlinedAt: !963)
!965 = !DILocation(line: 655, column: 29, scope: !93, inlinedAt: !963)
!966 = !DILocation(line: 655, column: 15, scope: !93, inlinedAt: !963)
!967 = !DILocation(line: 656, column: 7, scope: !968, inlinedAt: !963)
!968 = distinct !DILexicalBlock(scope: !93, file: !46, line: 656, column: 7)
!969 = !DILocation(line: 656, column: 19, scope: !968, inlinedAt: !963)
!970 = !DILocation(line: 656, column: 22, scope: !968, inlinedAt: !963)
!971 = !DILocation(line: 656, column: 7, scope: !93, inlinedAt: !963)
!972 = !DILocation(line: 662, column: 7, scope: !973, inlinedAt: !963)
!973 = distinct !DILexicalBlock(scope: !968, file: !46, line: 657, column: 5)
!974 = !DILocation(line: 664, column: 5, scope: !973, inlinedAt: !963)
!975 = !DILocation(line: 665, column: 3, scope: !93, inlinedAt: !963)
!976 = !DILocation(line: 667, column: 3, scope: !93, inlinedAt: !963)
!977 = !DILocation(line: 291, column: 3, scope: !930)
!978 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 854, type: !979, isLocal: false, isDefinition: true, scopeLine: 855, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !982)
!979 = !DISubroutineType(types: !980)
!980 = !{!74, !74, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!982 = !{!983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !997, !1000, !1003, !1004, !1007}
!983 = !DILocalVariable(name: "argc", arg: 1, scope: !978, file: !3, line: 854, type: !74)
!984 = !DILocalVariable(name: "argv", arg: 2, scope: !978, file: !3, line: 854, type: !981)
!985 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !978, file: !3, line: 856, type: !200)
!986 = !DILocalVariable(name: "bin_buffer", scope: !978, file: !3, line: 858, type: !76)
!987 = !DILocalVariable(name: "do_check", scope: !978, file: !3, line: 859, type: !82)
!988 = !DILocalVariable(name: "opt", scope: !978, file: !3, line: 860, type: !74)
!989 = !DILocalVariable(name: "ok", scope: !978, file: !3, line: 861, type: !82)
!990 = !DILocalVariable(name: "binary", scope: !978, file: !3, line: 862, type: !74)
!991 = !DILocalVariable(name: "prefix_tag", scope: !978, file: !3, line: 863, type: !82)
!992 = !DILocalVariable(name: "short_opts", scope: !978, file: !3, line: 879, type: !96)
!993 = !DILocalVariable(name: "b2_length_str", scope: !978, file: !3, line: 880, type: !96)
!994 = !DILocalVariable(name: "operand_lim", scope: !978, file: !3, line: 1021, type: !981)
!995 = !DILocalVariable(name: "operandp", scope: !996, file: !3, line: 1025, type: !981)
!996 = distinct !DILexicalBlock(scope: !978, file: !3, line: 1025, column: 3)
!997 = !DILocalVariable(name: "file", scope: !998, file: !3, line: 1027, type: !69)
!998 = distinct !DILexicalBlock(scope: !999, file: !3, line: 1026, column: 5)
!999 = distinct !DILexicalBlock(scope: !996, file: !3, line: 1025, column: 3)
!1000 = !DILocalVariable(name: "file_is_binary", scope: !1001, file: !3, line: 1033, type: !74)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 1032, column: 9)
!1002 = distinct !DILexicalBlock(scope: !998, file: !3, line: 1029, column: 11)
!1003 = !DILocalVariable(name: "missing", scope: !1001, file: !3, line: 1034, type: !82)
!1004 = !DILocalVariable(name: "needs_escape", scope: !1005, file: !3, line: 1047, type: !82)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 1039, column: 13)
!1006 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 1036, column: 15)
!1007 = !DILocalVariable(name: "i", scope: !1005, file: !3, line: 1066, type: !72)
!1008 = !DILocation(line: 653, column: 17, scope: !135, inlinedAt: !1009)
!1009 = distinct !DILocation(line: 1030, column: 15, scope: !1002)
!1010 = !DILocation(line: 854, column: 11, scope: !978)
!1011 = !DILocation(line: 854, column: 24, scope: !978)
!1012 = !DILocation(line: 856, column: 3, scope: !978)
!1013 = !DILocation(line: 856, column: 17, scope: !978)
!1014 = !DILocalVariable(name: "alignment", arg: 2, scope: !1015, file: !46, line: 498, type: !72)
!1015 = distinct !DISubprogram(name: "ptr_align", scope: !46, file: !46, line: 498, type: !1016, isLocal: true, isDefinition: true, scopeLine: 499, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1020)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!71, !1018, !72}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1020 = !{!1021, !1014, !1022, !1023}
!1021 = !DILocalVariable(name: "ptr", arg: 1, scope: !1015, file: !46, line: 498, type: !1018)
!1022 = !DILocalVariable(name: "p0", scope: !1015, file: !46, line: 500, type: !96)
!1023 = !DILocalVariable(name: "p1", scope: !1015, file: !46, line: 501, type: !96)
!1024 = !DILocation(line: 498, column: 36, scope: !1015, inlinedAt: !1025)
!1025 = distinct !DILocation(line: 858, column: 31, scope: !978)
!1026 = !DILocation(line: 501, column: 35, scope: !1015, inlinedAt: !1025)
!1027 = !DILocation(line: 501, column: 15, scope: !1015, inlinedAt: !1025)
!1028 = !DILocation(line: 502, column: 25, scope: !1015, inlinedAt: !1025)
!1029 = !DILocation(line: 502, column: 37, scope: !1015, inlinedAt: !1025)
!1030 = !DILocation(line: 502, column: 23, scope: !1015, inlinedAt: !1025)
!1031 = !DILocation(line: 858, column: 18, scope: !978)
!1032 = !DILocation(line: 859, column: 8, scope: !978)
!1033 = !DILocation(line: 861, column: 8, scope: !978)
!1034 = !DILocation(line: 862, column: 7, scope: !978)
!1035 = !DILocation(line: 863, column: 8, scope: !978)
!1036 = !DILocation(line: 867, column: 21, scope: !978)
!1037 = !DILocation(line: 867, column: 3, scope: !978)
!1038 = !DILocation(line: 868, column: 3, scope: !978)
!1039 = !DILocation(line: 869, column: 3, scope: !978)
!1040 = !DILocation(line: 870, column: 3, scope: !978)
!1041 = !DILocation(line: 872, column: 3, scope: !978)
!1042 = !DILocation(line: 876, column: 12, scope: !978)
!1043 = !DILocation(line: 876, column: 3, scope: !978)
!1044 = !DILocation(line: 885, column: 3, scope: !978)
!1045 = !DILocation(line: 880, column: 15, scope: !978)
!1046 = !DILocation(line: 885, column: 17, scope: !978)
!1047 = !DILocation(line: 860, column: 7, scope: !978)
!1048 = distinct !{!1048, !1044, !1049}
!1049 = !DILocation(line: 938, column: 7, scope: !978)
!1050 = !DILocation(line: 890, column: 33, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !978, file: !3, line: 887, column: 7)
!1052 = !DILocation(line: 891, column: 33, scope: !1051)
!1053 = !DILocation(line: 890, column: 21, scope: !1051)
!1054 = !DILocation(line: 890, column: 19, scope: !1051)
!1055 = !{!1056, !1056, i64 0}
!1056 = !{!"long", !944, i64 0}
!1057 = !DILocation(line: 892, column: 25, scope: !1051)
!1058 = !DILocation(line: 893, column: 23, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 893, column: 13)
!1060 = !DILocation(line: 893, column: 27, scope: !1059)
!1061 = !DILocation(line: 893, column: 13, scope: !1051)
!1062 = !DILocation(line: 895, column: 26, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 894, column: 11)
!1064 = !DILocation(line: 895, column: 51, scope: !1063)
!1065 = !DILocation(line: 895, column: 13, scope: !1063)
!1066 = !DILocation(line: 896, column: 13, scope: !1063)
!1067 = !DILocation(line: 905, column: 9, scope: !1051)
!1068 = !DILocation(line: 910, column: 9, scope: !1051)
!1069 = !DILocation(line: 913, column: 9, scope: !1051)
!1070 = !DILocation(line: 918, column: 9, scope: !1051)
!1071 = !DILocation(line: 921, column: 9, scope: !1051)
!1072 = !DILocation(line: 926, column: 9, scope: !1051)
!1073 = !DILocation(line: 929, column: 9, scope: !1051)
!1074 = !DILocation(line: 933, column: 9, scope: !1051)
!1075 = !DILocation(line: 934, column: 7, scope: !1051)
!1076 = !DILocation(line: 935, column: 7, scope: !1051)
!1077 = !DILocation(line: 937, column: 9, scope: !1051)
!1078 = !DILocation(line: 942, column: 7, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !978, file: !3, line: 942, column: 7)
!1080 = !DILocation(line: 942, column: 17, scope: !1079)
!1081 = !DILocation(line: 942, column: 7, scope: !978)
!1082 = !DILocation(line: 944, column: 20, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 943, column: 5)
!1084 = !DILocation(line: 944, column: 45, scope: !1083)
!1085 = !DILocation(line: 944, column: 7, scope: !1083)
!1086 = !DILocation(line: 945, column: 7, scope: !1083)
!1087 = !{!944, !944, i64 0}
!1088 = !DILocation(line: 950, column: 17, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !978, file: !3, line: 950, column: 7)
!1090 = !DILocation(line: 950, column: 27, scope: !1089)
!1091 = !DILocation(line: 950, column: 22, scope: !1089)
!1092 = !DILocation(line: 951, column: 15, scope: !1089)
!1093 = !DILocation(line: 951, column: 5, scope: !1089)
!1094 = !DILocation(line: 952, column: 22, scope: !978)
!1095 = !DILocation(line: 952, column: 32, scope: !978)
!1096 = !DILocation(line: 952, column: 20, scope: !978)
!1097 = !DILocation(line: 957, column: 7, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !978, file: !3, line: 957, column: 7)
!1099 = !DILocation(line: 957, column: 18, scope: !1098)
!1100 = !DILocation(line: 957, column: 22, scope: !1098)
!1101 = !DILocation(line: 964, column: 19, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1098, file: !3, line: 958, column: 4)
!1103 = !DILocation(line: 964, column: 6, scope: !1102)
!1104 = !DILocation(line: 965, column: 6, scope: !1102)
!1105 = !DILocation(line: 968, column: 18, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !978, file: !3, line: 968, column: 7)
!1107 = !DILocation(line: 970, column: 20, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 969, column: 5)
!1109 = !DILocation(line: 970, column: 7, scope: !1108)
!1110 = !DILocation(line: 972, column: 7, scope: !1108)
!1111 = !DILocation(line: 975, column: 9, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !978, file: !3, line: 975, column: 7)
!1113 = !DILocation(line: 975, column: 19, scope: !1112)
!1114 = !DILocation(line: 977, column: 20, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 976, column: 5)
!1116 = !DILocation(line: 977, column: 7, scope: !1115)
!1117 = !DILocation(line: 979, column: 7, scope: !1115)
!1118 = !DILocation(line: 982, column: 22, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !978, file: !3, line: 982, column: 7)
!1120 = !DILocation(line: 985, column: 14, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 983, column: 5)
!1122 = !DILocation(line: 984, column: 7, scope: !1121)
!1123 = !DILocation(line: 987, column: 7, scope: !1121)
!1124 = !DILocation(line: 990, column: 19, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !978, file: !3, line: 990, column: 7)
!1126 = !DILocation(line: 993, column: 8, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 991, column: 5)
!1128 = !DILocation(line: 992, column: 7, scope: !1127)
!1129 = !DILocation(line: 994, column: 7, scope: !1127)
!1130 = !DILocation(line: 997, column: 12, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !978, file: !3, line: 997, column: 7)
!1132 = !DILocation(line: 1000, column: 8, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 998, column: 5)
!1134 = !DILocation(line: 999, column: 7, scope: !1133)
!1135 = !DILocation(line: 1001, column: 7, scope: !1133)
!1136 = !DILocation(line: 1004, column: 13, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !978, file: !3, line: 1004, column: 7)
!1138 = !DILocation(line: 1007, column: 8, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 1005, column: 5)
!1140 = !DILocation(line: 1006, column: 7, scope: !1139)
!1141 = !DILocation(line: 1008, column: 7, scope: !1139)
!1142 = !DILocation(line: 1011, column: 17, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !978, file: !3, line: 1011, column: 7)
!1144 = !DILocation(line: 1011, column: 16, scope: !1143)
!1145 = !DILocation(line: 1011, column: 14, scope: !1143)
!1146 = !DILocation(line: 1011, column: 7, scope: !978)
!1147 = !DILocation(line: 1014, column: 9, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 1012, column: 4)
!1149 = !DILocation(line: 1013, column: 6, scope: !1148)
!1150 = !DILocation(line: 1015, column: 6, scope: !1148)
!1151 = !DILocation(line: 1018, column: 7, scope: !978)
!1152 = !DILocation(line: 1021, column: 29, scope: !978)
!1153 = !DILocation(line: 1021, column: 10, scope: !978)
!1154 = !DILocation(line: 1022, column: 7, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !978, file: !3, line: 1022, column: 7)
!1156 = !{!1157, !1157, i64 0}
!1157 = !{!"int", !944, i64 0}
!1158 = !DILocation(line: 1022, column: 14, scope: !1155)
!1159 = !DILocation(line: 1022, column: 7, scope: !978)
!1160 = !DILocation(line: 1023, column: 17, scope: !1155)
!1161 = !DILocation(line: 1023, column: 20, scope: !1155)
!1162 = !DILocation(line: 1023, column: 5, scope: !1155)
!1163 = !DILocation(line: 1025, column: 31, scope: !996)
!1164 = !DILocation(line: 1025, column: 15, scope: !996)
!1165 = !DILocation(line: 1025, column: 50, scope: !999)
!1166 = !DILocation(line: 1025, column: 3, scope: !996)
!1167 = !DILocation(line: 1090, column: 23, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !978, file: !3, line: 1090, column: 7)
!1169 = !DILocation(line: 1027, column: 20, scope: !998)
!1170 = !DILocation(line: 1027, column: 13, scope: !998)
!1171 = !DILocation(line: 1029, column: 11, scope: !998)
!1172 = !DILocation(line: 644, column: 27, scope: !135, inlinedAt: !1009)
!1173 = !DILocation(line: 647, column: 13, scope: !135, inlinedAt: !1009)
!1174 = !DILocation(line: 648, column: 13, scope: !135, inlinedAt: !1009)
!1175 = !DILocation(line: 649, column: 13, scope: !135, inlinedAt: !1009)
!1176 = !DILocation(line: 650, column: 13, scope: !135, inlinedAt: !1009)
!1177 = !DILocation(line: 651, column: 8, scope: !135, inlinedAt: !1009)
!1178 = !DILocation(line: 652, column: 8, scope: !135, inlinedAt: !1009)
!1179 = !DILocation(line: 653, column: 3, scope: !135, inlinedAt: !1009)
!1180 = !DILocation(line: 498, column: 36, scope: !1015, inlinedAt: !1181)
!1181 = distinct !DILocation(line: 655, column: 31, scope: !135, inlinedAt: !1009)
!1182 = !DILocation(line: 501, column: 15, scope: !1015, inlinedAt: !1181)
!1183 = !DILocation(line: 655, column: 18, scope: !135, inlinedAt: !1009)
!1184 = !DILocation(line: 657, column: 3, scope: !135, inlinedAt: !1009)
!1185 = !DILocation(line: 658, column: 3, scope: !135, inlinedAt: !1009)
!1186 = !DILocation(line: 659, column: 19, scope: !135, inlinedAt: !1009)
!1187 = !DILocation(line: 661, column: 7, scope: !135, inlinedAt: !1009)
!1188 = !DILocation(line: 664, column: 24, scope: !1189, inlinedAt: !1009)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 662, column: 5)
!1190 = distinct !DILexicalBlock(scope: !135, file: !3, line: 661, column: 7)
!1191 = !DILocation(line: 665, column: 26, scope: !1189, inlinedAt: !1009)
!1192 = !DILocation(line: 646, column: 9, scope: !135, inlinedAt: !1009)
!1193 = !DILocation(line: 666, column: 5, scope: !1189, inlinedAt: !1009)
!1194 = !DILocation(line: 669, column: 26, scope: !1195, inlinedAt: !1009)
!1195 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 668, column: 5)
!1196 = !DILocation(line: 670, column: 28, scope: !1197, inlinedAt: !1009)
!1197 = distinct !DILexicalBlock(scope: !1195, file: !3, line: 670, column: 11)
!1198 = !DILocation(line: 670, column: 11, scope: !1195, inlinedAt: !1009)
!1199 = !DILocation(line: 672, column: 21, scope: !1200, inlinedAt: !1009)
!1200 = distinct !DILexicalBlock(scope: !1197, file: !3, line: 671, column: 9)
!1201 = !DILocation(line: 672, column: 34, scope: !1200, inlinedAt: !1009)
!1202 = !DILocation(line: 672, column: 11, scope: !1200, inlinedAt: !1009)
!1203 = !DILocation(line: 673, column: 11, scope: !1200, inlinedAt: !1009)
!1204 = !DILocation(line: 656, column: 13, scope: !135, inlinedAt: !1009)
!1205 = !DILocation(line: 657, column: 9, scope: !135, inlinedAt: !1009)
!1206 = !DILocation(line: 678, column: 8, scope: !135, inlinedAt: !1009)
!1207 = !DILocation(line: 658, column: 10, scope: !135, inlinedAt: !1009)
!1208 = !DILocation(line: 679, column: 24, scope: !135, inlinedAt: !1009)
!1209 = !DILocation(line: 680, column: 3, scope: !135, inlinedAt: !1009)
!1210 = distinct !{!1210, !1211, !1212}
!1211 = !DILocation(line: 680, column: 3, scope: !135)
!1212 = !DILocation(line: 790, column: 64, scope: !135)
!1213 = !DILocation(line: 687, column: 7, scope: !209, inlinedAt: !1009)
!1214 = !DILocation(line: 688, column: 23, scope: !1215, inlinedAt: !1009)
!1215 = distinct !DILexicalBlock(scope: !209, file: !3, line: 688, column: 11)
!1216 = !DILocation(line: 688, column: 11, scope: !209, inlinedAt: !1009)
!1217 = !DILocation(line: 689, column: 9, scope: !1215, inlinedAt: !1009)
!1218 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !1219, file: !1220, line: 115, type: !981)
!1219 = distinct !DISubprogram(name: "getline", scope: !1220, file: !1220, line: 115, type: !1221, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1223)
!1220 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!215, !981, !889, !141}
!1223 = !{!1218, !1224, !1225}
!1224 = !DILocalVariable(name: "__n", arg: 2, scope: !1219, file: !1220, line: 115, type: !889)
!1225 = !DILocalVariable(name: "__stream", arg: 3, scope: !1219, file: !1220, line: 115, type: !141)
!1226 = !DILocation(line: 115, column: 17, scope: !1219, inlinedAt: !1227)
!1227 = distinct !DILocation(line: 692, column: 21, scope: !209, inlinedAt: !1009)
!1228 = !DILocation(line: 115, column: 36, scope: !1219, inlinedAt: !1227)
!1229 = !DILocation(line: 115, column: 47, scope: !1219, inlinedAt: !1227)
!1230 = !DILocation(line: 117, column: 10, scope: !1219, inlinedAt: !1227)
!1231 = !DILocation(line: 685, column: 15, scope: !209, inlinedAt: !1009)
!1232 = !DILocation(line: 693, column: 23, scope: !1233, inlinedAt: !1009)
!1233 = distinct !DILexicalBlock(scope: !209, file: !3, line: 693, column: 11)
!1234 = !DILocation(line: 693, column: 11, scope: !209, inlinedAt: !1009)
!1235 = !DILocation(line: 697, column: 11, scope: !1236, inlinedAt: !1009)
!1236 = distinct !DILexicalBlock(scope: !209, file: !3, line: 697, column: 11)
!1237 = !DILocation(line: 697, column: 19, scope: !1236, inlinedAt: !1009)
!1238 = !DILocation(line: 697, column: 11, scope: !209, inlinedAt: !1009)
!1239 = !DILocation(line: 701, column: 28, scope: !1240, inlinedAt: !1009)
!1240 = distinct !DILexicalBlock(scope: !209, file: !3, line: 701, column: 11)
!1241 = !DILocation(line: 701, column: 11, scope: !1240, inlinedAt: !1009)
!1242 = !DILocation(line: 701, column: 33, scope: !1240, inlinedAt: !1009)
!1243 = !DILocation(line: 701, column: 11, scope: !209, inlinedAt: !1009)
!1244 = !DILocation(line: 702, column: 29, scope: !1240, inlinedAt: !1009)
!1245 = !DILocation(line: 704, column: 23, scope: !218, inlinedAt: !1009)
!1246 = !DILocation(line: 702, column: 9, scope: !1240, inlinedAt: !1009)
!1247 = !DILocalVariable(name: "s", arg: 1, scope: !1248, file: !3, line: 397, type: !69)
