; ModuleID = 'coreutils-8.27/src/chcon.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.__dirstream = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 72, type: !98, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !23)
!3 = !DIFile(filename: "src/chcon.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !{!24, !57, !59, !61, !63, !66, !70, !72, !74, !76, !78, !0}
!24 = !DIGlobalVariableExpression(var: !25)
!25 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !26, file: !3, line: 573, type: !45, isLocal: true, isDefinition: true)
!26 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 411, type: !27, isLocal: false, isDefinition: true, scopeLine: 412, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !31)
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !29, !30}
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!31 = !{!32, !33, !34, !35, !36, !38, !39, !40, !41, !42}
!32 = !DILocalVariable(name: "argc", arg: 1, scope: !26, file: !3, line: 411, type: !29)
!33 = !DILocalVariable(name: "argv", arg: 2, scope: !26, file: !3, line: 411, type: !30)
!34 = !DILocalVariable(name: "bit_flags", scope: !26, file: !3, line: 414, type: !29)
!35 = !DILocalVariable(name: "dereference", scope: !26, file: !3, line: 418, type: !29)
!36 = !DILocalVariable(name: "ok", scope: !26, file: !3, line: 420, type: !37)
!37 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!38 = !DILocalVariable(name: "preserve_root", scope: !26, file: !3, line: 421, type: !37)
!39 = !DILocalVariable(name: "component_specified", scope: !26, file: !3, line: 422, type: !37)
!40 = !DILocalVariable(name: "reference_file", scope: !26, file: !3, line: 423, type: !20)
!41 = !DILocalVariable(name: "optc", scope: !26, file: !3, line: 424, type: !29)
!42 = !DILocalVariable(name: "ref_context", scope: !43, file: !3, line: 544, type: !20)
!43 = distinct !DILexicalBlock(scope: !44, file: !3, line: 543, column: 5)
!44 = distinct !DILexicalBlock(scope: !26, file: !3, line: 542, column: 7)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !46, line: 7, size: 128, elements: !47)
!46 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!47 = !{!48, !54}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !45, file: !46, line: 9, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !50, line: 48, baseType: !51)
!50 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !52, line: 136, baseType: !53)
!52 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!53 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !45, file: !46, line: 10, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !50, line: 60, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !52, line: 133, baseType: !53)
!57 = !DIGlobalVariableExpression(var: !58)
!58 = distinct !DIGlobalVariable(name: "affect_symlink_referent", scope: !2, file: !3, line: 41, type: !37, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60)
!60 = distinct !DIGlobalVariable(name: "recurse", scope: !2, file: !3, line: 44, type: !37, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62)
!62 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 47, type: !37, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64)
!64 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !2, file: !3, line: 51, type: !65, isLocal: true, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!66 = !DIGlobalVariableExpression(var: !67)
!67 = distinct !DIGlobalVariable(name: "specified_context", scope: !2, file: !3, line: 54, type: !68, isLocal: true, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!70 = !DIGlobalVariableExpression(var: !71)
!71 = distinct !DIGlobalVariable(name: "specified_user", scope: !2, file: !3, line: 57, type: !68, isLocal: true, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73)
!73 = distinct !DIGlobalVariable(name: "specified_role", scope: !2, file: !3, line: 58, type: !68, isLocal: true, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75)
!75 = distinct !DIGlobalVariable(name: "specified_range", scope: !2, file: !3, line: 59, type: !68, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77)
!77 = distinct !DIGlobalVariable(name: "specified_type", scope: !2, file: !3, line: 60, type: !68, isLocal: true, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79)
!79 = distinct !DIGlobalVariable(name: "infomap", scope: !80, file: !81, line: 632, type: !95, isLocal: true, isDefinition: true)
!80 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !81, file: !81, line: 630, type: !82, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !84)
!81 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!82 = !DISubroutineType(types: !83)
!83 = !{null, !68}
!84 = !{!85, !86, !87, !94}
!85 = !DILocalVariable(name: "program", arg: 1, scope: !80, file: !81, line: 630, type: !68)
!86 = !DILocalVariable(name: "node", scope: !80, file: !81, line: 642, type: !68)
!87 = !DILocalVariable(name: "map_prog", scope: !80, file: !81, line: 643, type: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !80, file: !81, line: 632, size: 128, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !90, file: !81, line: 632, baseType: !68, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !90, file: !81, line: 632, baseType: !68, size: 64, offset: 64)
!94 = !DILocalVariable(name: "lc_messages", scope: !80, file: !81, line: 655, type: !68)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 896, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 7)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 3584, elements: !108)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !101, line: 50, size: 256, elements: !102)
!101 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!102 = !{!103, !104, !105, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !101, line: 52, baseType: !68, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !100, file: !101, line: 55, baseType: !29, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !100, file: !101, line: 56, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !100, file: !101, line: 57, baseType: !29, size: 32, offset: 192)
!108 = !{!109}
!109 = !DISubrange(count: 14)
!110 = !DIGlobalVariableExpression(var: !111)
!111 = distinct !DIGlobalVariable(name: "Version", scope: !112, file: !113, line: 2, type: !68, isLocal: false, isDefinition: true)
!112 = distinct !DICompileUnit(language: DW_LANG_C99, file: !113, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, globals: !115)
!113 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!114 = !{}
!115 = !{!110}
!116 = !DIGlobalVariableExpression(var: !117)
!117 = distinct !DIGlobalVariable(name: "file_name", scope: !118, file: !123, line: 36, type: !68, isLocal: true, isDefinition: true)
!118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !119, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, globals: !120)
!119 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!120 = !{!116, !121}
!121 = !DIGlobalVariableExpression(var: !122)
!122 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !118, file: !123, line: 46, type: !37, isLocal: true, isDefinition: true)
!123 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!124 = !DIGlobalVariableExpression(var: !125)
!125 = distinct !DIGlobalVariable(name: "exit_failure", scope: !126, file: !129, line: 24, type: !130, isLocal: false, isDefinition: true)
!126 = distinct !DICompileUnit(language: DW_LANG_C99, file: !127, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, globals: !128)
!127 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!128 = !{!124}
!129 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!130 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !29)
!131 = !DIGlobalVariableExpression(var: !132)
!132 = distinct !DIGlobalVariable(name: "program_name", scope: !133, file: !137, line: 33, type: !68, isLocal: false, isDefinition: true)
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, retainedTypes: !135, globals: !136)
!134 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!135 = !{!22, !20}
!136 = !{!131}
!137 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!138 = !DIGlobalVariableExpression(var: !139)
!139 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !140, file: !170, line: 77, type: !206, isLocal: false, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !163, globals: !167)
!141 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!142 = !{!5, !143, !148}
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !144)
!144 = !{!145, !146, !147}
!145 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!146 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!147 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !149, line: 46, size: 32, elements: !150)
!149 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!150 = !{!151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162}
!151 = !DIEnumerator(name: "_ISupper", value: 256)
!152 = !DIEnumerator(name: "_ISlower", value: 512)
!153 = !DIEnumerator(name: "_ISalpha", value: 1024)
!154 = !DIEnumerator(name: "_ISdigit", value: 2048)
!155 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!156 = !DIEnumerator(name: "_ISspace", value: 8192)
!157 = !DIEnumerator(name: "_ISprint", value: 16384)
!158 = !DIEnumerator(name: "_ISgraph", value: 32768)
!159 = !DIEnumerator(name: "_ISblank", value: 1)
!160 = !DIEnumerator(name: "_IScntrl", value: 2)
!161 = !DIEnumerator(name: "_ISpunct", value: 4)
!162 = !DIEnumerator(name: "_ISalnum", value: 8)
!163 = !{!29, !164, !165, !20}
!164 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !166, line: 62, baseType: !53)
!166 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!167 = !{!138, !168, !175, !188, !190, !195, !202, !204}
!168 = !DIGlobalVariableExpression(var: !169)
!169 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !140, file: !170, line: 93, type: !171, isLocal: false, isDefinition: true)
!170 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 320, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!173 = !{!174}
!174 = !DISubrange(count: 10)
!175 = !DIGlobalVariableExpression(var: !176)
!176 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !140, file: !170, line: 1043, type: !177, isLocal: false, isDefinition: true)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !170, line: 57, size: 448, elements: !178)
!178 = !{!179, !180, !181, !186, !187}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !177, file: !170, line: 60, baseType: !5, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !177, file: !170, line: 63, baseType: !29, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !177, file: !170, line: 67, baseType: !182, size: 256, offset: 64)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 256, elements: !184)
!183 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!184 = !{!185}
!185 = !DISubrange(count: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !177, file: !170, line: 70, baseType: !68, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !177, file: !170, line: 73, baseType: !68, size: 64, offset: 384)
!188 = !DIGlobalVariableExpression(var: !189)
!189 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !140, file: !170, line: 108, type: !177, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191)
!191 = distinct !DIGlobalVariable(name: "slot0", scope: !140, file: !170, line: 834, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 256)
!195 = !DIGlobalVariableExpression(var: !196)
!196 = distinct !DIGlobalVariable(name: "slotvec", scope: !140, file: !170, line: 837, type: !197, isLocal: true, isDefinition: true)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !170, line: 826, size: 128, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !198, file: !170, line: 828, baseType: !165, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !198, file: !170, line: 829, baseType: !20, size: 64, offset: 64)
!202 = !DIGlobalVariableExpression(var: !203)
!203 = distinct !DIGlobalVariable(name: "nslots", scope: !140, file: !170, line: 835, type: !29, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205)
!205 = distinct !DIGlobalVariable(name: "slotvec0", scope: !140, file: !170, line: 836, type: !198, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 704, elements: !208)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!208 = !{!209}
!209 = !DISubrange(count: 11)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !212, file: !215, line: 26, type: !216, isLocal: false, isDefinition: true)
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !213, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, globals: !214)
!213 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!214 = !{!210}
!215 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 376, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 47)
!219 = !DIGlobalVariableExpression(var: !220)
!220 = distinct !DIGlobalVariable(name: "default_tuning", scope: !221, file: !225, line: 130, type: !226, isLocal: true, isDefinition: true)
!221 = distinct !DICompileUnit(language: DW_LANG_C99, file: !222, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, retainedTypes: !223, globals: !224)
!222 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!223 = !{!53, !22, !165}
!224 = !{!219}
!225 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !228, line: 65, baseType: !229)
!228 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !228, line: 53, size: 160, elements: !230)
!230 = !{!231, !233, !234, !235, !236}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !229, file: !228, line: 58, baseType: !232, size: 32)
!232 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !229, file: !228, line: 59, baseType: !232, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !229, file: !228, line: 60, baseType: !232, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !229, file: !228, line: 61, baseType: !232, size: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !229, file: !228, line: 62, baseType: !37, size: 8, offset: 128)
!237 = !DIGlobalVariableExpression(var: !238)
!238 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !239, file: !584, line: 120, type: !585, isLocal: true, isDefinition: true)
!239 = distinct !DICompileUnit(language: DW_LANG_C99, file: !240, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !241, retainedTypes: !580, globals: !583)
!240 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!241 = !{!242}
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !243, line: 41, size: 32, elements: !244)
!243 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!245 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!246 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!247 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!248 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!249 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!250 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!251 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!252 = !DIEnumerator(name: "DAY_1", value: 131079)
!253 = !DIEnumerator(name: "DAY_2", value: 131080)
!254 = !DIEnumerator(name: "DAY_3", value: 131081)
!255 = !DIEnumerator(name: "DAY_4", value: 131082)
!256 = !DIEnumerator(name: "DAY_5", value: 131083)
!257 = !DIEnumerator(name: "DAY_6", value: 131084)
!258 = !DIEnumerator(name: "DAY_7", value: 131085)
!259 = !DIEnumerator(name: "ABMON_1", value: 131086)
!260 = !DIEnumerator(name: "ABMON_2", value: 131087)
!261 = !DIEnumerator(name: "ABMON_3", value: 131088)
!262 = !DIEnumerator(name: "ABMON_4", value: 131089)
!263 = !DIEnumerator(name: "ABMON_5", value: 131090)
!264 = !DIEnumerator(name: "ABMON_6", value: 131091)
!265 = !DIEnumerator(name: "ABMON_7", value: 131092)
!266 = !DIEnumerator(name: "ABMON_8", value: 131093)
!267 = !DIEnumerator(name: "ABMON_9", value: 131094)
!268 = !DIEnumerator(name: "ABMON_10", value: 131095)
!269 = !DIEnumerator(name: "ABMON_11", value: 131096)
!270 = !DIEnumerator(name: "ABMON_12", value: 131097)
!271 = !DIEnumerator(name: "MON_1", value: 131098)
!272 = !DIEnumerator(name: "MON_2", value: 131099)
!273 = !DIEnumerator(name: "MON_3", value: 131100)
!274 = !DIEnumerator(name: "MON_4", value: 131101)
!275 = !DIEnumerator(name: "MON_5", value: 131102)
!276 = !DIEnumerator(name: "MON_6", value: 131103)
!277 = !DIEnumerator(name: "MON_7", value: 131104)
!278 = !DIEnumerator(name: "MON_8", value: 131105)
!279 = !DIEnumerator(name: "MON_9", value: 131106)
!280 = !DIEnumerator(name: "MON_10", value: 131107)
!281 = !DIEnumerator(name: "MON_11", value: 131108)
!282 = !DIEnumerator(name: "MON_12", value: 131109)
!283 = !DIEnumerator(name: "AM_STR", value: 131110)
!284 = !DIEnumerator(name: "PM_STR", value: 131111)
!285 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!286 = !DIEnumerator(name: "D_FMT", value: 131113)
!287 = !DIEnumerator(name: "T_FMT", value: 131114)
!288 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!289 = !DIEnumerator(name: "ERA", value: 131116)
!290 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!291 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!292 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!293 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!294 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!295 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!296 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!297 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!298 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!299 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!300 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!301 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!302 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!303 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!304 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!305 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!306 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!307 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!308 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!309 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!310 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!311 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!312 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!313 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!314 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!315 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!316 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!317 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!318 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!319 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!320 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!321 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!322 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!323 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!324 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!325 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!326 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!327 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!328 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!329 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!330 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!331 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!332 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!333 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!334 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!335 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!336 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!337 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!338 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!339 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!340 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!341 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!342 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!343 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!344 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!345 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!346 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!347 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!348 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!349 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!350 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!351 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!352 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!353 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!354 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!355 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!356 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!357 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!358 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!359 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!360 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!361 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!362 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!363 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!364 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!365 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!366 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!367 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!368 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!369 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!370 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!371 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!372 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!373 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!374 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!375 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!376 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!377 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!378 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!379 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!380 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!381 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!382 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!383 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!384 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!385 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!386 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!387 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!388 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!389 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!390 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!391 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!392 = !DIEnumerator(name: "CODESET", value: 14)
!393 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!394 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!395 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!396 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!397 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!398 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!399 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!400 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!401 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!402 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!403 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!404 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!405 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!406 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!407 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!408 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!409 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!410 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!411 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!412 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!413 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!414 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!415 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!416 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!417 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!418 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!419 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!420 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!421 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!422 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!423 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!424 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!425 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!426 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!427 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!428 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!429 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!430 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!431 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!432 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!433 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!434 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!435 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!436 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!437 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!438 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!439 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!440 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!441 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!442 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!443 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!444 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!445 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!446 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!447 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!448 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!449 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!450 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!451 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!452 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!453 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!454 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!455 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!456 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!457 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!458 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!459 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!460 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!461 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!462 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!463 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!464 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!465 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!466 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!467 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!468 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!469 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!470 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!471 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!472 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!473 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!474 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!475 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!476 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!477 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!478 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!479 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!480 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!481 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!482 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!483 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!484 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!485 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!486 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!487 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!488 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!489 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!490 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!491 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!492 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!493 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!494 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!495 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!496 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!497 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!498 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!499 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!500 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!501 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!502 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!503 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!504 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!505 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!506 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!507 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!508 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!509 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!510 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!511 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!512 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!513 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!514 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!515 = !DIEnumerator(name: "THOUSEP", value: 65537)
!516 = !DIEnumerator(name: "__GROUPING", value: 65538)
!517 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!518 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!519 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!520 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!521 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!522 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!523 = !DIEnumerator(name: "__YESSTR", value: 327682)
!524 = !DIEnumerator(name: "__NOSTR", value: 327683)
!525 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!526 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!527 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!528 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!529 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!530 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!531 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!532 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!533 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!534 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!535 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!536 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!537 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!538 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!539 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!540 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!541 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!542 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!543 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!544 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!545 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!546 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!547 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!548 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!549 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!550 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!551 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!552 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!553 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!554 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!555 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!556 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!557 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!558 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!559 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!560 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!561 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!562 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!563 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!564 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!565 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!566 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!567 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!568 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!569 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!570 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!571 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!572 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!573 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!574 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!575 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!576 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!577 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!578 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!579 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!580 = !{!22, !20, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!583 = !{!237}
!584 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!585 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !68)
!586 = !DIGlobalVariableExpression(var: !587)
!587 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !588, file: !589, line: 335, type: !29, isLocal: true, isDefinition: true)
!588 = distinct !DISubprogram(name: "rpl_fcntl", scope: !589, file: !589, line: 272, type: !590, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !592, variables: !595)
!589 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!590 = !DISubroutineType(types: !591)
!591 = !{!29, !29, !29, null}
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, globals: !594)
!593 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!594 = !{!586}
!595 = !{!596, !597, !598, !611, !612, !615, !618, !621}
!596 = !DILocalVariable(name: "fd", arg: 1, scope: !588, file: !589, line: 272, type: !29)
!597 = !DILocalVariable(name: "action", arg: 2, scope: !588, file: !589, line: 272, type: !29)
!598 = !DILocalVariable(name: "arg", scope: !588, file: !589, line: 274, type: !599)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !600, line: 30, baseType: !601)
!600 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !593, line: 274, baseType: !602)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 192, elements: !609)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !593, line: 274, size: 192, elements: !604)
!604 = !{!605, !606, !607, !608}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !603, file: !593, line: 274, baseType: !183, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !603, file: !593, line: 274, baseType: !183, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !603, file: !593, line: 274, baseType: !22, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !603, file: !593, line: 274, baseType: !22, size: 64, offset: 128)
!609 = !{!610}
!610 = !DISubrange(count: 1)
!611 = !DILocalVariable(name: "result", scope: !588, file: !589, line: 275, type: !29)
!612 = !DILocalVariable(name: "target", scope: !613, file: !589, line: 322, type: !29)
!613 = distinct !DILexicalBlock(scope: !614, file: !589, line: 321, column: 7)
!614 = distinct !DILexicalBlock(scope: !588, file: !589, line: 278, column: 5)
!615 = !DILocalVariable(name: "flags", scope: !616, file: !589, line: 359, type: !29)
!616 = distinct !DILexicalBlock(scope: !617, file: !589, line: 358, column: 11)
!617 = distinct !DILexicalBlock(scope: !613, file: !589, line: 357, column: 13)
!618 = !DILocalVariable(name: "saved_errno", scope: !619, file: !589, line: 362, type: !29)
!619 = distinct !DILexicalBlock(scope: !620, file: !589, line: 361, column: 15)
!620 = distinct !DILexicalBlock(scope: !616, file: !589, line: 360, column: 17)
!621 = !DILocalVariable(name: "p", scope: !622, file: !589, line: 404, type: !22)
!622 = distinct !DILexicalBlock(scope: !614, file: !589, line: 402, column: 7)
!623 = !DIGlobalVariableExpression(var: !624)
!624 = distinct !DIGlobalVariable(name: "proc_status", scope: !625, file: !626, line: 65, type: !29, isLocal: true, isDefinition: true)
!625 = distinct !DISubprogram(name: "openat_proc_name", scope: !626, file: !626, line: 44, type: !627, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, unit: !629, variables: !636)
!626 = !DIFile(filename: "lib/openat-proc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!627 = !DISubroutineType(types: !628)
!628 = !{!20, !20, !29, !68}
!629 = distinct !DICompileUnit(language: DW_LANG_C99, file: !630, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !631, globals: !635)
!630 = !DIFile(filename: "./lib/openat-proc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!631 = !{!632}
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !625, file: !626, line: 59, size: 32, elements: !633)
!633 = !{!634}
!634 = !DIEnumerator(name: "PROC_SELF_FD_DIR_SIZE_BOUND", value: 27)
!635 = !{!623}
!636 = !{!637, !638, !639, !640, !641, !642, !646, !652}
!637 = !DILocalVariable(name: "buf", arg: 1, scope: !625, file: !626, line: 44, type: !20)
!638 = !DILocalVariable(name: "fd", arg: 2, scope: !625, file: !626, line: 44, type: !29)
!639 = !DILocalVariable(name: "file", arg: 3, scope: !625, file: !626, line: 44, type: !68)
!640 = !DILocalVariable(name: "result", scope: !625, file: !626, line: 46, type: !20)
!641 = !DILocalVariable(name: "dirlen", scope: !625, file: !626, line: 47, type: !29)
!642 = !DILocalVariable(name: "proc_self_fd", scope: !643, file: !626, line: 76, type: !29)
!643 = distinct !DILexicalBlock(scope: !644, file: !626, line: 67, column: 7)
!644 = distinct !DILexicalBlock(scope: !645, file: !626, line: 66, column: 9)
!645 = distinct !DILexicalBlock(scope: !625, file: !626, line: 58, column: 3)
!646 = !DILocalVariable(name: "dotdot_buf", scope: !647, file: !626, line: 87, type: !649)
!647 = distinct !DILexicalBlock(scope: !648, file: !626, line: 81, column: 11)
!648 = distinct !DILexicalBlock(scope: !643, file: !626, line: 78, column: 13)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 32)
!652 = !DILocalVariable(name: "bufsize", scope: !653, file: !626, line: 98, type: !165)
!653 = distinct !DILexicalBlock(scope: !654, file: !626, line: 97, column: 7)
!654 = distinct !DILexicalBlock(scope: !645, file: !626, line: 94, column: 9)
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!656 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !659, retainedTypes: !664)
!658 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!659 = !{!660}
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !661, line: 41, size: 32, elements: !662)
!661 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!662 = !{!663}
!663 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!664 = !{!22}
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !667, retainedTypes: !681)
!666 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!667 = !{!668}
!668 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !670, file: !669, line: 192, size: 32, elements: !679)
!669 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!670 = distinct !DISubprogram(name: "x2nrealloc", scope: !669, file: !669, line: 180, type: !671, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !665, variables: !674)
!671 = !DISubroutineType(types: !672)
!672 = !{!22, !22, !673, !165}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!674 = !{!675, !676, !677, !678}
!675 = !DILocalVariable(name: "p", arg: 1, scope: !670, file: !669, line: 180, type: !22)
!676 = !DILocalVariable(name: "pn", arg: 2, scope: !670, file: !669, line: 180, type: !673)
!677 = !DILocalVariable(name: "s", arg: 3, scope: !670, file: !669, line: 180, type: !165)
!678 = !DILocalVariable(name: "n", scope: !670, file: !669, line: 182, type: !165)
!679 = !{!680}
!680 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!681 = !{!165, !20, !22}
!682 = distinct !DICompileUnit(language: DW_LANG_C99, file: !683, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!683 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, retainedTypes: !664)
!685 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, retainedTypes: !664)
!687 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !690, retainedTypes: !849)
!689 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!690 = !{!691, !696, !832, !835, !846}
!691 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !692, line: 160, size: 32, elements: !693)
!692 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!693 = !{!694, !695}
!694 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!695 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!696 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !698, file: !697, line: 54, size: 32, elements: !830)
!697 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!698 = distinct !DISubprogram(name: "setup_dir", scope: !697, file: !697, line: 50, type: !699, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !688, variables: !828)
!699 = !DISubroutineType(types: !700)
!700 = !{!37, !701}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !703, line: 199, baseType: !704)
!703 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !703, line: 80, size: 1024, elements: !705)
!705 = !{!706, !776, !777, !779, !780, !781, !782, !783, !784, !785, !792, !793, !796, !815}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !704, file: !703, line: 81, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !703, line: 201, size: 2112, elements: !709)
!709 = !{!710, !711, !712, !713, !718, !720, !721, !722, !723, !724, !725, !726, !727, !729, !730, !733, !734, !735, !736, !772}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !708, file: !703, line: 202, baseType: !707, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !708, file: !703, line: 203, baseType: !707, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !708, file: !703, line: 204, baseType: !707, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !708, file: !703, line: 205, baseType: !714, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !716, line: 127, baseType: !717)
!716 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !716, line: 127, flags: DIFlagFwdDecl)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !708, file: !703, line: 208, baseType: !719, size: 64, offset: 256)
!719 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !708, file: !703, line: 209, baseType: !22, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !708, file: !703, line: 210, baseType: !20, size: 64, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !708, file: !703, line: 211, baseType: !20, size: 64, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !708, file: !703, line: 212, baseType: !29, size: 32, offset: 512)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !708, file: !703, line: 213, baseType: !29, size: 32, offset: 544)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !708, file: !703, line: 214, baseType: !165, size: 64, offset: 576)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !708, file: !703, line: 216, baseType: !701, size: 64, offset: 640)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !708, file: !703, line: 220, baseType: !728, size: 64, offset: 704)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !166, line: 51, baseType: !719)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !708, file: !703, line: 222, baseType: !165, size: 64, offset: 768)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !708, file: !703, line: 223, baseType: !731, size: 64, offset: 832)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !50, line: 75, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !52, line: 139, baseType: !53)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !708, file: !703, line: 239, baseType: !164, size: 16, offset: 896)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !708, file: !703, line: 243, baseType: !164, size: 16, offset: 912)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !708, file: !703, line: 249, baseType: !164, size: 16, offset: 928)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !708, file: !703, line: 251, baseType: !737, size: 1152, offset: 960)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 1152, elements: !609)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !739, line: 46, size: 1152, elements: !740)
!739 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!740 = !{!741, !742, !743, !744, !746, !748, !750, !751, !752, !754, !756, !758, !766, !767, !768}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !738, file: !739, line: 48, baseType: !56, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !738, file: !739, line: 53, baseType: !51, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !738, file: !739, line: 61, baseType: !732, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !738, file: !739, line: 62, baseType: !745, size: 32, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !52, line: 138, baseType: !183)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !738, file: !739, line: 64, baseType: !747, size: 32, offset: 224)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !52, line: 134, baseType: !183)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !738, file: !739, line: 65, baseType: !749, size: 32, offset: 256)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !52, line: 135, baseType: !183)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !738, file: !739, line: 67, baseType: !29, size: 32, offset: 288)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !738, file: !739, line: 69, baseType: !56, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !738, file: !739, line: 74, baseType: !753, size: 64, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !52, line: 140, baseType: !719)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !738, file: !739, line: 78, baseType: !755, size: 64, offset: 448)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !52, line: 162, baseType: !719)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !738, file: !739, line: 80, baseType: !757, size: 64, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !52, line: 167, baseType: !719)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !738, file: !739, line: 91, baseType: !759, size: 128, offset: 576)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !760, line: 8, size: 128, elements: !761)
!760 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!761 = !{!762, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !759, file: !760, line: 10, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !52, line: 148, baseType: !719)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !759, file: !760, line: 11, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !52, line: 184, baseType: !719)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !738, file: !739, line: 92, baseType: !759, size: 128, offset: 704)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !738, file: !739, line: 93, baseType: !759, size: 128, offset: 832)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !738, file: !739, line: 106, baseType: !769, size: 192, offset: 960)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 192, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 3)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !708, file: !703, line: 252, baseType: !773, offset: 2112)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: -1)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !704, file: !703, line: 82, baseType: !707, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !704, file: !703, line: 83, baseType: !778, size: 64, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !704, file: !703, line: 84, baseType: !55, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !704, file: !703, line: 85, baseType: !20, size: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !704, file: !703, line: 86, baseType: !29, size: 32, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !704, file: !703, line: 87, baseType: !29, size: 32, offset: 352)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !704, file: !703, line: 89, baseType: !165, size: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !704, file: !703, line: 90, baseType: !165, size: 64, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !704, file: !703, line: 91, baseType: !786, size: 64, offset: 512)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!29, !789, !789}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !704, file: !703, line: 162, baseType: !29, size: 32, offset: 576)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !704, file: !703, line: 171, baseType: !794, size: 64, offset: 640)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !703, line: 171, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !704, file: !703, line: 193, baseType: !797, size: 64, offset: 704)
!797 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !704, file: !703, line: 173, size: 64, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !797, file: !703, line: 186, baseType: !794, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !797, file: !703, line: 192, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !803, line: 28, size: 256, elements: !804)
!803 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!804 = !{!805, !810, !814}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !802, file: !803, line: 30, baseType: !806, size: 128)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !46, line: 7, size: 128, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !806, file: !46, line: 9, baseType: !49, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !806, file: !46, line: 10, baseType: !55, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !802, file: !803, line: 31, baseType: !811, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !812, line: 112, baseType: !813)
!812 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !52, line: 62, baseType: !53)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !802, file: !803, line: 32, baseType: !29, size: 32, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !704, file: !703, line: 198, baseType: !816, size: 256, offset: 768)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !817, line: 39, baseType: !818)
!817 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !817, line: 31, size: 256, elements: !819)
!819 = !{!820, !824, !825, !826, !827}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !818, file: !817, line: 33, baseType: !821, size: 128)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 4)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !818, file: !817, line: 34, baseType: !29, size: 32, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !818, file: !817, line: 35, baseType: !183, size: 32, offset: 160)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !818, file: !817, line: 36, baseType: !183, size: 32, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !818, file: !817, line: 37, baseType: !37, size: 8, offset: 224)
!828 = !{!829}
!829 = !DILocalVariable(name: "fts", arg: 1, scope: !698, file: !697, line: 50, type: !701)
!830 = !{!831}
!831 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!832 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !692, line: 763, size: 32, elements: !833)
!833 = !{!834}
!834 = !DIEnumerator(name: "LCO_HT_INITIAL_SIZE", value: 13)
!835 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !716, line: 97, size: 32, elements: !836)
!836 = !{!837, !838, !839, !840, !841, !842, !843, !844, !845}
!837 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!838 = !DIEnumerator(name: "DT_FIFO", value: 1)
!839 = !DIEnumerator(name: "DT_CHR", value: 2)
!840 = !DIEnumerator(name: "DT_DIR", value: 4)
!841 = !DIEnumerator(name: "DT_BLK", value: 6)
!842 = !DIEnumerator(name: "DT_REG", value: 8)
!843 = !DIEnumerator(name: "DT_LNK", value: 10)
!844 = !DIEnumerator(name: "DT_SOCK", value: 12)
!845 = !DIEnumerator(name: "DT_WHT", value: 14)
!846 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !692, line: 155, size: 32, elements: !847)
!847 = !{!848}
!848 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!849 = !{!22, !811, !20, !719, !850, !855}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!29, !853, !853}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !703, line: 253, baseType: !708)
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, retainedTypes: !861)
!860 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!861 = !{!165}
!862 = distinct !DICompileUnit(language: DW_LANG_C99, file: !863, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!863 = !DIFile(filename: "./lib/selinux-at.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!864 = distinct !DICompileUnit(language: DW_LANG_C99, file: !865, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!865 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!867 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!868 = distinct !DICompileUnit(language: DW_LANG_C99, file: !869, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!869 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!871 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!873 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !876)
!875 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!876 = !{!877}
!877 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !817, line: 20, size: 32, elements: !878)
!878 = !{!879}
!879 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!881 = !DIFile(filename: "./lib/openat-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!883 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!885 = !DIFile(filename: "./lib/save-cwd.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!886 = distinct !DICompileUnit(language: DW_LANG_C99, file: !887, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!887 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!888 = distinct !DICompileUnit(language: DW_LANG_C99, file: !889, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!889 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, retainedTypes: !135)
!891 = !DIFile(filename: "./lib/chdir-long.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114)
!893 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, retainedTypes: !664)
!895 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!896 = distinct !DICompileUnit(language: DW_LANG_C99, file: !897, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, retainedTypes: !664)
!897 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!898 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!899 = !{i32 2, !"Dwarf Version", i32 4}
!900 = !{i32 2, !"Debug Info Version", i32 3}
!901 = !{i32 1, !"wchar_size", i32 4}
!902 = !{i32 7, !"PIC Level", i32 2}
!903 = !{i32 7, !"PIE Level", i32 2}
!904 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 346, type: !905, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !907)
!905 = !DISubroutineType(types: !906)
!906 = !{null, !29}
!907 = !{!908}
!908 = !DILocalVariable(name: "status", arg: 1, scope: !904, file: !3, line: 346, type: !29)
!909 = !DIExpression()
!910 = !DILocation(line: 346, column: 12, scope: !904)
!911 = !DILocation(line: 348, column: 14, scope: !912)
!912 = distinct !DILexicalBlock(scope: !904, file: !3, line: 348, column: 7)
!913 = !DILocation(line: 348, column: 7, scope: !904)
!914 = !DILocation(line: 349, column: 5, scope: !915)
!915 = distinct !DILexicalBlock(scope: !912, file: !3, line: 349, column: 5)
!916 = !{!917, !917, i64 0}
!917 = !{!"any pointer", !918, i64 0}
!918 = !{!"omnipotent char", !919, i64 0}
!919 = !{!"Simple C/C++ TBAA"}
!920 = !DILocation(line: 352, column: 7, scope: !921)
!921 = distinct !DILexicalBlock(scope: !912, file: !3, line: 351, column: 5)
!922 = !DILocation(line: 358, column: 7, scope: !921)
!923 = !DILocation(line: 587, column: 3, scope: !924, inlinedAt: !927)
!924 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !81, file: !81, line: 585, type: !925, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !114)
!925 = !DISubroutineType(types: !926)
!926 = !{null}
!927 = distinct !DILocation(line: 363, column: 7, scope: !921)
!928 = !DILocation(line: 365, column: 7, scope: !921)
!929 = !DILocation(line: 370, column: 7, scope: !921)
!930 = !DILocation(line: 376, column: 7, scope: !921)
!931 = !DILocation(line: 380, column: 7, scope: !921)
!932 = !DILocation(line: 384, column: 7, scope: !921)
!933 = !DILocation(line: 387, column: 7, scope: !921)
!934 = !DILocation(line: 390, column: 7, scope: !921)
!935 = !DILocation(line: 403, column: 7, scope: !921)
!936 = !DILocation(line: 404, column: 7, scope: !921)
!937 = !DILocation(line: 642, column: 15, scope: !80, inlinedAt: !938)
!938 = distinct !DILocation(line: 405, column: 7, scope: !921)
!939 = !DILocation(line: 651, column: 3, scope: !80, inlinedAt: !938)
!940 = !DILocation(line: 655, column: 29, scope: !80, inlinedAt: !938)
!941 = !DILocation(line: 655, column: 15, scope: !80, inlinedAt: !938)
!942 = !DILocation(line: 656, column: 7, scope: !943, inlinedAt: !938)
!943 = distinct !DILexicalBlock(scope: !80, file: !81, line: 656, column: 7)
!944 = !DILocation(line: 656, column: 19, scope: !943, inlinedAt: !938)
!945 = !DILocation(line: 656, column: 22, scope: !943, inlinedAt: !938)
!946 = !DILocation(line: 656, column: 7, scope: !80, inlinedAt: !938)
!947 = !DILocation(line: 662, column: 7, scope: !948, inlinedAt: !938)
!948 = distinct !DILexicalBlock(scope: !943, file: !81, line: 657, column: 5)
!949 = !DILocation(line: 664, column: 5, scope: !948, inlinedAt: !938)
!950 = !DILocation(line: 665, column: 3, scope: !80, inlinedAt: !938)
!951 = !DILocation(line: 667, column: 3, scope: !80, inlinedAt: !938)
!952 = !DILocation(line: 407, column: 3, scope: !904)
!953 = !DILocation(line: 411, column: 11, scope: !26)
!954 = !DILocation(line: 411, column: 24, scope: !26)
!955 = !DILocation(line: 414, column: 7, scope: !26)
!956 = !DILocation(line: 418, column: 7, scope: !26)
!957 = !DILocation(line: 421, column: 8, scope: !26)
!958 = !DILocation(line: 422, column: 8, scope: !26)
!959 = !DILocation(line: 423, column: 9, scope: !26)
!960 = !DILocation(line: 427, column: 21, scope: !26)
!961 = !DILocation(line: 427, column: 3, scope: !26)
!962 = !DILocation(line: 428, column: 3, scope: !26)
!963 = !DILocation(line: 429, column: 3, scope: !26)
!964 = !DILocation(line: 430, column: 3, scope: !26)
!965 = !DILocation(line: 432, column: 3, scope: !26)
!966 = !DILocation(line: 434, column: 3, scope: !26)
!967 = !DILocation(line: 434, column: 18, scope: !26)
!968 = !DILocation(line: 424, column: 7, scope: !26)
!969 = distinct !{!969, !966, !970}
!970 = !DILocation(line: 509, column: 5, scope: !26)
!971 = !DILocation(line: 441, column: 11, scope: !972)
!972 = distinct !DILexicalBlock(scope: !973, file: !3, line: 438, column: 9)
!973 = distinct !DILexicalBlock(scope: !26, file: !3, line: 436, column: 5)
!974 = !DILocation(line: 445, column: 11, scope: !972)
!975 = !DILocation(line: 449, column: 11, scope: !972)
!976 = !DILocation(line: 453, column: 11, scope: !972)
!977 = !DILocation(line: 458, column: 11, scope: !972)
!978 = !DILocation(line: 462, column: 11, scope: !972)
!979 = !DILocation(line: 466, column: 11, scope: !972)
!980 = !DILocation(line: 469, column: 28, scope: !972)
!981 = !DILocation(line: 470, column: 11, scope: !972)
!982 = !DILocation(line: 474, column: 11, scope: !972)
!983 = !DILocation(line: 482, column: 11, scope: !972)
!984 = !DILocation(line: 485, column: 28, scope: !972)
!985 = !DILocation(line: 485, column: 26, scope: !972)
!986 = !DILocation(line: 487, column: 11, scope: !972)
!987 = !DILocation(line: 490, column: 28, scope: !972)
!988 = !DILocation(line: 490, column: 26, scope: !972)
!989 = !DILocation(line: 492, column: 11, scope: !972)
!990 = !DILocation(line: 495, column: 28, scope: !972)
!991 = !DILocation(line: 495, column: 26, scope: !972)
!992 = !DILocation(line: 497, column: 11, scope: !972)
!993 = !DILocation(line: 500, column: 29, scope: !972)
!994 = !DILocation(line: 500, column: 27, scope: !972)
!995 = !DILocation(line: 502, column: 11, scope: !972)
!996 = !DILocation(line: 504, column: 9, scope: !972)
!997 = !DILocation(line: 505, column: 9, scope: !972)
!998 = !DILocation(line: 507, column: 11, scope: !972)
!999 = !DILocation(line: 511, column: 7, scope: !26)
!1000 = !DILocation(line: 513, column: 21, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 513, column: 11)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 512, column: 5)
!1003 = distinct !DILexicalBlock(scope: !26, file: !3, line: 511, column: 7)
!1004 = !DILocation(line: 513, column: 11, scope: !1002)
!1005 = !DILocation(line: 515, column: 27, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 515, column: 15)
!1007 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 514, column: 9)
!1008 = !DILocation(line: 515, column: 15, scope: !1007)
!1009 = !DILocation(line: 516, column: 13, scope: !1006)
!1010 = !DILocation(line: 522, column: 27, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 522, column: 15)
!1012 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 521, column: 9)
!1013 = !DILocation(line: 522, column: 15, scope: !1012)
!1014 = !DILocation(line: 523, column: 13, scope: !1011)
!1015 = !DILocation(line: 530, column: 46, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 528, column: 5)
!1017 = !DILocation(line: 530, column: 31, scope: !1016)
!1018 = !{!1019, !1019, i64 0}
!1019 = !{!"_Bool", !918, i64 0}
!1020 = !DILocation(line: 533, column: 14, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !26, file: !3, line: 533, column: 7)
!1022 = !{!1023, !1023, i64 0}
!1023 = !{!"int", !918, i64 0}
!1024 = !DILocation(line: 533, column: 12, scope: !1021)
!1025 = !DILocation(line: 533, column: 24, scope: !1021)
!1026 = !DILocation(line: 533, column: 42, scope: !1021)
!1027 = !DILocation(line: 533, column: 39, scope: !1021)
!1028 = !DILocation(line: 533, column: 21, scope: !1021)
!1029 = !DILocation(line: 533, column: 7, scope: !26)
!1030 = !DILocation(line: 535, column: 16, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 535, column: 11)
!1032 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 534, column: 5)
!1033 = !DILocation(line: 535, column: 11, scope: !1032)
!1034 = !DILocation(line: 536, column: 22, scope: !1031)
!1035 = !DILocation(line: 536, column: 9, scope: !1031)
!1036 = !DILocation(line: 538, column: 22, scope: !1031)
!1037 = !DILocation(line: 538, column: 70, scope: !1031)
!1038 = !DILocation(line: 538, column: 60, scope: !1031)
!1039 = !DILocation(line: 538, column: 53, scope: !1031)
!1040 = !DILocation(line: 538, column: 9, scope: !1031)
!1041 = !DILocation(line: 539, column: 7, scope: !1032)
!1042 = !DILocation(line: 542, column: 7, scope: !26)
!1043 = !DILocation(line: 544, column: 13, scope: !43)
!1044 = !DILocalVariable(name: "file", arg: 1, scope: !1045, file: !1046, line: 88, type: !68)
!1045 = distinct !DISubprogram(name: "getfilecon", scope: !1046, file: !1046, line: 88, type: !1047, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1051)
!1046 = !DIFile(filename: "./lib/selinux/selinux.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!29, !68, !1049}
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "security_context_t", file: !1046, line: 67, baseType: !20)
!1051 = !{!1044, !1052}
!1052 = !DILocalVariable(name: "con", arg: 2, scope: !1045, file: !1046, line: 89, type: !1049)
!1053 = !DILocation(line: 88, column: 25, scope: !1045, inlinedAt: !1054)
!1054 = distinct !DILocation(line: 546, column: 11, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !43, file: !3, line: 546, column: 11)
!1056 = !DILocation(line: 89, column: 33, scope: !1045, inlinedAt: !1054)
!1057 = !DILocation(line: 90, column: 5, scope: !1045, inlinedAt: !1054)
!1058 = !DILocation(line: 90, column: 11, scope: !1045, inlinedAt: !1054)
!1059 = !DILocation(line: 547, column: 9, scope: !1055)
!1060 = !DILocation(line: 552, column: 12, scope: !44)
!1061 = !DILocation(line: 559, column: 38, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 558, column: 5)
!1063 = distinct !DILexicalBlock(scope: !44, file: !3, line: 552, column: 12)
!1064 = !DILocation(line: 559, column: 27, scope: !1062)
!1065 = !DILocation(line: 559, column: 25, scope: !1062)
!1066 = !DILocalVariable(name: "con", arg: 1, scope: !1067, file: !1046, line: 112, type: !1050)
!1067 = distinct !DISubprogram(name: "security_check_context", scope: !1046, file: !1046, line: 112, type: !1068, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1070)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!29, !1050}
!1070 = !{!1066}
!1071 = !DIExpression(DW_OP_deref)
!1072 = !DILocation(line: 112, column: 44, scope: !1067, inlinedAt: !1073)
!1073 = distinct !DILocation(line: 560, column: 11, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 560, column: 11)
!1075 = !DILocation(line: 113, column: 5, scope: !1067, inlinedAt: !1073)
!1076 = !DILocation(line: 113, column: 11, scope: !1067, inlinedAt: !1073)
!1077 = !DILocation(line: 561, column: 9, scope: !1074)
!1078 = !DILocation(line: 555, column: 25, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 553, column: 5)
!1080 = !DILocation(line: 571, column: 15, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !26, file: !3, line: 571, column: 7)
!1082 = !DILocation(line: 571, column: 18, scope: !1081)
!1083 = !DILocation(line: 574, column: 22, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 572, column: 5)
!1085 = !DILocation(line: 574, column: 20, scope: !1084)
!1086 = !DILocation(line: 575, column: 24, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 575, column: 11)
!1088 = !DILocation(line: 575, column: 11, scope: !1084)
!1089 = !DILocation(line: 584, column: 30, scope: !26)
!1090 = !DILocation(line: 576, column: 9, scope: !1087)
!1091 = !DILocation(line: 581, column: 20, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 580, column: 5)
!1093 = !DILocation(line: 584, column: 28, scope: !26)
!1094 = !DILocation(line: 584, column: 48, scope: !26)
!1095 = !DILocalVariable(name: "files", arg: 1, scope: !1096, file: !3, line: 311, type: !30)
!1096 = distinct !DISubprogram(name: "process_files", scope: !3, file: !3, line: 311, type: !1097, isLocal: true, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1099)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!37, !30, !29}
!1099 = !{!1095, !1100, !1101, !1102, !1187}
!1100 = !DILocalVariable(name: "bit_flags", arg: 2, scope: !1096, file: !3, line: 311, type: !29)
!1101 = !DILocalVariable(name: "ok", scope: !1096, file: !3, line: 313, type: !37)
!1102 = !DILocalVariable(name: "fts", scope: !1096, file: !3, line: 315, type: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !703, line: 199, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !703, line: 80, size: 1024, elements: !1106)
!1106 = !{!1107, !1153, !1154, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1169, !1170, !1171, !1178}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1105, file: !703, line: 81, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !703, line: 201, size: 2112, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1152}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1109, file: !703, line: 202, baseType: !1108, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1109, file: !703, line: 203, baseType: !1108, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1109, file: !703, line: 204, baseType: !1108, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !1109, file: !703, line: 205, baseType: !714, size: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1109, file: !703, line: 208, baseType: !719, size: 64, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1109, file: !703, line: 209, baseType: !22, size: 64, offset: 320)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1109, file: !703, line: 210, baseType: !20, size: 64, offset: 384)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1109, file: !703, line: 211, baseType: !20, size: 64, offset: 448)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1109, file: !703, line: 212, baseType: !29, size: 32, offset: 512)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1109, file: !703, line: 213, baseType: !29, size: 32, offset: 544)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1109, file: !703, line: 214, baseType: !165, size: 64, offset: 576)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !1109, file: !703, line: 216, baseType: !1103, size: 64, offset: 640)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !1109, file: !703, line: 220, baseType: !728, size: 64, offset: 704)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1109, file: !703, line: 222, baseType: !165, size: 64, offset: 768)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !1109, file: !703, line: 223, baseType: !731, size: 64, offset: 832)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !1109, file: !703, line: 239, baseType: !164, size: 16, offset: 896)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !1109, file: !703, line: 243, baseType: !164, size: 16, offset: 912)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !1109, file: !703, line: 249, baseType: !164, size: 16, offset: 928)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !1109, file: !703, line: 251, baseType: !1130, size: 1152, offset: 960)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, size: 1152, elements: !609)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !739, line: 46, size: 1152, elements: !1132)
!1132 = !{!1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1149, !1150, !1151}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1131, file: !739, line: 48, baseType: !56, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1131, file: !739, line: 53, baseType: !51, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1131, file: !739, line: 61, baseType: !732, size: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1131, file: !739, line: 62, baseType: !745, size: 32, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1131, file: !739, line: 64, baseType: !747, size: 32, offset: 224)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1131, file: !739, line: 65, baseType: !749, size: 32, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1131, file: !739, line: 67, baseType: !29, size: 32, offset: 288)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1131, file: !739, line: 69, baseType: !56, size: 64, offset: 320)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1131, file: !739, line: 74, baseType: !753, size: 64, offset: 384)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1131, file: !739, line: 78, baseType: !755, size: 64, offset: 448)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1131, file: !739, line: 80, baseType: !757, size: 64, offset: 512)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1131, file: !739, line: 91, baseType: !1145, size: 128, offset: 576)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !760, line: 8, size: 128, elements: !1146)
!1146 = !{!1147, !1148}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1145, file: !760, line: 10, baseType: !763, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1145, file: !760, line: 11, baseType: !765, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1131, file: !739, line: 92, baseType: !1145, size: 128, offset: 704)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1131, file: !739, line: 93, baseType: !1145, size: 128, offset: 832)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1131, file: !739, line: 106, baseType: !769, size: 192, offset: 960)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !1109, file: !703, line: 252, baseType: !773, offset: 2112)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !1105, file: !703, line: 82, baseType: !1108, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !1105, file: !703, line: 83, baseType: !1155, size: 64, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !1105, file: !703, line: 84, baseType: !55, size: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1105, file: !703, line: 85, baseType: !20, size: 64, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !1105, file: !703, line: 86, baseType: !29, size: 32, offset: 320)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !1105, file: !703, line: 87, baseType: !29, size: 32, offset: 352)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1105, file: !703, line: 89, baseType: !165, size: 64, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !1105, file: !703, line: 90, baseType: !165, size: 64, offset: 448)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !1105, file: !703, line: 91, baseType: !1163, size: 64, offset: 512)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!29, !1166, !1166}
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
