; ModuleID = 'coreutils-8.27/src/chgrp.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.Chown_option = type { i32, i8, %struct.dev_ino*, i8, i8, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.__dirstream = type opaque

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 59, type: !146, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !33, globals: !44)
!3 = !DIFile(filename: "src/chgrp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !11, !25}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !6, line: 31, size: 32, elements: !7)
!6 = !DIFile(filename: "src/chown-core.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "V_high", value: 0)
!9 = !DIEnumerator(name: "V_changes_only", value: 1)
!10 = !DIEnumerator(name: "V_off", value: 2)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !12, line: 32, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !26, line: 26, size: 32, elements: !27)
!26 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!27 = !{!28, !29, !30, !31, !32}
!28 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!29 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!30 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!31 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!32 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!33 = !{!34, !36, !37, !42}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !38, line: 80, baseType: !39)
!38 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !40, line: 134, baseType: !41)
!40 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !38, line: 65, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !40, line: 135, baseType: !41)
!44 = !{!45, !122, !124, !0}
!45 = !DIGlobalVariableExpression(var: !46)
!46 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !47, file: !3, line: 304, type: !67, isLocal: true, isDefinition: true)
!47 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 173, type: !48, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !52)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !50, !51}
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!52 = !{!53, !54, !55, !57, !58, !59, !60, !81, !82, !83, !120}
!53 = !DILocalVariable(name: "argc", arg: 1, scope: !47, file: !3, line: 173, type: !50)
!54 = !DILocalVariable(name: "argv", arg: 2, scope: !47, file: !3, line: 173, type: !51)
!55 = !DILocalVariable(name: "preserve_root", scope: !47, file: !3, line: 175, type: !56)
!56 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!57 = !DILocalVariable(name: "gid", scope: !47, file: !3, line: 176, type: !42)
!58 = !DILocalVariable(name: "bit_flags", scope: !47, file: !3, line: 179, type: !50)
!59 = !DILocalVariable(name: "dereference", scope: !47, file: !3, line: 183, type: !50)
!60 = !DILocalVariable(name: "chopt", scope: !47, file: !3, line: 185, type: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !6, line: 43, size: 320, elements: !62)
!62 = !{!63, !64, !65, !77, !78, !79, !80}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !61, file: !6, line: 46, baseType: !5, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !61, file: !6, line: 49, baseType: !56, size: 8, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !61, file: !6, line: 53, baseType: !66, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !68, line: 7, size: 128, elements: !69)
!68 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!69 = !{!70, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !67, file: !68, line: 9, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !38, line: 48, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !40, line: 136, baseType: !73)
!73 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !67, file: !68, line: 10, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !38, line: 60, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !40, line: 133, baseType: !73)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !61, file: !6, line: 56, baseType: !56, size: 8, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !61, file: !6, line: 59, baseType: !56, size: 8, offset: 136)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !61, file: !6, line: 62, baseType: !34, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !61, file: !6, line: 65, baseType: !34, size: 64, offset: 256)
!81 = !DILocalVariable(name: "ok", scope: !47, file: !3, line: 186, type: !56)
!82 = !DILocalVariable(name: "optc", scope: !47, file: !3, line: 187, type: !50)
!83 = !DILocalVariable(name: "ref_stats", scope: !84, file: !3, line: 287, type: !86)
!84 = distinct !DILexicalBlock(scope: !85, file: !3, line: 286, column: 5)
!85 = distinct !DILexicalBlock(scope: !47, file: !3, line: 285, column: 7)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !87, line: 46, size: 1152, elements: !88)
!87 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!88 = !{!89, !90, !91, !93, !95, !96, !97, !98, !99, !102, !104, !106, !114, !115, !116}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !86, file: !87, line: 48, baseType: !76, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !86, file: !87, line: 53, baseType: !72, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !86, file: !87, line: 61, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !40, line: 139, baseType: !73)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !86, file: !87, line: 62, baseType: !94, size: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !40, line: 138, baseType: !41)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !86, file: !87, line: 64, baseType: !39, size: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !86, file: !87, line: 65, baseType: !43, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !86, file: !87, line: 67, baseType: !50, size: 32, offset: 288)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !86, file: !87, line: 69, baseType: !76, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !86, file: !87, line: 74, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 140, baseType: !101)
!101 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !86, file: !87, line: 78, baseType: !103, size: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !40, line: 162, baseType: !101)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !86, file: !87, line: 80, baseType: !105, size: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !40, line: 167, baseType: !101)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !86, file: !87, line: 91, baseType: !107, size: 128, offset: 576)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !108, line: 8, size: 128, elements: !109)
!108 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!109 = !{!110, !112}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !107, file: !108, line: 10, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !40, line: 148, baseType: !101)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !107, file: !108, line: 11, baseType: !113, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !40, line: 184, baseType: !101)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !86, file: !87, line: 92, baseType: !107, size: 128, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !86, file: !87, line: 93, baseType: !107, size: 128, offset: 832)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !86, file: !87, line: 106, baseType: !117, size: 192, offset: 960)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 192, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 3)
!120 = !DILocalVariable(name: "group_name", scope: !121, file: !3, line: 297, type: !34)
!121 = distinct !DILexicalBlock(scope: !85, file: !3, line: 296, column: 5)
!122 = !DIGlobalVariableExpression(var: !123)
!123 = distinct !DIGlobalVariable(name: "reference_file", scope: !2, file: !3, line: 47, type: !34, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125)
!125 = distinct !DIGlobalVariable(name: "infomap", scope: !126, file: !127, line: 632, type: !143, isLocal: true, isDefinition: true)
!126 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !127, file: !127, line: 630, type: !128, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !132)
!127 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!128 = !DISubroutineType(types: !129)
!129 = !{null, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!132 = !{!133, !134, !135, !142}
!133 = !DILocalVariable(name: "program", arg: 1, scope: !126, file: !127, line: 630, type: !130)
!134 = !DILocalVariable(name: "node", scope: !126, file: !127, line: 642, type: !130)
!135 = !DILocalVariable(name: "map_prog", scope: !126, file: !127, line: 643, type: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !126, file: !127, line: 632, size: 128, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !138, file: !127, line: 632, baseType: !130, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !138, file: !127, line: 632, baseType: !130, size: 64, offset: 64)
!142 = !DILocalVariable(name: "lc_messages", scope: !126, file: !127, line: 655, type: !130)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 896, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 7)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 3328, elements: !156)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !149, line: 50, size: 256, elements: !150)
!149 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!150 = !{!151, !152, !153, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !149, line: 52, baseType: !130, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !148, file: !149, line: 55, baseType: !50, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !148, file: !149, line: 56, baseType: !154, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !148, file: !149, line: 57, baseType: !50, size: 32, offset: 192)
!156 = !{!157}
!157 = !DISubrange(count: 13)
!158 = !DIGlobalVariableExpression(var: !159)
!159 = distinct !DIGlobalVariable(name: "Version", scope: !160, file: !161, line: 2, type: !130, isLocal: false, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, globals: !163)
!161 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!162 = !{}
!163 = !{!158}
!164 = !DIGlobalVariableExpression(var: !165)
!165 = distinct !DIGlobalVariable(name: "file_name", scope: !166, file: !171, line: 36, type: !130, isLocal: true, isDefinition: true)
!166 = distinct !DICompileUnit(language: DW_LANG_C99, file: !167, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, globals: !168)
!167 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!168 = !{!164, !169}
!169 = !DIGlobalVariableExpression(var: !170)
!170 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !166, file: !171, line: 46, type: !56, isLocal: true, isDefinition: true)
!171 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!172 = !DIGlobalVariableExpression(var: !173)
!173 = distinct !DIGlobalVariable(name: "exit_failure", scope: !174, file: !177, line: 24, type: !178, isLocal: false, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, globals: !176)
!175 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!176 = !{!172}
!177 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!178 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !50)
!179 = !DIGlobalVariableExpression(var: !180)
!180 = distinct !DIGlobalVariable(name: "program_name", scope: !181, file: !185, line: 33, type: !130, isLocal: false, isDefinition: true)
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !183, globals: !184)
!182 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!183 = !{!36, !34}
!184 = !{!179}
!185 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!186 = !DIGlobalVariableExpression(var: !187)
!187 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !188, file: !218, line: 77, type: !253, isLocal: false, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !190, retainedTypes: !211, globals: !215)
!189 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!190 = !{!11, !191, !196}
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, size: 32, elements: !192)
!192 = !{!193, !194, !195}
!193 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!194 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!195 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !197, line: 46, size: 32, elements: !198)
!197 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210}
!199 = !DIEnumerator(name: "_ISupper", value: 256)
!200 = !DIEnumerator(name: "_ISlower", value: 512)
!201 = !DIEnumerator(name: "_ISalpha", value: 1024)
!202 = !DIEnumerator(name: "_ISdigit", value: 2048)
!203 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!204 = !DIEnumerator(name: "_ISspace", value: 8192)
!205 = !DIEnumerator(name: "_ISprint", value: 16384)
!206 = !DIEnumerator(name: "_ISgraph", value: 32768)
!207 = !DIEnumerator(name: "_ISblank", value: 1)
!208 = !DIEnumerator(name: "_IScntrl", value: 2)
!209 = !DIEnumerator(name: "_ISpunct", value: 4)
!210 = !DIEnumerator(name: "_ISalnum", value: 8)
!211 = !{!50, !212, !213, !34}
!212 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !214, line: 62, baseType: !73)
!214 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!215 = !{!186, !216, !223, !235, !237, !242, !249, !251}
!216 = !DIGlobalVariableExpression(var: !217)
!217 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !188, file: !218, line: 93, type: !219, isLocal: false, isDefinition: true)
!218 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 320, elements: !221)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!221 = !{!222}
!222 = !DISubrange(count: 10)
!223 = !DIGlobalVariableExpression(var: !224)
!224 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !188, file: !218, line: 1043, type: !225, isLocal: false, isDefinition: true)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !218, line: 57, size: 448, elements: !226)
!226 = !{!227, !228, !229, !233, !234}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !225, file: !218, line: 60, baseType: !11, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !225, file: !218, line: 63, baseType: !50, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !225, file: !218, line: 67, baseType: !230, size: 256, offset: 64)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 256, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 8)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !225, file: !218, line: 70, baseType: !130, size: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !225, file: !218, line: 73, baseType: !130, size: 64, offset: 384)
!235 = !DIGlobalVariableExpression(var: !236)
!236 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !188, file: !218, line: 108, type: !225, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238)
!238 = distinct !DIGlobalVariable(name: "slot0", scope: !188, file: !218, line: 834, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 256)
!242 = !DIGlobalVariableExpression(var: !243)
!243 = distinct !DIGlobalVariable(name: "slotvec", scope: !188, file: !218, line: 837, type: !244, isLocal: true, isDefinition: true)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !218, line: 826, size: 128, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !245, file: !218, line: 828, baseType: !213, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !245, file: !218, line: 829, baseType: !34, size: 64, offset: 64)
!249 = !DIGlobalVariableExpression(var: !250)
!250 = distinct !DIGlobalVariable(name: "nslots", scope: !188, file: !218, line: 835, type: !50, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252)
!252 = distinct !DIGlobalVariable(name: "slotvec0", scope: !188, file: !218, line: 836, type: !245, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 704, elements: !255)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!255 = !{!256}
!256 = !DISubrange(count: 11)
!257 = !DIGlobalVariableExpression(var: !258)
!258 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !259, file: !262, line: 26, type: !263, isLocal: false, isDefinition: true)
!259 = distinct !DICompileUnit(language: DW_LANG_C99, file: !260, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, globals: !261)
!260 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!261 = !{!257}
!262 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 376, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 47)
!266 = !DIGlobalVariableExpression(var: !267)
!267 = distinct !DIGlobalVariable(name: "default_tuning", scope: !268, file: !272, line: 130, type: !273, isLocal: true, isDefinition: true)
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !270, globals: !271)
!269 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!270 = !{!73, !36, !213}
!271 = !{!266}
!272 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !275, line: 65, baseType: !276)
!275 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !275, line: 53, size: 160, elements: !277)
!277 = !{!278, !280, !281, !282, !283}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !276, file: !275, line: 58, baseType: !279, size: 32)
!279 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !276, file: !275, line: 59, baseType: !279, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !276, file: !275, line: 60, baseType: !279, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !276, file: !275, line: 61, baseType: !279, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !276, file: !275, line: 62, baseType: !56, size: 8, offset: 128)
!284 = !DIGlobalVariableExpression(var: !285)
!285 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !286, file: !631, line: 120, type: !632, isLocal: true, isDefinition: true)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !288, retainedTypes: !627, globals: !630)
!287 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!288 = !{!289}
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !290, line: 41, size: 32, elements: !291)
!290 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!292 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!293 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!294 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!295 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!296 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!297 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!298 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!299 = !DIEnumerator(name: "DAY_1", value: 131079)
!300 = !DIEnumerator(name: "DAY_2", value: 131080)
!301 = !DIEnumerator(name: "DAY_3", value: 131081)
!302 = !DIEnumerator(name: "DAY_4", value: 131082)
!303 = !DIEnumerator(name: "DAY_5", value: 131083)
!304 = !DIEnumerator(name: "DAY_6", value: 131084)
!305 = !DIEnumerator(name: "DAY_7", value: 131085)
!306 = !DIEnumerator(name: "ABMON_1", value: 131086)
!307 = !DIEnumerator(name: "ABMON_2", value: 131087)
!308 = !DIEnumerator(name: "ABMON_3", value: 131088)
!309 = !DIEnumerator(name: "ABMON_4", value: 131089)
!310 = !DIEnumerator(name: "ABMON_5", value: 131090)
!311 = !DIEnumerator(name: "ABMON_6", value: 131091)
!312 = !DIEnumerator(name: "ABMON_7", value: 131092)
!313 = !DIEnumerator(name: "ABMON_8", value: 131093)
!314 = !DIEnumerator(name: "ABMON_9", value: 131094)
!315 = !DIEnumerator(name: "ABMON_10", value: 131095)
!316 = !DIEnumerator(name: "ABMON_11", value: 131096)
!317 = !DIEnumerator(name: "ABMON_12", value: 131097)
!318 = !DIEnumerator(name: "MON_1", value: 131098)
!319 = !DIEnumerator(name: "MON_2", value: 131099)
!320 = !DIEnumerator(name: "MON_3", value: 131100)
!321 = !DIEnumerator(name: "MON_4", value: 131101)
!322 = !DIEnumerator(name: "MON_5", value: 131102)
!323 = !DIEnumerator(name: "MON_6", value: 131103)
!324 = !DIEnumerator(name: "MON_7", value: 131104)
!325 = !DIEnumerator(name: "MON_8", value: 131105)
!326 = !DIEnumerator(name: "MON_9", value: 131106)
!327 = !DIEnumerator(name: "MON_10", value: 131107)
!328 = !DIEnumerator(name: "MON_11", value: 131108)
!329 = !DIEnumerator(name: "MON_12", value: 131109)
!330 = !DIEnumerator(name: "AM_STR", value: 131110)
!331 = !DIEnumerator(name: "PM_STR", value: 131111)
!332 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!333 = !DIEnumerator(name: "D_FMT", value: 131113)
!334 = !DIEnumerator(name: "T_FMT", value: 131114)
!335 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!336 = !DIEnumerator(name: "ERA", value: 131116)
!337 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!338 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!339 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!340 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!341 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!342 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!343 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!344 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!345 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!346 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!347 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!348 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!349 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!350 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!351 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!352 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!353 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!354 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!355 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!356 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!357 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!358 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!359 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!360 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!361 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!362 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!363 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!364 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!365 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!366 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!367 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!368 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!369 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!370 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!371 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!372 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!373 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!374 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!375 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!376 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!377 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!378 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!379 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!380 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!381 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!382 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!383 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!384 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!385 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!386 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!387 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!388 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!389 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!390 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!391 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!392 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!393 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!394 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!395 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!396 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!397 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!398 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!399 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!400 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!401 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!402 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!403 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!404 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!405 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!406 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!407 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!408 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!409 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!410 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!411 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!412 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!413 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!414 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!415 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!416 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!417 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!418 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!419 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!420 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!421 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!422 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!423 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!424 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!425 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!426 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!427 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!428 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!429 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!430 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!431 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!432 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!433 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!434 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!435 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!436 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!437 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!438 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!439 = !DIEnumerator(name: "CODESET", value: 14)
!440 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!441 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!442 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!443 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!444 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!445 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!446 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!447 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!448 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!449 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!450 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!451 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!452 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!453 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!454 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!455 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!456 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!457 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!458 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!459 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!460 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!461 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!462 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!463 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!464 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!465 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!466 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!467 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!468 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!469 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!470 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!471 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!472 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!473 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!474 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!475 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!476 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!477 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!478 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!479 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!480 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!481 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!482 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!483 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!484 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!485 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!486 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!487 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!488 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!489 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!490 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!491 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!492 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!493 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!494 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!495 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!496 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!497 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!498 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!499 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!500 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!501 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!502 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!503 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!504 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!505 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!506 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!507 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!508 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!509 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!510 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!511 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!512 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!513 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!514 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!515 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!516 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!517 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!518 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!519 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!520 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!521 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!522 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!523 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!524 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!525 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!526 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!527 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!528 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!529 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!530 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!531 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!532 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!533 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!534 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!535 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!536 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!537 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!538 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!539 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!540 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!541 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!542 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!543 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!544 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!545 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!546 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!547 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!548 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!549 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!550 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!551 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!552 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!553 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!554 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!555 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!556 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!557 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!558 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!559 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!560 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!561 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!562 = !DIEnumerator(name: "THOUSEP", value: 65537)
!563 = !DIEnumerator(name: "__GROUPING", value: 65538)
!564 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!565 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!566 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!567 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!568 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!569 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!570 = !DIEnumerator(name: "__YESSTR", value: 327682)
!571 = !DIEnumerator(name: "__NOSTR", value: 327683)
!572 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!573 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!574 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!575 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!576 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!577 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!578 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!579 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!580 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!581 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!582 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!583 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!584 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!585 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!586 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!587 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!588 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!589 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!590 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!591 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!592 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!593 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!594 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!595 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!596 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!597 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!598 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!599 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!600 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!601 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!602 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!603 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!604 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!605 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!606 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!607 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!608 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!609 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!610 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!611 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!612 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!613 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!614 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!615 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!616 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!617 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!618 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!619 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!620 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!621 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!622 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!623 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!624 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!625 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!626 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!627 = !{!36, !34, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!630 = !{!284}
!631 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!632 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !130)
!633 = !DIGlobalVariableExpression(var: !634)
!634 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !635, file: !636, line: 335, type: !50, isLocal: true, isDefinition: true)
!635 = distinct !DISubprogram(name: "rpl_fcntl", scope: !636, file: !636, line: 272, type: !637, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !639, variables: !642)
!636 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!637 = !DISubroutineType(types: !638)
!638 = !{!50, !50, !50, null}
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, globals: !641)
!640 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!641 = !{!633}
!642 = !{!643, !644, !645, !658, !659, !662, !665, !668}
!643 = !DILocalVariable(name: "fd", arg: 1, scope: !635, file: !636, line: 272, type: !50)
!644 = !DILocalVariable(name: "action", arg: 2, scope: !635, file: !636, line: 272, type: !50)
!645 = !DILocalVariable(name: "arg", scope: !635, file: !636, line: 274, type: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !647, line: 30, baseType: !648)
!647 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !640, line: 274, baseType: !649)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 192, elements: !656)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !640, line: 274, size: 192, elements: !651)
!651 = !{!652, !653, !654, !655}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !650, file: !640, line: 274, baseType: !41, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !650, file: !640, line: 274, baseType: !41, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !650, file: !640, line: 274, baseType: !36, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !650, file: !640, line: 274, baseType: !36, size: 64, offset: 128)
!656 = !{!657}
!657 = !DISubrange(count: 1)
!658 = !DILocalVariable(name: "result", scope: !635, file: !636, line: 275, type: !50)
!659 = !DILocalVariable(name: "target", scope: !660, file: !636, line: 322, type: !50)
!660 = distinct !DILexicalBlock(scope: !661, file: !636, line: 321, column: 7)
!661 = distinct !DILexicalBlock(scope: !635, file: !636, line: 278, column: 5)
!662 = !DILocalVariable(name: "flags", scope: !663, file: !636, line: 359, type: !50)
!663 = distinct !DILexicalBlock(scope: !664, file: !636, line: 358, column: 11)
!664 = distinct !DILexicalBlock(scope: !660, file: !636, line: 357, column: 13)
!665 = !DILocalVariable(name: "saved_errno", scope: !666, file: !636, line: 362, type: !50)
!666 = distinct !DILexicalBlock(scope: !667, file: !636, line: 361, column: 15)
!667 = distinct !DILexicalBlock(scope: !663, file: !636, line: 360, column: 17)
!668 = !DILocalVariable(name: "p", scope: !669, file: !636, line: 404, type: !36)
!669 = distinct !DILexicalBlock(scope: !661, file: !636, line: 402, column: 7)
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !672, retainedTypes: !686)
!671 = !DIFile(filename: "src/chown-core.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!672 = !{!5, !11, !673, !680}
!673 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !671, line: 38, size: 32, elements: !674)
!674 = !{!675, !676, !677, !678, !679}
!675 = !DIEnumerator(name: "RC_ok", value: 2)
!676 = !DIEnumerator(name: "RC_excluded", value: 3)
!677 = !DIEnumerator(name: "RC_inode_changed", value: 4)
!678 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5)
!679 = !DIEnumerator(name: "RC_error", value: 6)
!680 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !6, line: 23, size: 32, elements: !681)
!681 = !{!682, !683, !684, !685}
!682 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1)
!683 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2)
!684 = !DIEnumerator(name: "CH_FAILED", value: 3)
!685 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4)
!686 = !{!37, !42, !36}
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !689)
!688 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!689 = !{!690}
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !691, line: 112, baseType: !692)
!691 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !40, line: 62, baseType: !73)
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162)
!694 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !697, retainedTypes: !702)
!696 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!697 = !{!698}
!698 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !699, line: 41, size: 32, elements: !700)
!699 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!700 = !{!701}
!701 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!702 = !{!36}
!703 = distinct !DICompileUnit(language: DW_LANG_C99, file: !704, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !705, retainedTypes: !719)
!704 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!705 = !{!706}
!706 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !708, file: !707, line: 192, size: 32, elements: !717)
!707 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!708 = distinct !DISubprogram(name: "x2nrealloc", scope: !707, file: !707, line: 180, type: !709, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !703, variables: !712)
!709 = !DISubroutineType(types: !710)
!710 = !{!36, !36, !711, !213}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!712 = !{!713, !714, !715, !716}
!713 = !DILocalVariable(name: "p", arg: 1, scope: !708, file: !707, line: 180, type: !36)
!714 = !DILocalVariable(name: "pn", arg: 2, scope: !708, file: !707, line: 180, type: !711)
!715 = !DILocalVariable(name: "s", arg: 3, scope: !708, file: !707, line: 180, type: !213)
!716 = !DILocalVariable(name: "n", scope: !708, file: !707, line: 182, type: !213)
!717 = !{!718}
!718 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!719 = !{!213, !34, !36}
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162)
!721 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !702)
!723 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !726, retainedTypes: !727)
!725 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!726 = !{!25, !196}
!727 = !{!50, !212}
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !702)
!729 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!730 = distinct !DICompileUnit(language: DW_LANG_C99, file: !731, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !732, retainedTypes: !873)
!731 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!732 = !{!733, !738, !856, !859, !870}
!733 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !734, line: 160, size: 32, elements: !735)
!734 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!735 = !{!736, !737}
!736 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!737 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!738 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !740, file: !739, line: 54, size: 32, elements: !854)
!739 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!740 = distinct !DISubprogram(name: "setup_dir", scope: !739, file: !739, line: 50, type: !741, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !730, variables: !852)
!741 = !DISubroutineType(types: !742)
!742 = !{!56, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !745, line: 199, baseType: !746)
!745 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !745, line: 80, size: 1024, elements: !747)
!747 = !{!748, !803, !804, !806, !807, !808, !809, !810, !811, !812, !819, !820, !823, !839}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !746, file: !745, line: 81, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !745, line: 201, size: 2112, elements: !751)
!751 = !{!752, !753, !754, !755, !760, !761, !762, !763, !764, !765, !766, !767, !768, !770, !771, !773, !774, !775, !776, !799}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !750, file: !745, line: 202, baseType: !749, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !750, file: !745, line: 203, baseType: !749, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !750, file: !745, line: 204, baseType: !749, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !750, file: !745, line: 205, baseType: !756, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !758, line: 127, baseType: !759)
!758 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !758, line: 127, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !750, file: !745, line: 208, baseType: !101, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !750, file: !745, line: 209, baseType: !36, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !750, file: !745, line: 210, baseType: !34, size: 64, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !750, file: !745, line: 211, baseType: !34, size: 64, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !750, file: !745, line: 212, baseType: !50, size: 32, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !750, file: !745, line: 213, baseType: !50, size: 32, offset: 544)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !750, file: !745, line: 214, baseType: !213, size: 64, offset: 576)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !750, file: !745, line: 216, baseType: !743, size: 64, offset: 640)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !750, file: !745, line: 220, baseType: !769, size: 64, offset: 704)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !214, line: 51, baseType: !101)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !750, file: !745, line: 222, baseType: !213, size: 64, offset: 768)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !750, file: !745, line: 223, baseType: !772, size: 64, offset: 832)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !38, line: 75, baseType: !92)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !750, file: !745, line: 239, baseType: !212, size: 16, offset: 896)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !750, file: !745, line: 243, baseType: !212, size: 16, offset: 912)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !750, file: !745, line: 249, baseType: !212, size: 16, offset: 928)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !750, file: !745, line: 251, baseType: !777, size: 1152, offset: 960)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 1152, elements: !656)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !87, line: 46, size: 1152, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !796, !797, !798}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !778, file: !87, line: 48, baseType: !76, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !778, file: !87, line: 53, baseType: !72, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !778, file: !87, line: 61, baseType: !92, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !778, file: !87, line: 62, baseType: !94, size: 32, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !778, file: !87, line: 64, baseType: !39, size: 32, offset: 224)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !778, file: !87, line: 65, baseType: !43, size: 32, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !778, file: !87, line: 67, baseType: !50, size: 32, offset: 288)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !778, file: !87, line: 69, baseType: !76, size: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !778, file: !87, line: 74, baseType: !100, size: 64, offset: 384)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !778, file: !87, line: 78, baseType: !103, size: 64, offset: 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !778, file: !87, line: 80, baseType: !105, size: 64, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !778, file: !87, line: 91, baseType: !792, size: 128, offset: 576)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !108, line: 8, size: 128, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !792, file: !108, line: 10, baseType: !111, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !792, file: !108, line: 11, baseType: !113, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !778, file: !87, line: 92, baseType: !792, size: 128, offset: 704)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !778, file: !87, line: 93, baseType: !792, size: 128, offset: 832)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !778, file: !87, line: 106, baseType: !117, size: 192, offset: 960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !750, file: !745, line: 252, baseType: !800, offset: 2112)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: -1)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !746, file: !745, line: 82, baseType: !749, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !746, file: !745, line: 83, baseType: !805, size: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !746, file: !745, line: 84, baseType: !75, size: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !746, file: !745, line: 85, baseType: !34, size: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !746, file: !745, line: 86, baseType: !50, size: 32, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !746, file: !745, line: 87, baseType: !50, size: 32, offset: 352)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !746, file: !745, line: 89, baseType: !213, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !746, file: !745, line: 90, baseType: !213, size: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !746, file: !745, line: 91, baseType: !813, size: 64, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!50, !816, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !750)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !746, file: !745, line: 162, baseType: !50, size: 32, offset: 576)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !746, file: !745, line: 171, baseType: !821, size: 64, offset: 640)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !745, line: 171, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !746, file: !745, line: 193, baseType: !824, size: 64, offset: 704)
!824 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !746, file: !745, line: 173, size: 64, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !824, file: !745, line: 186, baseType: !821, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !824, file: !745, line: 192, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !830, line: 28, size: 256, elements: !831)
!830 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!831 = !{!832, !837, !838}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !829, file: !830, line: 30, baseType: !833, size: 128)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !68, line: 7, size: 128, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !833, file: !68, line: 9, baseType: !71, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !833, file: !68, line: 10, baseType: !75, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !829, file: !830, line: 31, baseType: !690, size: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !829, file: !830, line: 32, baseType: !50, size: 32, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !746, file: !745, line: 198, baseType: !840, size: 256, offset: 768)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !841, line: 39, baseType: !842)
!841 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !841, line: 31, size: 256, elements: !843)
!843 = !{!844, !848, !849, !850, !851}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !842, file: !841, line: 33, baseType: !845, size: 128)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 4)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !842, file: !841, line: 34, baseType: !50, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !842, file: !841, line: 35, baseType: !41, size: 32, offset: 160)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !842, file: !841, line: 36, baseType: !41, size: 32, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !842, file: !841, line: 37, baseType: !56, size: 8, offset: 224)
!852 = !{!853}
!853 = !DILocalVariable(name: "fts", arg: 1, scope: !740, file: !739, line: 50, type: !743)
!854 = !{!855}
!855 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!856 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !734, line: 763, size: 32, elements: !857)
!857 = !{!858}
!858 = !DIEnumerator(name: "LCO_HT_INITIAL_SIZE", value: 13)
!859 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !758, line: 97, size: 32, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869}
!861 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!862 = !DIEnumerator(name: "DT_FIFO", value: 1)
!863 = !DIEnumerator(name: "DT_CHR", value: 2)
!864 = !DIEnumerator(name: "DT_DIR", value: 4)
!865 = !DIEnumerator(name: "DT_BLK", value: 6)
!866 = !DIEnumerator(name: "DT_REG", value: 8)
!867 = !DIEnumerator(name: "DT_LNK", value: 10)
!868 = !DIEnumerator(name: "DT_SOCK", value: 12)
!869 = !DIEnumerator(name: "DT_WHT", value: 14)
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !734, line: 155, size: 32, elements: !871)
!871 = !{!872}
!872 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!873 = !{!36, !690, !34, !101, !874, !879}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!50, !877, !877}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !745, line: 253, baseType: !750)
!883 = distinct !DICompileUnit(language: DW_LANG_C99, file: !884, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !885)
!884 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!885 = !{!213}
!886 = distinct !DICompileUnit(language: DW_LANG_C99, file: !887, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162)
!887 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!888 = distinct !DICompileUnit(language: DW_LANG_C99, file: !889, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162)
!889 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162)
!891 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162)
!893 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162)
!895 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!896 = distinct !DICompileUnit(language: DW_LANG_C99, file: !897, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !898)
!897 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!898 = !{!899}
!899 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !841, line: 20, size: 32, elements: !900)
!900 = !{!901}
!901 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!902 = distinct !DICompileUnit(language: DW_LANG_C99, file: !903, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162)
!903 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!904 = distinct !DICompileUnit(language: DW_LANG_C99, file: !905, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162)
!905 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!906 = distinct !DICompileUnit(language: DW_LANG_C99, file: !907, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162)
!907 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162)
!909 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!910 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !702)
!911 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !702)
!913 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!914 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!915 = !{i32 2, !"Dwarf Version", i32 4}
!916 = !{i32 2, !"Debug Info Version", i32 3}
!917 = !{i32 1, !"wchar_size", i32 4}
!918 = !{i32 7, !"PIC Level", i32 2}
!919 = !{i32 7, !"PIE Level", i32 2}
!920 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 104, type: !921, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !923)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !50}
!923 = !{!924}
!924 = !DILocalVariable(name: "status", arg: 1, scope: !920, file: !3, line: 104, type: !50)
!925 = !DIExpression()
!926 = !DILocation(line: 104, column: 12, scope: !920)
!927 = !DILocation(line: 106, column: 14, scope: !928)
!928 = distinct !DILexicalBlock(scope: !920, file: !3, line: 106, column: 7)
!929 = !DILocation(line: 106, column: 7, scope: !920)
!930 = !DILocation(line: 107, column: 5, scope: !931)
!931 = distinct !DILexicalBlock(scope: !928, file: !3, line: 107, column: 5)
!932 = !{!933, !933, i64 0}
!933 = !{!"any pointer", !934, i64 0}
!934 = !{!"omnipotent char", !935, i64 0}
!935 = !{!"Simple C/C++ TBAA"}
!936 = !DILocation(line: 110, column: 7, scope: !937)
!937 = distinct !DILexicalBlock(scope: !928, file: !3, line: 109, column: 5)
!938 = !DILocation(line: 115, column: 7, scope: !937)
!939 = !DILocation(line: 120, column: 7, scope: !937)
!940 = !DILocation(line: 125, column: 7, scope: !937)
!941 = !DILocation(line: 130, column: 7, scope: !937)
!942 = !DILocation(line: 134, column: 7, scope: !937)
!943 = !DILocation(line: 138, column: 7, scope: !937)
!944 = !DILocation(line: 142, column: 7, scope: !937)
!945 = !DILocation(line: 145, column: 7, scope: !937)
!946 = !DILocation(line: 158, column: 7, scope: !937)
!947 = !DILocation(line: 159, column: 7, scope: !937)
!948 = !DILocation(line: 160, column: 7, scope: !937)
!949 = !DILocation(line: 642, column: 15, scope: !126, inlinedAt: !950)
!950 = distinct !DILocation(line: 167, column: 7, scope: !937)
!951 = !DILocation(line: 651, column: 3, scope: !126, inlinedAt: !950)
!952 = !DILocation(line: 655, column: 29, scope: !126, inlinedAt: !950)
!953 = !DILocation(line: 655, column: 15, scope: !126, inlinedAt: !950)
!954 = !DILocation(line: 656, column: 7, scope: !955, inlinedAt: !950)
!955 = distinct !DILexicalBlock(scope: !126, file: !127, line: 656, column: 7)
!956 = !DILocation(line: 656, column: 19, scope: !955, inlinedAt: !950)
!957 = !DILocation(line: 656, column: 22, scope: !955, inlinedAt: !950)
!958 = !DILocation(line: 656, column: 7, scope: !126, inlinedAt: !950)
!959 = !DILocation(line: 662, column: 7, scope: !960, inlinedAt: !950)
!960 = distinct !DILexicalBlock(scope: !955, file: !127, line: 657, column: 5)
!961 = !DILocation(line: 664, column: 5, scope: !960, inlinedAt: !950)
!962 = !DILocation(line: 665, column: 3, scope: !126, inlinedAt: !950)
!963 = !DILocation(line: 667, column: 3, scope: !126, inlinedAt: !950)
!964 = !DILocation(line: 169, column: 3, scope: !920)
!965 = !DILocation(line: 173, column: 11, scope: !47)
!966 = !DILocation(line: 173, column: 24, scope: !47)
!967 = !DILocation(line: 175, column: 8, scope: !47)
!968 = !DILocation(line: 179, column: 7, scope: !47)
!969 = !DILocation(line: 183, column: 7, scope: !47)
!970 = !DILocation(line: 185, column: 3, scope: !47)
!971 = !DILocation(line: 190, column: 21, scope: !47)
!972 = !DILocation(line: 190, column: 3, scope: !47)
!973 = !DILocation(line: 191, column: 3, scope: !47)
!974 = !DILocation(line: 192, column: 3, scope: !47)
!975 = !DILocation(line: 193, column: 3, scope: !47)
!976 = !DILocation(line: 195, column: 3, scope: !47)
!977 = !DILocation(line: 185, column: 23, scope: !47)
!978 = !DILocation(line: 197, column: 3, scope: !47)
!979 = !DILocation(line: 199, column: 3, scope: !47)
!980 = !DILocation(line: 199, column: 18, scope: !47)
!981 = !DILocation(line: 187, column: 7, scope: !47)
!982 = distinct !{!982, !979, !983}
!983 = !DILocation(line: 258, column: 5, scope: !47)
!984 = !DILocation(line: 210, column: 11, scope: !985)
!985 = distinct !DILexicalBlock(scope: !986, file: !3, line: 203, column: 9)
!986 = distinct !DILexicalBlock(scope: !47, file: !3, line: 201, column: 5)
!987 = !DILocation(line: 214, column: 11, scope: !985)
!988 = !DILocation(line: 218, column: 11, scope: !985)
!989 = !DILocation(line: 223, column: 11, scope: !985)
!990 = !DILocation(line: 227, column: 11, scope: !985)
!991 = !DILocation(line: 231, column: 11, scope: !985)
!992 = !DILocation(line: 234, column: 28, scope: !985)
!993 = !DILocation(line: 234, column: 26, scope: !985)
!994 = !DILocation(line: 235, column: 11, scope: !985)
!995 = !DILocation(line: 238, column: 25, scope: !985)
!996 = !{!997, !998, i64 4}
!997 = !{!"Chown_option", !934, i64 0, !998, i64 4, !933, i64 8, !998, i64 16, !998, i64 17, !933, i64 24, !933, i64 32}
!998 = !{!"_Bool", !934, i64 0}
!999 = !DILocation(line: 239, column: 11, scope: !985)
!1000 = !DILocation(line: 242, column: 27, scope: !985)
!1001 = !{!997, !934, i64 0}
!1002 = !DILocation(line: 243, column: 11, scope: !985)
!1003 = !DILocation(line: 246, column: 30, scope: !985)
!1004 = !{!997, !998, i64 17}
!1005 = !DILocation(line: 247, column: 11, scope: !985)
!1006 = !DILocation(line: 250, column: 27, scope: !985)
!1007 = !DILocation(line: 251, column: 11, scope: !985)
!1008 = !DILocation(line: 253, column: 9, scope: !985)
!1009 = !DILocation(line: 254, column: 9, scope: !985)
!1010 = !DILocation(line: 256, column: 11, scope: !985)
!1011 = !DILocation(line: 260, column: 13, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !47, file: !3, line: 260, column: 7)
!1013 = !{i8 0, i8 2}
!1014 = !DILocation(line: 260, column: 7, scope: !47)
!1015 = !DILocation(line: 262, column: 21, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 262, column: 11)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 261, column: 5)
!1018 = !DILocation(line: 262, column: 11, scope: !1017)
!1019 = !DILocation(line: 264, column: 27, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 264, column: 15)
!1021 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 263, column: 9)
!1022 = !DILocation(line: 264, column: 15, scope: !1021)
!1023 = !DILocation(line: 265, column: 13, scope: !1020)
!1024 = !DILocation(line: 274, column: 48, scope: !47)
!1025 = !DILocation(line: 274, column: 9, scope: !47)
!1026 = !DILocation(line: 274, column: 33, scope: !47)
!1027 = !{!997, !998, i64 16}
!1028 = !DILocation(line: 276, column: 14, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !47, file: !3, line: 276, column: 7)
!1030 = !{!1031, !1031, i64 0}
!1031 = !{!"int", !934, i64 0}
!1032 = !DILocation(line: 276, column: 12, scope: !1029)
!1033 = !DILocation(line: 276, column: 24, scope: !1029)
!1034 = !DILocation(line: 276, column: 21, scope: !1029)
!1035 = !DILocation(line: 276, column: 7, scope: !47)
!1036 = !DILocation(line: 278, column: 16, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 278, column: 11)
!1038 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 277, column: 5)
!1039 = !DILocation(line: 278, column: 11, scope: !1038)
!1040 = !DILocation(line: 279, column: 22, scope: !1037)
!1041 = !DILocation(line: 279, column: 9, scope: !1037)
!1042 = !DILocation(line: 281, column: 22, scope: !1037)
!1043 = !DILocation(line: 281, column: 70, scope: !1037)
!1044 = !DILocation(line: 281, column: 60, scope: !1037)
!1045 = !DILocation(line: 281, column: 53, scope: !1037)
!1046 = !DILocation(line: 281, column: 9, scope: !1037)
!1047 = !DILocation(line: 282, column: 7, scope: !1038)
!1048 = !DILocation(line: 285, column: 7, scope: !47)
!1049 = !DILocation(line: 287, column: 7, scope: !84)
!1050 = !DILocation(line: 287, column: 19, scope: !84)
!1051 = !DILocalVariable(name: "__path", arg: 1, scope: !1052, file: !1053, line: 449, type: !130)
!1052 = distinct !DISubprogram(name: "stat", scope: !1053, file: !1053, line: 449, type: !1054, isLocal: false, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1057)
!1053 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!50, !130, !1056}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!1057 = !{!1051, !1058}
!1058 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1052, file: !1053, line: 449, type: !1056)
!1059 = !DILocation(line: 449, column: 1, scope: !1052, inlinedAt: !1060)
!1060 = distinct !DILocation(line: 288, column: 11, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !84, file: !3, line: 288, column: 11)
!1062 = !DILocation(line: 451, column: 10, scope: !1052, inlinedAt: !1060)
!1063 = !DILocation(line: 288, column: 11, scope: !1061)
!1064 = !DILocation(line: 288, column: 11, scope: !84)
!1065 = !DILocation(line: 289, column: 9, scope: !1061)
!1066 = !DILocation(line: 292, column: 23, scope: !84)
!1067 = !{!1068, !1031, i64 32}
!1068 = !{!"stat", !1069, i64 0, !1069, i64 8, !1069, i64 16, !1031, i64 24, !1031, i64 28, !1031, i64 32, !1031, i64 36, !1069, i64 40, !1069, i64 48, !1069, i64 56, !1069, i64 64, !1070, i64 72, !1070, i64 88, !1070, i64 104, !934, i64 120}
!1069 = !{!"long", !934, i64 0}
!1070 = !{!"timespec", !1069, i64 0, !1069, i64 8}
!1071 = !DILocation(line: 176, column: 9, scope: !47)
!1072 = !DILocation(line: 293, column: 26, scope: !84)
!1073 = !DILocation(line: 293, column: 13, scope: !84)
!1074 = !DILocation(line: 293, column: 24, scope: !84)
!1075 = !{!997, !933, i64 32}
!1076 = !DILocation(line: 294, column: 5, scope: !85)
!1077 = !DILocation(line: 294, column: 5, scope: !84)
!1078 = !DILocation(line: 297, column: 37, scope: !121)
!1079 = !DILocation(line: 297, column: 26, scope: !121)
!1080 = !DILocation(line: 297, column: 13, scope: !121)
!1081 = !DILocation(line: 298, column: 27, scope: !121)
!1082 = !{!934, !934, i64 0}
!1083 = !DILocation(line: 298, column: 13, scope: !121)
!1084 = !DILocation(line: 298, column: 24, scope: !121)
!1085 = !DILocalVariable(name: "name", arg: 1, scope: !1086, file: !3, line: 79, type: !130)
!1086 = distinct !DISubprogram(name: "parse_group", scope: !3, file: !3, line: 79, type: !1087, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1089)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!42, !130}
!1089 = !{!1085, !1090, !1091, !1102}
!1090 = !DILocalVariable(name: "gid", scope: !1086, file: !3, line: 81, type: !42)
!1091 = !DILocalVariable(name: "grp", scope: !1092, file: !3, line: 85, type: !1094)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 84, column: 5)
!1093 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 83, column: 7)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !1096, line: 42, size: 256, elements: !1097)
!1096 = !DIFile(filename: "/usr/include/grp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1097 = !{!1098, !1099, !1100, !1101}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !1095, file: !1096, line: 44, baseType: !34, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !1095, file: !1096, line: 45, baseType: !34, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !1095, file: !1096, line: 46, baseType: !43, size: 32, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !1095, file: !1096, line: 47, baseType: !51, size: 64, offset: 192)
!1102 = !DILocalVariable(name: "tmp", scope: !1103, file: !3, line: 90, type: !73)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 89, column: 9)
!1104 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 86, column: 11)
!1105 = !DILocation(line: 79, column: 26, scope: !1086, inlinedAt: !1106)
!1106 = distinct !DILocation(line: 299, column: 13, scope: !121)
!1107 = !DILocation(line: 81, column: 9, scope: !1086, inlinedAt: !1106)
!1108 = !DILocation(line: 83, column: 7, scope: !1093, inlinedAt: !1106)
!1109 = !DILocation(line: 83, column: 7, scope: !1086, inlinedAt: !1106)
!1110 = !DILocation(line: 85, column: 27, scope: !1092, inlinedAt: !1106)
!1111 = !DILocation(line: 85, column: 21, scope: !1092, inlinedAt: !1106)
!1112 = !DILocation(line: 86, column: 11, scope: !1104, inlinedAt: !1106)
!1113 = !DILocation(line: 86, column: 11, scope: !1092, inlinedAt: !1106)
!1114 = !DILocation(line: 87, column: 20, scope: !1104, inlinedAt: !1106)
!1115 = !{!1116, !1031, i64 16}
!1116 = !{!"group", !933, i64 0, !933, i64 8, !1031, i64 16, !933, i64 24}
!1117 = !DILocation(line: 87, column: 9, scope: !1104, inlinedAt: !1106)
!1118 = !DILocation(line: 90, column: 11, scope: !1103, inlinedAt: !1106)
!1119 = !DILocation(line: 90, column: 29, scope: !1103, inlinedAt: !1106)
!1120 = !DILocation(line: 91, column: 18, scope: !1121, inlinedAt: !1106)
!1121 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 91, column: 15)
!1122 = !DILocation(line: 91, column: 54, scope: !1121, inlinedAt: !1106)
!1123 = !DILocation(line: 92, column: 21, scope: !1121, inlinedAt: !1106)
!1124 = !DILocation(line: 92, column: 25, scope: !1121, inlinedAt: !1106)
!1125 = !DILocation(line: 92, column: 18, scope: !1121, inlinedAt: !1106)
!1126 = !DILocation(line: 93, column: 13, scope: !1121, inlinedAt: !1106)
!1127 = !DILocation(line: 95, column: 17, scope: !1103, inlinedAt: !1106)
!1128 = !DILocation(line: 96, column: 9, scope: !1104, inlinedAt: !1106)
!1129 = !DILocation(line: 97, column: 7, scope: !1092, inlinedAt: !1106)
!1130 = !DILocation(line: 98, column: 5, scope: !1092, inlinedAt: !1106)
!1131 = !DILocation(line: 302, column: 13, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !47, file: !3, line: 302, column: 7)
!1133 = !DILocation(line: 302, column: 24, scope: !1132)
!1134 = !DILocation(line: 302, column: 21, scope: !1132)
!1135 = !DILocation(line: 305, column: 28, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 303, column: 5)
!1137 = !DILocation(line: 305, column: 13, scope: !1136)
!1138 = !DILocation(line: 305, column: 26, scope: !1136)
!1139 = !{!997, !933, i64 8}
!1140 = !DILocation(line: 306, column: 30, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1136, file: !3, line: 306, column: 11)
!1142 = !DILocation(line: 306, column: 11, scope: !1136)
!1143 = !DILocation(line: 307, column: 9, scope: !1141)
!1144 = !DILocation(line: 311, column: 13, scope: !47)
!1145 = !DILocation(line: 312, column: 28, scope: !47)
!1146 = !DILocation(line: 312, column: 26, scope: !47)
!1147 = !DILocation(line: 312, column: 8, scope: !47)
!1148 = !DILocation(line: 318, column: 10, scope: !47)
!1149 = !DILocation(line: 319, column: 1, scope: !47)
!1150 = distinct !DISubprogram(name: "chopt_init", scope: !671, file: !671, line: 58, type: !1151, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, unit: !670, variables: !1168)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{null, !1153}
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !6, line: 43, size: 320, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1164, !1165, !1166, !1167}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !1154, file: !6, line: 46, baseType: !5, size: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !1154, file: !6, line: 49, baseType: !56, size: 8, offset: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !1154, file: !6, line: 53, baseType: !1159, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !68, line: 7, size: 128, elements: !1161)
!1161 = !{!1162, !1163}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1160, file: !68, line: 9, baseType: !71, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1160, file: !68, line: 10, baseType: !75, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !1154, file: !6, line: 56, baseType: !56, size: 8, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !1154, file: !6, line: 59, baseType: !56, size: 8, offset: 136)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !1154, file: !6, line: 62, baseType: !34, size: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !1154, file: !6, line: 65, baseType: !34, size: 64, offset: 256)
!1168 = !{!1169}
!1169 = !DILocalVariable(name: "chopt", arg: 1, scope: !1150, file: !671, line: 58, type: !1153)
!1170 = !DILocation(line: 58, column: 34, scope: !1150)
!1171 = !DILocation(line: 60, column: 10, scope: !1150)
!1172 = !DILocation(line: 60, column: 20, scope: !1150)
!1173 = !DILocation(line: 61, column: 10, scope: !1150)
!1174 = !DILocation(line: 61, column: 23, scope: !1150)
!1175 = !DILocation(line: 62, column: 10, scope: !1150)
!1176 = !DILocation(line: 62, column: 34, scope: !1150)
!1177 = !DILocation(line: 63, column: 10, scope: !1150)
!1178 = !DILocation(line: 63, column: 18, scope: !1150)
!1179 = !DILocation(line: 64, column: 10, scope: !1150)
!1180 = !DILocation(line: 64, column: 23, scope: !1150)
!1181 = !DILocation(line: 65, column: 10, scope: !1150)
!1182 = !DILocation(line: 67, column: 1, scope: !1150)
!1183 = !DILocation(line: 65, column: 20, scope: !1150)
!1184 = distinct !DISubprogram(name: "chopt_free", scope: !671, file: !671, line: 70, type: !1151, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true, unit: !670, variables: !1185)
!1185 = !{!1186}
!1186 = !DILocalVariable(name: "chopt", arg: 1, scope: !1184, file: !671, line: 70, type: !1153)
!1187 = !DILocation(line: 70, column: 34, scope: !1184)
!1188 = !DILocation(line: 74, column: 1, scope: !1184)
!1189 = distinct !DISubprogram(name: "gid_to_name", scope: !671, file: !671, line: 81, type: !1190, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, unit: !670, variables: !1192)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!34, !42}
!1192 = !{!1193, !1194, !1198}
!1193 = !DILocalVariable(name: "gid", arg: 1, scope: !1189, file: !671, line: 81, type: !42)
!1194 = !DILocalVariable(name: "buf", scope: !1189, file: !671, line: 83, type: !1195)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 168, elements: !1196)
!1196 = !{!1197}
!1197 = !DISubrange(count: 21)
!1198 = !DILocalVariable(name: "grp", scope: !1189, file: !671, line: 84, type: !1199)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !1096, line: 42, size: 256, elements: !1201)
!1201 = !{!1202, !1203, !1204, !1205}
