; ModuleID = 'coreutils-8.27/src/chmod.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.timespec = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.__dirstream = type opaque

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 95, type: !117, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !30, globals: !35)
!3 = !DIFile(filename: "src/chmod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !10, !24}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !3, line: 50, size: 32, elements: !6)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "V_high", value: 0)
!8 = !DIEnumerator(name: "V_changes_only", value: 1)
!9 = !DIEnumerator(name: "V_off", value: 2)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !11, line: 32, size: 32, elements: !12)
!11 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!13 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!14 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!15 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!16 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!17 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!18 = !DIEnumerator(name: "c_quoting_style", value: 5)
!19 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!20 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!21 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!22 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!23 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !3, line: 42, size: 32, elements: !25)
!25 = !{!26, !27, !28, !29}
!26 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 0)
!27 = !DIEnumerator(name: "CH_SUCCEEDED", value: 1)
!28 = !DIEnumerator(name: "CH_FAILED", value: 2)
!29 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 3)
!30 = !{!31, !33, !34}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!35 = !{!36, !76, !81, !86, !88, !90, !92, !95, !0, !115}
!36 = !DIGlobalVariableExpression(var: !37)
!37 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !38, file: !3, line: 555, type: !65, isLocal: true, isDefinition: true)
!38 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 415, type: !39, isLocal: false, isDefinition: true, scopeLine: 416, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !43)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !41, !42}
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!43 = !{!44, !45, !46, !47, !50, !51, !53, !54, !57, !58, !62, !63, !64}
!44 = !DILocalVariable(name: "argc", arg: 1, scope: !38, file: !3, line: 415, type: !41)
!45 = !DILocalVariable(name: "argv", arg: 2, scope: !38, file: !3, line: 415, type: !42)
!46 = !DILocalVariable(name: "mode", scope: !38, file: !3, line: 417, type: !31)
!47 = !DILocalVariable(name: "mode_len", scope: !38, file: !3, line: 418, type: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 62, baseType: !34)
!49 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!50 = !DILocalVariable(name: "mode_alloc", scope: !38, file: !3, line: 419, type: !48)
!51 = !DILocalVariable(name: "ok", scope: !38, file: !3, line: 420, type: !52)
!52 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!53 = !DILocalVariable(name: "preserve_root", scope: !38, file: !3, line: 421, type: !52)
!54 = !DILocalVariable(name: "reference_file", scope: !38, file: !3, line: 422, type: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!57 = !DILocalVariable(name: "c", scope: !38, file: !3, line: 423, type: !41)
!58 = !DILocalVariable(name: "arg", scope: !59, file: !3, line: 468, type: !55)
!59 = distinct !DILexicalBlock(scope: !60, file: !3, line: 462, column: 11)
!60 = distinct !DILexicalBlock(scope: !61, file: !3, line: 442, column: 9)
!61 = distinct !DILexicalBlock(scope: !38, file: !3, line: 440, column: 5)
!62 = !DILocalVariable(name: "arg_len", scope: !59, file: !3, line: 469, type: !48)
!63 = !DILocalVariable(name: "mode_comma_len", scope: !59, file: !3, line: 470, type: !48)
!64 = !DILocalVariable(name: "new_mode_len", scope: !59, file: !3, line: 471, type: !48)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !66, line: 7, size: 128, elements: !67)
!66 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!67 = !{!68, !73}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !65, file: !66, line: 9, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !70, line: 48, baseType: !71)
!70 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !72, line: 136, baseType: !34)
!72 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !65, file: !66, line: 10, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !70, line: 60, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !72, line: 133, baseType: !34)
!76 = !DIGlobalVariableExpression(var: !77)
!77 = distinct !DIGlobalVariable(name: "change", scope: !2, file: !3, line: 63, type: !78, isLocal: true, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !80, line: 25, flags: DIFlagFwdDecl)
!80 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!81 = !DIGlobalVariableExpression(var: !82)
!82 = distinct !DIGlobalVariable(name: "umask_value", scope: !2, file: !3, line: 66, type: !83, isLocal: true, isDefinition: true)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !70, line: 70, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !72, line: 138, baseType: !85)
!85 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!86 = !DIGlobalVariableExpression(var: !87)
!87 = distinct !DIGlobalVariable(name: "recurse", scope: !2, file: !3, line: 69, type: !52, isLocal: true, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89)
!89 = distinct !DIGlobalVariable(name: "force_silent", scope: !2, file: !3, line: 72, type: !52, isLocal: true, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91)
!91 = distinct !DIGlobalVariable(name: "diagnose_surprises", scope: !2, file: !3, line: 77, type: !52, isLocal: true, isDefinition: true)
!92 = !DIGlobalVariableExpression(var: !93)
!93 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !2, file: !3, line: 84, type: !94, isLocal: true, isDefinition: true)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!95 = !DIGlobalVariableExpression(var: !96)
!96 = distinct !DIGlobalVariable(name: "infomap", scope: !97, file: !98, line: 632, type: !112, isLocal: true, isDefinition: true)
!97 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !98, file: !98, line: 630, type: !99, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !101)
!98 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!99 = !DISubroutineType(types: !100)
!100 = !{null, !55}
!101 = !{!102, !103, !104, !111}
!102 = !DILocalVariable(name: "program", arg: 1, scope: !97, file: !98, line: 630, type: !55)
!103 = !DILocalVariable(name: "node", scope: !97, file: !98, line: 642, type: !55)
!104 = !DILocalVariable(name: "map_prog", scope: !97, file: !98, line: 643, type: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !97, file: !98, line: 632, size: 128, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !107, file: !98, line: 632, baseType: !55, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !107, file: !98, line: 632, baseType: !55, size: 64, offset: 64)
!111 = !DILocalVariable(name: "lc_messages", scope: !97, file: !98, line: 655, type: !55)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 896, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 7)
!115 = !DIGlobalVariableExpression(var: !116)
!116 = distinct !DIGlobalVariable(name: "verbosity", scope: !2, file: !3, line: 80, type: !5, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 2816, elements: !127)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !120, line: 50, size: 256, elements: !121)
!120 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!121 = !{!122, !123, !124, !126}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !120, line: 52, baseType: !55, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !119, file: !120, line: 55, baseType: !41, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !119, file: !120, line: 56, baseType: !125, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !119, file: !120, line: 57, baseType: !41, size: 32, offset: 192)
!127 = !{!128}
!128 = !DISubrange(count: 11)
!129 = !DIGlobalVariableExpression(var: !130)
!130 = distinct !DIGlobalVariable(name: "Version", scope: !131, file: !132, line: 2, type: !55, isLocal: false, isDefinition: true)
!131 = distinct !DICompileUnit(language: DW_LANG_C99, file: !132, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, globals: !134)
!132 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!133 = !{}
!134 = !{!129}
!135 = !DIGlobalVariableExpression(var: !136)
!136 = distinct !DIGlobalVariable(name: "file_name", scope: !137, file: !142, line: 36, type: !55, isLocal: true, isDefinition: true)
!137 = distinct !DICompileUnit(language: DW_LANG_C99, file: !138, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, globals: !139)
!138 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!139 = !{!135, !140}
!140 = !DIGlobalVariableExpression(var: !141)
!141 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !137, file: !142, line: 46, type: !52, isLocal: true, isDefinition: true)
!142 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!143 = !DIGlobalVariableExpression(var: !144)
!144 = distinct !DIGlobalVariable(name: "exit_failure", scope: !145, file: !148, line: 24, type: !149, isLocal: false, isDefinition: true)
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, globals: !147)
!146 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!147 = !{!143}
!148 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!149 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !41)
!150 = !DIGlobalVariableExpression(var: !151)
!151 = distinct !DIGlobalVariable(name: "program_name", scope: !152, file: !156, line: 33, type: !55, isLocal: false, isDefinition: true)
!152 = distinct !DICompileUnit(language: DW_LANG_C99, file: !153, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, retainedTypes: !154, globals: !155)
!153 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!154 = !{!33, !31}
!155 = !{!150}
!156 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!157 = !DIGlobalVariableExpression(var: !158)
!158 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !159, file: !187, line: 77, type: !222, isLocal: false, isDefinition: true)
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, retainedTypes: !182, globals: !184)
!160 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!161 = !{!10, !162, !167}
!162 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !11, line: 242, size: 32, elements: !163)
!163 = !{!164, !165, !166}
!164 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!165 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!166 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !168, line: 46, size: 32, elements: !169)
!168 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181}
!170 = !DIEnumerator(name: "_ISupper", value: 256)
!171 = !DIEnumerator(name: "_ISlower", value: 512)
!172 = !DIEnumerator(name: "_ISalpha", value: 1024)
!173 = !DIEnumerator(name: "_ISdigit", value: 2048)
!174 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!175 = !DIEnumerator(name: "_ISspace", value: 8192)
!176 = !DIEnumerator(name: "_ISprint", value: 16384)
!177 = !DIEnumerator(name: "_ISgraph", value: 32768)
!178 = !DIEnumerator(name: "_ISblank", value: 1)
!179 = !DIEnumerator(name: "_IScntrl", value: 2)
!180 = !DIEnumerator(name: "_ISpunct", value: 4)
!181 = !DIEnumerator(name: "_ISalnum", value: 8)
!182 = !{!41, !183, !48, !31}
!183 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!184 = !{!157, !185, !192, !204, !206, !211, !218, !220}
!185 = !DIGlobalVariableExpression(var: !186)
!186 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !159, file: !187, line: 93, type: !188, isLocal: false, isDefinition: true)
!187 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 320, elements: !190)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!190 = !{!191}
!191 = !DISubrange(count: 10)
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !159, file: !187, line: 1043, type: !194, isLocal: false, isDefinition: true)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !187, line: 57, size: 448, elements: !195)
!195 = !{!196, !197, !198, !202, !203}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !194, file: !187, line: 60, baseType: !10, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !194, file: !187, line: 63, baseType: !41, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !194, file: !187, line: 67, baseType: !199, size: 256, offset: 64)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 256, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 8)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !194, file: !187, line: 70, baseType: !55, size: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !194, file: !187, line: 73, baseType: !55, size: 64, offset: 384)
!204 = !DIGlobalVariableExpression(var: !205)
!205 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !159, file: !187, line: 108, type: !194, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207)
!207 = distinct !DIGlobalVariable(name: "slot0", scope: !159, file: !187, line: 834, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 256)
!211 = !DIGlobalVariableExpression(var: !212)
!212 = distinct !DIGlobalVariable(name: "slotvec", scope: !159, file: !187, line: 837, type: !213, isLocal: true, isDefinition: true)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !187, line: 826, size: 128, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !214, file: !187, line: 828, baseType: !48, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !214, file: !187, line: 829, baseType: !31, size: 64, offset: 64)
!218 = !DIGlobalVariableExpression(var: !219)
!219 = distinct !DIGlobalVariable(name: "nslots", scope: !159, file: !187, line: 835, type: !41, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221)
!221 = distinct !DIGlobalVariable(name: "slotvec0", scope: !159, file: !187, line: 836, type: !214, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 704, elements: !127)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!224 = !DIGlobalVariableExpression(var: !225)
!225 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !226, file: !229, line: 26, type: !230, isLocal: false, isDefinition: true)
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, globals: !228)
!227 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!228 = !{!224}
!229 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 376, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 47)
!233 = !DIGlobalVariableExpression(var: !234)
!234 = distinct !DIGlobalVariable(name: "default_tuning", scope: !235, file: !239, line: 130, type: !240, isLocal: true, isDefinition: true)
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, retainedTypes: !237, globals: !238)
!236 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!237 = !{!34, !33, !48}
!238 = !{!233}
!239 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !242, line: 65, baseType: !243)
!242 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !242, line: 53, size: 160, elements: !244)
!244 = !{!245, !247, !248, !249, !250}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !243, file: !242, line: 58, baseType: !246, size: 32)
!246 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !243, file: !242, line: 59, baseType: !246, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !243, file: !242, line: 60, baseType: !246, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !243, file: !242, line: 61, baseType: !246, size: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !243, file: !242, line: 62, baseType: !52, size: 8, offset: 128)
!251 = !DIGlobalVariableExpression(var: !252)
!252 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !253, file: !598, line: 120, type: !599, isLocal: true, isDefinition: true)
!253 = distinct !DICompileUnit(language: DW_LANG_C99, file: !254, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !594, globals: !597)
!254 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!255 = !{!256}
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 41, size: 32, elements: !258)
!257 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!259 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!260 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!261 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!262 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!263 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!264 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!265 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!266 = !DIEnumerator(name: "DAY_1", value: 131079)
!267 = !DIEnumerator(name: "DAY_2", value: 131080)
!268 = !DIEnumerator(name: "DAY_3", value: 131081)
!269 = !DIEnumerator(name: "DAY_4", value: 131082)
!270 = !DIEnumerator(name: "DAY_5", value: 131083)
!271 = !DIEnumerator(name: "DAY_6", value: 131084)
!272 = !DIEnumerator(name: "DAY_7", value: 131085)
!273 = !DIEnumerator(name: "ABMON_1", value: 131086)
!274 = !DIEnumerator(name: "ABMON_2", value: 131087)
!275 = !DIEnumerator(name: "ABMON_3", value: 131088)
!276 = !DIEnumerator(name: "ABMON_4", value: 131089)
!277 = !DIEnumerator(name: "ABMON_5", value: 131090)
!278 = !DIEnumerator(name: "ABMON_6", value: 131091)
!279 = !DIEnumerator(name: "ABMON_7", value: 131092)
!280 = !DIEnumerator(name: "ABMON_8", value: 131093)
!281 = !DIEnumerator(name: "ABMON_9", value: 131094)
!282 = !DIEnumerator(name: "ABMON_10", value: 131095)
!283 = !DIEnumerator(name: "ABMON_11", value: 131096)
!284 = !DIEnumerator(name: "ABMON_12", value: 131097)
!285 = !DIEnumerator(name: "MON_1", value: 131098)
!286 = !DIEnumerator(name: "MON_2", value: 131099)
!287 = !DIEnumerator(name: "MON_3", value: 131100)
!288 = !DIEnumerator(name: "MON_4", value: 131101)
!289 = !DIEnumerator(name: "MON_5", value: 131102)
!290 = !DIEnumerator(name: "MON_6", value: 131103)
!291 = !DIEnumerator(name: "MON_7", value: 131104)
!292 = !DIEnumerator(name: "MON_8", value: 131105)
!293 = !DIEnumerator(name: "MON_9", value: 131106)
!294 = !DIEnumerator(name: "MON_10", value: 131107)
!295 = !DIEnumerator(name: "MON_11", value: 131108)
!296 = !DIEnumerator(name: "MON_12", value: 131109)
!297 = !DIEnumerator(name: "AM_STR", value: 131110)
!298 = !DIEnumerator(name: "PM_STR", value: 131111)
!299 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!300 = !DIEnumerator(name: "D_FMT", value: 131113)
!301 = !DIEnumerator(name: "T_FMT", value: 131114)
!302 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!303 = !DIEnumerator(name: "ERA", value: 131116)
!304 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!305 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!306 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!307 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!308 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!309 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!310 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!311 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!312 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!313 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!314 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!315 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!316 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!317 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!318 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!319 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!320 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!321 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!322 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!323 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!324 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!325 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!326 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!327 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!328 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!329 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!330 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!331 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!332 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!333 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!334 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!335 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!336 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!337 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!338 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!339 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!340 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!341 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!342 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!343 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!344 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!345 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!346 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!347 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!348 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!349 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!350 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!351 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!352 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!353 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!354 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!355 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!356 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!357 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!358 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!359 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!360 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!361 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!362 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!363 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!364 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!365 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!366 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!367 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!368 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!369 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!370 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!371 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!372 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!373 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!374 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!375 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!376 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!377 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!378 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!379 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!380 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!381 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!382 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!383 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!384 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!385 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!386 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!387 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!388 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!389 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!390 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!391 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!392 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!393 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!394 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!395 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!396 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!397 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!398 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!399 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!400 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!401 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!402 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!403 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!404 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!405 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!406 = !DIEnumerator(name: "CODESET", value: 14)
!407 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!408 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!409 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!410 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!411 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!412 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!413 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!414 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!415 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!416 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!417 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!418 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!419 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!420 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!421 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!422 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!423 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!424 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!425 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!426 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!427 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!428 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!429 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!430 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!431 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!432 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!433 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!434 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!435 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!436 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!437 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!438 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!439 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!440 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!441 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!442 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!443 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!444 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!445 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!446 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!447 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!448 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!449 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!450 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!451 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!452 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!453 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!454 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!455 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!456 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!457 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!458 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!459 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!460 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!461 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!462 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!463 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!464 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!465 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!466 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!467 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!468 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!469 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!470 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!471 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!472 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!473 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!474 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!475 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!476 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!477 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!478 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!479 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!480 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!481 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!482 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!483 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!484 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!485 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!486 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!487 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!488 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!489 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!490 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!491 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!492 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!493 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!494 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!495 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!496 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!497 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!498 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!499 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!500 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!501 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!502 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!503 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!504 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!505 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!506 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!507 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!508 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!509 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!510 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!511 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!512 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!513 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!514 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!515 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!516 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!517 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!518 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!519 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!520 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!521 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!522 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!523 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!524 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!525 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!526 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!527 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!528 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!529 = !DIEnumerator(name: "THOUSEP", value: 65537)
!530 = !DIEnumerator(name: "__GROUPING", value: 65538)
!531 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!532 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!533 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!534 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!535 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!536 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!537 = !DIEnumerator(name: "__YESSTR", value: 327682)
!538 = !DIEnumerator(name: "__NOSTR", value: 327683)
!539 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!540 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!541 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!542 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!543 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!544 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!545 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!546 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!547 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!548 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!549 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!550 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!551 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!552 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!553 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!554 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!555 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!556 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!557 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!558 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!559 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!560 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!561 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!562 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!563 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!564 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!565 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!566 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!567 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!568 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!569 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!570 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!571 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!572 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!573 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!574 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!575 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!576 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!577 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!578 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!579 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!580 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!581 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!582 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!583 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!584 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!585 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!586 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!587 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!588 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!589 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!590 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!591 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!592 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!593 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!594 = !{!33, !31, !595}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!597 = !{!251}
!598 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!599 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !55)
!600 = !DIGlobalVariableExpression(var: !601)
!601 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !602, file: !603, line: 335, type: !41, isLocal: true, isDefinition: true)
!602 = distinct !DISubprogram(name: "rpl_fcntl", scope: !603, file: !603, line: 272, type: !604, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !606, variables: !609)
!603 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!604 = !DISubroutineType(types: !605)
!605 = !{!41, !41, !41, null}
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, globals: !608)
!607 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!608 = !{!600}
!609 = !{!610, !611, !612, !625, !626, !629, !632, !635}
!610 = !DILocalVariable(name: "fd", arg: 1, scope: !602, file: !603, line: 272, type: !41)
!611 = !DILocalVariable(name: "action", arg: 2, scope: !602, file: !603, line: 272, type: !41)
!612 = !DILocalVariable(name: "arg", scope: !602, file: !603, line: 274, type: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !614, line: 30, baseType: !615)
!614 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !607, line: 274, baseType: !616)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 192, elements: !623)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !607, line: 274, size: 192, elements: !618)
!618 = !{!619, !620, !621, !622}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !617, file: !607, line: 274, baseType: !85, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !617, file: !607, line: 274, baseType: !85, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !617, file: !607, line: 274, baseType: !33, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !617, file: !607, line: 274, baseType: !33, size: 64, offset: 128)
!623 = !{!624}
!624 = !DISubrange(count: 1)
!625 = !DILocalVariable(name: "result", scope: !602, file: !603, line: 275, type: !41)
!626 = !DILocalVariable(name: "target", scope: !627, file: !603, line: 322, type: !41)
!627 = distinct !DILexicalBlock(scope: !628, file: !603, line: 321, column: 7)
!628 = distinct !DILexicalBlock(scope: !602, file: !603, line: 278, column: 5)
!629 = !DILocalVariable(name: "flags", scope: !630, file: !603, line: 359, type: !41)
!630 = distinct !DILexicalBlock(scope: !631, file: !603, line: 358, column: 11)
!631 = distinct !DILexicalBlock(scope: !627, file: !603, line: 357, column: 13)
!632 = !DILocalVariable(name: "saved_errno", scope: !633, file: !603, line: 362, type: !41)
!633 = distinct !DILexicalBlock(scope: !634, file: !603, line: 361, column: 15)
!634 = distinct !DILexicalBlock(scope: !630, file: !603, line: 360, column: 17)
!635 = !DILocalVariable(name: "p", scope: !636, file: !603, line: 404, type: !33)
!636 = distinct !DILexicalBlock(scope: !628, file: !603, line: 402, column: 7)
!637 = distinct !DICompileUnit(language: DW_LANG_C99, file: !638, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133)
!638 = !DIFile(filename: "./lib/filemode.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !641, retainedTypes: !649)
!640 = !DIFile(filename: "./lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!641 = !{!642}
!642 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !643, line: 78, size: 32, elements: !644)
!643 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!644 = !{!645, !646, !647, !648}
!645 = !DIEnumerator(name: "MODE_DONE", value: 0)
!646 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1)
!647 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2)
!648 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3)
!649 = !{!48}
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133)
!651 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !654, retainedTypes: !659)
!653 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!654 = !{!655}
!655 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !656, line: 41, size: 32, elements: !657)
!656 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!657 = !{!658}
!658 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!659 = !{!33}
!660 = distinct !DICompileUnit(language: DW_LANG_C99, file: !661, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !662, retainedTypes: !676)
!661 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!662 = !{!663}
!663 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !665, file: !664, line: 192, size: 32, elements: !674)
!664 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!665 = distinct !DISubprogram(name: "x2nrealloc", scope: !664, file: !664, line: 180, type: !666, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !660, variables: !669)
!666 = !DISubroutineType(types: !667)
!667 = !{!33, !33, !668, !48}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!669 = !{!670, !671, !672, !673}
!670 = !DILocalVariable(name: "p", arg: 1, scope: !665, file: !664, line: 180, type: !33)
!671 = !DILocalVariable(name: "pn", arg: 2, scope: !665, file: !664, line: 180, type: !668)
!672 = !DILocalVariable(name: "s", arg: 3, scope: !665, file: !664, line: 180, type: !48)
!673 = !DILocalVariable(name: "n", scope: !665, file: !664, line: 182, type: !48)
!674 = !{!675}
!675 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!676 = !{!48, !31, !33}
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133)
!678 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, retainedTypes: !659)
!680 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, retainedTypes: !659)
!682 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !685, retainedTypes: !843)
!684 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!685 = !{!686, !691, !826, !829, !840}
!686 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !687, line: 160, size: 32, elements: !688)
!687 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!688 = !{!689, !690}
!689 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!690 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!691 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !693, file: !692, line: 54, size: 32, elements: !824)
!692 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!693 = distinct !DISubprogram(name: "setup_dir", scope: !692, file: !692, line: 50, type: !694, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !683, variables: !822)
!694 = !DISubroutineType(types: !695)
!695 = !{!52, !696}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !698, line: 199, baseType: !699)
!698 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 80, size: 1024, elements: !700)
!700 = !{!701, !770, !771, !773, !774, !775, !776, !777, !778, !779, !786, !787, !790, !809}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !699, file: !698, line: 81, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !698, line: 201, size: 2112, elements: !704)
!704 = !{!705, !706, !707, !708, !713, !715, !716, !717, !718, !719, !720, !721, !722, !724, !725, !728, !729, !730, !731, !766}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !703, file: !698, line: 202, baseType: !702, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !703, file: !698, line: 203, baseType: !702, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !703, file: !698, line: 204, baseType: !702, size: 64, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !703, file: !698, line: 205, baseType: !709, size: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !711, line: 127, baseType: !712)
!711 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !711, line: 127, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !703, file: !698, line: 208, baseType: !714, size: 64, offset: 256)
!714 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !703, file: !698, line: 209, baseType: !33, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !703, file: !698, line: 210, baseType: !31, size: 64, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !703, file: !698, line: 211, baseType: !31, size: 64, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !703, file: !698, line: 212, baseType: !41, size: 32, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !703, file: !698, line: 213, baseType: !41, size: 32, offset: 544)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !703, file: !698, line: 214, baseType: !48, size: 64, offset: 576)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !703, file: !698, line: 216, baseType: !696, size: 64, offset: 640)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !703, file: !698, line: 220, baseType: !723, size: 64, offset: 704)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !49, line: 51, baseType: !714)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !703, file: !698, line: 222, baseType: !48, size: 64, offset: 768)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !703, file: !698, line: 223, baseType: !726, size: 64, offset: 832)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !70, line: 75, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !72, line: 139, baseType: !34)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !703, file: !698, line: 239, baseType: !183, size: 16, offset: 896)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !703, file: !698, line: 243, baseType: !183, size: 16, offset: 912)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !703, file: !698, line: 249, baseType: !183, size: 16, offset: 928)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !703, file: !698, line: 251, baseType: !732, size: 1152, offset: 960)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 1152, elements: !623)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !734, line: 46, size: 1152, elements: !735)
!734 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!735 = !{!736, !737, !738, !739, !740, !742, !744, !745, !746, !748, !750, !752, !760, !761, !762}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !733, file: !734, line: 48, baseType: !75, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !733, file: !734, line: 53, baseType: !71, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !733, file: !734, line: 61, baseType: !727, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !733, file: !734, line: 62, baseType: !84, size: 32, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !733, file: !734, line: 64, baseType: !741, size: 32, offset: 224)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !72, line: 134, baseType: !85)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !733, file: !734, line: 65, baseType: !743, size: 32, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !72, line: 135, baseType: !85)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !733, file: !734, line: 67, baseType: !41, size: 32, offset: 288)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !733, file: !734, line: 69, baseType: !75, size: 64, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !733, file: !734, line: 74, baseType: !747, size: 64, offset: 384)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !72, line: 140, baseType: !714)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !733, file: !734, line: 78, baseType: !749, size: 64, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !72, line: 162, baseType: !714)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !733, file: !734, line: 80, baseType: !751, size: 64, offset: 512)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !72, line: 167, baseType: !714)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !733, file: !734, line: 91, baseType: !753, size: 128, offset: 576)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !754, line: 8, size: 128, elements: !755)
!754 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!755 = !{!756, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !753, file: !754, line: 10, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !72, line: 148, baseType: !714)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !753, file: !754, line: 11, baseType: !759, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !72, line: 184, baseType: !714)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !733, file: !734, line: 92, baseType: !753, size: 128, offset: 704)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !733, file: !734, line: 93, baseType: !753, size: 128, offset: 832)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !733, file: !734, line: 106, baseType: !763, size: 192, offset: 960)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 192, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 3)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !703, file: !698, line: 252, baseType: !767, offset: 2112)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: -1)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !699, file: !698, line: 82, baseType: !702, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !699, file: !698, line: 83, baseType: !772, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !699, file: !698, line: 84, baseType: !74, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !699, file: !698, line: 85, baseType: !31, size: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !699, file: !698, line: 86, baseType: !41, size: 32, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !699, file: !698, line: 87, baseType: !41, size: 32, offset: 352)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !699, file: !698, line: 89, baseType: !48, size: 64, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !699, file: !698, line: 90, baseType: !48, size: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !699, file: !698, line: 91, baseType: !780, size: 64, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!41, !783, !783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !699, file: !698, line: 162, baseType: !41, size: 32, offset: 576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !699, file: !698, line: 171, baseType: !788, size: 64, offset: 640)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !698, line: 171, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !699, file: !698, line: 193, baseType: !791, size: 64, offset: 704)
!791 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !699, file: !698, line: 173, size: 64, elements: !792)
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !791, file: !698, line: 186, baseType: !788, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !791, file: !698, line: 192, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !797, line: 28, size: 256, elements: !798)
!797 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!798 = !{!799, !804, !808}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !796, file: !797, line: 30, baseType: !800, size: 128)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !66, line: 7, size: 128, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !800, file: !66, line: 9, baseType: !69, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !800, file: !66, line: 10, baseType: !74, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !796, file: !797, line: 31, baseType: !805, size: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !806, line: 112, baseType: !807)
!806 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !72, line: 62, baseType: !34)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !796, file: !797, line: 32, baseType: !41, size: 32, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !699, file: !698, line: 198, baseType: !810, size: 256, offset: 768)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !811, line: 39, baseType: !812)
!811 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !811, line: 31, size: 256, elements: !813)
!813 = !{!814, !818, !819, !820, !821}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !812, file: !811, line: 33, baseType: !815, size: 128)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 128, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 4)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !812, file: !811, line: 34, baseType: !41, size: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !812, file: !811, line: 35, baseType: !85, size: 32, offset: 160)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !812, file: !811, line: 36, baseType: !85, size: 32, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !812, file: !811, line: 37, baseType: !52, size: 8, offset: 224)
!822 = !{!823}
!823 = !DILocalVariable(name: "fts", arg: 1, scope: !693, file: !692, line: 50, type: !696)
!824 = !{!825}
!825 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!826 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !687, line: 763, size: 32, elements: !827)
!827 = !{!828}
!828 = !DIEnumerator(name: "LCO_HT_INITIAL_SIZE", value: 13)
!829 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !711, line: 97, size: 32, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839}
!831 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!832 = !DIEnumerator(name: "DT_FIFO", value: 1)
!833 = !DIEnumerator(name: "DT_CHR", value: 2)
!834 = !DIEnumerator(name: "DT_DIR", value: 4)
!835 = !DIEnumerator(name: "DT_BLK", value: 6)
!836 = !DIEnumerator(name: "DT_REG", value: 8)
!837 = !DIEnumerator(name: "DT_LNK", value: 10)
!838 = !DIEnumerator(name: "DT_SOCK", value: 12)
!839 = !DIEnumerator(name: "DT_WHT", value: 14)
!840 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !687, line: 155, size: 32, elements: !841)
!841 = !{!842}
!842 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!843 = !{!33, !805, !31, !714, !844, !849}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!41, !847, !847}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !698, line: 253, baseType: !703)
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !854, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, retainedTypes: !649)
!854 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133)
!856 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133)
!858 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133)
!860 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!861 = distinct !DICompileUnit(language: DW_LANG_C99, file: !862, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133)
!862 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!863 = distinct !DICompileUnit(language: DW_LANG_C99, file: !864, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133)
!864 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!865 = distinct !DICompileUnit(language: DW_LANG_C99, file: !866, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !867)
!866 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!867 = !{!868}
!868 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !811, line: 20, size: 32, elements: !869)
!869 = !{!870}
!870 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!871 = distinct !DICompileUnit(language: DW_LANG_C99, file: !872, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133)
!872 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!873 = distinct !DICompileUnit(language: DW_LANG_C99, file: !874, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133)
!874 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133)
!876 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!877 = distinct !DICompileUnit(language: DW_LANG_C99, file: !878, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133)
!878 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, retainedTypes: !659)
!880 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!881 = distinct !DICompileUnit(language: DW_LANG_C99, file: !882, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, retainedTypes: !659)
!882 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!883 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!884 = !{i32 2, !"Dwarf Version", i32 4}
!885 = !{i32 2, !"Debug Info Version", i32 3}
!886 = !{i32 1, !"wchar_size", i32 4}
!887 = !{i32 7, !"PIC Level", i32 2}
!888 = !{i32 7, !"PIE Level", i32 2}
!889 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 368, type: !890, isLocal: false, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !892)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !41}
!892 = !{!893}
!893 = !DILocalVariable(name: "status", arg: 1, scope: !889, file: !3, line: 368, type: !41)
!894 = !DIExpression()
!895 = !DILocation(line: 368, column: 12, scope: !889)
!896 = !DILocation(line: 370, column: 14, scope: !897)
!897 = distinct !DILexicalBlock(scope: !889, file: !3, line: 370, column: 7)
!898 = !DILocation(line: 370, column: 7, scope: !889)
!899 = !DILocation(line: 371, column: 5, scope: !900)
!900 = distinct !DILexicalBlock(scope: !897, file: !3, line: 371, column: 5)
!901 = !{!902, !902, i64 0}
!902 = !{!"any pointer", !903, i64 0}
!903 = !{!"omnipotent char", !904, i64 0}
!904 = !{!"Simple C/C++ TBAA"}
!905 = !DILocation(line: 374, column: 7, scope: !906)
!906 = distinct !DILexicalBlock(scope: !897, file: !3, line: 373, column: 5)
!907 = !DILocation(line: 380, column: 7, scope: !906)
!908 = !DILocation(line: 385, column: 7, scope: !906)
!909 = !DILocation(line: 390, column: 7, scope: !906)
!910 = !DILocation(line: 394, column: 7, scope: !906)
!911 = !DILocation(line: 397, column: 7, scope: !906)
!912 = !DILocation(line: 400, column: 7, scope: !906)
!913 = !DILocation(line: 401, column: 7, scope: !906)
!914 = !DILocation(line: 402, column: 7, scope: !906)
!915 = !DILocation(line: 642, column: 15, scope: !97, inlinedAt: !916)
!916 = distinct !DILocation(line: 406, column: 7, scope: !906)
!917 = !DILocation(line: 651, column: 3, scope: !97, inlinedAt: !916)
!918 = !DILocation(line: 655, column: 29, scope: !97, inlinedAt: !916)
!919 = !DILocation(line: 655, column: 15, scope: !97, inlinedAt: !916)
!920 = !DILocation(line: 656, column: 7, scope: !921, inlinedAt: !916)
!921 = distinct !DILexicalBlock(scope: !97, file: !98, line: 656, column: 7)
!922 = !DILocation(line: 656, column: 19, scope: !921, inlinedAt: !916)
!923 = !DILocation(line: 656, column: 22, scope: !921, inlinedAt: !916)
!924 = !DILocation(line: 656, column: 7, scope: !97, inlinedAt: !916)
!925 = !DILocation(line: 662, column: 7, scope: !926, inlinedAt: !916)
!926 = distinct !DILexicalBlock(scope: !921, file: !98, line: 657, column: 5)
!927 = !DILocation(line: 664, column: 5, scope: !926, inlinedAt: !916)
!928 = !DILocation(line: 665, column: 3, scope: !97, inlinedAt: !916)
!929 = !DILocation(line: 667, column: 3, scope: !97, inlinedAt: !916)
!930 = !DILocation(line: 408, column: 3, scope: !889)
!931 = !DILocalVariable(name: "perms", scope: !932, file: !3, line: 145, type: !941)
!932 = distinct !DISubprogram(name: "describe_change", scope: !3, file: !3, line: 142, type: !933, isLocal: true, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !935)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !55, !83, !83, !24}
!935 = !{!936, !937, !938, !939, !931, !940, !944}
!936 = !DILocalVariable(name: "file", arg: 1, scope: !932, file: !3, line: 142, type: !55)
!937 = !DILocalVariable(name: "old_mode", arg: 2, scope: !932, file: !3, line: 142, type: !83)
!938 = !DILocalVariable(name: "mode", arg: 3, scope: !932, file: !3, line: 142, type: !83)
!939 = !DILocalVariable(name: "changed", arg: 4, scope: !932, file: !3, line: 143, type: !24)
!940 = !DILocalVariable(name: "old_perms", scope: !932, file: !3, line: 146, type: !941)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 96, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 12)
!944 = !DILocalVariable(name: "fmt", scope: !932, file: !3, line: 147, type: !55)
!945 = !DILocation(line: 145, column: 8, scope: !932, inlinedAt: !946)
!946 = distinct !DILocation(line: 298, column: 11, scope: !947, inlinedAt: !1065)
!947 = distinct !DILexicalBlock(scope: !948, file: !3, line: 292, column: 9)
!948 = distinct !DILexicalBlock(scope: !949, file: !3, line: 291, column: 11)
!949 = distinct !DILexicalBlock(scope: !950, file: !3, line: 286, column: 5)
!950 = distinct !DILexicalBlock(scope: !951, file: !3, line: 285, column: 7)
!951 = distinct !DISubprogram(name: "process_file", scope: !3, file: !3, line: 188, type: !952, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1040)
!952 = !DISubroutineType(types: !953)
!953 = !{!52, !954, !1038}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !698, line: 199, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 80, size: 1024, elements: !957)
!957 = !{!958, !1004, !1005, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1020, !1021, !1022, !1029}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !956, file: !698, line: 81, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !698, line: 201, size: 2112, elements: !961)
!961 = !{!962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !1003}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !960, file: !698, line: 202, baseType: !959, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !960, file: !698, line: 203, baseType: !959, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !960, file: !698, line: 204, baseType: !959, size: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !960, file: !698, line: 205, baseType: !709, size: 64, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !960, file: !698, line: 208, baseType: !714, size: 64, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !960, file: !698, line: 209, baseType: !33, size: 64, offset: 320)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !960, file: !698, line: 210, baseType: !31, size: 64, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !960, file: !698, line: 211, baseType: !31, size: 64, offset: 448)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !960, file: !698, line: 212, baseType: !41, size: 32, offset: 512)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !960, file: !698, line: 213, baseType: !41, size: 32, offset: 544)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !960, file: !698, line: 214, baseType: !48, size: 64, offset: 576)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !960, file: !698, line: 216, baseType: !954, size: 64, offset: 640)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !960, file: !698, line: 220, baseType: !723, size: 64, offset: 704)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !960, file: !698, line: 222, baseType: !48, size: 64, offset: 768)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !960, file: !698, line: 223, baseType: !726, size: 64, offset: 832)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !960, file: !698, line: 239, baseType: !183, size: 16, offset: 896)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !960, file: !698, line: 243, baseType: !183, size: 16, offset: 912)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !960, file: !698, line: 249, baseType: !183, size: 16, offset: 928)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !960, file: !698, line: 251, baseType: !981, size: 1152, offset: 960)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 1152, elements: !623)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !734, line: 46, size: 1152, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !1000, !1001, !1002}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !982, file: !734, line: 48, baseType: !75, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !982, file: !734, line: 53, baseType: !71, size: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !982, file: !734, line: 61, baseType: !727, size: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !982, file: !734, line: 62, baseType: !84, size: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !982, file: !734, line: 64, baseType: !741, size: 32, offset: 224)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !982, file: !734, line: 65, baseType: !743, size: 32, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !982, file: !734, line: 67, baseType: !41, size: 32, offset: 288)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !982, file: !734, line: 69, baseType: !75, size: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !982, file: !734, line: 74, baseType: !747, size: 64, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !982, file: !734, line: 78, baseType: !749, size: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !982, file: !734, line: 80, baseType: !751, size: 64, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !982, file: !734, line: 91, baseType: !996, size: 128, offset: 576)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !754, line: 8, size: 128, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !996, file: !754, line: 10, baseType: !757, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !996, file: !754, line: 11, baseType: !759, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !982, file: !734, line: 92, baseType: !996, size: 128, offset: 704)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !982, file: !734, line: 93, baseType: !996, size: 128, offset: 832)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !982, file: !734, line: 106, baseType: !763, size: 192, offset: 960)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !960, file: !698, line: 252, baseType: !767, offset: 2112)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !956, file: !698, line: 82, baseType: !959, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !956, file: !698, line: 83, baseType: !1006, size: 64, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !956, file: !698, line: 84, baseType: !74, size: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !956, file: !698, line: 85, baseType: !31, size: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !956, file: !698, line: 86, baseType: !41, size: 32, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !956, file: !698, line: 87, baseType: !41, size: 32, offset: 352)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !956, file: !698, line: 89, baseType: !48, size: 64, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !956, file: !698, line: 90, baseType: !48, size: 64, offset: 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !956, file: !698, line: 91, baseType: !1014, size: 64, offset: 512)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!41, !1017, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !956, file: !698, line: 162, baseType: !41, size: 32, offset: 576)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !956, file: !698, line: 171, baseType: !788, size: 64, offset: 640)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !956, file: !698, line: 193, baseType: !1023, size: 64, offset: 704)
!1023 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !956, file: !698, line: 173, size: 64, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !1023, file: !698, line: 186, baseType: !788, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1023, file: !698, line: 192, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !698, line: 192, flags: DIFlagFwdDecl)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !956, file: !698, line: 198, baseType: !1030, size: 256, offset: 768)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !811, line: 39, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !811, line: 31, size: 256, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !1031, file: !811, line: 33, baseType: !815, size: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !1031, file: !811, line: 34, baseType: !41, size: 32, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !1031, file: !811, line: 35, baseType: !85, size: 32, offset: 160)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !1031, file: !811, line: 36, baseType: !85, size: 32, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !1031, file: !811, line: 37, baseType: !52, size: 8, offset: 224)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !698, line: 253, baseType: !960)
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1048, !1049, !1050, !1051, !1052, !1056, !1057, !1058, !1061, !1064}
!1041 = !DILocalVariable(name: "fts", arg: 1, scope: !951, file: !3, line: 188, type: !954)
!1042 = !DILocalVariable(name: "ent", arg: 2, scope: !951, file: !3, line: 188, type: !1038)
!1043 = !DILocalVariable(name: "file_full_name", scope: !951, file: !3, line: 190, type: !55)
!1044 = !DILocalVariable(name: "file", scope: !951, file: !3, line: 191, type: !55)
!1045 = !DILocalVariable(name: "file_stats", scope: !951, file: !3, line: 192, type: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!1048 = !DILocalVariable(name: "old_mode", scope: !951, file: !3, line: 193, type: !83)
!1049 = !DILocalVariable(name: "new_mode", scope: !951, file: !3, line: 194, type: !83)
!1050 = !DILocalVariable(name: "ok", scope: !951, file: !3, line: 195, type: !52)
!1051 = !DILocalVariable(name: "chmod_succeeded", scope: !951, file: !3, line: 196, type: !52)
!1052 = !DILocalVariable(name: "__x", scope: !1053, file: !3, line: 261, type: !1038)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 261, column: 7)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 256, column: 5)
!1055 = distinct !DILexicalBlock(scope: !951, file: !3, line: 255, column: 7)
!1056 = !DILocalVariable(name: "changed", scope: !949, file: !3, line: 287, type: !52)
!1057 = !DILocalVariable(name: "ch_status", scope: !947, file: !3, line: 293, type: !24)
!1058 = !DILocalVariable(name: "naively_expected_mode", scope: !1059, file: !3, line: 304, type: !83)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 303, column: 5)
!1060 = distinct !DILexicalBlock(scope: !951, file: !3, line: 302, column: 7)
!1061 = !DILocalVariable(name: "new_perms", scope: !1062, file: !3, line: 308, type: !941)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 307, column: 9)
!1063 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 306, column: 11)
!1064 = !DILocalVariable(name: "naively_expected_perms", scope: !1062, file: !3, line: 309, type: !941)
!1065 = distinct !DILocation(line: 355, column: 13, scope: !1066, inlinedAt: !1076)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 339, column: 5)
!1067 = distinct !DISubprogram(name: "process_files", scope: !3, file: !3, line: 332, type: !1068, isLocal: true, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1070)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!52, !42, !41}
!1070 = !{!1071, !1072, !1073, !1074, !1075}
!1071 = !DILocalVariable(name: "files", arg: 1, scope: !1067, file: !3, line: 332, type: !42)
!1072 = !DILocalVariable(name: "bit_flags", arg: 2, scope: !1067, file: !3, line: 332, type: !41)
!1073 = !DILocalVariable(name: "ok", scope: !1067, file: !3, line: 334, type: !52)
!1074 = !DILocalVariable(name: "fts", scope: !1067, file: !3, line: 336, type: !954)
!1075 = !DILocalVariable(name: "ent", scope: !1066, file: !3, line: 340, type: !1038)
!1076 = distinct !DILocation(line: 566, column: 8, scope: !38)
!1077 = !DILocation(line: 146, column: 8, scope: !932, inlinedAt: !946)
!1078 = !DILocation(line: 308, column: 16, scope: !1062, inlinedAt: !1065)
!1079 = !DILocation(line: 309, column: 16, scope: !1062, inlinedAt: !1065)
!1080 = !DILocation(line: 415, column: 11, scope: !38)
!1081 = !DILocation(line: 415, column: 24, scope: !38)
!1082 = !DILocation(line: 417, column: 9, scope: !38)
!1083 = !DILocation(line: 418, column: 10, scope: !38)
!1084 = !DILocation(line: 419, column: 3, scope: !38)
!1085 = !DILocation(line: 419, column: 10, scope: !38)
!1086 = !{!1087, !1087, i64 0}
!1087 = !{!"long", !903, i64 0}
!1088 = !DILocation(line: 421, column: 8, scope: !38)
!1089 = !DILocation(line: 422, column: 15, scope: !38)
!1090 = !DILocation(line: 426, column: 21, scope: !38)
!1091 = !DILocation(line: 426, column: 3, scope: !38)
!1092 = !DILocation(line: 427, column: 3, scope: !38)
!1093 = !DILocation(line: 428, column: 3, scope: !38)
!1094 = !DILocation(line: 429, column: 3, scope: !38)
!1095 = !DILocation(line: 431, column: 3, scope: !38)
!1096 = !DILocation(line: 435, column: 3, scope: !38)
!1097 = !DILocation(line: 435, column: 15, scope: !38)
!1098 = !DILocation(line: 423, column: 7, scope: !38)
!1099 = distinct !{!1099, !1096, !1100}
!1100 = !DILocation(line: 510, column: 5, scope: !38)
!1101 = !DILocation(line: 468, column: 36, scope: !59)
!1102 = !{!1103, !1103, i64 0}
!1103 = !{!"int", !903, i64 0}
!1104 = !DILocation(line: 468, column: 43, scope: !59)
!1105 = !DILocation(line: 468, column: 31, scope: !59)
!1106 = !DILocation(line: 468, column: 25, scope: !59)
!1107 = !DILocation(line: 469, column: 30, scope: !59)
!1108 = !DILocation(line: 469, column: 20, scope: !59)
!1109 = !DILocation(line: 470, column: 49, scope: !59)
!1110 = !DILocation(line: 470, column: 48, scope: !59)
!1111 = !DILocation(line: 470, column: 46, scope: !59)
!1112 = !DILocation(line: 470, column: 20, scope: !59)
!1113 = !DILocation(line: 471, column: 50, scope: !59)
!1114 = !DILocation(line: 471, column: 20, scope: !59)
!1115 = !DILocation(line: 472, column: 17, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !59, file: !3, line: 472, column: 17)
!1117 = !DILocation(line: 472, column: 28, scope: !1116)
!1118 = !DILocation(line: 472, column: 17, scope: !59)
!1119 = !DILocation(line: 474, column: 43, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1116, file: !3, line: 473, column: 15)
!1121 = !DILocation(line: 474, column: 28, scope: !1120)
!1122 = !DILocation(line: 475, column: 24, scope: !1120)
!1123 = !DILocation(line: 476, column: 15, scope: !1120)
!1124 = !DILocation(line: 477, column: 13, scope: !59)
!1125 = !DILocation(line: 477, column: 28, scope: !59)
!1126 = !{!903, !903, i64 0}
!1127 = !DILocation(line: 478, column: 26, scope: !59)
!1128 = !DILocation(line: 478, column: 57, scope: !59)
!1129 = !DILocation(line: 478, column: 13, scope: !59)
!1130 = !DILocation(line: 483, column: 11, scope: !60)
!1131 = !DILocation(line: 489, column: 11, scope: !60)
!1132 = !DILocation(line: 491, column: 28, scope: !60)
!1133 = !DILocation(line: 492, column: 11, scope: !60)
!1134 = !DILocation(line: 495, column: 11, scope: !60)
!1135 = !DILocation(line: 497, column: 21, scope: !60)
!1136 = !DILocation(line: 498, column: 11, scope: !60)
!1137 = !DILocation(line: 501, column: 11, scope: !60)
!1138 = !DILocation(line: 503, column: 21, scope: !60)
!1139 = !DILocation(line: 504, column: 11, scope: !60)
!1140 = !DILocation(line: 505, column: 9, scope: !60)
!1141 = !DILocation(line: 506, column: 9, scope: !60)
!1142 = !DILocation(line: 508, column: 11, scope: !60)
!1143 = !DILocation(line: 512, column: 7, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !38, file: !3, line: 512, column: 7)
!1145 = !DILocation(line: 512, column: 7, scope: !38)
!1146 = !DILocation(line: 514, column: 11, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 513, column: 5)
!1148 = !DILocation(line: 516, column: 24, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1150, file: !3, line: 515, column: 9)
!1150 = distinct !DILexicalBlock(scope: !1147, file: !3, line: 514, column: 11)
!1151 = !DILocation(line: 516, column: 11, scope: !1149)
!1152 = !DILocation(line: 517, column: 11, scope: !1149)
!1153 = !DILocation(line: 522, column: 11, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 521, column: 5)
!1155 = !DILocation(line: 523, column: 27, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1154, file: !3, line: 522, column: 11)
!1157 = !DILocation(line: 523, column: 16, scope: !1156)
!1158 = !DILocation(line: 523, column: 9, scope: !1156)
!1159 = !DILocation(line: 526, column: 7, scope: !1160)
