; ModuleID = 'coreutils-8.27/src/chown.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.Chown_option = type { i32, i8, %struct.dev_ino*, i8, i8, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.__dirstream = type opaque

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 55, type: !145, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !25, globals: !29)
!3 = !DIFile(filename: "src/chown.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !6, line: 31, size: 32, elements: !7)
!6 = !DIFile(filename: "src/chown-core.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "V_high", value: 0)
!9 = !DIEnumerator(name: "V_changes_only", value: 1)
!10 = !DIEnumerator(name: "V_off", value: 2)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !12, line: 32, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!29 = !{!30, !123, !125, !0}
!30 = !DIGlobalVariableExpression(var: !31)
!31 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !32, file: !3, line: 316, type: !62, isLocal: true, isDefinition: true)
!32 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 157, type: !33, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !37)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !35, !36}
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!37 = !{!38, !39, !40, !42, !48, !51, !52, !53, !54, !55, !76, !77, !78, !84, !121}
!38 = !DILocalVariable(name: "argc", arg: 1, scope: !32, file: !3, line: 157, type: !35)
!39 = !DILocalVariable(name: "argv", arg: 2, scope: !32, file: !3, line: 157, type: !36)
!40 = !DILocalVariable(name: "preserve_root", scope: !32, file: !3, line: 159, type: !41)
!41 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!42 = !DILocalVariable(name: "uid", scope: !32, file: !3, line: 161, type: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !44, line: 80, baseType: !45)
!44 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !46, line: 134, baseType: !47)
!46 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DILocalVariable(name: "gid", scope: !32, file: !3, line: 162, type: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !44, line: 65, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !46, line: 135, baseType: !47)
!51 = !DILocalVariable(name: "required_uid", scope: !32, file: !3, line: 166, type: !43)
!52 = !DILocalVariable(name: "required_gid", scope: !32, file: !3, line: 167, type: !49)
!53 = !DILocalVariable(name: "bit_flags", scope: !32, file: !3, line: 170, type: !35)
!54 = !DILocalVariable(name: "dereference", scope: !32, file: !3, line: 174, type: !35)
!55 = !DILocalVariable(name: "chopt", scope: !32, file: !3, line: 176, type: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !6, line: 43, size: 320, elements: !57)
!57 = !{!58, !59, !60, !72, !73, !74, !75}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !56, file: !6, line: 46, baseType: !5, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !56, file: !6, line: 49, baseType: !41, size: 8, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !56, file: !6, line: 53, baseType: !61, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !63, line: 7, size: 128, elements: !64)
!63 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!64 = !{!65, !69}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !62, file: !63, line: 9, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !44, line: 48, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !46, line: 136, baseType: !68)
!68 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !62, file: !63, line: 10, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !44, line: 60, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !46, line: 133, baseType: !68)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !56, file: !6, line: 56, baseType: !41, size: 8, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !56, file: !6, line: 59, baseType: !41, size: 8, offset: 136)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !56, file: !6, line: 62, baseType: !26, size: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !56, file: !6, line: 65, baseType: !26, size: 64, offset: 256)
!76 = !DILocalVariable(name: "ok", scope: !32, file: !3, line: 177, type: !41)
!77 = !DILocalVariable(name: "optc", scope: !32, file: !3, line: 178, type: !35)
!78 = !DILocalVariable(name: "e", scope: !79, file: !3, line: 230, type: !82)
!79 = distinct !DILexicalBlock(scope: !80, file: !3, line: 229, column: 11)
!80 = distinct !DILexicalBlock(scope: !81, file: !3, line: 194, column: 9)
!81 = distinct !DILexicalBlock(scope: !32, file: !3, line: 192, column: 5)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!84 = !DILocalVariable(name: "ref_stats", scope: !85, file: !3, line: 288, type: !87)
!85 = distinct !DILexicalBlock(scope: !86, file: !3, line: 287, column: 5)
!86 = distinct !DILexicalBlock(scope: !32, file: !3, line: 286, column: 7)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !88, line: 46, size: 1152, elements: !89)
!88 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!89 = !{!90, !91, !92, !94, !96, !97, !98, !99, !100, !103, !105, !107, !115, !116, !117}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !87, file: !88, line: 48, baseType: !71, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !87, file: !88, line: 53, baseType: !67, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !87, file: !88, line: 61, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !46, line: 139, baseType: !68)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !87, file: !88, line: 62, baseType: !95, size: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !46, line: 138, baseType: !47)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !87, file: !88, line: 64, baseType: !45, size: 32, offset: 224)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !87, file: !88, line: 65, baseType: !50, size: 32, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !87, file: !88, line: 67, baseType: !35, size: 32, offset: 288)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !87, file: !88, line: 69, baseType: !71, size: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !87, file: !88, line: 74, baseType: !101, size: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !46, line: 140, baseType: !102)
!102 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !87, file: !88, line: 78, baseType: !104, size: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !46, line: 162, baseType: !102)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !87, file: !88, line: 80, baseType: !106, size: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !46, line: 167, baseType: !102)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !87, file: !88, line: 91, baseType: !108, size: 128, offset: 576)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !109, line: 8, size: 128, elements: !110)
!109 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!110 = !{!111, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !108, file: !109, line: 10, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !46, line: 148, baseType: !102)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !108, file: !109, line: 11, baseType: !114, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !46, line: 184, baseType: !102)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !87, file: !88, line: 92, baseType: !108, size: 128, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !87, file: !88, line: 93, baseType: !108, size: 128, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !87, file: !88, line: 106, baseType: !118, size: 192, offset: 960)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 192, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 3)
!121 = !DILocalVariable(name: "e", scope: !122, file: !3, line: 300, type: !82)
!122 = distinct !DILexicalBlock(scope: !86, file: !3, line: 299, column: 5)
!123 = !DIGlobalVariableExpression(var: !124)
!124 = distinct !DIGlobalVariable(name: "reference_file", scope: !2, file: !3, line: 42, type: !26, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126)
!126 = distinct !DIGlobalVariable(name: "infomap", scope: !127, file: !128, line: 632, type: !142, isLocal: true, isDefinition: true)
!127 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !128, file: !128, line: 630, type: !129, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !131)
!128 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!129 = !DISubroutineType(types: !130)
!130 = !{null, !82}
!131 = !{!132, !133, !134, !141}
!132 = !DILocalVariable(name: "program", arg: 1, scope: !127, file: !128, line: 630, type: !82)
!133 = !DILocalVariable(name: "node", scope: !127, file: !128, line: 642, type: !82)
!134 = !DILocalVariable(name: "map_prog", scope: !127, file: !128, line: 643, type: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !127, file: !128, line: 632, size: 128, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !137, file: !128, line: 632, baseType: !82, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !137, file: !128, line: 632, baseType: !82, size: 64, offset: 64)
!141 = !DILocalVariable(name: "lc_messages", scope: !127, file: !128, line: 655, type: !82)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 896, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 7)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 3584, elements: !155)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !148, line: 50, size: 256, elements: !149)
!148 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!149 = !{!150, !151, !152, !154}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !148, line: 52, baseType: !82, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !147, file: !148, line: 55, baseType: !35, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !147, file: !148, line: 56, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !147, file: !148, line: 57, baseType: !35, size: 32, offset: 192)
!155 = !{!156}
!156 = !DISubrange(count: 14)
!157 = !DIGlobalVariableExpression(var: !158)
!158 = distinct !DIGlobalVariable(name: "Version", scope: !159, file: !160, line: 2, type: !82, isLocal: false, isDefinition: true)
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, globals: !162)
!160 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!161 = !{}
!162 = !{!157}
!163 = !DIGlobalVariableExpression(var: !164)
!164 = distinct !DIGlobalVariable(name: "file_name", scope: !165, file: !170, line: 36, type: !82, isLocal: true, isDefinition: true)
!165 = distinct !DICompileUnit(language: DW_LANG_C99, file: !166, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, globals: !167)
!166 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!167 = !{!163, !168}
!168 = !DIGlobalVariableExpression(var: !169)
!169 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !165, file: !170, line: 46, type: !41, isLocal: true, isDefinition: true)
!170 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!171 = !DIGlobalVariableExpression(var: !172)
!172 = distinct !DIGlobalVariable(name: "exit_failure", scope: !173, file: !176, line: 24, type: !177, isLocal: false, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, globals: !175)
!174 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!175 = !{!171}
!176 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!177 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !35)
!178 = !DIGlobalVariableExpression(var: !179)
!179 = distinct !DIGlobalVariable(name: "program_name", scope: !180, file: !184, line: 33, type: !82, isLocal: false, isDefinition: true)
!180 = distinct !DICompileUnit(language: DW_LANG_C99, file: !181, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, retainedTypes: !182, globals: !183)
!181 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!182 = !{!28, !26}
!183 = !{!178}
!184 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!185 = !DIGlobalVariableExpression(var: !186)
!186 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !187, file: !217, line: 77, type: !252, isLocal: false, isDefinition: true)
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, retainedTypes: !210, globals: !214)
!188 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!189 = !{!11, !190, !195}
!190 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, size: 32, elements: !191)
!191 = !{!192, !193, !194}
!192 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!193 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!194 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!195 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !196, line: 46, size: 32, elements: !197)
!196 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209}
!198 = !DIEnumerator(name: "_ISupper", value: 256)
!199 = !DIEnumerator(name: "_ISlower", value: 512)
!200 = !DIEnumerator(name: "_ISalpha", value: 1024)
!201 = !DIEnumerator(name: "_ISdigit", value: 2048)
!202 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!203 = !DIEnumerator(name: "_ISspace", value: 8192)
!204 = !DIEnumerator(name: "_ISprint", value: 16384)
!205 = !DIEnumerator(name: "_ISgraph", value: 32768)
!206 = !DIEnumerator(name: "_ISblank", value: 1)
!207 = !DIEnumerator(name: "_IScntrl", value: 2)
!208 = !DIEnumerator(name: "_ISpunct", value: 4)
!209 = !DIEnumerator(name: "_ISalnum", value: 8)
!210 = !{!35, !211, !212, !26}
!211 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !213, line: 62, baseType: !68)
!213 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!214 = !{!185, !215, !222, !234, !236, !241, !248, !250}
!215 = !DIGlobalVariableExpression(var: !216)
!216 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !187, file: !217, line: 93, type: !218, isLocal: false, isDefinition: true)
!217 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 320, elements: !220)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!220 = !{!221}
!221 = !DISubrange(count: 10)
!222 = !DIGlobalVariableExpression(var: !223)
!223 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !187, file: !217, line: 1043, type: !224, isLocal: false, isDefinition: true)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !217, line: 57, size: 448, elements: !225)
!225 = !{!226, !227, !228, !232, !233}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !224, file: !217, line: 60, baseType: !11, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !224, file: !217, line: 63, baseType: !35, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !224, file: !217, line: 67, baseType: !229, size: 256, offset: 64)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 256, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !224, file: !217, line: 70, baseType: !82, size: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !224, file: !217, line: 73, baseType: !82, size: 64, offset: 384)
!234 = !DIGlobalVariableExpression(var: !235)
!235 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !187, file: !217, line: 108, type: !224, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237)
!237 = distinct !DIGlobalVariable(name: "slot0", scope: !187, file: !217, line: 834, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 256)
!241 = !DIGlobalVariableExpression(var: !242)
!242 = distinct !DIGlobalVariable(name: "slotvec", scope: !187, file: !217, line: 837, type: !243, isLocal: true, isDefinition: true)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !217, line: 826, size: 128, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !244, file: !217, line: 828, baseType: !212, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !244, file: !217, line: 829, baseType: !26, size: 64, offset: 64)
!248 = !DIGlobalVariableExpression(var: !249)
!249 = distinct !DIGlobalVariable(name: "nslots", scope: !187, file: !217, line: 835, type: !35, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251)
!251 = distinct !DIGlobalVariable(name: "slotvec0", scope: !187, file: !217, line: 836, type: !244, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 704, elements: !254)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!254 = !{!255}
!255 = !DISubrange(count: 11)
!256 = !DIGlobalVariableExpression(var: !257)
!257 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !258, file: !261, line: 26, type: !262, isLocal: false, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, globals: !260)
!259 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!260 = !{!256}
!261 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 376, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 47)
!265 = !DIGlobalVariableExpression(var: !266)
!266 = distinct !DIGlobalVariable(name: "default_tuning", scope: !267, file: !271, line: 130, type: !272, isLocal: true, isDefinition: true)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, retainedTypes: !269, globals: !270)
!268 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!269 = !{!68, !28, !212}
!270 = !{!265}
!271 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !274, line: 65, baseType: !275)
!274 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !274, line: 53, size: 160, elements: !276)
!276 = !{!277, !279, !280, !281, !282}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !275, file: !274, line: 58, baseType: !278, size: 32)
!278 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !275, file: !274, line: 59, baseType: !278, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !275, file: !274, line: 60, baseType: !278, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !275, file: !274, line: 61, baseType: !278, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !275, file: !274, line: 62, baseType: !41, size: 8, offset: 128)
!283 = !DIGlobalVariableExpression(var: !284)
!284 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !285, file: !630, line: 120, type: !631, isLocal: true, isDefinition: true)
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !287, retainedTypes: !626, globals: !629)
!286 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!287 = !{!288}
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !289, line: 41, size: 32, elements: !290)
!289 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!291 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!292 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!293 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!294 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!295 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!296 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!297 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!298 = !DIEnumerator(name: "DAY_1", value: 131079)
!299 = !DIEnumerator(name: "DAY_2", value: 131080)
!300 = !DIEnumerator(name: "DAY_3", value: 131081)
!301 = !DIEnumerator(name: "DAY_4", value: 131082)
!302 = !DIEnumerator(name: "DAY_5", value: 131083)
!303 = !DIEnumerator(name: "DAY_6", value: 131084)
!304 = !DIEnumerator(name: "DAY_7", value: 131085)
!305 = !DIEnumerator(name: "ABMON_1", value: 131086)
!306 = !DIEnumerator(name: "ABMON_2", value: 131087)
!307 = !DIEnumerator(name: "ABMON_3", value: 131088)
!308 = !DIEnumerator(name: "ABMON_4", value: 131089)
!309 = !DIEnumerator(name: "ABMON_5", value: 131090)
!310 = !DIEnumerator(name: "ABMON_6", value: 131091)
!311 = !DIEnumerator(name: "ABMON_7", value: 131092)
!312 = !DIEnumerator(name: "ABMON_8", value: 131093)
!313 = !DIEnumerator(name: "ABMON_9", value: 131094)
!314 = !DIEnumerator(name: "ABMON_10", value: 131095)
!315 = !DIEnumerator(name: "ABMON_11", value: 131096)
!316 = !DIEnumerator(name: "ABMON_12", value: 131097)
!317 = !DIEnumerator(name: "MON_1", value: 131098)
!318 = !DIEnumerator(name: "MON_2", value: 131099)
!319 = !DIEnumerator(name: "MON_3", value: 131100)
!320 = !DIEnumerator(name: "MON_4", value: 131101)
!321 = !DIEnumerator(name: "MON_5", value: 131102)
!322 = !DIEnumerator(name: "MON_6", value: 131103)
!323 = !DIEnumerator(name: "MON_7", value: 131104)
!324 = !DIEnumerator(name: "MON_8", value: 131105)
!325 = !DIEnumerator(name: "MON_9", value: 131106)
!326 = !DIEnumerator(name: "MON_10", value: 131107)
!327 = !DIEnumerator(name: "MON_11", value: 131108)
!328 = !DIEnumerator(name: "MON_12", value: 131109)
!329 = !DIEnumerator(name: "AM_STR", value: 131110)
!330 = !DIEnumerator(name: "PM_STR", value: 131111)
!331 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!332 = !DIEnumerator(name: "D_FMT", value: 131113)
!333 = !DIEnumerator(name: "T_FMT", value: 131114)
!334 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!335 = !DIEnumerator(name: "ERA", value: 131116)
!336 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!337 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!338 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!339 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!340 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!341 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!342 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!343 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!344 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!345 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!346 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!347 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!348 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!349 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!350 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!351 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!352 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!353 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!354 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!355 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!356 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!357 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!358 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!359 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!360 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!361 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!362 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!363 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!364 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!365 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!366 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!367 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!368 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!369 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!370 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!371 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!372 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!373 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!374 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!375 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!376 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!377 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!378 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!379 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!380 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!381 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!382 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!383 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!384 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!385 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!386 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!387 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!388 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!389 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!390 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!391 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!392 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!393 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!394 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!395 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!396 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!397 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!398 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!399 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!400 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!401 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!402 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!403 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!404 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!405 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!406 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!407 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!408 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!409 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!410 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!411 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!412 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!413 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!414 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!415 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!416 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!417 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!418 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!419 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!420 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!421 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!422 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!423 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!424 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!425 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!426 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!427 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!428 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!429 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!430 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!431 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!432 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!433 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!434 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!435 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!436 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!437 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!438 = !DIEnumerator(name: "CODESET", value: 14)
!439 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!440 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!441 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!442 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!443 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!444 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!445 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!446 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!447 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!448 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!449 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!450 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!451 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!452 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!453 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!454 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!455 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!456 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!457 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!458 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!459 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!460 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!461 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!462 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!463 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!464 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!465 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!466 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!467 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!468 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!469 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!470 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!471 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!472 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!473 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!474 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!475 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!476 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!477 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!478 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!479 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!480 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!481 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!482 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!483 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!484 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!485 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!486 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!487 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!488 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!489 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!490 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!491 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!492 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!493 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!494 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!495 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!496 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!497 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!498 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!499 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!500 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!501 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!502 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!503 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!504 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!505 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!506 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!507 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!508 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!509 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!510 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!511 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!512 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!513 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!514 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!515 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!516 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!517 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!518 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!519 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!520 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!521 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!522 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!523 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!524 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!525 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!526 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!527 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!528 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!529 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!530 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!531 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!532 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!533 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!534 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!535 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!536 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!537 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!538 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!539 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!540 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!541 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!542 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!543 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!544 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!545 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!546 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!547 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!548 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!549 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!550 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!551 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!552 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!553 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!554 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!555 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!556 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!557 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!558 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!559 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!560 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!561 = !DIEnumerator(name: "THOUSEP", value: 65537)
!562 = !DIEnumerator(name: "__GROUPING", value: 65538)
!563 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!564 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!565 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!566 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!567 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!568 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!569 = !DIEnumerator(name: "__YESSTR", value: 327682)
!570 = !DIEnumerator(name: "__NOSTR", value: 327683)
!571 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!572 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!573 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!574 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!575 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!576 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!577 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!578 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!579 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!580 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!581 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!582 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!583 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!584 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!585 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!586 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!587 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!588 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!589 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!590 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!591 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!592 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!593 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!594 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!595 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!596 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!597 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!598 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!599 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!600 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!601 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!602 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!603 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!604 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!605 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!606 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!607 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!608 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!609 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!610 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!611 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!612 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!613 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!614 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!615 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!616 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!617 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!618 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!619 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!620 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!621 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!622 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!623 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!624 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!625 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!626 = !{!28, !26, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!629 = !{!283}
!630 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!631 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !82)
!632 = !DIGlobalVariableExpression(var: !633)
!633 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !634, file: !635, line: 335, type: !35, isLocal: true, isDefinition: true)
!634 = distinct !DISubprogram(name: "rpl_fcntl", scope: !635, file: !635, line: 272, type: !636, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !638, variables: !641)
!635 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!636 = !DISubroutineType(types: !637)
!637 = !{!35, !35, !35, null}
!638 = distinct !DICompileUnit(language: DW_LANG_C99, file: !639, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, globals: !640)
!639 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!640 = !{!632}
!641 = !{!642, !643, !644, !657, !658, !661, !664, !667}
!642 = !DILocalVariable(name: "fd", arg: 1, scope: !634, file: !635, line: 272, type: !35)
!643 = !DILocalVariable(name: "action", arg: 2, scope: !634, file: !635, line: 272, type: !35)
!644 = !DILocalVariable(name: "arg", scope: !634, file: !635, line: 274, type: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !646, line: 30, baseType: !647)
!646 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !639, line: 274, baseType: !648)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 192, elements: !655)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !639, line: 274, size: 192, elements: !650)
!650 = !{!651, !652, !653, !654}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !649, file: !639, line: 274, baseType: !47, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !649, file: !639, line: 274, baseType: !47, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !649, file: !639, line: 274, baseType: !28, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !649, file: !639, line: 274, baseType: !28, size: 64, offset: 128)
!655 = !{!656}
!656 = !DISubrange(count: 1)
!657 = !DILocalVariable(name: "result", scope: !634, file: !635, line: 275, type: !35)
!658 = !DILocalVariable(name: "target", scope: !659, file: !635, line: 322, type: !35)
!659 = distinct !DILexicalBlock(scope: !660, file: !635, line: 321, column: 7)
!660 = distinct !DILexicalBlock(scope: !634, file: !635, line: 278, column: 5)
!661 = !DILocalVariable(name: "flags", scope: !662, file: !635, line: 359, type: !35)
!662 = distinct !DILexicalBlock(scope: !663, file: !635, line: 358, column: 11)
!663 = distinct !DILexicalBlock(scope: !659, file: !635, line: 357, column: 13)
!664 = !DILocalVariable(name: "saved_errno", scope: !665, file: !635, line: 362, type: !35)
!665 = distinct !DILexicalBlock(scope: !666, file: !635, line: 361, column: 15)
!666 = distinct !DILexicalBlock(scope: !662, file: !635, line: 360, column: 17)
!667 = !DILocalVariable(name: "p", scope: !668, file: !635, line: 404, type: !28)
!668 = distinct !DILexicalBlock(scope: !660, file: !635, line: 402, column: 7)
!669 = distinct !DICompileUnit(language: DW_LANG_C99, file: !670, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !671, retainedTypes: !685)
!670 = !DIFile(filename: "src/chown-core.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!671 = !{!5, !11, !672, !679}
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !670, line: 38, size: 32, elements: !673)
!673 = !{!674, !675, !676, !677, !678}
!674 = !DIEnumerator(name: "RC_ok", value: 2)
!675 = !DIEnumerator(name: "RC_excluded", value: 3)
!676 = !DIEnumerator(name: "RC_inode_changed", value: 4)
!677 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5)
!678 = !DIEnumerator(name: "RC_error", value: 6)
!679 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !6, line: 23, size: 32, elements: !680)
!680 = !{!681, !682, !683, !684}
!681 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1)
!682 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2)
!683 = !DIEnumerator(name: "CH_FAILED", value: 3)
!684 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4)
!685 = !{!43, !49, !28}
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, retainedTypes: !688)
!687 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!688 = !{!689}
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !690, line: 112, baseType: !691)
!690 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !46, line: 62, baseType: !68)
!692 = distinct !DICompileUnit(language: DW_LANG_C99, file: !693, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161)
!693 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!694 = distinct !DICompileUnit(language: DW_LANG_C99, file: !695, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !696, retainedTypes: !705, globals: !706)
!695 = !DIFile(filename: "./lib/userspec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!696 = !{!697}
!697 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !698, line: 26, size: 32, elements: !699)
!698 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!699 = !{!700, !701, !702, !703, !704}
!700 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!701 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!702 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!703 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!704 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!705 = !{!28, !43, !49}
!706 = !{!707, !772, !774}
!707 = !DIGlobalVariableExpression(var: !708)
!708 = distinct !DIGlobalVariable(name: "E_invalid_user", scope: !709, file: !710, line: 106, type: !82, isLocal: true, isDefinition: true)
!709 = distinct !DISubprogram(name: "parse_with_separator", scope: !710, file: !710, line: 102, type: !711, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, unit: !694, variables: !715)
!710 = !DIFile(filename: "lib/userspec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!711 = !DISubroutineType(types: !712)
!712 = !{!82, !82, !82, !713, !714, !36, !36}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !735, !744, !745, !746, !747, !748, !749, !752, !757, !760, !767}
!716 = !DILocalVariable(name: "spec", arg: 1, scope: !709, file: !710, line: 102, type: !82)
!717 = !DILocalVariable(name: "separator", arg: 2, scope: !709, file: !710, line: 102, type: !82)
!718 = !DILocalVariable(name: "uid", arg: 3, scope: !709, file: !710, line: 103, type: !713)
!719 = !DILocalVariable(name: "gid", arg: 4, scope: !709, file: !710, line: 103, type: !714)
!720 = !DILocalVariable(name: "username", arg: 5, scope: !709, file: !710, line: 104, type: !36)
!721 = !DILocalVariable(name: "groupname", arg: 6, scope: !709, file: !710, line: 104, type: !36)
!722 = !DILocalVariable(name: "error_msg", scope: !709, file: !710, line: 110, type: !82)
!723 = !DILocalVariable(name: "pwd", scope: !709, file: !710, line: 111, type: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !726, line: 49, size: 384, elements: !727)
!726 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!727 = !{!728, !729, !730, !731, !732, !733, !734}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !725, file: !726, line: 51, baseType: !26, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !725, file: !726, line: 52, baseType: !26, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !725, file: !726, line: 53, baseType: !45, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !725, file: !726, line: 54, baseType: !50, size: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !725, file: !726, line: 55, baseType: !26, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !725, file: !726, line: 56, baseType: !26, size: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !725, file: !726, line: 57, baseType: !26, size: 64, offset: 320)
!735 = !DILocalVariable(name: "grp", scope: !709, file: !710, line: 112, type: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !738, line: 42, size: 256, elements: !739)
!738 = !DIFile(filename: "/usr/include/grp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!739 = !{!740, !741, !742, !743}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !737, file: !738, line: 44, baseType: !26, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !737, file: !738, line: 45, baseType: !26, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !737, file: !738, line: 46, baseType: !50, size: 32, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !737, file: !738, line: 47, baseType: !36, size: 64, offset: 192)
!744 = !DILocalVariable(name: "u", scope: !709, file: !710, line: 113, type: !26)
!745 = !DILocalVariable(name: "g", scope: !709, file: !710, line: 114, type: !82)
!746 = !DILocalVariable(name: "gname", scope: !709, file: !710, line: 115, type: !26)
!747 = !DILocalVariable(name: "unum", scope: !709, file: !710, line: 116, type: !43)
!748 = !DILocalVariable(name: "gnum", scope: !709, file: !710, line: 117, type: !49)
!749 = !DILocalVariable(name: "ulen", scope: !750, file: !710, line: 137, type: !212)
!750 = distinct !DILexicalBlock(scope: !751, file: !710, line: 136, column: 5)
!751 = distinct !DILexicalBlock(scope: !709, file: !710, line: 130, column: 7)
!752 = !DILocalVariable(name: "use_login_group", scope: !753, file: !710, line: 164, type: !41)
!753 = distinct !DILexicalBlock(scope: !754, file: !710, line: 163, column: 9)
!754 = distinct !DILexicalBlock(scope: !755, file: !710, line: 162, column: 11)
!755 = distinct !DILexicalBlock(scope: !756, file: !710, line: 159, column: 5)
!756 = distinct !DILexicalBlock(scope: !709, file: !710, line: 158, column: 7)
!757 = !DILocalVariable(name: "tmp", scope: !758, file: !710, line: 173, type: !68)
!758 = distinct !DILexicalBlock(scope: !759, file: !710, line: 172, column: 13)
!759 = distinct !DILexicalBlock(scope: !753, file: !710, line: 165, column: 15)
!760 = !DILocalVariable(name: "buf", scope: !761, file: !710, line: 188, type: !764)
!761 = distinct !DILexicalBlock(scope: !762, file: !710, line: 185, column: 13)
!762 = distinct !DILexicalBlock(scope: !763, file: !710, line: 184, column: 15)
!763 = distinct !DILexicalBlock(scope: !754, file: !710, line: 182, column: 9)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 168, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 21)
!767 = !DILocalVariable(name: "tmp", scope: !768, file: !710, line: 205, type: !68)
!768 = distinct !DILexicalBlock(scope: !769, file: !710, line: 204, column: 9)
!769 = distinct !DILexicalBlock(scope: !770, file: !710, line: 203, column: 11)
!770 = distinct !DILexicalBlock(scope: !771, file: !710, line: 199, column: 5)
!771 = distinct !DILexicalBlock(scope: !709, file: !710, line: 198, column: 7)
!772 = !DIGlobalVariableExpression(var: !773)
!773 = distinct !DIGlobalVariable(name: "E_invalid_group", scope: !709, file: !710, line: 107, type: !82, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775)
!775 = distinct !DIGlobalVariable(name: "E_bad_spec", scope: !709, file: !710, line: 108, type: !82, isLocal: true, isDefinition: true)
!776 = distinct !DICompileUnit(language: DW_LANG_C99, file: !777, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !778, retainedTypes: !783)
!777 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!778 = !{!779}
!779 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !780, line: 41, size: 32, elements: !781)
!780 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!781 = !{!782}
!782 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!783 = !{!28}
!784 = distinct !DICompileUnit(language: DW_LANG_C99, file: !785, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !786, retainedTypes: !800)
!785 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!786 = !{!787}
!787 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !789, file: !788, line: 192, size: 32, elements: !798)
!788 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!789 = distinct !DISubprogram(name: "x2nrealloc", scope: !788, file: !788, line: 180, type: !790, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !784, variables: !793)
!790 = !DISubroutineType(types: !791)
!791 = !{!28, !28, !792, !212}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!793 = !{!794, !795, !796, !797}
!794 = !DILocalVariable(name: "p", arg: 1, scope: !789, file: !788, line: 180, type: !28)
!795 = !DILocalVariable(name: "pn", arg: 2, scope: !789, file: !788, line: 180, type: !792)
!796 = !DILocalVariable(name: "s", arg: 3, scope: !789, file: !788, line: 180, type: !212)
!797 = !DILocalVariable(name: "n", scope: !789, file: !788, line: 182, type: !212)
!798 = !{!799}
!799 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!800 = !{!212, !26, !28}
!801 = distinct !DICompileUnit(language: DW_LANG_C99, file: !802, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161)
!802 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!803 = distinct !DICompileUnit(language: DW_LANG_C99, file: !804, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, retainedTypes: !783)
!804 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!805 = distinct !DICompileUnit(language: DW_LANG_C99, file: !806, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !807, retainedTypes: !808)
!806 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!807 = !{!697, !195}
!808 = !{!35, !211}
!809 = distinct !DICompileUnit(language: DW_LANG_C99, file: !810, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, retainedTypes: !783)
!810 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!811 = distinct !DICompileUnit(language: DW_LANG_C99, file: !812, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !813, retainedTypes: !954)
!812 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!813 = !{!814, !819, !937, !940, !951}
!814 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !815, line: 160, size: 32, elements: !816)
!815 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!816 = !{!817, !818}
!817 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!818 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!819 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !821, file: !820, line: 54, size: 32, elements: !935)
!820 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!821 = distinct !DISubprogram(name: "setup_dir", scope: !820, file: !820, line: 50, type: !822, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !811, variables: !933)
!822 = !DISubroutineType(types: !823)
!823 = !{!41, !824}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !826, line: 199, baseType: !827)
!826 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !826, line: 80, size: 1024, elements: !828)
!828 = !{!829, !884, !885, !887, !888, !889, !890, !891, !892, !893, !900, !901, !904, !920}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !827, file: !826, line: 81, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !826, line: 201, size: 2112, elements: !832)
!832 = !{!833, !834, !835, !836, !841, !842, !843, !844, !845, !846, !847, !848, !849, !851, !852, !854, !855, !856, !857, !880}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !831, file: !826, line: 202, baseType: !830, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !831, file: !826, line: 203, baseType: !830, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !831, file: !826, line: 204, baseType: !830, size: 64, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !831, file: !826, line: 205, baseType: !837, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !839, line: 127, baseType: !840)
!839 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !839, line: 127, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !831, file: !826, line: 208, baseType: !102, size: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !831, file: !826, line: 209, baseType: !28, size: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !831, file: !826, line: 210, baseType: !26, size: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !831, file: !826, line: 211, baseType: !26, size: 64, offset: 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !831, file: !826, line: 212, baseType: !35, size: 32, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !831, file: !826, line: 213, baseType: !35, size: 32, offset: 544)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !831, file: !826, line: 214, baseType: !212, size: 64, offset: 576)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !831, file: !826, line: 216, baseType: !824, size: 64, offset: 640)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !831, file: !826, line: 220, baseType: !850, size: 64, offset: 704)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !213, line: 51, baseType: !102)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !831, file: !826, line: 222, baseType: !212, size: 64, offset: 768)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !831, file: !826, line: 223, baseType: !853, size: 64, offset: 832)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !44, line: 75, baseType: !93)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !831, file: !826, line: 239, baseType: !211, size: 16, offset: 896)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !831, file: !826, line: 243, baseType: !211, size: 16, offset: 912)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !831, file: !826, line: 249, baseType: !211, size: 16, offset: 928)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !831, file: !826, line: 251, baseType: !858, size: 1152, offset: 960)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 1152, elements: !655)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !88, line: 46, size: 1152, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !877, !878, !879}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !859, file: !88, line: 48, baseType: !71, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !859, file: !88, line: 53, baseType: !67, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !859, file: !88, line: 61, baseType: !93, size: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !859, file: !88, line: 62, baseType: !95, size: 32, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !859, file: !88, line: 64, baseType: !45, size: 32, offset: 224)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !859, file: !88, line: 65, baseType: !50, size: 32, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !859, file: !88, line: 67, baseType: !35, size: 32, offset: 288)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !859, file: !88, line: 69, baseType: !71, size: 64, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !859, file: !88, line: 74, baseType: !101, size: 64, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !859, file: !88, line: 78, baseType: !104, size: 64, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !859, file: !88, line: 80, baseType: !106, size: 64, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !859, file: !88, line: 91, baseType: !873, size: 128, offset: 576)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !109, line: 8, size: 128, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !873, file: !109, line: 10, baseType: !112, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !873, file: !109, line: 11, baseType: !114, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !859, file: !88, line: 92, baseType: !873, size: 128, offset: 704)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !859, file: !88, line: 93, baseType: !873, size: 128, offset: 832)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !859, file: !88, line: 106, baseType: !118, size: 192, offset: 960)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !831, file: !826, line: 252, baseType: !881, offset: 2112)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, elements: !882)
!882 = !{!883}
!883 = !DISubrange(count: -1)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !827, file: !826, line: 82, baseType: !830, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !827, file: !826, line: 83, baseType: !886, size: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !827, file: !826, line: 84, baseType: !70, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !827, file: !826, line: 85, baseType: !26, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !827, file: !826, line: 86, baseType: !35, size: 32, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !827, file: !826, line: 87, baseType: !35, size: 32, offset: 352)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !827, file: !826, line: 89, baseType: !212, size: 64, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !827, file: !826, line: 90, baseType: !212, size: 64, offset: 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !827, file: !826, line: 91, baseType: !894, size: 64, offset: 512)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!35, !897, !897}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !827, file: !826, line: 162, baseType: !35, size: 32, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !827, file: !826, line: 171, baseType: !902, size: 64, offset: 640)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !826, line: 171, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !827, file: !826, line: 193, baseType: !905, size: 64, offset: 704)
!905 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !827, file: !826, line: 173, size: 64, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !905, file: !826, line: 186, baseType: !902, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !905, file: !826, line: 192, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !911, line: 28, size: 256, elements: !912)
!911 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!912 = !{!913, !918, !919}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !910, file: !911, line: 30, baseType: !914, size: 128)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !63, line: 7, size: 128, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !914, file: !63, line: 9, baseType: !66, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !914, file: !63, line: 10, baseType: !70, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !910, file: !911, line: 31, baseType: !689, size: 64, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !910, file: !911, line: 32, baseType: !35, size: 32, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !827, file: !826, line: 198, baseType: !921, size: 256, offset: 768)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !922, line: 39, baseType: !923)
!922 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !922, line: 31, size: 256, elements: !924)
!924 = !{!925, !929, !930, !931, !932}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !923, file: !922, line: 33, baseType: !926, size: 128)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 4)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !923, file: !922, line: 34, baseType: !35, size: 32, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !923, file: !922, line: 35, baseType: !47, size: 32, offset: 160)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !923, file: !922, line: 36, baseType: !47, size: 32, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !923, file: !922, line: 37, baseType: !41, size: 8, offset: 224)
!933 = !{!934}
!934 = !DILocalVariable(name: "fts", arg: 1, scope: !821, file: !820, line: 50, type: !824)
!935 = !{!936}
!936 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !815, line: 763, size: 32, elements: !938)
!938 = !{!939}
!939 = !DIEnumerator(name: "LCO_HT_INITIAL_SIZE", value: 13)
!940 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !839, line: 97, size: 32, elements: !941)
!941 = !{!942, !943, !944, !945, !946, !947, !948, !949, !950}
!942 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!943 = !DIEnumerator(name: "DT_FIFO", value: 1)
!944 = !DIEnumerator(name: "DT_CHR", value: 2)
!945 = !DIEnumerator(name: "DT_DIR", value: 4)
!946 = !DIEnumerator(name: "DT_BLK", value: 6)
!947 = !DIEnumerator(name: "DT_REG", value: 8)
!948 = !DIEnumerator(name: "DT_LNK", value: 10)
!949 = !DIEnumerator(name: "DT_SOCK", value: 12)
!950 = !DIEnumerator(name: "DT_WHT", value: 14)
!951 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !815, line: 155, size: 32, elements: !952)
!952 = !{!953}
!953 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!954 = !{!28, !689, !26, !102, !955, !960}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!35, !958, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !826, line: 253, baseType: !831)
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, retainedTypes: !966)
!965 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!966 = !{!212}
!967 = distinct !DICompileUnit(language: DW_LANG_C99, file: !968, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161)
!968 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!969 = distinct !DICompileUnit(language: DW_LANG_C99, file: !970, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161)
!970 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!971 = distinct !DICompileUnit(language: DW_LANG_C99, file: !972, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161)
!972 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!973 = distinct !DICompileUnit(language: DW_LANG_C99, file: !974, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161)
!974 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!975 = distinct !DICompileUnit(language: DW_LANG_C99, file: !976, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161)
!976 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!977 = distinct !DICompileUnit(language: DW_LANG_C99, file: !978, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !979)
!978 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!979 = !{!980}
!980 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !922, line: 20, size: 32, elements: !981)
!981 = !{!982}
!982 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!983 = distinct !DICompileUnit(language: DW_LANG_C99, file: !984, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161)
!984 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!985 = distinct !DICompileUnit(language: DW_LANG_C99, file: !986, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161)
!986 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!987 = distinct !DICompileUnit(language: DW_LANG_C99, file: !988, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161)
!988 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!989 = distinct !DICompileUnit(language: DW_LANG_C99, file: !990, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161)
!990 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!991 = distinct !DICompileUnit(language: DW_LANG_C99, file: !992, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, retainedTypes: !783)
!992 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!993 = distinct !DICompileUnit(language: DW_LANG_C99, file: !994, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, retainedTypes: !783)
!994 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!995 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!996 = !{i32 2, !"Dwarf Version", i32 4}
!997 = !{i32 2, !"Debug Info Version", i32 3}
!998 = !{i32 1, !"wchar_size", i32 4}
!999 = !{i32 7, !"PIC Level", i32 2}
!1000 = !{i32 7, !"PIE Level", i32 2}
!1001 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 74, type: !1002, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !1004)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{null, !35}
!1004 = !{!1005}
!1005 = !DILocalVariable(name: "status", arg: 1, scope: !1001, file: !3, line: 74, type: !35)
!1006 = !DIExpression()
!1007 = !DILocation(line: 74, column: 12, scope: !1001)
!1008 = !DILocation(line: 76, column: 14, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 76, column: 7)
!1010 = !DILocation(line: 76, column: 7, scope: !1001)
!1011 = !DILocation(line: 77, column: 5, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 77, column: 5)
!1013 = !{!1014, !1014, i64 0}
!1014 = !{!"any pointer", !1015, i64 0}
!1015 = !{!"omnipotent char", !1016, i64 0}
!1016 = !{!"Simple C/C++ TBAA"}
!1017 = !DILocation(line: 80, column: 7, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 79, column: 5)
!1019 = !DILocation(line: 85, column: 7, scope: !1018)
!1020 = !DILocation(line: 90, column: 7, scope: !1018)
!1021 = !DILocation(line: 95, column: 7, scope: !1018)
!1022 = !DILocation(line: 100, column: 7, scope: !1018)
!1023 = !DILocation(line: 104, column: 7, scope: !1018)
!1024 = !DILocation(line: 111, column: 7, scope: !1018)
!1025 = !DILocation(line: 115, column: 7, scope: !1018)
!1026 = !DILocation(line: 119, column: 7, scope: !1018)
!1027 = !DILocation(line: 122, column: 7, scope: !1018)
!1028 = !DILocation(line: 135, column: 7, scope: !1018)
!1029 = !DILocation(line: 136, column: 7, scope: !1018)
!1030 = !DILocation(line: 137, column: 7, scope: !1018)
!1031 = !DILocation(line: 143, column: 7, scope: !1018)
!1032 = !DILocation(line: 642, column: 15, scope: !127, inlinedAt: !1033)
!1033 = distinct !DILocation(line: 151, column: 7, scope: !1018)
!1034 = !DILocation(line: 651, column: 3, scope: !127, inlinedAt: !1033)
!1035 = !DILocation(line: 655, column: 29, scope: !127, inlinedAt: !1033)
!1036 = !DILocation(line: 655, column: 15, scope: !127, inlinedAt: !1033)
!1037 = !DILocation(line: 656, column: 7, scope: !1038, inlinedAt: !1033)
!1038 = distinct !DILexicalBlock(scope: !127, file: !128, line: 656, column: 7)
!1039 = !DILocation(line: 656, column: 19, scope: !1038, inlinedAt: !1033)
!1040 = !DILocation(line: 656, column: 22, scope: !1038, inlinedAt: !1033)
!1041 = !DILocation(line: 656, column: 7, scope: !127, inlinedAt: !1033)
!1042 = !DILocation(line: 662, column: 7, scope: !1043, inlinedAt: !1033)
!1043 = distinct !DILexicalBlock(scope: !1038, file: !128, line: 657, column: 5)
!1044 = !DILocation(line: 664, column: 5, scope: !1043, inlinedAt: !1033)
!1045 = !DILocation(line: 665, column: 3, scope: !127, inlinedAt: !1033)
!1046 = !DILocation(line: 667, column: 3, scope: !127, inlinedAt: !1033)
!1047 = !DILocation(line: 153, column: 3, scope: !1001)
!1048 = !DILocation(line: 157, column: 11, scope: !32)
!1049 = !DILocation(line: 157, column: 24, scope: !32)
!1050 = !DILocation(line: 159, column: 8, scope: !32)
!1051 = !DILocation(line: 161, column: 3, scope: !32)
!1052 = !DILocation(line: 161, column: 9, scope: !32)
!1053 = !{!1054, !1054, i64 0}
!1054 = !{!"int", !1015, i64 0}
!1055 = !DILocation(line: 162, column: 3, scope: !32)
!1056 = !DILocation(line: 162, column: 9, scope: !32)
!1057 = !DILocation(line: 166, column: 3, scope: !32)
!1058 = !DILocation(line: 166, column: 9, scope: !32)
!1059 = !DILocation(line: 167, column: 3, scope: !32)
!1060 = !DILocation(line: 167, column: 9, scope: !32)
!1061 = !DILocation(line: 170, column: 7, scope: !32)
!1062 = !DILocation(line: 174, column: 7, scope: !32)
!1063 = !DILocation(line: 176, column: 3, scope: !32)
!1064 = !DILocation(line: 181, column: 21, scope: !32)
!1065 = !DILocation(line: 181, column: 3, scope: !32)
!1066 = !DILocation(line: 182, column: 3, scope: !32)
!1067 = !DILocation(line: 183, column: 3, scope: !32)
!1068 = !DILocation(line: 184, column: 3, scope: !32)
!1069 = !DILocation(line: 186, column: 3, scope: !32)
!1070 = !DILocation(line: 176, column: 23, scope: !32)
!1071 = !DILocation(line: 188, column: 3, scope: !32)
!1072 = !DILocation(line: 190, column: 3, scope: !32)
!1073 = !DILocation(line: 190, column: 18, scope: !32)
!1074 = !DILocation(line: 178, column: 7, scope: !32)
!1075 = !DILocation(line: 201, column: 11, scope: !80)
!1076 = !DILocation(line: 205, column: 11, scope: !80)
!1077 = !DILocation(line: 209, column: 11, scope: !80)
!1078 = !DILocation(line: 214, column: 11, scope: !80)
!1079 = !DILocation(line: 218, column: 11, scope: !80)
!1080 = !DILocation(line: 222, column: 11, scope: !80)
!1081 = !DILocation(line: 225, column: 28, scope: !80)
!1082 = !DILocation(line: 225, column: 26, scope: !80)
!1083 = !DILocation(line: 226, column: 11, scope: !80)
!1084 = !DILocation(line: 230, column: 46, scope: !79)
!1085 = !DILocation(line: 230, column: 29, scope: !79)
!1086 = !DILocation(line: 230, column: 25, scope: !79)
!1087 = !DILocation(line: 233, column: 17, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !79, file: !3, line: 233, column: 17)
!1089 = !DILocation(line: 233, column: 17, scope: !79)
!1090 = distinct !{!1090, !1072, !1091}
!1091 = !DILocation(line: 259, column: 5, scope: !32)
!1092 = !DILocation(line: 234, column: 15, scope: !1088)
!1093 = !DILocation(line: 239, column: 25, scope: !80)
!1094 = !{!1095, !1096, i64 4}
!1095 = !{!"Chown_option", !1015, i64 0, !1096, i64 4, !1014, i64 8, !1096, i64 16, !1096, i64 17, !1014, i64 24, !1014, i64 32}
!1096 = !{!"_Bool", !1015, i64 0}
!1097 = !DILocation(line: 240, column: 11, scope: !80)
!1098 = !DILocation(line: 243, column: 27, scope: !80)
!1099 = !{!1095, !1015, i64 0}
!1100 = !DILocation(line: 244, column: 11, scope: !80)
!1101 = !DILocation(line: 247, column: 30, scope: !80)
!1102 = !{!1095, !1096, i64 17}
!1103 = !DILocation(line: 248, column: 11, scope: !80)
!1104 = !DILocation(line: 251, column: 27, scope: !80)
!1105 = !DILocation(line: 252, column: 11, scope: !80)
!1106 = !DILocation(line: 254, column: 9, scope: !80)
!1107 = !DILocation(line: 255, column: 9, scope: !80)
!1108 = !DILocation(line: 257, column: 11, scope: !80)
!1109 = !DILocation(line: 261, column: 13, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !32, file: !3, line: 261, column: 7)
!1111 = !{i8 0, i8 2}
!1112 = !DILocation(line: 261, column: 7, scope: !32)
!1113 = !DILocation(line: 263, column: 21, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !3, line: 263, column: 11)
!1115 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 262, column: 5)
!1116 = !DILocation(line: 263, column: 11, scope: !1115)
!1117 = !DILocation(line: 265, column: 27, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 265, column: 15)
!1119 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 264, column: 9)
!1120 = !DILocation(line: 265, column: 15, scope: !1119)
!1121 = !DILocation(line: 266, column: 13, scope: !1118)
!1122 = !DILocation(line: 275, column: 48, scope: !32)
!1123 = !DILocation(line: 275, column: 9, scope: !32)
!1124 = !DILocation(line: 275, column: 33, scope: !32)
!1125 = !{!1095, !1096, i64 16}
!1126 = !DILocation(line: 277, column: 14, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !32, file: !3, line: 277, column: 7)
!1128 = !DILocation(line: 277, column: 12, scope: !1127)
!1129 = !DILocation(line: 277, column: 24, scope: !1127)
!1130 = !DILocation(line: 277, column: 21, scope: !1127)
!1131 = !DILocation(line: 277, column: 7, scope: !32)
!1132 = !DILocation(line: 279, column: 16, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 279, column: 11)
!1134 = distinct !DILexicalBlock(scope: !1127, file: !3, line: 278, column: 5)
!1135 = !DILocation(line: 279, column: 11, scope: !1134)
!1136 = !DILocation(line: 280, column: 22, scope: !1133)
!1137 = !DILocation(line: 280, column: 9, scope: !1133)
!1138 = !DILocation(line: 282, column: 22, scope: !1133)
!1139 = !DILocation(line: 282, column: 70, scope: !1133)
!1140 = !DILocation(line: 282, column: 60, scope: !1133)
!1141 = !DILocation(line: 282, column: 53, scope: !1133)
!1142 = !DILocation(line: 282, column: 9, scope: !1133)
!1143 = !DILocation(line: 283, column: 7, scope: !1134)
!1144 = !DILocation(line: 286, column: 7, scope: !32)
!1145 = !DILocation(line: 288, column: 7, scope: !85)
!1146 = !DILocation(line: 288, column: 19, scope: !85)
!1147 = !DILocalVariable(name: "__path", arg: 1, scope: !1148, file: !1149, line: 449, type: !82)
!1148 = distinct !DISubprogram(name: "stat", scope: !1149, file: !1149, line: 449, type: !1150, isLocal: false, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1153)
!1149 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!35, !82, !1152}
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!1153 = !{!1147, !1154}
!1154 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1148, file: !1149, line: 449, type: !1152)
!1155 = !DILocation(line: 449, column: 1, scope: !1148, inlinedAt: !1156)
!1156 = distinct !DILocation(line: 289, column: 11, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !85, file: !3, line: 289, column: 11)
!1158 = !DILocation(line: 451, column: 10, scope: !1148, inlinedAt: !1156)
!1159 = !DILocation(line: 289, column: 11, scope: !1157)
!1160 = !DILocation(line: 289, column: 11, scope: !85)
!1161 = !DILocation(line: 290, column: 9, scope: !1157)
!1162 = !DILocation(line: 293, column: 23, scope: !85)
!1163 = !{!1164, !1054, i64 28}
!1164 = !{!"stat", !1165, i64 0, !1165, i64 8, !1165, i64 16, !1054, i64 24, !1054, i64 28, !1054, i64 32, !1054, i64 36, !1165, i64 40, !1165, i64 48, !1165, i64 56, !1165, i64 64, !1166, i64 72, !1166, i64 88, !1166, i64 104, !1015, i64 120}
!1165 = !{!"long", !1015, i64 0}
!1166 = !{!"timespec", !1165, i64 0, !1165, i64 8}
!1167 = !DILocation(line: 293, column: 11, scope: !85)
!1168 = !DILocation(line: 294, column: 23, scope: !85)
!1169 = !{!1164, !1054, i64 32}
!1170 = !DILocation(line: 294, column: 11, scope: !85)
!1171 = !DILocation(line: 295, column: 25, scope: !85)
!1172 = !DILocation(line: 295, column: 13, scope: !85)
!1173 = !DILocation(line: 295, column: 23, scope: !85)
!1174 = !{!1095, !1014, i64 24}
!1175 = !DILocation(line: 296, column: 26, scope: !85)
!1176 = !DILocation(line: 296, column: 13, scope: !85)
!1177 = !DILocation(line: 296, column: 24, scope: !85)
!1178 = !{!1095, !1014, i64 32}
!1179 = !DILocation(line: 297, column: 5, scope: !86)
!1180 = !DILocation(line: 297, column: 5, scope: !85)
!1181 = !DILocation(line: 300, column: 40, scope: !122)
!1182 = !DILocation(line: 301, column: 47, scope: !122)
!1183 = !DILocation(line: 301, column: 65, scope: !122)
!1184 = !DILocation(line: 300, column: 23, scope: !122)
!1185 = !DILocation(line: 300, column: 19, scope: !122)
!1186 = !DILocation(line: 302, column: 11, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !122, file: !3, line: 302, column: 11)
!1188 = !DILocation(line: 302, column: 11, scope: !122)
!1189 = !DILocation(line: 303, column: 9, scope: !1187)
!1190 = !DILocation(line: 308, column: 18, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !122, file: !3, line: 308, column: 11)
!1192 = !DILocation(line: 308, column: 12, scope: !1191)
!1193 = !DILocation(line: 308, column: 37, scope: !1191)
