; ModuleID = 'coreutils-8.27/src/cksum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"Usage: %s [FILE]...\0A  or:  %s [OPTION]\0A\00", align 1
@.str.2 = private unnamed_addr constant [51 x i8] c"Print CRC checksum and byte counts of each FILE.\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [45 x i8] c"      --help     display this help and exit\0A\00", align 1
@.str.4 = private unnamed_addr constant [54 x i8] c"      --version  output version information and exit\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "crctab", scope: !2, file: !3, line: 118, type: !58, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !34)
!3 = !DIFile(filename: "src/cksum.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 45, size: 32, elements: !21)
!20 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!23 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!24 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!25 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!26 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!27 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!28 = !{!29, !32, !33}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!34 = !{!35, !38, !0}
!35 = !DIGlobalVariableExpression(var: !36)
!36 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 175, type: !37, isLocal: true, isDefinition: true)
!37 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!38 = !DIGlobalVariableExpression(var: !39)
!39 = distinct !DIGlobalVariable(name: "infomap", scope: !40, file: !41, line: 632, type: !55, isLocal: true, isDefinition: true)
!40 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !41, file: !41, line: 630, type: !42, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !44)
!41 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!42 = !DISubroutineType(types: !43)
!43 = !{null, !29}
!44 = !{!45, !46, !47, !54}
!45 = !DILocalVariable(name: "program", arg: 1, scope: !40, file: !41, line: 630, type: !29)
!46 = !DILocalVariable(name: "node", scope: !40, file: !41, line: 642, type: !29)
!47 = !DILocalVariable(name: "map_prog", scope: !40, file: !41, line: 643, type: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !40, file: !41, line: 632, size: 128, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !50, file: !41, line: 632, baseType: !29, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !50, file: !41, line: 632, baseType: !29, size: 64, offset: 64)
!54 = !DILocalVariable(name: "lc_messages", scope: !40, file: !41, line: 655, type: !29)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 896, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 7)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 16384, elements: !63)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !61, line: 84, baseType: !62)
!61 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!62 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!63 = !{!64}
!64 = !DISubrange(count: 256)
!65 = !DIGlobalVariableExpression(var: !66)
!66 = distinct !DIGlobalVariable(name: "Version", scope: !67, file: !68, line: 2, type: !29, isLocal: false, isDefinition: true)
!67 = distinct !DICompileUnit(language: DW_LANG_C99, file: !68, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, globals: !70)
!68 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!69 = !{}
!70 = !{!65}
!71 = !DIGlobalVariableExpression(var: !72)
!72 = distinct !DIGlobalVariable(name: "file_name", scope: !73, file: !78, line: 36, type: !29, isLocal: true, isDefinition: true)
!73 = distinct !DICompileUnit(language: DW_LANG_C99, file: !74, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, globals: !75)
!74 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!75 = !{!71, !76}
!76 = !DIGlobalVariableExpression(var: !77)
!77 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !73, file: !78, line: 46, type: !37, isLocal: true, isDefinition: true)
!78 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!79 = !DIGlobalVariableExpression(var: !80)
!80 = distinct !DIGlobalVariable(name: "exit_failure", scope: !81, file: !84, line: 24, type: !85, isLocal: false, isDefinition: true)
!81 = distinct !DICompileUnit(language: DW_LANG_C99, file: !82, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, globals: !83)
!82 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!83 = !{!79}
!84 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!85 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !86)
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !DIGlobalVariableExpression(var: !88)
!88 = distinct !DIGlobalVariable(name: "long_options", scope: !89, file: !92, line: 33, type: !93, isLocal: true, isDefinition: true)
!89 = distinct !DICompileUnit(language: DW_LANG_C99, file: !90, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, globals: !91)
!90 = !DIFile(filename: "./lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!91 = !{!87}
!92 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 768, elements: !103)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !96, line: 50, size: 256, elements: !97)
!96 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!97 = !{!98, !99, !100, !102}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !95, file: !96, line: 52, baseType: !29, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !95, file: !96, line: 55, baseType: !86, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !95, file: !96, line: 56, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !95, file: !96, line: 57, baseType: !86, size: 32, offset: 192)
!103 = !{!104}
!104 = !DISubrange(count: 3)
!105 = !DIGlobalVariableExpression(var: !106)
!106 = distinct !DIGlobalVariable(name: "program_name", scope: !107, file: !112, line: 33, type: !29, isLocal: false, isDefinition: true)
!107 = distinct !DICompileUnit(language: DW_LANG_C99, file: !108, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !109, globals: !111)
!108 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!109 = !{!32, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!111 = !{!105}
!112 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!113 = !DIGlobalVariableExpression(var: !114)
!114 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !115, file: !145, line: 77, type: !178, isLocal: false, isDefinition: true)
!115 = distinct !DICompileUnit(language: DW_LANG_C99, file: !116, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !117, retainedTypes: !138, globals: !142)
!116 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!117 = !{!5, !118, !123}
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !119)
!119 = !{!120, !121, !122}
!120 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!121 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!122 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 46, size: 32, elements: !125)
!124 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137}
!126 = !DIEnumerator(name: "_ISupper", value: 256)
!127 = !DIEnumerator(name: "_ISlower", value: 512)
!128 = !DIEnumerator(name: "_ISalpha", value: 1024)
!129 = !DIEnumerator(name: "_ISdigit", value: 2048)
!130 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!131 = !DIEnumerator(name: "_ISspace", value: 8192)
!132 = !DIEnumerator(name: "_ISprint", value: 16384)
!133 = !DIEnumerator(name: "_ISgraph", value: 32768)
!134 = !DIEnumerator(name: "_ISblank", value: 1)
!135 = !DIEnumerator(name: "_IScntrl", value: 2)
!136 = !DIEnumerator(name: "_ISpunct", value: 4)
!137 = !DIEnumerator(name: "_ISalnum", value: 8)
!138 = !{!86, !139, !140, !110}
!139 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !141, line: 62, baseType: !62)
!141 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!142 = !{!113, !143, !150, !162, !164, !167, !174, !176}
!143 = !DIGlobalVariableExpression(var: !144)
!144 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !115, file: !145, line: 93, type: !146, isLocal: false, isDefinition: true)
!145 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 320, elements: !148)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!148 = !{!149}
!149 = !DISubrange(count: 10)
!150 = !DIGlobalVariableExpression(var: !151)
!151 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !115, file: !145, line: 1043, type: !152, isLocal: false, isDefinition: true)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !145, line: 57, size: 448, elements: !153)
!153 = !{!154, !155, !156, !160, !161}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !152, file: !145, line: 60, baseType: !5, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !152, file: !145, line: 63, baseType: !86, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !152, file: !145, line: 67, baseType: !157, size: 256, offset: 64)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 256, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 8)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !152, file: !145, line: 70, baseType: !29, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !152, file: !145, line: 73, baseType: !29, size: 64, offset: 384)
!162 = !DIGlobalVariableExpression(var: !163)
!163 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !115, file: !145, line: 108, type: !152, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165)
!165 = distinct !DIGlobalVariable(name: "slot0", scope: !115, file: !145, line: 834, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 2048, elements: !63)
!167 = !DIGlobalVariableExpression(var: !168)
!168 = distinct !DIGlobalVariable(name: "slotvec", scope: !115, file: !145, line: 837, type: !169, isLocal: true, isDefinition: true)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !145, line: 826, size: 128, elements: !171)
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !170, file: !145, line: 828, baseType: !140, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !170, file: !145, line: 829, baseType: !110, size: 64, offset: 64)
!174 = !DIGlobalVariableExpression(var: !175)
!175 = distinct !DIGlobalVariable(name: "nslots", scope: !115, file: !145, line: 835, type: !86, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177)
!177 = distinct !DIGlobalVariable(name: "slotvec0", scope: !115, file: !145, line: 836, type: !170, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 704, elements: !180)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!180 = !{!181}
!181 = !DISubrange(count: 11)
!182 = !DIGlobalVariableExpression(var: !183)
!183 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !184, file: !187, line: 26, type: !188, isLocal: false, isDefinition: true)
!184 = distinct !DICompileUnit(language: DW_LANG_C99, file: !185, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, globals: !186)
!185 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!186 = !{!182}
!187 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 376, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 47)
!191 = !DIGlobalVariableExpression(var: !192)
!192 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !193, file: !538, line: 120, type: !539, isLocal: true, isDefinition: true)
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !195, retainedTypes: !534, globals: !537)
!194 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!195 = !{!196}
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !197, line: 41, size: 32, elements: !198)
!197 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533}
!199 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!200 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!201 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!202 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!203 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!204 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!205 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!206 = !DIEnumerator(name: "DAY_1", value: 131079)
!207 = !DIEnumerator(name: "DAY_2", value: 131080)
!208 = !DIEnumerator(name: "DAY_3", value: 131081)
!209 = !DIEnumerator(name: "DAY_4", value: 131082)
!210 = !DIEnumerator(name: "DAY_5", value: 131083)
!211 = !DIEnumerator(name: "DAY_6", value: 131084)
!212 = !DIEnumerator(name: "DAY_7", value: 131085)
!213 = !DIEnumerator(name: "ABMON_1", value: 131086)
!214 = !DIEnumerator(name: "ABMON_2", value: 131087)
!215 = !DIEnumerator(name: "ABMON_3", value: 131088)
!216 = !DIEnumerator(name: "ABMON_4", value: 131089)
!217 = !DIEnumerator(name: "ABMON_5", value: 131090)
!218 = !DIEnumerator(name: "ABMON_6", value: 131091)
!219 = !DIEnumerator(name: "ABMON_7", value: 131092)
!220 = !DIEnumerator(name: "ABMON_8", value: 131093)
!221 = !DIEnumerator(name: "ABMON_9", value: 131094)
!222 = !DIEnumerator(name: "ABMON_10", value: 131095)
!223 = !DIEnumerator(name: "ABMON_11", value: 131096)
!224 = !DIEnumerator(name: "ABMON_12", value: 131097)
!225 = !DIEnumerator(name: "MON_1", value: 131098)
!226 = !DIEnumerator(name: "MON_2", value: 131099)
!227 = !DIEnumerator(name: "MON_3", value: 131100)
!228 = !DIEnumerator(name: "MON_4", value: 131101)
!229 = !DIEnumerator(name: "MON_5", value: 131102)
!230 = !DIEnumerator(name: "MON_6", value: 131103)
!231 = !DIEnumerator(name: "MON_7", value: 131104)
!232 = !DIEnumerator(name: "MON_8", value: 131105)
!233 = !DIEnumerator(name: "MON_9", value: 131106)
!234 = !DIEnumerator(name: "MON_10", value: 131107)
!235 = !DIEnumerator(name: "MON_11", value: 131108)
!236 = !DIEnumerator(name: "MON_12", value: 131109)
!237 = !DIEnumerator(name: "AM_STR", value: 131110)
!238 = !DIEnumerator(name: "PM_STR", value: 131111)
!239 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!240 = !DIEnumerator(name: "D_FMT", value: 131113)
!241 = !DIEnumerator(name: "T_FMT", value: 131114)
!242 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!243 = !DIEnumerator(name: "ERA", value: 131116)
!244 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!245 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!246 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!247 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!248 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!249 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!250 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!251 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!252 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!253 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!254 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!255 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!256 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!257 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!258 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!259 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!260 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!261 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!262 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!263 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!264 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!265 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!266 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!267 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!268 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!269 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!270 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!271 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!272 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!273 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!274 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!275 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!276 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!277 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!278 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!279 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!280 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!281 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!282 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!283 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!284 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!285 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!286 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!287 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!288 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!289 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!290 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!291 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!292 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!293 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!294 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!295 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!296 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!297 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!298 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!299 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!300 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!301 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!302 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!303 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!304 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!305 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!306 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!307 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!308 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!309 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!310 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!311 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!312 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!313 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!314 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!315 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!316 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!317 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!318 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!319 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!320 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!321 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!322 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!323 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!324 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!325 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!326 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!327 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!328 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!329 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!330 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!331 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!332 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!333 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!334 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!335 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!336 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!337 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!338 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!339 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!340 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!341 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!342 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!343 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!344 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!345 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!346 = !DIEnumerator(name: "CODESET", value: 14)
!347 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!348 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!349 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!350 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!351 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!352 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!353 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!354 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!355 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!356 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!357 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!358 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!359 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!360 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!361 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!362 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!363 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!364 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!365 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!366 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!367 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!368 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!369 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!370 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!371 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!372 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!373 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!374 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!375 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!376 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!377 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!378 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!379 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!380 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!381 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!382 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!383 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!384 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!385 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!386 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!387 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!388 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!389 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!390 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!391 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!392 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!393 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!394 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!395 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!396 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!397 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!398 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!399 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!400 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!401 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!402 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!403 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!404 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!405 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!406 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!407 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!408 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!409 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!410 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!411 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!412 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!413 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!414 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!415 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!416 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!417 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!418 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!419 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!420 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!421 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!422 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!423 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!424 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!425 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!426 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!427 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!428 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!429 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!430 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!431 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!432 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!433 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!434 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!435 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!436 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!437 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!438 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!439 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!440 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!441 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!442 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!443 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!444 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!445 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!446 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!447 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!448 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!449 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!450 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!451 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!452 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!453 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!454 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!455 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!456 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!457 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!458 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!459 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!460 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!461 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!462 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!463 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!464 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!465 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!466 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!467 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!468 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!469 = !DIEnumerator(name: "THOUSEP", value: 65537)
!470 = !DIEnumerator(name: "__GROUPING", value: 65538)
!471 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!472 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!473 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!474 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!475 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!476 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!477 = !DIEnumerator(name: "__YESSTR", value: 327682)
!478 = !DIEnumerator(name: "__NOSTR", value: 327683)
!479 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!480 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!481 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!482 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!483 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!484 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!485 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!486 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!487 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!488 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!489 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!490 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!491 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!492 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!493 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!494 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!495 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!496 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!497 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!498 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!499 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!500 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!501 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!502 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!503 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!504 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!505 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!506 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!507 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!508 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!509 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!510 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!511 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!512 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!513 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!514 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!515 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!516 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!517 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!518 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!519 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!520 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!521 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!522 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!523 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!524 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!525 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!526 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!527 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!528 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!529 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!530 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!531 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!532 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!533 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!534 = !{!32, !110, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!537 = !{!191}
!538 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!539 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !29)
!540 = distinct !DICompileUnit(language: DW_LANG_C99, file: !541, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !542)
!541 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!542 = !{!19}
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !545)
!544 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !61, line: 112, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !548, line: 62, baseType: !62)
!548 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !551, retainedTypes: !556)
!550 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!551 = !{!552}
!552 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !553, line: 41, size: 32, elements: !554)
!553 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!554 = !{!555}
!555 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!556 = !{!32}
!557 = distinct !DICompileUnit(language: DW_LANG_C99, file: !558, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !559, retainedTypes: !573)
!558 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!559 = !{!560}
!560 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !562, file: !561, line: 192, size: 32, elements: !571)
!561 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!562 = distinct !DISubprogram(name: "x2nrealloc", scope: !561, file: !561, line: 180, type: !563, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !557, variables: !566)
!563 = !DISubroutineType(types: !564)
!564 = !{!32, !32, !565, !140}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!566 = !{!567, !568, !569, !570}
!567 = !DILocalVariable(name: "p", arg: 1, scope: !562, file: !561, line: 180, type: !32)
!568 = !DILocalVariable(name: "pn", arg: 2, scope: !562, file: !561, line: 180, type: !565)
!569 = !DILocalVariable(name: "s", arg: 3, scope: !562, file: !561, line: 180, type: !140)
!570 = !DILocalVariable(name: "n", scope: !562, file: !561, line: 182, type: !140)
!571 = !{!572}
!572 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!573 = !{!140, !110, !32}
!574 = distinct !DICompileUnit(language: DW_LANG_C99, file: !575, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69)
!575 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!576 = distinct !DICompileUnit(language: DW_LANG_C99, file: !577, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !556)
!577 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!578 = distinct !DICompileUnit(language: DW_LANG_C99, file: !579, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69)
!579 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !556)
!581 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!582 = distinct !DICompileUnit(language: DW_LANG_C99, file: !583, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !556)
!583 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !586)
!585 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!586 = !{!140}
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69)
!588 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !590, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69)
!590 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!591 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!592 = !{i32 2, !"Dwarf Version", i32 4}
!593 = !{i32 2, !"Debug Info Version", i32 3}
!594 = !{i32 1, !"wchar_size", i32 4}
!595 = !{i32 7, !"PIC Level", i32 2}
!596 = !{i32 7, !"PIE Level", i32 2}
!597 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 257, type: !598, isLocal: false, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !600)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !86}
!600 = !{!601}
!601 = !DILocalVariable(name: "status", arg: 1, scope: !597, file: !3, line: 257, type: !86)
!602 = !DIExpression()
!603 = !DILocation(line: 257, column: 12, scope: !597)
!604 = !DILocation(line: 259, column: 14, scope: !605)
!605 = distinct !DILexicalBlock(scope: !597, file: !3, line: 259, column: 7)
!606 = !DILocation(line: 259, column: 7, scope: !597)
!607 = !DILocation(line: 260, column: 5, scope: !608)
!608 = distinct !DILexicalBlock(scope: !605, file: !3, line: 260, column: 5)
!609 = !{!610, !610, i64 0}
!610 = !{!"any pointer", !611, i64 0}
!611 = !{!"omnipotent char", !612, i64 0}
!612 = !{!"Simple C/C++ TBAA"}
!613 = !DILocation(line: 263, column: 7, scope: !614)
!614 = distinct !DILexicalBlock(scope: !605, file: !3, line: 262, column: 5)
!615 = !DILocation(line: 268, column: 7, scope: !614)
!616 = !DILocation(line: 272, column: 7, scope: !614)
!617 = !DILocation(line: 273, column: 7, scope: !614)
!618 = !DILocation(line: 642, column: 15, scope: !40, inlinedAt: !619)
!619 = distinct !DILocation(line: 274, column: 7, scope: !614)
!620 = !DILocation(line: 651, column: 3, scope: !40, inlinedAt: !619)
!621 = !DILocation(line: 655, column: 29, scope: !40, inlinedAt: !619)
!622 = !DILocation(line: 655, column: 15, scope: !40, inlinedAt: !619)
!623 = !DILocation(line: 656, column: 7, scope: !624, inlinedAt: !619)
!624 = distinct !DILexicalBlock(scope: !40, file: !41, line: 656, column: 7)
!625 = !DILocation(line: 656, column: 19, scope: !624, inlinedAt: !619)
!626 = !DILocation(line: 656, column: 22, scope: !624, inlinedAt: !619)
!627 = !DILocation(line: 656, column: 7, scope: !40, inlinedAt: !619)
!628 = !DILocation(line: 662, column: 7, scope: !629, inlinedAt: !619)
!629 = distinct !DILexicalBlock(scope: !624, file: !41, line: 657, column: 5)
!630 = !DILocation(line: 664, column: 5, scope: !629, inlinedAt: !619)
!631 = !DILocation(line: 665, column: 3, scope: !40, inlinedAt: !619)
!632 = !DILocation(line: 667, column: 3, scope: !40, inlinedAt: !619)
!633 = !DILocation(line: 276, column: 3, scope: !597)
!634 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 280, type: !635, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !638)
!635 = !DISubroutineType(types: !636)
!636 = !{!86, !86, !637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!638 = !{!639, !640, !641, !642}
!639 = !DILocalVariable(name: "argc", arg: 1, scope: !634, file: !3, line: 280, type: !86)
!640 = !DILocalVariable(name: "argv", arg: 2, scope: !634, file: !3, line: 280, type: !637)
!641 = !DILocalVariable(name: "i", scope: !634, file: !3, line: 282, type: !86)
!642 = !DILocalVariable(name: "ok", scope: !634, file: !3, line: 283, type: !37)
!643 = !DILocation(line: 280, column: 11, scope: !634)
!644 = !DILocation(line: 280, column: 24, scope: !634)
!645 = !DILocation(line: 286, column: 21, scope: !634)
!646 = !DILocation(line: 286, column: 3, scope: !634)
!647 = !DILocation(line: 287, column: 3, scope: !634)
!648 = !DILocation(line: 288, column: 3, scope: !634)
!649 = !DILocation(line: 289, column: 3, scope: !634)
!650 = !DILocation(line: 291, column: 3, scope: !634)
!651 = !DILocation(line: 295, column: 12, scope: !634)
!652 = !DILocation(line: 295, column: 3, scope: !634)
!653 = !DILocation(line: 297, column: 58, scope: !634)
!654 = !DILocation(line: 297, column: 3, scope: !634)
!655 = !DILocation(line: 299, column: 7, scope: !656)
!656 = distinct !DILexicalBlock(scope: !634, file: !3, line: 299, column: 7)
!657 = !DILocation(line: 299, column: 48, scope: !656)
!658 = !DILocation(line: 299, column: 7, scope: !634)
!659 = !DILocation(line: 300, column: 5, scope: !656)
!660 = !DILocation(line: 304, column: 7, scope: !661)
!661 = distinct !DILexicalBlock(scope: !634, file: !3, line: 304, column: 7)
!662 = !{!663, !663, i64 0}
!663 = !{!"int", !611, i64 0}
!664 = !DILocation(line: 304, column: 14, scope: !661)
!665 = !DILocation(line: 304, column: 7, scope: !634)
!666 = !DILocation(line: 305, column: 10, scope: !661)
!667 = !DILocation(line: 305, column: 8, scope: !661)
!668 = !DILocation(line: 283, column: 8, scope: !634)
!669 = !DILocation(line: 305, column: 5, scope: !661)
!670 = !DILocation(line: 282, column: 7, scope: !634)
!671 = !DILocation(line: 309, column: 26, scope: !672)
!672 = distinct !DILexicalBlock(scope: !673, file: !3, line: 309, column: 7)
!673 = distinct !DILexicalBlock(scope: !674, file: !3, line: 309, column: 7)
!674 = distinct !DILexicalBlock(scope: !661, file: !3, line: 307, column: 5)
!675 = !DILocation(line: 309, column: 7, scope: !673)
!676 = !DILocation(line: 310, column: 22, scope: !672)
!677 = !DILocation(line: 310, column: 15, scope: !672)
!678 = !DILocation(line: 310, column: 12, scope: !672)
!679 = !DILocation(line: 309, column: 35, scope: !672)
!680 = distinct !{!680, !675, !681}
!681 = !DILocation(line: 310, column: 35, scope: !673)
!682 = !DILocation(line: 313, column: 23, scope: !683)
!683 = distinct !DILexicalBlock(scope: !634, file: !3, line: 313, column: 7)
!684 = !DILocation(line: 313, column: 34, scope: !683)
!685 = !DILocation(line: 313, column: 26, scope: !683)
!686 = !DILocation(line: 313, column: 41, scope: !683)
!687 = !DILocation(line: 313, column: 7, scope: !634)
!688 = !DILocation(line: 314, column: 5, scope: !683)
!689 = !DILocation(line: 315, column: 10, scope: !634)
!690 = !DILocation(line: 315, column: 3, scope: !634)
!691 = distinct !DISubprogram(name: "cksum", scope: !3, file: !3, line: 183, type: !692, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !694)
!692 = !DISubroutineType(types: !693)
!693 = !{!37, !29, !37}
!694 = !{!695, !696, !697, !701, !702, !703, !704, !759, !763, !764}
!695 = !DILocalVariable(name: "file", arg: 1, scope: !691, file: !3, line: 183, type: !29)
!696 = !DILocalVariable(name: "print_name", arg: 2, scope: !691, file: !3, line: 183, type: !37)
!697 = !DILocalVariable(name: "buf", scope: !691, file: !3, line: 185, type: !698)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 524288, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 65536)
!701 = !DILocalVariable(name: "crc", scope: !691, file: !3, line: 186, type: !60)
!702 = !DILocalVariable(name: "length", scope: !691, file: !3, line: 187, type: !546)
!703 = !DILocalVariable(name: "bytes_read", scope: !691, file: !3, line: 188, type: !140)
!704 = !DILocalVariable(name: "fp", scope: !691, file: !3, line: 189, type: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !707, line: 7, baseType: !708)
!707 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !709, line: 241, size: 1728, elements: !710)
!709 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !731, !732, !733, !734, !737, !738, !740, !744, !747, !749, !750, !751, !752, !753, !754, !755}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !708, file: !709, line: 242, baseType: !86, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !708, file: !709, line: 247, baseType: !110, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !708, file: !709, line: 248, baseType: !110, size: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !708, file: !709, line: 249, baseType: !110, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !708, file: !709, line: 250, baseType: !110, size: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !708, file: !709, line: 251, baseType: !110, size: 64, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !708, file: !709, line: 252, baseType: !110, size: 64, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !708, file: !709, line: 253, baseType: !110, size: 64, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !708, file: !709, line: 254, baseType: !110, size: 64, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !708, file: !709, line: 256, baseType: !110, size: 64, offset: 576)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !708, file: !709, line: 257, baseType: !110, size: 64, offset: 640)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !708, file: !709, line: 258, baseType: !110, size: 64, offset: 704)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !708, file: !709, line: 260, baseType: !724, size: 64, offset: 768)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !709, line: 156, size: 192, elements: !726)
!726 = !{!727, !728, !730}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !725, file: !709, line: 157, baseType: !724, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !725, file: !709, line: 158, baseType: !729, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !725, file: !709, line: 162, baseType: !86, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !708, file: !709, line: 262, baseType: !729, size: 64, offset: 832)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !708, file: !709, line: 264, baseType: !86, size: 32, offset: 896)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !708, file: !709, line: 268, baseType: !86, size: 32, offset: 928)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !708, file: !709, line: 270, baseType: !735, size: 64, offset: 960)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !548, line: 140, baseType: !736)
!736 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !708, file: !709, line: 274, baseType: !139, size: 16, offset: 1024)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !708, file: !709, line: 275, baseType: !739, size: 8, offset: 1040)
!739 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !708, file: !709, line: 276, baseType: !741, size: 8, offset: 1048)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 1)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !708, file: !709, line: 280, baseType: !745, size: 64, offset: 1088)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !709, line: 150, baseType: null)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !708, file: !709, line: 289, baseType: !748, size: 64, offset: 1152)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !548, line: 141, baseType: !736)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !708, file: !709, line: 297, baseType: !32, size: 64, offset: 1216)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !708, file: !709, line: 298, baseType: !32, size: 64, offset: 1280)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !708, file: !709, line: 299, baseType: !32, size: 64, offset: 1344)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !708, file: !709, line: 300, baseType: !32, size: 64, offset: 1408)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !708, file: !709, line: 302, baseType: !140, size: 64, offset: 1472)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !708, file: !709, line: 303, baseType: !86, size: 32, offset: 1536)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !708, file: !709, line: 305, baseType: !756, size: 160, offset: 1568)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 20)
!759 = !DILocalVariable(name: "length_buf", scope: !691, file: !3, line: 190, type: !760)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 168, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 21)
!763 = !DILocalVariable(name: "hp", scope: !691, file: !3, line: 191, type: !29)
!764 = !DILocalVariable(name: "cp", scope: !765, file: !3, line: 213, type: !535)
!765 = distinct !DILexicalBlock(scope: !691, file: !3, line: 212, column: 5)
!766 = !DILocation(line: 183, column: 20, scope: !691)
!767 = !DILocation(line: 183, column: 31, scope: !691)
!768 = !DILocation(line: 185, column: 3, scope: !691)
!769 = !DILocation(line: 185, column: 17, scope: !691)
!770 = !DILocation(line: 186, column: 17, scope: !691)
!771 = !DILocation(line: 187, column: 13, scope: !691)
!772 = !DILocation(line: 190, column: 3, scope: !691)
!773 = !DILocation(line: 190, column: 8, scope: !691)
!774 = !DILocation(line: 193, column: 7, scope: !775)
!775 = distinct !DILexicalBlock(scope: !691, file: !3, line: 193, column: 7)
!776 = !DILocation(line: 193, column: 7, scope: !691)
!777 = !DILocation(line: 195, column: 12, scope: !778)
!778 = distinct !DILexicalBlock(scope: !775, file: !3, line: 194, column: 5)
!779 = !DILocation(line: 189, column: 9, scope: !691)
!780 = !DILocation(line: 198, column: 5, scope: !778)
!781 = !DILocation(line: 201, column: 12, scope: !782)
!782 = distinct !DILexicalBlock(scope: !775, file: !3, line: 200, column: 5)
!783 = !DILocation(line: 202, column: 14, scope: !784)
!784 = distinct !DILexicalBlock(scope: !782, file: !3, line: 202, column: 11)
!785 = !DILocation(line: 202, column: 11, scope: !782)
!786 = !DILocation(line: 204, column: 21, scope: !787)
!787 = distinct !DILexicalBlock(scope: !784, file: !3, line: 203, column: 9)
!788 = !DILocation(line: 204, column: 34, scope: !787)
!789 = !DILocation(line: 204, column: 11, scope: !787)
!790 = !DILocation(line: 205, column: 11, scope: !787)
!791 = !DILocation(line: 209, column: 3, scope: !691)
!792 = !DILocation(line: 211, column: 24, scope: !691)
!793 = !DILocation(line: 188, column: 10, scope: !691)
!794 = !DILocation(line: 211, column: 52, scope: !691)
!795 = !DILocation(line: 211, column: 3, scope: !691)
!796 = !DILocation(line: 215, column: 18, scope: !797)
!797 = distinct !DILexicalBlock(scope: !765, file: !3, line: 215, column: 11)
!798 = distinct !{!798, !795, !799}
!799 = !DILocation(line: 222, column: 5, scope: !691)
!800 = !DILocation(line: 213, column: 22, scope: !765)
!801 = !DILocation(line: 215, column: 31, scope: !797)
!802 = !DILocation(line: 215, column: 11, scope: !765)
!803 = !DILocation(line: 218, column: 24, scope: !765)
!804 = !DILocation(line: 219, column: 20, scope: !765)
!805 = !DILocation(line: 219, column: 41, scope: !765)
!806 = !DILocation(line: 219, column: 50, scope: !765)
!807 = !{!611, !611, i64 0}
!808 = !DILocation(line: 219, column: 57, scope: !765)
!809 = !DILocation(line: 219, column: 28, scope: !765)
!810 = !{!811, !811, i64 0}
!811 = !{!"long", !611, i64 0}
!812 = !DILocation(line: 219, column: 26, scope: !765)
!813 = !DILocation(line: 218, column: 7, scope: !765)
!814 = !DILocation(line: 216, column: 9, scope: !797)
!815 = !DILocation(line: 219, column: 53, scope: !765)
!816 = distinct !{!816, !813, !817}
!817 = !DILocation(line: 219, column: 63, scope: !765)
!818 = !DILocalVariable(name: "__stream", arg: 1, scope: !819, file: !820, line: 125, type: !705)
!819 = distinct !DISubprogram(name: "feof_unlocked", scope: !820, file: !820, line: 125, type: !821, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !823)
!820 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!821 = !DISubroutineType(types: !822)
!822 = !{!86, !705}
!823 = !{!818}
!824 = !DILocation(line: 125, column: 1, scope: !819, inlinedAt: !825)
!825 = distinct !DILocation(line: 220, column: 11, scope: !826)
!826 = distinct !DILexicalBlock(scope: !765, file: !3, line: 220, column: 11)
!827 = !DILocation(line: 127, column: 10, scope: !819, inlinedAt: !825)
!828 = !{!829, !663, i64 0}
!829 = !{!"_IO_FILE", !663, i64 0, !610, i64 8, !610, i64 16, !610, i64 24, !610, i64 32, !610, i64 40, !610, i64 48, !610, i64 56, !610, i64 64, !610, i64 72, !610, i64 80, !610, i64 88, !610, i64 96, !610, i64 104, !663, i64 112, !663, i64 116, !811, i64 120, !830, i64 128, !611, i64 130, !611, i64 131, !610, i64 136, !811, i64 144, !610, i64 152, !610, i64 160, !610, i64 168, !610, i64 176, !811, i64 184, !663, i64 192, !611, i64 196}
!830 = !{!"short", !611, i64 0}
!831 = !DILocation(line: 220, column: 11, scope: !826)
!832 = !DILocalVariable(name: "__stream", arg: 1, scope: !833, file: !820, line: 132, type: !705)
!833 = distinct !DISubprogram(name: "ferror_unlocked", scope: !820, file: !820, line: 132, type: !821, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !834)
!834 = !{!832}
!835 = !DILocation(line: 132, column: 1, scope: !833, inlinedAt: !836)
!836 = distinct !DILocation(line: 224, column: 7, scope: !837)
!837 = distinct !DILexicalBlock(scope: !691, file: !3, line: 224, column: 7)
!838 = !DILocation(line: 134, column: 10, scope: !833, inlinedAt: !836)
!839 = !DILocation(line: 224, column: 7, scope: !837)
!840 = !DILocation(line: 224, column: 7, scope: !691)
!841 = !DILocation(line: 226, column: 17, scope: !842)
!842 = distinct !DILexicalBlock(scope: !837, file: !3, line: 225, column: 5)
!843 = !DILocation(line: 226, column: 30, scope: !842)
!844 = !DILocation(line: 226, column: 7, scope: !842)
!845 = !DILocation(line: 227, column: 12, scope: !846)
!846 = distinct !DILexicalBlock(scope: !842, file: !3, line: 227, column: 11)
!847 = !DILocation(line: 227, column: 11, scope: !842)
!848 = !DILocation(line: 228, column: 9, scope: !846)
!849 = !DILocation(line: 232, column: 8, scope: !850)
!850 = distinct !DILexicalBlock(scope: !691, file: !3, line: 232, column: 7)
!851 = !DILocation(line: 232, column: 26, scope: !850)
!852 = !DILocation(line: 232, column: 29, scope: !850)
!853 = !DILocation(line: 232, column: 41, scope: !850)
!854 = !DILocation(line: 232, column: 7, scope: !691)
!855 = !DILocation(line: 234, column: 17, scope: !856)
!856 = distinct !DILexicalBlock(scope: !850, file: !3, line: 233, column: 5)
!857 = !DILocation(line: 234, column: 30, scope: !856)
!858 = !DILocation(line: 234, column: 7, scope: !856)
!859 = !DILocation(line: 235, column: 7, scope: !856)
!860 = !DILocation(line: 238, column: 8, scope: !691)
!861 = !DILocation(line: 191, column: 15, scope: !691)
!862 = !DILocation(line: 240, column: 3, scope: !863)
!863 = distinct !DILexicalBlock(scope: !691, file: !3, line: 240, column: 3)
!864 = !DILocation(line: 241, column: 16, scope: !865)
!865 = distinct !DILexicalBlock(scope: !863, file: !3, line: 240, column: 3)
!866 = !DILocation(line: 241, column: 37, scope: !865)
!867 = !DILocation(line: 241, column: 44, scope: !865)
!868 = !DILocation(line: 241, column: 54, scope: !865)
!869 = !DILocation(line: 241, column: 24, scope: !865)
!870 = !DILocation(line: 241, column: 22, scope: !865)
!871 = !DILocation(line: 240, column: 25, scope: !865)
!872 = distinct !{!872, !862, !873}
!873 = !DILocation(line: 241, column: 60, scope: !863)
!874 = !DILocation(line: 245, column: 7, scope: !691)
!875 = !DILocation(line: 246, column: 5, scope: !876)
!876 = distinct !DILexicalBlock(scope: !691, file: !3, line: 245, column: 7)
!877 = !DILocation(line: 248, column: 5, scope: !876)
!878 = !DILocation(line: 250, column: 7, scope: !879)
!879 = distinct !DILexicalBlock(scope: !691, file: !3, line: 250, column: 7)
!880 = !DILocation(line: 132, column: 1, scope: !833, inlinedAt: !881)
!881 = distinct !DILocation(line: 250, column: 7, scope: !879)
!882 = !DILocation(line: 134, column: 10, scope: !833, inlinedAt: !881)
!883 = !DILocation(line: 250, column: 7, scope: !691)
!884 = !DILocation(line: 251, column: 5, scope: !879)
!885 = !DILocation(line: 254, column: 1, scope: !691)
!886 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !78, file: !78, line: 41, type: !42, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !73, variables: !887)
!887 = !{!888}
!888 = !DILocalVariable(name: "file", arg: 1, scope: !886, file: !78, line: 41, type: !29)
!889 = !DILocation(line: 41, column: 41, scope: !886)
!890 = !DILocation(line: 43, column: 13, scope: !886)
!891 = !DILocation(line: 44, column: 1, scope: !886)
!892 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !78, file: !78, line: 78, type: !893, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !73, variables: !895)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !37}
!895 = !{!896}
!896 = !DILocalVariable(name: "ignore", arg: 1, scope: !892, file: !78, line: 78, type: !37)
!897 = !DILocation(line: 78, column: 37, scope: !892)
!898 = !DILocation(line: 80, column: 16, scope: !892)
!899 = !{!900, !900, i64 0}
!900 = !{!"_Bool", !611, i64 0}
!901 = !DILocation(line: 81, column: 1, scope: !892)
!902 = distinct !DISubprogram(name: "close_stdout", scope: !78, file: !78, line: 107, type: !903, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, unit: !73, variables: !905)
!903 = !DISubroutineType(types: !904)
!904 = !{null}
!905 = !{!906}
!906 = !DILocalVariable(name: "write_error", scope: !907, file: !78, line: 112, type: !29)
!907 = distinct !DILexicalBlock(scope: !908, file: !78, line: 111, column: 5)
!908 = distinct !DILexicalBlock(scope: !902, file: !78, line: 109, column: 7)
!909 = !DILocation(line: 109, column: 21, scope: !908)
!910 = !DILocation(line: 109, column: 7, scope: !908)
!911 = !DILocation(line: 109, column: 29, scope: !908)
!912 = !DILocation(line: 110, column: 7, scope: !908)
!913 = !DILocation(line: 110, column: 12, scope: !908)
!914 = !{i8 0, i8 2}
!915 = !DILocation(line: 114, column: 19, scope: !916)
!916 = distinct !DILexicalBlock(scope: !907, file: !78, line: 113, column: 11)
!917 = !DILocation(line: 110, column: 25, scope: !908)
!918 = !DILocation(line: 110, column: 28, scope: !908)
!919 = !DILocation(line: 110, column: 34, scope: !908)
!920 = !DILocation(line: 109, column: 7, scope: !902)
!921 = !DILocation(line: 112, column: 33, scope: !907)
!922 = !DILocation(line: 112, column: 19, scope: !907)
!923 = !DILocation(line: 113, column: 11, scope: !916)
!924 = !DILocation(line: 113, column: 11, scope: !907)
!925 = !DILocation(line: 114, column: 36, scope: !916)
!926 = !DILocation(line: 114, column: 9, scope: !916)
!927 = !DILocation(line: 117, column: 9, scope: !916)
!928 = !DILocation(line: 119, column: 14, scope: !907)
!929 = !DILocation(line: 119, column: 7, scope: !907)
!930 = !DILocation(line: 122, column: 22, scope: !931)
!931 = distinct !DILexicalBlock(scope: !902, file: !78, line: 122, column: 8)
!932 = !DILocation(line: 122, column: 8, scope: !931)
!933 = !DILocation(line: 122, column: 30, scope: !931)
!934 = !DILocation(line: 122, column: 8, scope: !902)
!935 = !DILocation(line: 123, column: 13, scope: !931)
!936 = !DILocation(line: 123, column: 6, scope: !931)
!937 = !DILocation(line: 124, column: 1, scope: !902)
!938 = distinct !DISubprogram(name: "fdadvise", scope: !939, file: !939, line: 31, type: !940, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !540, variables: !945)
!939 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!940 = !DISubroutineType(types: !941)
!941 = !{null, !86, !942, !942, !944}
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !943, line: 57, baseType: !735)
!943 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "fadvice_t", file: !20, line: 52, baseType: !19)
!945 = !{!946, !947, !948, !949, !950}
!946 = !DILocalVariable(name: "fd", arg: 1, scope: !938, file: !939, line: 31, type: !86)
!947 = !DILocalVariable(name: "offset", arg: 2, scope: !938, file: !939, line: 31, type: !942)
!948 = !DILocalVariable(name: "len", arg: 3, scope: !938, file: !939, line: 31, type: !942)
!949 = !DILocalVariable(name: "advice", arg: 4, scope: !938, file: !939, line: 31, type: !944)
!950 = !DILocalVariable(name: "__x", scope: !951, file: !939, line: 34, type: !86)
!951 = distinct !DILexicalBlock(scope: !938, file: !939, line: 34, column: 3)
!952 = !DILocation(line: 31, column: 15, scope: !938)
!953 = !DILocation(line: 31, column: 25, scope: !938)
!954 = !DILocation(line: 31, column: 39, scope: !938)
!955 = !DILocation(line: 31, column: 54, scope: !938)
!956 = !DILocation(line: 34, column: 3, scope: !951)
!957 = !DILocation(line: 36, column: 1, scope: !938)
!958 = distinct !DISubprogram(name: "fadvise", scope: !939, file: !939, line: 39, type: !959, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !540, variables: !1001)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !961, !944}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !707, line: 7, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !709, line: 241, size: 1728, elements: !964)
!964 = !{!965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !963, file: !709, line: 242, baseType: !86, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !963, file: !709, line: 247, baseType: !110, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !963, file: !709, line: 248, baseType: !110, size: 64, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !963, file: !709, line: 249, baseType: !110, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !963, file: !709, line: 250, baseType: !110, size: 64, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !963, file: !709, line: 251, baseType: !110, size: 64, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !963, file: !709, line: 252, baseType: !110, size: 64, offset: 384)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !963, file: !709, line: 253, baseType: !110, size: 64, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !963, file: !709, line: 254, baseType: !110, size: 64, offset: 512)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !963, file: !709, line: 256, baseType: !110, size: 64, offset: 576)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !963, file: !709, line: 257, baseType: !110, size: 64, offset: 640)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !963, file: !709, line: 258, baseType: !110, size: 64, offset: 704)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !963, file: !709, line: 260, baseType: !978, size: 64, offset: 768)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !709, line: 156, size: 192, elements: !980)
!980 = !{!981, !982, !984}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !979, file: !709, line: 157, baseType: !978, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !979, file: !709, line: 158, baseType: !983, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !979, file: !709, line: 162, baseType: !86, size: 32, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !963, file: !709, line: 262, baseType: !983, size: 64, offset: 832)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !963, file: !709, line: 264, baseType: !86, size: 32, offset: 896)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !963, file: !709, line: 268, baseType: !86, size: 32, offset: 928)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !963, file: !709, line: 270, baseType: !735, size: 64, offset: 960)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !963, file: !709, line: 274, baseType: !139, size: 16, offset: 1024)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !963, file: !709, line: 275, baseType: !739, size: 8, offset: 1040)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !963, file: !709, line: 276, baseType: !741, size: 8, offset: 1048)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !963, file: !709, line: 280, baseType: !745, size: 64, offset: 1088)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !963, file: !709, line: 289, baseType: !748, size: 64, offset: 1152)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !963, file: !709, line: 297, baseType: !32, size: 64, offset: 1216)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !963, file: !709, line: 298, baseType: !32, size: 64, offset: 1280)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !963, file: !709, line: 299, baseType: !32, size: 64, offset: 1344)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !963, file: !709, line: 300, baseType: !32, size: 64, offset: 1408)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !963, file: !709, line: 302, baseType: !140, size: 64, offset: 1472)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !963, file: !709, line: 303, baseType: !86, size: 32, offset: 1536)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !963, file: !709, line: 305, baseType: !756, size: 160, offset: 1568)
!1001 = !{!1002, !1003}
!1002 = !DILocalVariable(name: "fp", arg: 1, scope: !958, file: !939, line: 39, type: !961)
!1003 = !DILocalVariable(name: "advice", arg: 2, scope: !958, file: !939, line: 39, type: !944)
!1004 = !DILocation(line: 39, column: 16, scope: !958)
!1005 = !DILocation(line: 39, column: 30, scope: !958)
!1006 = !DILocation(line: 41, column: 7, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !958, file: !939, line: 41, column: 7)
!1008 = !DILocation(line: 41, column: 7, scope: !958)
!1009 = !DILocation(line: 42, column: 15, scope: !1007)
!1010 = !DILocation(line: 31, column: 15, scope: !938, inlinedAt: !1011)
!1011 = distinct !DILocation(line: 42, column: 5, scope: !1007)
!1012 = !DILocation(line: 31, column: 25, scope: !938, inlinedAt: !1011)
!1013 = !DILocation(line: 31, column: 39, scope: !938, inlinedAt: !1011)
!1014 = !DILocation(line: 31, column: 54, scope: !938, inlinedAt: !1011)
!1015 = !DILocation(line: 34, column: 3, scope: !951, inlinedAt: !1011)
!1016 = !DILocation(line: 42, column: 5, scope: !1007)
!1017 = !DILocation(line: 43, column: 1, scope: !958)
!1018 = distinct !DISubprogram(name: "umaxtostr", scope: !1019, file: !1019, line: 36, type: !1020, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, unit: !543, variables: !1022)
!1019 = !DIFile(filename: "./lib/anytostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!110, !546, !110}
!1022 = !{!1023, !1024, !1025}
!1023 = !DILocalVariable(name: "i", arg: 1, scope: !1018, file: !1019, line: 36, type: !546)
!1024 = !DILocalVariable(name: "buf", arg: 2, scope: !1018, file: !1019, line: 36, type: !110)
!1025 = !DILocalVariable(name: "p", scope: !1018, file: !1019, line: 38, type: !110)
!1026 = !DILocation(line: 36, column: 19, scope: !1018)
!1027 = !DILocation(line: 36, column: 28, scope: !1018)
!1028 = !DILocation(line: 38, column: 17, scope: !1018)
!1029 = !DILocation(line: 38, column: 9, scope: !1018)
!1030 = !DILocation(line: 39, column: 6, scope: !1018)
!1031 = !DILocation(line: 51, column: 7, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !1019, line: 50, column: 5)
!1033 = distinct !DILexicalBlock(scope: !1018, file: !1019, line: 41, column: 7)
!1034 = distinct !{!1034, !1031, !1035}
!1035 = !DILocation(line: 53, column: 28, scope: !1032)
!1036 = !DILocation(line: 52, column: 24, scope: !1032)
!1037 = !DILocation(line: 52, column: 16, scope: !1032)
!1038 = !DILocation(line: 52, column: 10, scope: !1032)
!1039 = !DILocation(line: 52, column: 14, scope: !1032)
!1040 = !DILocation(line: 53, column: 17, scope: !1032)
!1041 = !DILocation(line: 53, column: 24, scope: !1032)
!1042 = !DILocation(line: 52, column: 9, scope: !1032)
!1043 = !DILocation(line: 56, column: 3, scope: !1018)
!1044 = distinct !DISubprogram(name: "parse_long_options", scope: !92, file: !92, line: 44, type: !1045, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !89, variables: !1048)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{null, !86, !637, !29, !29, !29, !1047, null}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057}
!1049 = !DILocalVariable(name: "argc", arg: 1, scope: !1044, file: !92, line: 44, type: !86)
!1050 = !DILocalVariable(name: "argv", arg: 2, scope: !1044, file: !92, line: 45, type: !637)
!1051 = !DILocalVariable(name: "command_name", arg: 3, scope: !1044, file: !92, line: 46, type: !29)
!1052 = !DILocalVariable(name: "package", arg: 4, scope: !1044, file: !92, line: 47, type: !29)
!1053 = !DILocalVariable(name: "version", arg: 5, scope: !1044, file: !92, line: 48, type: !29)
!1054 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1044, file: !92, line: 49, type: !1047)
!1055 = !DILocalVariable(name: "c", scope: !1044, file: !92, line: 52, type: !86)
!1056 = !DILocalVariable(name: "saved_opterr", scope: !1044, file: !92, line: 53, type: !86)
!1057 = !DILocalVariable(name: "authors", scope: !1058, file: !92, line: 71, type: !1062)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !92, line: 70, column: 11)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !92, line: 64, column: 9)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !92, line: 62, column: 5)
!1061 = distinct !DILexicalBlock(scope: !1044, file: !92, line: 60, column: 7)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !943, line: 46, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1064, line: 48, baseType: !1065)
!1064 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !90, line: 71, baseType: !1066)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 192, elements: !742)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !90, line: 71, size: 192, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1067, file: !90, line: 71, baseType: !33, size: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1067, file: !90, line: 71, baseType: !33, size: 32, offset: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1067, file: !90, line: 71, baseType: !32, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1067, file: !90, line: 71, baseType: !32, size: 64, offset: 128)
!1073 = !DILocation(line: 44, column: 25, scope: !1044)
!1074 = !DILocation(line: 45, column: 28, scope: !1044)
!1075 = !DILocation(line: 46, column: 33, scope: !1044)
!1076 = !DILocation(line: 47, column: 33, scope: !1044)
!1077 = !DILocation(line: 48, column: 33, scope: !1044)
!1078 = !DILocation(line: 49, column: 28, scope: !1044)
!1079 = !DILocation(line: 55, column: 18, scope: !1044)
!1080 = !DILocation(line: 53, column: 7, scope: !1044)
!1081 = !DILocation(line: 58, column: 10, scope: !1044)
!1082 = !DILocation(line: 60, column: 12, scope: !1061)
!1083 = !DILocation(line: 61, column: 7, scope: !1061)
!1084 = !DILocation(line: 61, column: 15, scope: !1061)
!1085 = !DILocation(line: 52, column: 7, scope: !1044)
!1086 = !DILocation(line: 60, column: 7, scope: !1044)
!1087 = !DILocation(line: 66, column: 11, scope: !1059)
!1088 = !DILocation(line: 67, column: 11, scope: !1059)
!1089 = !DILocation(line: 71, column: 13, scope: !1058)
!1090 = !DILocation(line: 71, column: 21, scope: !1058)
!1091 = !DILocation(line: 72, column: 13, scope: !1058)
!1092 = !DILocation(line: 73, column: 29, scope: !1058)
!1093 = !DILocation(line: 73, column: 13, scope: !1058)
!1094 = !DILocation(line: 74, column: 13, scope: !1058)
!1095 = !DILocation(line: 84, column: 10, scope: !1044)
!1096 = !DILocation(line: 88, column: 10, scope: !1044)
!1097 = !DILocation(line: 89, column: 1, scope: !1044)
!1098 = distinct !DISubprogram(name: "set_program_name", scope: !112, file: !112, line: 39, type: !42, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !107, variables: !1099)
!1099 = !{!1100, !1101, !1102}
!1100 = !DILocalVariable(name: "argv0", arg: 1, scope: !1098, file: !112, line: 39, type: !29)
!1101 = !DILocalVariable(name: "slash", scope: !1098, file: !112, line: 46, type: !29)
!1102 = !DILocalVariable(name: "base", scope: !1098, file: !112, line: 47, type: !29)
!1103 = !DILocation(line: 39, column: 31, scope: !1098)
!1104 = !DILocation(line: 51, column: 13, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1098, file: !112, line: 51, column: 7)
!1106 = !DILocation(line: 51, column: 7, scope: !1098)
!1107 = !DILocation(line: 55, column: 14, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1105, file: !112, line: 52, column: 5)
!1109 = !DILocation(line: 54, column: 7, scope: !1108)
!1110 = !DILocation(line: 56, column: 7, scope: !1108)
!1111 = !DILocation(line: 59, column: 11, scope: !1098)
!1112 = !DILocation(line: 46, column: 15, scope: !1098)
!1113 = !DILocation(line: 60, column: 17, scope: !1098)
!1114 = !DILocation(line: 60, column: 33, scope: !1098)
!1115 = !DILocation(line: 60, column: 11, scope: !1098)
!1116 = !DILocation(line: 47, column: 15, scope: !1098)
!1117 = !DILocation(line: 61, column: 12, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1098, file: !112, line: 61, column: 7)
!1119 = !DILocation(line: 61, column: 20, scope: !1118)
!1120 = !DILocation(line: 61, column: 25, scope: !1118)
!1121 = !DILocation(line: 61, column: 42, scope: !1118)
!1122 = !DILocation(line: 61, column: 28, scope: !1118)
!1123 = !DILocation(line: 61, column: 61, scope: !1118)
!1124 = !DILocation(line: 61, column: 7, scope: !1098)
!1125 = !DILocation(line: 64, column: 11, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !112, line: 64, column: 11)
!1127 = distinct !DILexicalBlock(scope: !1118, file: !112, line: 62, column: 5)
!1128 = !DILocation(line: 64, column: 36, scope: !1126)
!1129 = !DILocation(line: 64, column: 11, scope: !1127)
!1130 = !DILocation(line: 66, column: 24, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1126, file: !112, line: 65, column: 9)
!1132 = !DILocation(line: 70, column: 41, scope: !1131)
!1133 = !DILocation(line: 72, column: 9, scope: !1131)
!1134 = !DILocation(line: 84, column: 16, scope: !1098)
!1135 = !DILocation(line: 90, column: 27, scope: !1098)
!1136 = !DILocation(line: 92, column: 1, scope: !1098)
!1137 = distinct !DISubprogram(name: "clone_quoting_options", scope: !145, file: !145, line: 114, type: !1138, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, unit: !115, variables: !1141)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!1140, !1140}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!1141 = !{!1142, !1143, !1144}
!1142 = !DILocalVariable(name: "o", arg: 1, scope: !1137, file: !145, line: 114, type: !1140)
!1143 = !DILocalVariable(name: "e", scope: !1137, file: !145, line: 116, type: !86)
!1144 = !DILocalVariable(name: "p", scope: !1137, file: !145, line: 117, type: !1140)
!1145 = !DILocation(line: 114, column: 48, scope: !1137)
!1146 = !DILocation(line: 116, column: 11, scope: !1137)
!1147 = !DILocation(line: 116, column: 7, scope: !1137)
!1148 = !DILocation(line: 117, column: 40, scope: !1137)
!1149 = !DILocation(line: 117, column: 31, scope: !1137)
!1150 = !DILocation(line: 117, column: 27, scope: !1137)
!1151 = !DILocation(line: 119, column: 9, scope: !1137)
!1152 = !DILocation(line: 120, column: 3, scope: !1137)
!1153 = distinct !DISubprogram(name: "get_quoting_style", scope: !145, file: !145, line: 125, type: !1154, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !115, variables: !1158)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!5, !1156}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!1158 = !{!1159}
!1159 = !DILocalVariable(name: "o", arg: 1, scope: !1153, file: !145, line: 125, type: !1156)
!1160 = !DILocation(line: 125, column: 50, scope: !1153)
!1161 = !DILocation(line: 127, column: 11, scope: !1153)
!1162 = !DILocation(line: 127, column: 46, scope: !1153)
!1163 = !{!1164, !611, i64 0}
!1164 = !{!"quoting_options", !611, i64 0, !663, i64 4, !611, i64 8, !610, i64 40, !610, i64 48}
!1165 = !DILocation(line: 127, column: 3, scope: !1153)
!1166 = distinct !DISubprogram(name: "set_quoting_style", scope: !145, file: !145, line: 133, type: !1167, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, unit: !115, variables: !1169)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{null, !1140, !5}
!1169 = !{!1170, !1171}
!1170 = !DILocalVariable(name: "o", arg: 1, scope: !1166, file: !145, line: 133, type: !1140)
!1171 = !DILocalVariable(name: "s", arg: 2, scope: !1166, file: !145, line: 133, type: !5)
!1172 = !DILocation(line: 133, column: 44, scope: !1166)
!1173 = !DILocation(line: 133, column: 66, scope: !1166)
!1174 = !DILocation(line: 135, column: 4, scope: !1166)
!1175 = !DILocation(line: 135, column: 39, scope: !1166)
!1176 = !DILocation(line: 135, column: 45, scope: !1166)
!1177 = !DILocation(line: 136, column: 1, scope: !1166)
!1178 = distinct !DISubprogram(name: "set_char_quoting", scope: !145, file: !145, line: 144, type: !1179, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, unit: !115, variables: !1181)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!86, !1140, !31, !86}
!1181 = !{!1182, !1183, !1184, !1185, !1186, !1188, !1189}
!1182 = !DILocalVariable(name: "o", arg: 1, scope: !1178, file: !145, line: 144, type: !1140)
!1183 = !DILocalVariable(name: "c", arg: 2, scope: !1178, file: !145, line: 144, type: !31)
!1184 = !DILocalVariable(name: "i", arg: 3, scope: !1178, file: !145, line: 144, type: !86)
!1185 = !DILocalVariable(name: "uc", scope: !1178, file: !145, line: 146, type: !536)
!1186 = !DILocalVariable(name: "p", scope: !1178, file: !145, line: 147, type: !1187)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!1188 = !DILocalVariable(name: "shift", scope: !1178, file: !145, line: 149, type: !86)
!1189 = !DILocalVariable(name: "r", scope: !1178, file: !145, line: 150, type: !86)
!1190 = !DILocation(line: 144, column: 43, scope: !1178)
!1191 = !DILocation(line: 144, column: 51, scope: !1178)
!1192 = !DILocation(line: 144, column: 58, scope: !1178)
!1193 = !DILocation(line: 146, column: 17, scope: !1178)
!1194 = !DILocation(line: 148, column: 6, scope: !1178)
!1195 = !DILocation(line: 148, column: 62, scope: !1178)
!1196 = !DILocation(line: 148, column: 57, scope: !1178)
!1197 = !DILocation(line: 147, column: 17, scope: !1178)
!1198 = !DILocation(line: 149, column: 18, scope: !1178)
!1199 = !DILocation(line: 149, column: 15, scope: !1178)
!1200 = !DILocation(line: 149, column: 7, scope: !1178)
!1201 = !DILocation(line: 150, column: 12, scope: !1178)
!1202 = !DILocation(line: 150, column: 15, scope: !1178)
!1203 = !DILocation(line: 150, column: 25, scope: !1178)
!1204 = !DILocation(line: 150, column: 7, scope: !1178)
!1205 = !DILocation(line: 151, column: 13, scope: !1178)
!1206 = !DILocation(line: 151, column: 18, scope: !1178)
!1207 = !DILocation(line: 151, column: 23, scope: !1178)
!1208 = !DILocation(line: 151, column: 6, scope: !1178)
!1209 = !DILocation(line: 152, column: 3, scope: !1178)
!1210 = distinct !DISubprogram(name: "set_quoting_flags", scope: !145, file: !145, line: 160, type: !1211, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, unit: !115, variables: !1213)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!86, !1140, !86}
!1213 = !{!1214, !1215, !1216}
!1214 = !DILocalVariable(name: "o", arg: 1, scope: !1210, file: !145, line: 160, type: !1140)
!1215 = !DILocalVariable(name: "i", arg: 2, scope: !1210, file: !145, line: 160, type: !86)
!1216 = !DILocalVariable(name: "r", scope: !1210, file: !145, line: 162, type: !86)
!1217 = !DILocation(line: 160, column: 44, scope: !1210)
!1218 = !DILocation(line: 160, column: 51, scope: !1210)
!1219 = !DILocation(line: 163, column: 8, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1210, file: !145, line: 163, column: 7)
!1221 = !DILocation(line: 163, column: 7, scope: !1210)
!1222 = !DILocation(line: 165, column: 10, scope: !1210)
!1223 = !{!1164, !663, i64 4}
!1224 = !DILocation(line: 162, column: 7, scope: !1210)
!1225 = !DILocation(line: 166, column: 12, scope: !1210)
!1226 = !DILocation(line: 167, column: 3, scope: !1210)
!1227 = distinct !DISubprogram(name: "set_custom_quoting", scope: !145, file: !145, line: 171, type: !1228, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: true, unit: !115, variables: !1230)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{null, !1140, !29, !29}
!1230 = !{!1231, !1232, !1233}
!1231 = !DILocalVariable(name: "o", arg: 1, scope: !1227, file: !145, line: 171, type: !1140)
!1232 = !DILocalVariable(name: "left_quote", arg: 2, scope: !1227, file: !145, line: 172, type: !29)
!1233 = !DILocalVariable(name: "right_quote", arg: 3, scope: !1227, file: !145, line: 172, type: !29)
!1234 = !DILocation(line: 171, column: 45, scope: !1227)
!1235 = !DILocation(line: 172, column: 33, scope: !1227)
!1236 = !DILocation(line: 172, column: 57, scope: !1227)
!1237 = !DILocation(line: 174, column: 8, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1227, file: !145, line: 174, column: 7)
!1239 = !DILocation(line: 174, column: 7, scope: !1227)
!1240 = !DILocation(line: 176, column: 6, scope: !1227)
!1241 = !DILocation(line: 176, column: 12, scope: !1227)
!1242 = !DILocation(line: 177, column: 8, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1227, file: !145, line: 177, column: 7)
!1244 = !DILocation(line: 177, column: 23, scope: !1243)
!1245 = !DILocation(line: 177, column: 19, scope: !1243)
!1246 = !DILocation(line: 178, column: 5, scope: !1243)
!1247 = !DILocation(line: 179, column: 6, scope: !1227)
!1248 = !DILocation(line: 179, column: 17, scope: !1227)
!1249 = !{!1164, !610, i64 40}
!1250 = !DILocation(line: 180, column: 6, scope: !1227)
!1251 = !DILocation(line: 180, column: 18, scope: !1227)
!1252 = !{!1164, !610, i64 48}
!1253 = !DILocation(line: 181, column: 1, scope: !1227)
!1254 = distinct !DISubprogram(name: "quotearg_buffer", scope: !145, file: !145, line: 776, type: !1255, isLocal: false, isDefinition: true, scopeLine: 779, flags: DIFlagPrototyped, isOptimized: true, unit: !115, variables: !1257)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!140, !110, !140, !29, !140, !1156}
!1257 = !{!1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265}
!1258 = !DILocalVariable(name: "buffer", arg: 1, scope: !1254, file: !145, line: 776, type: !110)
!1259 = !DILocalVariable(name: "buffersize", arg: 2, scope: !1254, file: !145, line: 776, type: !140)
!1260 = !DILocalVariable(name: "arg", arg: 3, scope: !1254, file: !145, line: 777, type: !29)
!1261 = !DILocalVariable(name: "argsize", arg: 4, scope: !1254, file: !145, line: 777, type: !140)
!1262 = !DILocalVariable(name: "o", arg: 5, scope: !1254, file: !145, line: 778, type: !1156)
!1263 = !DILocalVariable(name: "p", scope: !1254, file: !145, line: 780, type: !1156)
!1264 = !DILocalVariable(name: "e", scope: !1254, file: !145, line: 781, type: !86)
!1265 = !DILocalVariable(name: "r", scope: !1254, file: !145, line: 782, type: !140)
!1266 = !DILocation(line: 776, column: 24, scope: !1254)
!1267 = !DILocation(line: 776, column: 39, scope: !1254)
!1268 = !DILocation(line: 777, column: 30, scope: !1254)
!1269 = !DILocation(line: 777, column: 42, scope: !1254)
!1270 = !DILocation(line: 778, column: 48, scope: !1254)
!1271 = !DILocation(line: 780, column: 37, scope: !1254)
!1272 = !DILocation(line: 780, column: 33, scope: !1254)
!1273 = !DILocation(line: 781, column: 11, scope: !1254)
!1274 = !DILocation(line: 781, column: 7, scope: !1254)
!1275 = !DILocation(line: 783, column: 43, scope: !1254)
!1276 = !DILocation(line: 783, column: 53, scope: !1254)
!1277 = !DILocation(line: 783, column: 60, scope: !1254)
!1278 = !DILocation(line: 784, column: 43, scope: !1254)
!1279 = !DILocation(line: 784, column: 58, scope: !1254)
!1280 = !DILocation(line: 782, column: 14, scope: !1254)
!1281 = !DILocation(line: 782, column: 10, scope: !1254)
!1282 = !DILocation(line: 785, column: 9, scope: !1254)
!1283 = !DILocation(line: 786, column: 3, scope: !1254)
!1284 = distinct !DISubprogram(name: "quotearg_buffer_restyled", scope: !145, file: !145, line: 248, type: !1285, isLocal: true, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: true, unit: !115, variables: !1289)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!140, !110, !140, !29, !140, !5, !86, !1287, !29, !29}
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
