; ModuleID = 'coreutils-8.27/src/comm.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.linebuffer = type { i64, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [35 x i8] c"Usage: %s [OPTION]... FILE1 FILE2\0A\00", align 1
@.str.2 = private unnamed_addr constant [52 x i8] c"Compare sorted files FILE1 and FILE2 line by line.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [60 x i8] c"\0AWhen FILE1 or FILE2 (not both) is -, read standard input.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "hard_LC_COLLATE", scope: !2, file: !3, line: 46, type: !40, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !33, globals: !37)
!3 = !DIFile(filename: "src/comm.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !10, !24}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 70, size: 32, elements: !6)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "CHECK_ORDER_DEFAULT", value: 0)
!8 = !DIEnumerator(name: "CHECK_ORDER_ENABLED", value: 1)
!9 = !DIEnumerator(name: "CHECK_ORDER_DISABLED", value: 2)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !11, line: 32, size: 32, elements: !12)
!11 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!13 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!14 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!15 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!16 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!17 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!18 = !DIEnumerator(name: "c_quoting_style", value: 5)
!19 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!20 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!21 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!22 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!23 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 45, size: 32, elements: !26)
!25 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!26 = !{!27, !28, !29, !30, !31, !32}
!27 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!28 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!29 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!30 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!31 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!32 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!33 = !{!34, !36}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!37 = !{!0, !38, !41, !43, !45, !47, !52, !54, !56, !78, !93, !96, !101}
!38 = !DIGlobalVariableExpression(var: !39)
!39 = distinct !DIGlobalVariable(name: "only_file_1", scope: !2, file: !3, line: 49, type: !40, isLocal: true, isDefinition: true)
!40 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!41 = !DIGlobalVariableExpression(var: !42)
!42 = distinct !DIGlobalVariable(name: "only_file_2", scope: !2, file: !3, line: 52, type: !40, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44)
!44 = distinct !DIGlobalVariable(name: "both", scope: !2, file: !3, line: 55, type: !40, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46)
!46 = distinct !DIGlobalVariable(name: "seen_unpairable", scope: !2, file: !3, line: 58, type: !40, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48)
!48 = distinct !DIGlobalVariable(name: "issued_disorder_warning", scope: !2, file: !3, line: 61, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 16, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 2)
!52 = !DIGlobalVariableExpression(var: !53)
!53 = distinct !DIGlobalVariable(name: "total_option", scope: !2, file: !3, line: 67, type: !40, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55)
!55 = distinct !DIGlobalVariable(name: "check_input_order", scope: !2, file: !3, line: 75, type: !5, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57)
!57 = distinct !DIGlobalVariable(name: "infomap", scope: !58, file: !59, line: 632, type: !75, isLocal: true, isDefinition: true)
!58 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !59, file: !59, line: 630, type: !60, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !64)
!59 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!64 = !{!65, !66, !67, !74}
!65 = !DILocalVariable(name: "program", arg: 1, scope: !58, file: !59, line: 630, type: !62)
!66 = !DILocalVariable(name: "node", scope: !58, file: !59, line: 642, type: !62)
!67 = !DILocalVariable(name: "map_prog", scope: !58, file: !59, line: 643, type: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !58, file: !59, line: 632, size: 128, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !70, file: !59, line: 632, baseType: !62, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !70, file: !59, line: 632, baseType: !62, size: 64, offset: 64)
!74 = !DILocalVariable(name: "lc_messages", scope: !58, file: !59, line: 655, type: !62)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 896, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 7)
!78 = !DIGlobalVariableExpression(var: !79)
!79 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 92, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 2048, elements: !91)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !83, line: 50, size: 256, elements: !84)
!83 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!84 = !{!85, !86, !88, !90}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !82, file: !83, line: 52, baseType: !62, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !82, file: !83, line: 55, baseType: !87, size: 32, offset: 64)
!87 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !82, file: !83, line: 56, baseType: !89, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !82, file: !83, line: 57, baseType: !87, size: 32, offset: 192)
!91 = !{!92}
!92 = !DISubrange(count: 8)
!93 = !DIGlobalVariableExpression(var: !94)
!94 = distinct !DIGlobalVariable(name: "delim", scope: !2, file: !3, line: 64, type: !95, isLocal: true, isDefinition: true)
!95 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!96 = !DIGlobalVariableExpression(var: !97)
!97 = distinct !DIGlobalVariable(name: "col_sep_len", scope: !2, file: !3, line: 80, type: !98, isLocal: true, isDefinition: true)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !99, line: 62, baseType: !100)
!99 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!100 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!101 = !DIGlobalVariableExpression(var: !102)
!102 = distinct !DIGlobalVariable(name: "col_sep", scope: !2, file: !3, line: 79, type: !62, isLocal: true, isDefinition: true)
!103 = !DIGlobalVariableExpression(var: !104)
!104 = distinct !DIGlobalVariable(name: "Version", scope: !105, file: !106, line: 2, type: !62, isLocal: false, isDefinition: true)
!105 = distinct !DICompileUnit(language: DW_LANG_C99, file: !106, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, globals: !108)
!106 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!107 = !{}
!108 = !{!103}
!109 = !DIGlobalVariableExpression(var: !110)
!110 = distinct !DIGlobalVariable(name: "file_name", scope: !111, file: !116, line: 36, type: !62, isLocal: true, isDefinition: true)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, globals: !113)
!112 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!113 = !{!109, !114}
!114 = !DIGlobalVariableExpression(var: !115)
!115 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !111, file: !116, line: 46, type: !40, isLocal: true, isDefinition: true)
!116 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!117 = !DIGlobalVariableExpression(var: !118)
!118 = distinct !DIGlobalVariable(name: "exit_failure", scope: !119, file: !122, line: 24, type: !123, isLocal: false, isDefinition: true)
!119 = distinct !DICompileUnit(language: DW_LANG_C99, file: !120, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, globals: !121)
!120 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!121 = !{!117}
!122 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!123 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !87)
!124 = !DIGlobalVariableExpression(var: !125)
!125 = distinct !DIGlobalVariable(name: "program_name", scope: !126, file: !130, line: 33, type: !62, isLocal: false, isDefinition: true)
!126 = distinct !DICompileUnit(language: DW_LANG_C99, file: !127, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !128, globals: !129)
!127 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!128 = !{!36, !34}
!129 = !{!124}
!130 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!131 = !DIGlobalVariableExpression(var: !132)
!132 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !133, file: !161, line: 77, type: !195, isLocal: false, isDefinition: true)
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !135, retainedTypes: !156, globals: !158)
!134 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!135 = !{!10, !136, !141}
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !11, line: 242, size: 32, elements: !137)
!137 = !{!138, !139, !140}
!138 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!139 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!140 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !142, line: 46, size: 32, elements: !143)
!142 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155}
!144 = !DIEnumerator(name: "_ISupper", value: 256)
!145 = !DIEnumerator(name: "_ISlower", value: 512)
!146 = !DIEnumerator(name: "_ISalpha", value: 1024)
!147 = !DIEnumerator(name: "_ISdigit", value: 2048)
!148 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!149 = !DIEnumerator(name: "_ISspace", value: 8192)
!150 = !DIEnumerator(name: "_ISprint", value: 16384)
!151 = !DIEnumerator(name: "_ISgraph", value: 32768)
!152 = !DIEnumerator(name: "_ISblank", value: 1)
!153 = !DIEnumerator(name: "_IScntrl", value: 2)
!154 = !DIEnumerator(name: "_ISpunct", value: 4)
!155 = !DIEnumerator(name: "_ISalnum", value: 8)
!156 = !{!87, !157, !98, !34}
!157 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!158 = !{!131, !159, !166, !177, !179, !184, !191, !193}
!159 = !DIGlobalVariableExpression(var: !160)
!160 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !133, file: !161, line: 93, type: !162, isLocal: false, isDefinition: true)
!161 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 320, elements: !164)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!164 = !{!165}
!165 = !DISubrange(count: 10)
!166 = !DIGlobalVariableExpression(var: !167)
!167 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !133, file: !161, line: 1043, type: !168, isLocal: false, isDefinition: true)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !161, line: 57, size: 448, elements: !169)
!169 = !{!170, !171, !172, !175, !176}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !168, file: !161, line: 60, baseType: !10, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !168, file: !161, line: 63, baseType: !87, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !168, file: !161, line: 67, baseType: !173, size: 256, offset: 64)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 256, elements: !91)
!174 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !168, file: !161, line: 70, baseType: !62, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !168, file: !161, line: 73, baseType: !62, size: 64, offset: 384)
!177 = !DIGlobalVariableExpression(var: !178)
!178 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !133, file: !161, line: 108, type: !168, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180)
!180 = distinct !DIGlobalVariable(name: "slot0", scope: !133, file: !161, line: 834, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 256)
!184 = !DIGlobalVariableExpression(var: !185)
!185 = distinct !DIGlobalVariable(name: "slotvec", scope: !133, file: !161, line: 837, type: !186, isLocal: true, isDefinition: true)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !161, line: 826, size: 128, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !187, file: !161, line: 828, baseType: !98, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !187, file: !161, line: 829, baseType: !34, size: 64, offset: 64)
!191 = !DIGlobalVariableExpression(var: !192)
!192 = distinct !DIGlobalVariable(name: "nslots", scope: !133, file: !161, line: 835, type: !87, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194)
!194 = distinct !DIGlobalVariable(name: "slotvec0", scope: !133, file: !161, line: 836, type: !187, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 704, elements: !197)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!197 = !{!198}
!198 = !DISubrange(count: 11)
!199 = !DIGlobalVariableExpression(var: !200)
!200 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !201, file: !204, line: 26, type: !205, isLocal: false, isDefinition: true)
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, globals: !203)
!202 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!203 = !{!199}
!204 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 376, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 47)
!208 = !DIGlobalVariableExpression(var: !209)
!209 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !210, file: !211, line: 335, type: !87, isLocal: true, isDefinition: true)
!210 = distinct !DISubprogram(name: "rpl_fcntl", scope: !211, file: !211, line: 272, type: !212, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !214, variables: !217)
!211 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!212 = !DISubroutineType(types: !213)
!213 = !{!87, !87, !87, null}
!214 = distinct !DICompileUnit(language: DW_LANG_C99, file: !215, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, globals: !216)
!215 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!216 = !{!208}
!217 = !{!218, !219, !220, !233, !234, !237, !240, !243}
!218 = !DILocalVariable(name: "fd", arg: 1, scope: !210, file: !211, line: 272, type: !87)
!219 = !DILocalVariable(name: "action", arg: 2, scope: !210, file: !211, line: 272, type: !87)
!220 = !DILocalVariable(name: "arg", scope: !210, file: !211, line: 274, type: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !222, line: 30, baseType: !223)
!222 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !215, line: 274, baseType: !224)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 192, elements: !231)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !215, line: 274, size: 192, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !225, file: !215, line: 274, baseType: !174, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !225, file: !215, line: 274, baseType: !174, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !225, file: !215, line: 274, baseType: !36, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !225, file: !215, line: 274, baseType: !36, size: 64, offset: 128)
!231 = !{!232}
!232 = !DISubrange(count: 1)
!233 = !DILocalVariable(name: "result", scope: !210, file: !211, line: 275, type: !87)
!234 = !DILocalVariable(name: "target", scope: !235, file: !211, line: 322, type: !87)
!235 = distinct !DILexicalBlock(scope: !236, file: !211, line: 321, column: 7)
!236 = distinct !DILexicalBlock(scope: !210, file: !211, line: 278, column: 5)
!237 = !DILocalVariable(name: "flags", scope: !238, file: !211, line: 359, type: !87)
!238 = distinct !DILexicalBlock(scope: !239, file: !211, line: 358, column: 11)
!239 = distinct !DILexicalBlock(scope: !235, file: !211, line: 357, column: 13)
!240 = !DILocalVariable(name: "saved_errno", scope: !241, file: !211, line: 362, type: !87)
!241 = distinct !DILexicalBlock(scope: !242, file: !211, line: 361, column: 15)
!242 = distinct !DILexicalBlock(scope: !238, file: !211, line: 360, column: 17)
!243 = !DILocalVariable(name: "p", scope: !244, file: !211, line: 404, type: !36)
!244 = distinct !DILexicalBlock(scope: !236, file: !211, line: 402, column: 7)
!245 = !DIGlobalVariableExpression(var: !246)
!246 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !247, file: !591, line: 120, type: !592, isLocal: true, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !249, retainedTypes: !588, globals: !590)
!248 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!249 = !{!250}
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !251, line: 41, size: 32, elements: !252)
!251 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!253 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!254 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!255 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!256 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!257 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!258 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!259 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!260 = !DIEnumerator(name: "DAY_1", value: 131079)
!261 = !DIEnumerator(name: "DAY_2", value: 131080)
!262 = !DIEnumerator(name: "DAY_3", value: 131081)
!263 = !DIEnumerator(name: "DAY_4", value: 131082)
!264 = !DIEnumerator(name: "DAY_5", value: 131083)
!265 = !DIEnumerator(name: "DAY_6", value: 131084)
!266 = !DIEnumerator(name: "DAY_7", value: 131085)
!267 = !DIEnumerator(name: "ABMON_1", value: 131086)
!268 = !DIEnumerator(name: "ABMON_2", value: 131087)
!269 = !DIEnumerator(name: "ABMON_3", value: 131088)
!270 = !DIEnumerator(name: "ABMON_4", value: 131089)
!271 = !DIEnumerator(name: "ABMON_5", value: 131090)
!272 = !DIEnumerator(name: "ABMON_6", value: 131091)
!273 = !DIEnumerator(name: "ABMON_7", value: 131092)
!274 = !DIEnumerator(name: "ABMON_8", value: 131093)
!275 = !DIEnumerator(name: "ABMON_9", value: 131094)
!276 = !DIEnumerator(name: "ABMON_10", value: 131095)
!277 = !DIEnumerator(name: "ABMON_11", value: 131096)
!278 = !DIEnumerator(name: "ABMON_12", value: 131097)
!279 = !DIEnumerator(name: "MON_1", value: 131098)
!280 = !DIEnumerator(name: "MON_2", value: 131099)
!281 = !DIEnumerator(name: "MON_3", value: 131100)
!282 = !DIEnumerator(name: "MON_4", value: 131101)
!283 = !DIEnumerator(name: "MON_5", value: 131102)
!284 = !DIEnumerator(name: "MON_6", value: 131103)
!285 = !DIEnumerator(name: "MON_7", value: 131104)
!286 = !DIEnumerator(name: "MON_8", value: 131105)
!287 = !DIEnumerator(name: "MON_9", value: 131106)
!288 = !DIEnumerator(name: "MON_10", value: 131107)
!289 = !DIEnumerator(name: "MON_11", value: 131108)
!290 = !DIEnumerator(name: "MON_12", value: 131109)
!291 = !DIEnumerator(name: "AM_STR", value: 131110)
!292 = !DIEnumerator(name: "PM_STR", value: 131111)
!293 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!294 = !DIEnumerator(name: "D_FMT", value: 131113)
!295 = !DIEnumerator(name: "T_FMT", value: 131114)
!296 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!297 = !DIEnumerator(name: "ERA", value: 131116)
!298 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!299 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!300 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!301 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!302 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!303 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!304 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!305 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!306 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!307 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!308 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!309 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!310 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!311 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!312 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!313 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!314 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!315 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!316 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!317 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!318 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!319 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!320 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!321 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!322 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!323 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!324 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!325 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!326 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!327 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!328 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!329 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!330 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!331 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!332 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!333 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!334 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!335 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!336 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!337 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!338 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!339 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!340 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!341 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!342 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!343 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!344 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!345 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!346 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!347 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!348 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!349 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!350 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!351 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!352 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!353 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!354 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!355 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!356 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!357 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!358 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!359 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!360 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!361 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!362 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!363 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!364 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!365 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!366 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!367 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!368 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!369 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!370 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!371 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!372 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!373 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!374 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!375 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!376 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!377 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!378 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!379 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!380 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!381 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!382 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!383 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!384 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!385 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!386 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!387 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!388 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!389 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!390 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!391 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!392 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!393 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!394 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!395 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!396 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!397 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!398 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!399 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!400 = !DIEnumerator(name: "CODESET", value: 14)
!401 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!402 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!403 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!404 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!405 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!406 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!407 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!408 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!409 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!410 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!411 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!412 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!413 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!414 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!415 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!416 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!417 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!418 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!419 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!420 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!421 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!422 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!423 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!424 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!425 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!426 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!427 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!428 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!429 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!430 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!431 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!432 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!433 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!434 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!435 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!436 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!437 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!438 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!439 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!440 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!441 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!442 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!443 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!444 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!445 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!446 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!447 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!448 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!449 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!450 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!451 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!452 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!453 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!454 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!455 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!456 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!457 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!458 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!459 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!460 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!461 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!462 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!463 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!464 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!465 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!466 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!467 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!468 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!469 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!470 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!471 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!472 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!473 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!474 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!475 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!476 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!477 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!478 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!479 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!480 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!481 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!482 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!483 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!484 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!485 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!486 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!487 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!488 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!489 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!490 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!491 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!492 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!493 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!494 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!495 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!496 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!497 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!498 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!499 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!500 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!501 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!502 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!503 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!504 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!505 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!506 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!507 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!508 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!509 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!510 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!511 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!512 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!513 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!514 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!515 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!516 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!517 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!518 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!519 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!520 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!521 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!522 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!523 = !DIEnumerator(name: "THOUSEP", value: 65537)
!524 = !DIEnumerator(name: "__GROUPING", value: 65538)
!525 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!526 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!527 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!528 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!529 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!530 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!531 = !DIEnumerator(name: "__YESSTR", value: 327682)
!532 = !DIEnumerator(name: "__NOSTR", value: 327683)
!533 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!534 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!535 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!536 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!537 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!538 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!539 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!540 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!541 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!542 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!543 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!544 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!545 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!546 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!547 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!548 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!549 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!550 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!551 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!552 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!553 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!554 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!555 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!556 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!557 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!558 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!559 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!560 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!561 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!562 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!563 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!564 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!565 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!566 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!567 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!568 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!569 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!570 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!571 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!572 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!573 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!574 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!575 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!576 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!577 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!578 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!579 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!580 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!581 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!582 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!583 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!584 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!585 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!586 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!587 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!588 = !{!36, !34, !589}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!590 = !{!245}
!591 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!592 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !62)
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !595)
!594 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!595 = !{!24}
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107)
!597 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!598 = distinct !DICompileUnit(language: DW_LANG_C99, file: !599, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107)
!599 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !602)
!601 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!602 = !{!603}
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !604, line: 112, baseType: !605)
!604 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !606, line: 62, baseType: !100)
!606 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!607 = distinct !DICompileUnit(language: DW_LANG_C99, file: !608, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !609)
!608 = !DIFile(filename: "./lib/linebuffer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!609 = !{!589}
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107)
!611 = !DIFile(filename: "./lib/memcmp2.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107)
!613 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !616, retainedTypes: !621)
!615 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!616 = !{!617}
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !618, line: 41, size: 32, elements: !619)
!618 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!619 = !{!620}
!620 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!621 = !{!36}
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !624, retainedTypes: !638)
!623 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!624 = !{!625}
!625 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !627, file: !626, line: 192, size: 32, elements: !636)
!626 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!627 = distinct !DISubprogram(name: "x2nrealloc", scope: !626, file: !626, line: 180, type: !628, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !622, variables: !631)
!628 = !DISubroutineType(types: !629)
!629 = !{!36, !36, !630, !98}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!631 = !{!632, !633, !634, !635}
!632 = !DILocalVariable(name: "p", arg: 1, scope: !627, file: !626, line: 180, type: !36)
!633 = !DILocalVariable(name: "pn", arg: 2, scope: !627, file: !626, line: 180, type: !630)
!634 = !DILocalVariable(name: "s", arg: 3, scope: !627, file: !626, line: 180, type: !98)
!635 = !DILocalVariable(name: "n", scope: !627, file: !626, line: 182, type: !98)
!636 = !{!637}
!637 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!638 = !{!98, !34, !36}
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107)
!640 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !643)
!642 = !DIFile(filename: "./lib/xmemcoll.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!643 = !{!10}
!644 = distinct !DICompileUnit(language: DW_LANG_C99, file: !645, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !621)
!645 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!646 = distinct !DICompileUnit(language: DW_LANG_C99, file: !647, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107)
!647 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!648 = distinct !DICompileUnit(language: DW_LANG_C99, file: !649, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !621)
!649 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !621)
!651 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !654)
!653 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!654 = !{!98}
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107)
!656 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107)
!658 = !DIFile(filename: "./lib/memcoll.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!659 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!660 = !{i32 2, !"Dwarf Version", i32 4}
!661 = !{i32 2, !"Debug Info Version", i32 3}
!662 = !{i32 1, !"wchar_size", i32 4}
!663 = !{i32 7, !"PIC Level", i32 2}
!664 = !{i32 7, !"PIE Level", i32 2}
!665 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 106, type: !666, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !668)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !87}
!668 = !{!669}
!669 = !DILocalVariable(name: "status", arg: 1, scope: !665, file: !3, line: 106, type: !87)
!670 = !DIExpression()
!671 = !DILocation(line: 106, column: 12, scope: !665)
!672 = !DILocation(line: 108, column: 14, scope: !673)
!673 = distinct !DILexicalBlock(scope: !665, file: !3, line: 108, column: 7)
!674 = !DILocation(line: 108, column: 7, scope: !665)
!675 = !DILocation(line: 109, column: 5, scope: !676)
!676 = distinct !DILexicalBlock(scope: !673, file: !3, line: 109, column: 5)
!677 = !{!678, !678, i64 0}
!678 = !{!"any pointer", !679, i64 0}
!679 = !{!"omnipotent char", !680, i64 0}
!680 = !{!"Simple C/C++ TBAA"}
!681 = !DILocation(line: 112, column: 7, scope: !682)
!682 = distinct !DILexicalBlock(scope: !673, file: !3, line: 111, column: 5)
!683 = !DILocation(line: 116, column: 7, scope: !682)
!684 = !DILocation(line: 119, column: 7, scope: !682)
!685 = !DILocation(line: 123, column: 7, scope: !682)
!686 = !DILocation(line: 129, column: 7, scope: !682)
!687 = !DILocation(line: 135, column: 7, scope: !682)
!688 = !DILocation(line: 141, column: 7, scope: !682)
!689 = !DILocation(line: 144, column: 7, scope: !682)
!690 = !DILocation(line: 147, column: 7, scope: !682)
!691 = !DILocation(line: 150, column: 7, scope: !682)
!692 = !DILocation(line: 151, column: 7, scope: !682)
!693 = !DILocation(line: 152, column: 7, scope: !682)
!694 = !DILocation(line: 156, column: 7, scope: !682)
!695 = !DILocation(line: 642, column: 15, scope: !58, inlinedAt: !696)
!696 = distinct !DILocation(line: 163, column: 7, scope: !682)
!697 = !DILocation(line: 651, column: 3, scope: !58, inlinedAt: !696)
!698 = !DILocation(line: 655, column: 29, scope: !58, inlinedAt: !696)
!699 = !DILocation(line: 655, column: 15, scope: !58, inlinedAt: !696)
!700 = !DILocation(line: 656, column: 7, scope: !701, inlinedAt: !696)
!701 = distinct !DILexicalBlock(scope: !58, file: !59, line: 656, column: 7)
!702 = !DILocation(line: 656, column: 19, scope: !701, inlinedAt: !696)
!703 = !DILocation(line: 656, column: 22, scope: !701, inlinedAt: !696)
!704 = !DILocation(line: 656, column: 7, scope: !58, inlinedAt: !696)
!705 = !DILocation(line: 662, column: 7, scope: !706, inlinedAt: !696)
!706 = distinct !DILexicalBlock(scope: !701, file: !59, line: 657, column: 5)
!707 = !DILocation(line: 664, column: 5, scope: !706, inlinedAt: !696)
!708 = !DILocation(line: 665, column: 3, scope: !58, inlinedAt: !696)
!709 = !DILocation(line: 667, column: 3, scope: !58, inlinedAt: !696)
!710 = !DILocation(line: 165, column: 3, scope: !665)
!711 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 407, type: !712, isLocal: false, isDefinition: true, scopeLine: 408, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !715)
!712 = !DISubroutineType(types: !713)
!713 = !{!87, !87, !714}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!715 = !{!716, !717, !718}
!716 = !DILocalVariable(name: "argc", arg: 1, scope: !711, file: !3, line: 407, type: !87)
!717 = !DILocalVariable(name: "argv", arg: 2, scope: !711, file: !3, line: 407, type: !714)
!718 = !DILocalVariable(name: "c", scope: !711, file: !3, line: 409, type: !87)
!719 = !DILocalVariable(name: "lba", scope: !720, file: !3, line: 257, type: !818)
!720 = distinct !DISubprogram(name: "compare_files", scope: !3, file: !3, line: 254, type: !721, isLocal: true, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !723)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !714}
!723 = !{!724, !719, !725, !734, !738, !742, !796, !799, !800, !801, !803, !804, !810, !816, !817}
!724 = !DILocalVariable(name: "infiles", arg: 1, scope: !720, file: !3, line: 254, type: !714)
!725 = !DILocalVariable(name: "thisline", scope: !720, file: !3, line: 261, type: !726)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 128, elements: !50)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !729, line: 26, size: 192, elements: !730)
!729 = !DIFile(filename: "./lib/linebuffer.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!730 = !{!731, !732, !733}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !728, file: !729, line: 28, baseType: !98, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !728, file: !729, line: 29, baseType: !98, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !728, file: !729, line: 30, baseType: !34, size: 64, offset: 128)
!734 = !DILocalVariable(name: "all_line", scope: !720, file: !3, line: 266, type: !735)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 512, elements: !736)
!736 = !{!51, !737}
!737 = !DISubrange(count: 4)
!738 = !DILocalVariable(name: "alt", scope: !720, file: !3, line: 269, type: !739)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 192, elements: !740)
!740 = !{!51, !741}
!741 = !DISubrange(count: 3)
!742 = !DILocalVariable(name: "streams", scope: !720, file: !3, line: 272, type: !743)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 128, elements: !50)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !746, line: 7, baseType: !747)
!746 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !748, line: 241, size: 1728, elements: !749)
!748 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !770, !771, !772, !773, !776, !777, !779, !781, !784, !786, !787, !788, !789, !790, !791, !792}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !747, file: !748, line: 242, baseType: !87, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !747, file: !748, line: 247, baseType: !34, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !747, file: !748, line: 248, baseType: !34, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !747, file: !748, line: 249, baseType: !34, size: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !747, file: !748, line: 250, baseType: !34, size: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !747, file: !748, line: 251, baseType: !34, size: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !747, file: !748, line: 252, baseType: !34, size: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !747, file: !748, line: 253, baseType: !34, size: 64, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !747, file: !748, line: 254, baseType: !34, size: 64, offset: 512)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !747, file: !748, line: 256, baseType: !34, size: 64, offset: 576)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !747, file: !748, line: 257, baseType: !34, size: 64, offset: 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !747, file: !748, line: 258, baseType: !34, size: 64, offset: 704)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !747, file: !748, line: 260, baseType: !763, size: 64, offset: 768)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !748, line: 156, size: 192, elements: !765)
!765 = !{!766, !767, !769}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !764, file: !748, line: 157, baseType: !763, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !764, file: !748, line: 158, baseType: !768, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !764, file: !748, line: 162, baseType: !87, size: 32, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !747, file: !748, line: 262, baseType: !768, size: 64, offset: 832)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !747, file: !748, line: 264, baseType: !87, size: 32, offset: 896)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !747, file: !748, line: 268, baseType: !87, size: 32, offset: 928)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !747, file: !748, line: 270, baseType: !774, size: 64, offset: 960)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !606, line: 140, baseType: !775)
!775 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !747, file: !748, line: 274, baseType: !157, size: 16, offset: 1024)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !747, file: !748, line: 275, baseType: !778, size: 8, offset: 1040)
!778 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !747, file: !748, line: 276, baseType: !780, size: 8, offset: 1048)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, elements: !231)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !747, file: !748, line: 280, baseType: !782, size: 64, offset: 1088)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !748, line: 150, baseType: null)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !747, file: !748, line: 289, baseType: !785, size: 64, offset: 1152)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !606, line: 141, baseType: !775)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !747, file: !748, line: 297, baseType: !36, size: 64, offset: 1216)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !747, file: !748, line: 298, baseType: !36, size: 64, offset: 1280)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !747, file: !748, line: 299, baseType: !36, size: 64, offset: 1344)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !747, file: !748, line: 300, baseType: !36, size: 64, offset: 1408)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !747, file: !748, line: 302, baseType: !98, size: 64, offset: 1472)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !747, file: !748, line: 303, baseType: !87, size: 32, offset: 1536)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !747, file: !748, line: 305, baseType: !793, size: 160, offset: 1568)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 20)
!796 = !DILocalVariable(name: "total", scope: !720, file: !3, line: 275, type: !797)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 192, elements: !798)
!798 = !{!741}
!799 = !DILocalVariable(name: "i", scope: !720, file: !3, line: 277, type: !87)
!800 = !DILocalVariable(name: "j", scope: !720, file: !3, line: 277, type: !87)
!801 = !DILocalVariable(name: "order", scope: !802, file: !3, line: 304, type: !87)
!802 = distinct !DILexicalBlock(scope: !720, file: !3, line: 303, column: 5)
!803 = !DILocalVariable(name: "fill_up", scope: !802, file: !3, line: 305, type: !49)
!804 = !DILocalVariable(name: "len", scope: !805, file: !3, line: 320, type: !98)
!805 = distinct !DILexicalBlock(scope: !806, file: !3, line: 319, column: 13)
!806 = distinct !DILexicalBlock(scope: !807, file: !3, line: 315, column: 15)
!807 = distinct !DILexicalBlock(scope: !808, file: !3, line: 314, column: 9)
!808 = distinct !DILexicalBlock(scope: !809, file: !3, line: 311, column: 16)
!809 = distinct !DILexicalBlock(scope: !802, file: !3, line: 309, column: 11)
!810 = !DILocalVariable(name: "buf1", scope: !811, file: !3, line: 395, type: !813)
!811 = distinct !DILexicalBlock(scope: !812, file: !3, line: 393, column: 5)
!812 = distinct !DILexicalBlock(scope: !720, file: !3, line: 392, column: 7)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 168, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 21)
!816 = !DILocalVariable(name: "buf2", scope: !811, file: !3, line: 396, type: !813)
!817 = !DILocalVariable(name: "buf3", scope: !811, file: !3, line: 397, type: !813)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 1536, elements: !736)
!819 = !DILocation(line: 257, column: 21, scope: !720, inlinedAt: !820)
!820 = distinct !DILocation(line: 493, column: 3, scope: !711)
!821 = !DILocation(line: 266, column: 22, scope: !720, inlinedAt: !820)
!822 = !DILocation(line: 395, column: 12, scope: !811, inlinedAt: !820)
!823 = !DILocation(line: 396, column: 12, scope: !811, inlinedAt: !820)
!824 = !DILocation(line: 397, column: 12, scope: !811, inlinedAt: !820)
!825 = !DILocation(line: 407, column: 11, scope: !711)
!826 = !DILocation(line: 407, column: 24, scope: !711)
!827 = !DILocation(line: 412, column: 21, scope: !711)
!828 = !DILocation(line: 412, column: 3, scope: !711)
!829 = !DILocation(line: 413, column: 3, scope: !711)
!830 = !DILocation(line: 414, column: 3, scope: !711)
!831 = !DILocation(line: 415, column: 3, scope: !711)
!832 = !DILocation(line: 416, column: 21, scope: !711)
!833 = !DILocation(line: 416, column: 19, scope: !711)
!834 = !{!835, !835, i64 0}
!835 = !{!"_Bool", !679, i64 0}
!836 = !DILocation(line: 418, column: 3, scope: !711)
!837 = !DILocation(line: 425, column: 59, scope: !711)
!838 = !DILocation(line: 425, column: 30, scope: !711)
!839 = !DILocation(line: 426, column: 21, scope: !711)
!840 = !{!679, !679, i64 0}
!841 = !DILocation(line: 429, column: 3, scope: !711)
!842 = !DILocation(line: 429, column: 15, scope: !711)
!843 = !DILocation(line: 409, column: 7, scope: !711)
!844 = !DILocation(line: 434, column: 9, scope: !845)
!845 = distinct !DILexicalBlock(scope: !711, file: !3, line: 431, column: 7)
!846 = !DILocation(line: 438, column: 9, scope: !845)
!847 = !DILocation(line: 442, column: 9, scope: !845)
!848 = !DILocation(line: 446, column: 9, scope: !845)
!849 = !DILocation(line: 449, column: 27, scope: !845)
!850 = !DILocation(line: 450, column: 9, scope: !845)
!851 = !DILocation(line: 453, column: 27, scope: !845)
!852 = !DILocation(line: 454, column: 9, scope: !845)
!853 = !DILocation(line: 457, column: 13, scope: !854)
!854 = distinct !DILexicalBlock(scope: !845, file: !3, line: 457, column: 13)
!855 = !{!856, !856, i64 0}
!856 = !{!"long", !679, i64 0}
!857 = !DILocation(line: 457, column: 25, scope: !854)
!858 = !DILocation(line: 459, column: 19, scope: !845)
!859 = !DILocation(line: 457, column: 29, scope: !854)
!860 = !DILocation(line: 457, column: 13, scope: !845)
!861 = !DILocation(line: 458, column: 11, scope: !854)
!862 = !DILocation(line: 459, column: 17, scope: !845)
!863 = !DILocation(line: 460, column: 24, scope: !845)
!864 = !DILocation(line: 460, column: 23, scope: !845)
!865 = !DILocation(line: 460, column: 33, scope: !845)
!866 = !DILocation(line: 460, column: 21, scope: !845)
!867 = !DILocation(line: 461, column: 9, scope: !845)
!868 = !DILocation(line: 465, column: 9, scope: !845)
!869 = distinct !{!869, !841, !870}
!870 = !DILocation(line: 473, column: 7, scope: !711)
!871 = !DILocation(line: 467, column: 7, scope: !845)
!872 = !DILocation(line: 469, column: 7, scope: !845)
!873 = !DILocation(line: 472, column: 9, scope: !845)
!874 = !DILocation(line: 475, column: 9, scope: !875)
!875 = distinct !DILexicalBlock(scope: !711, file: !3, line: 475, column: 7)
!876 = !DILocation(line: 475, column: 7, scope: !711)
!877 = !DILocation(line: 476, column: 17, scope: !875)
!878 = !DILocation(line: 476, column: 5, scope: !875)
!879 = !DILocation(line: 478, column: 14, scope: !880)
!880 = distinct !DILexicalBlock(scope: !711, file: !3, line: 478, column: 7)
!881 = !{!882, !882, i64 0}
!882 = !{!"int", !679, i64 0}
!883 = !DILocation(line: 478, column: 12, scope: !880)
!884 = !DILocation(line: 478, column: 21, scope: !880)
!885 = !DILocation(line: 478, column: 7, scope: !711)
!886 = !DILocation(line: 480, column: 16, scope: !887)
!887 = distinct !DILexicalBlock(scope: !888, file: !3, line: 480, column: 11)
!888 = distinct !DILexicalBlock(scope: !880, file: !3, line: 479, column: 5)
!889 = !DILocation(line: 480, column: 11, scope: !888)
!890 = !DILocation(line: 481, column: 22, scope: !887)
!891 = !DILocation(line: 481, column: 9, scope: !887)
!892 = !DILocation(line: 483, column: 22, scope: !887)
!893 = !DILocation(line: 483, column: 70, scope: !887)
!894 = !DILocation(line: 483, column: 60, scope: !887)
!895 = !DILocation(line: 483, column: 53, scope: !887)
!896 = !DILocation(line: 483, column: 9, scope: !887)
!897 = !DILocation(line: 484, column: 7, scope: !888)
!898 = !DILocation(line: 487, column: 9, scope: !899)
!899 = distinct !DILexicalBlock(scope: !711, file: !3, line: 487, column: 7)
!900 = !DILocation(line: 487, column: 7, scope: !711)
!901 = !DILocation(line: 489, column: 20, scope: !902)
!902 = distinct !DILexicalBlock(scope: !899, file: !3, line: 488, column: 5)
!903 = !DILocation(line: 489, column: 55, scope: !902)
!904 = !DILocation(line: 489, column: 62, scope: !902)
!905 = !DILocation(line: 489, column: 50, scope: !902)
!906 = !DILocation(line: 489, column: 43, scope: !902)
!907 = !DILocation(line: 489, column: 7, scope: !902)
!908 = !DILocation(line: 490, column: 7, scope: !902)
!909 = !DILocation(line: 493, column: 23, scope: !711)
!910 = !DILocation(line: 254, column: 23, scope: !720, inlinedAt: !820)
!911 = !DILocation(line: 257, column: 3, scope: !720, inlinedAt: !820)
!912 = !DILocation(line: 266, column: 3, scope: !720, inlinedAt: !820)
!913 = !DILocation(line: 275, column: 13, scope: !720, inlinedAt: !820)
!914 = !DIExpression(DW_OP_LLVM_fragment, 0, 64)
!915 = !DIExpression(DW_OP_LLVM_fragment, 64, 64)
!916 = !DIExpression(DW_OP_LLVM_fragment, 128, 64)
!917 = !DILocation(line: 277, column: 7, scope: !720, inlinedAt: !820)
!918 = !DILocation(line: 277, column: 10, scope: !720, inlinedAt: !820)
!919 = !DILocation(line: 284, column: 24, scope: !920, inlinedAt: !820)
!920 = distinct !DILexicalBlock(scope: !921, file: !3, line: 283, column: 9)
!921 = distinct !DILexicalBlock(scope: !922, file: !3, line: 282, column: 7)
!922 = distinct !DILexicalBlock(scope: !923, file: !3, line: 282, column: 7)
!923 = distinct !DILexicalBlock(scope: !924, file: !3, line: 281, column: 5)
!924 = distinct !DILexicalBlock(scope: !925, file: !3, line: 280, column: 3)
!925 = distinct !DILexicalBlock(scope: !720, file: !3, line: 280, column: 3)
!926 = !DILocation(line: 284, column: 11, scope: !920, inlinedAt: !820)
!927 = !DILocation(line: 285, column: 11, scope: !920, inlinedAt: !820)
!928 = !DILocation(line: 285, column: 26, scope: !920, inlinedAt: !820)
!929 = !DILocation(line: 290, column: 21, scope: !923, inlinedAt: !820)
!930 = !DILocation(line: 290, column: 47, scope: !923, inlinedAt: !820)
!931 = !DILocation(line: 290, column: 55, scope: !923, inlinedAt: !820)
!932 = !DILocation(line: 291, column: 12, scope: !933, inlinedAt: !820)
!933 = distinct !DILexicalBlock(scope: !923, file: !3, line: 291, column: 11)
!934 = !DILocation(line: 291, column: 11, scope: !923, inlinedAt: !820)
!935 = !DILocation(line: 292, column: 9, scope: !933, inlinedAt: !820)
!936 = !DILocation(line: 294, column: 7, scope: !923, inlinedAt: !820)
!937 = !DILocation(line: 296, column: 21, scope: !923, inlinedAt: !820)
!938 = !DILocalVariable(name: "__stream", arg: 1, scope: !939, file: !940, line: 132, type: !744)
!939 = distinct !DISubprogram(name: "ferror_unlocked", scope: !940, file: !940, line: 132, type: !941, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !943)
!940 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!941 = !DISubroutineType(types: !942)
!942 = !{!87, !744}
!943 = !{!938}
!944 = !DILocation(line: 132, column: 1, scope: !939, inlinedAt: !945)
!945 = distinct !DILocation(line: 298, column: 11, scope: !946, inlinedAt: !820)
!946 = distinct !DILexicalBlock(scope: !923, file: !3, line: 298, column: 11)
!947 = !DILocation(line: 134, column: 10, scope: !939, inlinedAt: !945)
!948 = !{!949, !882, i64 0}
!949 = !{!"_IO_FILE", !882, i64 0, !678, i64 8, !678, i64 16, !678, i64 24, !678, i64 32, !678, i64 40, !678, i64 48, !678, i64 56, !678, i64 64, !678, i64 72, !678, i64 80, !678, i64 88, !678, i64 96, !678, i64 104, !882, i64 112, !882, i64 116, !856, i64 120, !950, i64 128, !679, i64 130, !679, i64 131, !678, i64 136, !856, i64 144, !678, i64 152, !678, i64 160, !678, i64 168, !678, i64 176, !856, i64 184, !882, i64 192, !679, i64 196}
!950 = !{!"short", !679, i64 0}
!951 = !DILocation(line: 298, column: 11, scope: !946, inlinedAt: !820)
!952 = !DILocation(line: 298, column: 11, scope: !923, inlinedAt: !820)
!953 = !DILocation(line: 299, column: 9, scope: !946, inlinedAt: !820)
!954 = !DILocation(line: 305, column: 12, scope: !802, inlinedAt: !820)
!955 = !DILocation(line: 309, column: 12, scope: !809, inlinedAt: !820)
!956 = !DILocation(line: 309, column: 11, scope: !802, inlinedAt: !820)
!957 = !DILocation(line: 339, column: 15, scope: !958, inlinedAt: !820)
!958 = distinct !DILexicalBlock(scope: !959, file: !3, line: 337, column: 9)
!959 = distinct !DILexicalBlock(scope: !802, file: !3, line: 330, column: 11)
!960 = !DILocation(line: 311, column: 17, scope: !808, inlinedAt: !820)
!961 = !DILocation(line: 311, column: 16, scope: !809, inlinedAt: !820)
!962 = !DILocation(line: 315, column: 15, scope: !806, inlinedAt: !820)
!963 = !{i8 0, i8 2}
!964 = !DILocation(line: 315, column: 15, scope: !807, inlinedAt: !820)
!965 = !DILocation(line: 316, column: 44, scope: !806, inlinedAt: !820)
!966 = !{!967, !678, i64 16}
!967 = !{!"linebuffer", !856, i64 0, !856, i64 8, !678, i64 16}
!968 = !DILocation(line: 316, column: 65, scope: !806, inlinedAt: !820)
!969 = !{!967, !856, i64 8}
!970 = !DILocation(line: 316, column: 72, scope: !806, inlinedAt: !820)
!971 = !DILocation(line: 317, column: 44, scope: !806, inlinedAt: !820)
!972 = !DILocation(line: 317, column: 65, scope: !806, inlinedAt: !820)
!973 = !DILocation(line: 317, column: 72, scope: !806, inlinedAt: !820)
!974 = !DILocation(line: 316, column: 21, scope: !806, inlinedAt: !820)
!975 = !DILocation(line: 304, column: 11, scope: !802, inlinedAt: !820)
!976 = !DILocation(line: 316, column: 13, scope: !806, inlinedAt: !820)
!977 = !DILocation(line: 320, column: 28, scope: !805, inlinedAt: !820)
!978 = !DILocation(line: 320, column: 75, scope: !805, inlinedAt: !820)
!979 = !DILocation(line: 320, column: 22, scope: !805, inlinedAt: !820)
!980 = !DILocation(line: 321, column: 44, scope: !805, inlinedAt: !820)
!981 = !DILocation(line: 321, column: 65, scope: !805, inlinedAt: !820)
!982 = !DILocation(line: 321, column: 23, scope: !805, inlinedAt: !820)
!983 = !DILocation(line: 322, column: 25, scope: !984, inlinedAt: !820)
!984 = distinct !DILexicalBlock(scope: !805, file: !3, line: 322, column: 19)
!985 = !DILocation(line: 322, column: 19, scope: !805, inlinedAt: !820)
!986 = !DILocation(line: 325, column: 48, scope: !984, inlinedAt: !820)
!987 = !DILocation(line: 330, column: 17, scope: !959, inlinedAt: !820)
!988 = !DILocation(line: 330, column: 11, scope: !802, inlinedAt: !820)
!989 = !DILocation(line: 333, column: 19, scope: !990, inlinedAt: !820)
!990 = distinct !DILexicalBlock(scope: !959, file: !3, line: 331, column: 9)
!991 = !DILocation(line: 334, column: 35, scope: !990, inlinedAt: !820)
!992 = !DILocalVariable(name: "line", arg: 1, scope: !993, file: !3, line: 174, type: !996)
!993 = distinct !DISubprogram(name: "writeline", scope: !3, file: !3, line: 174, type: !994, isLocal: true, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !998)
!994 = !DISubroutineType(types: !995)
!995 = !{null, !996, !744, !87}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!998 = !{!992, !999, !1000}
!999 = !DILocalVariable(name: "stream", arg: 2, scope: !993, file: !3, line: 174, type: !744)
!1000 = !DILocalVariable(name: "class", arg: 3, scope: !993, file: !3, line: 174, type: !87)
!1001 = !DILocation(line: 174, column: 37, scope: !993, inlinedAt: !1002)
!1002 = distinct !DILocation(line: 334, column: 11, scope: !990, inlinedAt: !820)
!1003 = !DILocation(line: 174, column: 49, scope: !993, inlinedAt: !1002)
!1004 = !DILocation(line: 174, column: 61, scope: !993, inlinedAt: !1002)
!1005 = !DILocation(line: 191, column: 11, scope: !1006, inlinedAt: !1002)
!1006 = distinct !DILexicalBlock(scope: !993, file: !3, line: 177, column: 5)
!1007 = !DILocation(line: 193, column: 11, scope: !1006, inlinedAt: !1002)
!1008 = !DILocation(line: 194, column: 9, scope: !1009, inlinedAt: !1002)
!1009 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 193, column: 11)
!1010 = !DILocation(line: 195, column: 11, scope: !1006, inlinedAt: !1002)
!1011 = !DILocation(line: 196, column: 9, scope: !1012, inlinedAt: !1002)
!1012 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 195, column: 11)
!1013 = !DILocation(line: 200, column: 3, scope: !993, inlinedAt: !1002)
!1014 = !DILocation(line: 201, column: 1, scope: !993, inlinedAt: !1002)
!1015 = !DILocation(line: 339, column: 21, scope: !1016, inlinedAt: !820)
!1016 = distinct !DILexicalBlock(scope: !958, file: !3, line: 339, column: 15)
!1017 = !DILocation(line: 342, column: 23, scope: !1018, inlinedAt: !820)
!1018 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 340, column: 13)
!1019 = !DILocation(line: 174, column: 37, scope: !993, inlinedAt: !1020)
!1020 = distinct !DILocation(line: 343, column: 15, scope: !1018, inlinedAt: !820)
!1021 = !DILocation(line: 174, column: 61, scope: !993, inlinedAt: !1020)
!1022 = !DILocation(line: 179, column: 11, scope: !1006, inlinedAt: !1020)
!1023 = !DILocation(line: 343, column: 39, scope: !1018, inlinedAt: !820)
!1024 = !DILocation(line: 200, column: 3, scope: !993, inlinedAt: !1020)
!1025 = !DILocation(line: 201, column: 1, scope: !993, inlinedAt: !1020)
!1026 = !DILocation(line: 348, column: 23, scope: !1027, inlinedAt: !820)
!1027 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 346, column: 13)
!1028 = !DILocation(line: 349, column: 39, scope: !1027, inlinedAt: !820)
!1029 = !DILocation(line: 174, column: 37, scope: !993, inlinedAt: !1030)
!1030 = distinct !DILocation(line: 349, column: 15, scope: !1027, inlinedAt: !820)
!1031 = !DILocation(line: 174, column: 49, scope: !993, inlinedAt: !1030)
!1032 = !DILocation(line: 174, column: 61, scope: !993, inlinedAt: !1030)
!1033 = !DILocation(line: 184, column: 11, scope: !1006, inlinedAt: !1030)
!1034 = !DILocation(line: 186, column: 11, scope: !1006, inlinedAt: !1030)
!1035 = !DILocation(line: 187, column: 9, scope: !1036, inlinedAt: !1030)
!1036 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 186, column: 11)
!1037 = !DILocation(line: 200, column: 3, scope: !993, inlinedAt: !1030)
!1038 = !DILocation(line: 201, column: 1, scope: !993, inlinedAt: !1030)
!1039 = !DILocation(line: 366, column: 36, scope: !1040, inlinedAt: !820)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 362, column: 11)
!1041 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 361, column: 13)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 360, column: 7)
!1043 = distinct !DILexicalBlock(scope: !802, file: !3, line: 360, column: 7)
!1044 = !DILocation(line: 366, column: 41, scope: !1040, inlinedAt: !820)
!1045 = !DILocation(line: 368, column: 49, scope: !1040, inlinedAt: !820)
!1046 = !DILocation(line: 368, column: 27, scope: !1040, inlinedAt: !820)
!1047 = !DILocation(line: 371, column: 17, scope: !1048, inlinedAt: !820)
!1048 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 371, column: 17)
!1049 = !DILocation(line: 371, column: 17, scope: !1040, inlinedAt: !820)
!1050 = !DILocation(line: 372, column: 28, scope: !1048, inlinedAt: !820)
!1051 = !DILocation(line: 372, column: 15, scope: !1048, inlinedAt: !820)
!1052 = !DILocation(line: 377, column: 22, scope: !1053, inlinedAt: !820)
!1053 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 377, column: 22)
!1054 = !DILocation(line: 377, column: 46, scope: !1053, inlinedAt: !820)
!1055 = !DILocation(line: 377, column: 22, scope: !1048, inlinedAt: !820)
!1056 = !DILocation(line: 379, column: 28, scope: !1053, inlinedAt: !820)
!1057 = !DILocation(line: 378, column: 15, scope: !1053, inlinedAt: !820)
!1058 = !DILocation(line: 132, column: 1, scope: !939, inlinedAt: !1059)
!1059 = distinct !DILocation(line: 381, column: 17, scope: !1060, inlinedAt: !820)
!1060 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 381, column: 17)
!1061 = !DILocation(line: 134, column: 10, scope: !939, inlinedAt: !1059)
!1062 = !DILocation(line: 381, column: 17, scope: !1060, inlinedAt: !820)
!1063 = !DILocation(line: 381, column: 17, scope: !1040, inlinedAt: !820)
!1064 = !DILocation(line: 382, column: 15, scope: !1060, inlinedAt: !820)
!1065 = !DILocation(line: 361, column: 13, scope: !1041, inlinedAt: !820)
!1066 = !DILocation(line: 361, column: 13, scope: !1042, inlinedAt: !820)
!1067 = !DILocation(line: 389, column: 9, scope: !1068, inlinedAt: !820)
!1068 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 389, column: 9)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 388, column: 3)
!1070 = distinct !DILexicalBlock(scope: !720, file: !3, line: 388, column: 3)
!1071 = !DILocation(line: 389, column: 29, scope: !1068, inlinedAt: !820)
!1072 = !DILocation(line: 389, column: 9, scope: !1069, inlinedAt: !820)
!1073 = !DILocation(line: 390, column: 7, scope: !1068, inlinedAt: !820)
!1074 = !DILocation(line: 395, column: 7, scope: !811, inlinedAt: !820)
!1075 = !DILocation(line: 396, column: 7, scope: !811, inlinedAt: !820)
!1076 = !DILocation(line: 397, column: 7, scope: !811, inlinedAt: !820)
!1077 = !DILocation(line: 398, column: 7, scope: !811, inlinedAt: !820)
!1078 = !DILocation(line: 403, column: 5, scope: !812, inlinedAt: !820)
!1079 = !DILocation(line: 403, column: 5, scope: !811, inlinedAt: !820)
!1080 = !DILocation(line: 392, column: 7, scope: !720, inlinedAt: !820)
!1081 = !DILocation(line: 302, column: 25, scope: !720, inlinedAt: !820)
!1082 = !DILocation(line: 302, column: 10, scope: !720, inlinedAt: !820)
!1083 = !DILocation(line: 302, column: 22, scope: !720, inlinedAt: !820)
!1084 = !DILocation(line: 302, column: 3, scope: !720, inlinedAt: !820)
!1085 = distinct !{!1085, !1086, !1087}
!1086 = !DILocation(line: 302, column: 3, scope: !720)
!1087 = !DILocation(line: 386, column: 5, scope: !720)
!1088 = !DILocation(line: 404, column: 1, scope: !720, inlinedAt: !820)
!1089 = !DILocation(line: 495, column: 7, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !711, file: !3, line: 495, column: 7)
!1091 = !DILocation(line: 495, column: 37, scope: !1090)
!1092 = !DILocation(line: 495, column: 34, scope: !1090)
!1093 = !DILocation(line: 499, column: 1, scope: !711)
!1094 = distinct !DISubprogram(name: "check_order", scope: !3, file: !3, line: 215, type: !1095, isLocal: true, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1097)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{null, !996, !996, !87}
!1097 = !{!1098, !1099, !1100, !1101}
!1098 = !DILocalVariable(name: "prev", arg: 1, scope: !1094, file: !3, line: 215, type: !996)
!1099 = !DILocalVariable(name: "current", arg: 2, scope: !1094, file: !3, line: 216, type: !996)
!1100 = !DILocalVariable(name: "whatfile", arg: 3, scope: !1094, file: !3, line: 217, type: !87)
!1101 = !DILocalVariable(name: "order", scope: !1102, file: !3, line: 225, type: !87)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 224, column: 9)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 223, column: 11)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 222, column: 5)
!1105 = distinct !DILexicalBlock(scope: !1094, file: !3, line: 220, column: 7)
!1106 = !DILocation(line: 215, column: 39, scope: !1094)
!1107 = !DILocation(line: 216, column: 39, scope: !1094)
!1108 = !DILocation(line: 217, column: 18, scope: !1094)
!1109 = !DILocation(line: 220, column: 7, scope: !1105)
!1110 = !DILocation(line: 221, column: 7, scope: !1105)
!1111 = !DILocation(line: 220, column: 7, scope: !1094)
!1112 = !DILocation(line: 223, column: 45, scope: !1103)
!1113 = !DILocation(line: 223, column: 12, scope: !1103)
!1114 = !DILocation(line: 223, column: 11, scope: !1104)
!1115 = !DILocation(line: 227, column: 15, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 227, column: 15)
!1117 = !DILocation(line: 227, column: 15, scope: !1102)
!1118 = !DILocation(line: 228, column: 21, scope: !1116)
!1119 = !DILocation(line: 225, column: 15, scope: !1102)
!1120 = !DILocation(line: 228, column: 13, scope: !1116)
!1121 = !DILocation(line: 231, column: 21, scope: !1116)
!1122 = !DILocation(line: 234, column: 17, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 234, column: 15)
!1124 = !DILocation(line: 234, column: 15, scope: !1102)
!1125 = !DILocation(line: 236, column: 23, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 235, column: 13)
!1127 = !DILocation(line: 236, column: 41, scope: !1126)
!1128 = !DILocation(line: 238, column: 25, scope: !1126)
!1129 = !DILocation(line: 236, column: 15, scope: !1126)
!1130 = !DILocation(line: 242, column: 53, scope: !1126)
!1131 = !DILocation(line: 243, column: 13, scope: !1126)
!1132 = !DILocation(line: 246, column: 1, scope: !1094)
!1133 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !116, file: !116, line: 41, type: !60, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !111, variables: !1134)
!1134 = !{!1135}
!1135 = !DILocalVariable(name: "file", arg: 1, scope: !1133, file: !116, line: 41, type: !62)
!1136 = !DILocation(line: 41, column: 41, scope: !1133)
!1137 = !DILocation(line: 43, column: 13, scope: !1133)
!1138 = !DILocation(line: 44, column: 1, scope: !1133)
!1139 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !116, file: !116, line: 78, type: !1140, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !111, variables: !1142)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{null, !40}
!1142 = !{!1143}
!1143 = !DILocalVariable(name: "ignore", arg: 1, scope: !1139, file: !116, line: 78, type: !40)
!1144 = !DILocation(line: 78, column: 37, scope: !1139)
!1145 = !DILocation(line: 80, column: 16, scope: !1139)
!1146 = !DILocation(line: 81, column: 1, scope: !1139)
!1147 = distinct !DISubprogram(name: "close_stdout", scope: !116, file: !116, line: 107, type: !1148, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, unit: !111, variables: !1150)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{null}
!1150 = !{!1151}
!1151 = !DILocalVariable(name: "write_error", scope: !1152, file: !116, line: 112, type: !62)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !116, line: 111, column: 5)
!1153 = distinct !DILexicalBlock(scope: !1147, file: !116, line: 109, column: 7)
!1154 = !DILocation(line: 109, column: 21, scope: !1153)
!1155 = !DILocation(line: 109, column: 7, scope: !1153)
!1156 = !DILocation(line: 109, column: 29, scope: !1153)
!1157 = !DILocation(line: 110, column: 7, scope: !1153)
!1158 = !DILocation(line: 110, column: 12, scope: !1153)
!1159 = !DILocation(line: 114, column: 19, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1152, file: !116, line: 113, column: 11)
!1161 = !DILocation(line: 110, column: 25, scope: !1153)
!1162 = !DILocation(line: 110, column: 28, scope: !1153)
!1163 = !DILocation(line: 110, column: 34, scope: !1153)
!1164 = !DILocation(line: 109, column: 7, scope: !1147)
!1165 = !DILocation(line: 112, column: 33, scope: !1152)
!1166 = !DILocation(line: 112, column: 19, scope: !1152)
!1167 = !DILocation(line: 113, column: 11, scope: !1160)
!1168 = !DILocation(line: 113, column: 11, scope: !1152)
!1169 = !DILocation(line: 114, column: 36, scope: !1160)
!1170 = !DILocation(line: 114, column: 9, scope: !1160)
!1171 = !DILocation(line: 117, column: 9, scope: !1160)
!1172 = !DILocation(line: 119, column: 14, scope: !1152)
!1173 = !DILocation(line: 119, column: 7, scope: !1152)
!1174 = !DILocation(line: 122, column: 22, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1147, file: !116, line: 122, column: 8)
!1176 = !DILocation(line: 122, column: 8, scope: !1175)
!1177 = !DILocation(line: 122, column: 30, scope: !1175)
!1178 = !DILocation(line: 122, column: 8, scope: !1147)
!1179 = !DILocation(line: 123, column: 13, scope: !1175)
!1180 = !DILocation(line: 123, column: 6, scope: !1175)
!1181 = !DILocation(line: 124, column: 1, scope: !1147)
!1182 = distinct !DISubprogram(name: "fdadvise", scope: !1183, file: !1183, line: 31, type: !1184, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !593, variables: !1189)
!1183 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1184 = !DISubroutineType(types: !1185)
!1185 = !{null, !87, !1186, !1186, !1188}
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !1187, line: 57, baseType: !774)
!1187 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "fadvice_t", file: !25, line: 52, baseType: !24)
!1189 = !{!1190, !1191, !1192, !1193, !1194}
!1190 = !DILocalVariable(name: "fd", arg: 1, scope: !1182, file: !1183, line: 31, type: !87)
!1191 = !DILocalVariable(name: "offset", arg: 2, scope: !1182, file: !1183, line: 31, type: !1186)
!1192 = !DILocalVariable(name: "len", arg: 3, scope: !1182, file: !1183, line: 31, type: !1186)
!1193 = !DILocalVariable(name: "advice", arg: 4, scope: !1182, file: !1183, line: 31, type: !1188)
!1194 = !DILocalVariable(name: "__x", scope: !1195, file: !1183, line: 34, type: !87)
!1195 = distinct !DILexicalBlock(scope: !1182, file: !1183, line: 34, column: 3)
!1196 = !DILocation(line: 31, column: 15, scope: !1182)
!1197 = !DILocation(line: 31, column: 25, scope: !1182)
!1198 = !DILocation(line: 31, column: 39, scope: !1182)
!1199 = !DILocation(line: 31, column: 54, scope: !1182)
!1200 = !DILocation(line: 34, column: 3, scope: !1195)
!1201 = !DILocation(line: 36, column: 1, scope: !1182)
!1202 = distinct !DISubprogram(name: "fadvise", scope: !1183, file: !1183, line: 39, type: !1203, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !593, variables: !1245)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{null, !1205, !1188}
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !746, line: 7, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !748, line: 241, size: 1728, elements: !1208)
!1208 = !{!1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1207, file: !748, line: 242, baseType: !87, size: 32)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1207, file: !748, line: 247, baseType: !34, size: 64, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1207, file: !748, line: 248, baseType: !34, size: 64, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1207, file: !748, line: 249, baseType: !34, size: 64, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1207, file: !748, line: 250, baseType: !34, size: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1207, file: !748, line: 251, baseType: !34, size: 64, offset: 320)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1207, file: !748, line: 252, baseType: !34, size: 64, offset: 384)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1207, file: !748, line: 253, baseType: !34, size: 64, offset: 448)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1207, file: !748, line: 254, baseType: !34, size: 64, offset: 512)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1207, file: !748, line: 256, baseType: !34, size: 64, offset: 576)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1207, file: !748, line: 257, baseType: !34, size: 64, offset: 640)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1207, file: !748, line: 258, baseType: !34, size: 64, offset: 704)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1207, file: !748, line: 260, baseType: !1222, size: 64, offset: 768)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !748, line: 156, size: 192, elements: !1224)
!1224 = !{!1225, !1226, !1228}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1223, file: !748, line: 157, baseType: !1222, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1223, file: !748, line: 158, baseType: !1227, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1223, file: !748, line: 162, baseType: !87, size: 32, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1207, file: !748, line: 262, baseType: !1227, size: 64, offset: 832)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1207, file: !748, line: 264, baseType: !87, size: 32, offset: 896)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1207, file: !748, line: 268, baseType: !87, size: 32, offset: 928)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1207, file: !748, line: 270, baseType: !774, size: 64, offset: 960)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1207, file: !748, line: 274, baseType: !157, size: 16, offset: 1024)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1207, file: !748, line: 275, baseType: !778, size: 8, offset: 1040)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1207, file: !748, line: 276, baseType: !780, size: 8, offset: 1048)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1207, file: !748, line: 280, baseType: !782, size: 64, offset: 1088)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1207, file: !748, line: 289, baseType: !785, size: 64, offset: 1152)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1207, file: !748, line: 297, baseType: !36, size: 64, offset: 1216)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1207, file: !748, line: 298, baseType: !36, size: 64, offset: 1280)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1207, file: !748, line: 299, baseType: !36, size: 64, offset: 1344)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1207, file: !748, line: 300, baseType: !36, size: 64, offset: 1408)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1207, file: !748, line: 302, baseType: !98, size: 64, offset: 1472)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1207, file: !748, line: 303, baseType: !87, size: 32, offset: 1536)
