; ModuleID = 'coreutils-8.27/src/cp.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, %struct.hash_table*, %struct.hash_table* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.dir_attr = type { %struct.stat, i8, i64, %struct.dir_attr* }
%struct.dir_list = type { %struct.dir_list*, i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_opts", scope: !2, file: !3, line: 117, type: !289, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !125, globals: !127)
!3 = !DIFile(filename: "src/cp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !12, !19, !25, !31, !36, !50}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 28, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "no_backups", value: 0)
!9 = !DIEnumerator(name: "simple_backups", value: 1)
!10 = !DIEnumerator(name: "numbered_existing_backups", value: 2)
!11 = !DIEnumerator(name: "numbered_backups", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !13, line: 69, size: 32, elements: !14)
!13 = !DIFile(filename: "src/copy.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1)
!16 = !DIEnumerator(name: "DEREF_NEVER", value: 2)
!17 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3)
!18 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !13, line: 60, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1)
!22 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2)
!23 = !DIEnumerator(name: "I_ASK_USER", value: 3)
!24 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !13, line: 26, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0)
!28 = !DIEnumerator(name: "SPARSE_NEVER", value: 1)
!29 = !DIEnumerator(name: "SPARSE_AUTO", value: 2)
!30 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !13, line: 47, size: 32, elements: !32)
!32 = !{!33, !34, !35}
!33 = !DIEnumerator(name: "REFLINK_NEVER", value: 0)
!34 = !DIEnumerator(name: "REFLINK_AUTO", value: 1)
!35 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !37, line: 32, size: 32, elements: !38)
!37 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!39 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!40 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!41 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!42 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!43 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!44 = !DIEnumerator(name: "c_quoting_style", value: 5)
!45 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!46 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!47 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!48 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!49 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "File_attribute", scope: !51, file: !3, line: 839, size: 32, elements: !117)
!51 = distinct !DISubprogram(name: "decode_preserve_arg", scope: !3, file: !3, line: 837, type: !52, isLocal: true, isDefinition: true, scopeLine: 838, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !107)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !54, !57, !71}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !13, line: 98, size: 576, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !70, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !106}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !58, file: !13, line: 100, baseType: !5, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !58, file: !13, line: 103, baseType: !12, size: 32, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !58, file: !13, line: 108, baseType: !19, size: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !58, file: !13, line: 111, baseType: !25, size: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !58, file: !13, line: 115, baseType: !65, size: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !66, line: 70, baseType: !67)
!66 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !68, line: 138, baseType: !69)
!68 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!69 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !58, file: !13, line: 119, baseType: !71, size: 8, offset: 160)
!71 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !58, file: !13, line: 123, baseType: !71, size: 8, offset: 168)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !58, file: !13, line: 130, baseType: !71, size: 8, offset: 176)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !58, file: !13, line: 134, baseType: !71, size: 8, offset: 184)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !58, file: !13, line: 138, baseType: !71, size: 8, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !58, file: !13, line: 141, baseType: !71, size: 8, offset: 200)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !58, file: !13, line: 145, baseType: !71, size: 8, offset: 208)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !58, file: !13, line: 152, baseType: !71, size: 8, offset: 216)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !58, file: !13, line: 156, baseType: !71, size: 8, offset: 224)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !58, file: !13, line: 160, baseType: !71, size: 8, offset: 232)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !58, file: !13, line: 161, baseType: !71, size: 8, offset: 240)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !58, file: !13, line: 162, baseType: !71, size: 8, offset: 248)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !58, file: !13, line: 163, baseType: !71, size: 8, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !58, file: !13, line: 166, baseType: !71, size: 8, offset: 264)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !58, file: !13, line: 178, baseType: !71, size: 8, offset: 272)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !58, file: !13, line: 182, baseType: !71, size: 8, offset: 280)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !58, file: !13, line: 188, baseType: !71, size: 8, offset: 288)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !58, file: !13, line: 192, baseType: !71, size: 8, offset: 296)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !58, file: !13, line: 201, baseType: !71, size: 8, offset: 304)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !58, file: !13, line: 205, baseType: !71, size: 8, offset: 312)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !58, file: !13, line: 214, baseType: !71, size: 8, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !58, file: !13, line: 223, baseType: !71, size: 8, offset: 328)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !58, file: !13, line: 227, baseType: !71, size: 8, offset: 336)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !58, file: !13, line: 231, baseType: !71, size: 8, offset: 344)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !58, file: !13, line: 235, baseType: !71, size: 8, offset: 352)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !58, file: !13, line: 239, baseType: !71, size: 8, offset: 360)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !58, file: !13, line: 242, baseType: !71, size: 8, offset: 368)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !58, file: !13, line: 245, baseType: !71, size: 8, offset: 376)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !58, file: !13, line: 250, baseType: !71, size: 8, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !58, file: !13, line: 253, baseType: !31, size: 32, offset: 416)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !58, file: !13, line: 264, baseType: !102, size: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !104, line: 69, baseType: !105)
!104 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !104, line: 67, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !58, file: !13, line: 267, baseType: !102, size: 64, offset: 512)
!107 = !{!108, !109, !110, !111, !113, !114, !116}
!108 = !DILocalVariable(name: "arg", arg: 1, scope: !51, file: !3, line: 837, type: !54)
!109 = !DILocalVariable(name: "x", arg: 2, scope: !51, file: !3, line: 837, type: !57)
!110 = !DILocalVariable(name: "on_off", arg: 3, scope: !51, file: !3, line: 837, type: !71)
!111 = !DILocalVariable(name: "arg_writable", scope: !51, file: !3, line: 863, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!113 = !DILocalVariable(name: "s", scope: !51, file: !3, line: 864, type: !112)
!114 = !DILocalVariable(name: "comma", scope: !115, file: !3, line: 868, type: !112)
!115 = distinct !DILexicalBlock(scope: !51, file: !3, line: 866, column: 5)
!116 = !DILocalVariable(name: "val", scope: !115, file: !3, line: 869, type: !50)
!117 = !{!118, !119, !120, !121, !122, !123, !124}
!118 = !DIEnumerator(name: "PRESERVE_MODE", value: 0)
!119 = !DIEnumerator(name: "PRESERVE_TIMESTAMPS", value: 1)
!120 = !DIEnumerator(name: "PRESERVE_OWNERSHIP", value: 2)
!121 = !DIEnumerator(name: "PRESERVE_LINK", value: 3)
!122 = !DIEnumerator(name: "PRESERVE_CONTEXT", value: 4)
!123 = !DIEnumerator(name: "PRESERVE_XATTR", value: 5)
!124 = !DIEnumerator(name: "PRESERVE_ALL", value: 6)
!125 = !{!54, !126, !112}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !{!128, !130, !132, !0, !152, !158, !164, !170, !173, !177, !182, !184}
!128 = !DIGlobalVariableExpression(var: !129)
!129 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !2, file: !3, line: 88, type: !71, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131)
!131 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !2, file: !3, line: 95, type: !71, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133)
!133 = distinct !DIGlobalVariable(name: "infomap", scope: !134, file: !135, line: 632, type: !149, isLocal: true, isDefinition: true)
!134 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !135, file: !135, line: 630, type: !136, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !138)
!135 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!136 = !DISubroutineType(types: !137)
!137 = !{null, !54}
!138 = !{!139, !140, !141, !148}
!139 = !DILocalVariable(name: "program", arg: 1, scope: !134, file: !135, line: 630, type: !54)
!140 = !DILocalVariable(name: "node", scope: !134, file: !135, line: 642, type: !54)
!141 = !DILocalVariable(name: "map_prog", scope: !134, file: !135, line: 643, type: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !134, file: !135, line: 632, size: 128, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !144, file: !135, line: 632, baseType: !54, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !144, file: !135, line: 632, baseType: !54, size: 64, offset: 64)
!148 = !DILocalVariable(name: "lc_messages", scope: !134, file: !135, line: 655, type: !54)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 896, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 7)
!152 = !DIGlobalVariableExpression(var: !153)
!153 = distinct !DIGlobalVariable(name: "sparse_type", scope: !2, file: !3, line: 101, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 96, elements: !156)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!156 = !{!157}
!157 = !DISubrange(count: 3)
!158 = !DIGlobalVariableExpression(var: !159)
!159 = distinct !DIGlobalVariable(name: "sparse_type_string", scope: !2, file: !3, line: 97, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 256, elements: !162)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!162 = !{!163}
!163 = !DISubrange(count: 4)
!164 = !DIGlobalVariableExpression(var: !165)
!165 = distinct !DIGlobalVariable(name: "reflink_type", scope: !2, file: !3, line: 111, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 64, elements: !168)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!168 = !{!169}
!169 = !DISubrange(count: 2)
!170 = !DIGlobalVariableExpression(var: !171)
!171 = distinct !DIGlobalVariable(name: "reflink_type_string", scope: !2, file: !3, line: 107, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 192, elements: !156)
!173 = !DIGlobalVariableExpression(var: !174)
!174 = distinct !DIGlobalVariable(name: "preserve_vals", scope: !51, file: !3, line: 849, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 224, elements: !150)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!177 = !DIGlobalVariableExpression(var: !178)
!178 = distinct !DIGlobalVariable(name: "preserve_args", scope: !51, file: !3, line: 856, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 512, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 8)
!182 = !DIGlobalVariableExpression(var: !183)
!183 = distinct !DIGlobalVariable(name: "parents_option", scope: !2, file: !3, line: 92, type: !71, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185)
!185 = distinct !DIGlobalVariable(name: "x_tmp", scope: !186, file: !3, line: 760, type: !58, isLocal: true, isDefinition: true)
!186 = distinct !DISubprogram(name: "do_copy", scope: !3, file: !3, line: 597, type: !187, isLocal: true, isDefinition: true, scopeLine: 599, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !191)
!187 = !DISubroutineType(types: !188)
!188 = !{!71, !189, !190, !54, !71, !57}
!189 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!191 = !{!192, !193, !194, !195, !196, !197, !234, !235, !236, !240, !243, !247, !248, !258, !259, !260, !263, !266, !267, !268, !270, !272, !275, !276, !277, !280, !284, !286, !287, !288}
!192 = !DILocalVariable(name: "n_files", arg: 1, scope: !186, file: !3, line: 597, type: !189)
!193 = !DILocalVariable(name: "file", arg: 2, scope: !186, file: !3, line: 597, type: !190)
!194 = !DILocalVariable(name: "target_directory", arg: 3, scope: !186, file: !3, line: 597, type: !54)
!195 = !DILocalVariable(name: "no_target_directory", arg: 4, scope: !186, file: !3, line: 598, type: !71)
!196 = !DILocalVariable(name: "x", arg: 5, scope: !186, file: !3, line: 598, type: !57)
!197 = !DILocalVariable(name: "sb", scope: !186, file: !3, line: 600, type: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !199, line: 46, size: 1152, elements: !200)
!199 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!200 = !{!201, !204, !206, !208, !209, !211, !213, !214, !215, !218, !220, !222, !230, !231, !232}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !198, file: !199, line: 48, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !68, line: 133, baseType: !203)
!203 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !198, file: !199, line: 53, baseType: !205, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !68, line: 136, baseType: !203)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !198, file: !199, line: 61, baseType: !207, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !68, line: 139, baseType: !203)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !198, file: !199, line: 62, baseType: !67, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !198, file: !199, line: 64, baseType: !210, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !68, line: 134, baseType: !69)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !198, file: !199, line: 65, baseType: !212, size: 32, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !68, line: 135, baseType: !69)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !198, file: !199, line: 67, baseType: !189, size: 32, offset: 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !198, file: !199, line: 69, baseType: !202, size: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !198, file: !199, line: 74, baseType: !216, size: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 140, baseType: !217)
!217 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !198, file: !199, line: 78, baseType: !219, size: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !68, line: 162, baseType: !217)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !198, file: !199, line: 80, baseType: !221, size: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !68, line: 167, baseType: !217)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !198, file: !199, line: 91, baseType: !223, size: 128, offset: 576)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !224, line: 8, size: 128, elements: !225)
!224 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!225 = !{!226, !228}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !223, file: !224, line: 10, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !68, line: 148, baseType: !217)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !223, file: !224, line: 11, baseType: !229, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !68, line: 184, baseType: !217)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !198, file: !199, line: 92, baseType: !223, size: 128, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !198, file: !199, line: 93, baseType: !223, size: 128, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !198, file: !199, line: 106, baseType: !233, size: 192, offset: 960)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 192, elements: !156)
!234 = !DILocalVariable(name: "new_dst", scope: !186, file: !3, line: 601, type: !71)
!235 = !DILocalVariable(name: "ok", scope: !186, file: !3, line: 602, type: !71)
!236 = !DILocalVariable(name: "__x", scope: !237, file: !3, line: 626, type: !71)
!237 = distinct !DILexicalBlock(scope: !238, file: !3, line: 626, column: 7)
!238 = distinct !DILexicalBlock(scope: !239, file: !3, line: 615, column: 5)
!239 = distinct !DILexicalBlock(scope: !186, file: !3, line: 614, column: 7)
!240 = !DILocalVariable(name: "i", scope: !241, file: !3, line: 643, type: !189)
!241 = distinct !DILexicalBlock(scope: !242, file: !3, line: 639, column: 5)
!242 = distinct !DILexicalBlock(scope: !186, file: !3, line: 638, column: 7)
!243 = !DILocalVariable(name: "dst_name", scope: !244, file: !3, line: 656, type: !112)
!244 = distinct !DILexicalBlock(scope: !245, file: !3, line: 655, column: 9)
!245 = distinct !DILexicalBlock(scope: !246, file: !3, line: 654, column: 7)
!246 = distinct !DILexicalBlock(scope: !241, file: !3, line: 654, column: 7)
!247 = !DILocalVariable(name: "parent_exists", scope: !244, file: !3, line: 657, type: !71)
!248 = !DILocalVariable(name: "attr_list", scope: !244, file: !3, line: 658, type: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_attr", file: !3, line: 64, size: 1344, elements: !251)
!251 = !{!252, !253, !254, !257}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !250, file: !3, line: 66, baseType: !198, size: 1152)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !250, file: !3, line: 67, baseType: !71, size: 8, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "slash_offset", scope: !250, file: !3, line: 68, baseType: !255, size: 64, offset: 1216)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !256, line: 62, baseType: !203)
!256 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !3, line: 69, baseType: !249, size: 64, offset: 1280)
!258 = !DILocalVariable(name: "arg_in_concat", scope: !244, file: !3, line: 659, type: !112)
!259 = !DILocalVariable(name: "arg", scope: !244, file: !3, line: 660, type: !112)
!260 = !DILocalVariable(name: "arg_no_trailing_slash", scope: !261, file: !3, line: 669, type: !112)
!261 = distinct !DILexicalBlock(scope: !262, file: !3, line: 668, column: 13)
!262 = distinct !DILexicalBlock(scope: !244, file: !3, line: 667, column: 15)
!263 = !DILocalVariable(name: "__old", scope: !264, file: !3, line: 676, type: !54)
!264 = distinct !DILexicalBlock(scope: !265, file: !3, line: 676, column: 15)
!265 = distinct !DILexicalBlock(scope: !261, file: !3, line: 676, column: 15)
!266 = !DILocalVariable(name: "__len", scope: !264, file: !3, line: 676, type: !255)
!267 = !DILocalVariable(name: "__new", scope: !264, file: !3, line: 676, type: !112)
!268 = !DILocalVariable(name: "arg_base", scope: !269, file: !3, line: 695, type: !112)
!269 = distinct !DILexicalBlock(scope: !262, file: !3, line: 694, column: 13)
!270 = !DILocalVariable(name: "tmp_abns_", scope: !271, file: !3, line: 698, type: !112)
!271 = distinct !DILexicalBlock(scope: !269, file: !3, line: 698, column: 15)
!272 = !DILocalVariable(name: "__old", scope: !273, file: !3, line: 698, type: !54)
!273 = distinct !DILexicalBlock(scope: !274, file: !3, line: 698, column: 15)
!274 = distinct !DILexicalBlock(scope: !271, file: !3, line: 698, column: 15)
!275 = !DILocalVariable(name: "__len", scope: !273, file: !3, line: 698, type: !255)
!276 = !DILocalVariable(name: "__new", scope: !273, file: !3, line: 698, type: !112)
!277 = !DILocalVariable(name: "copy_into_self", scope: !278, file: !3, line: 714, type: !71)
!278 = distinct !DILexicalBlock(scope: !279, file: !3, line: 713, column: 13)
!279 = distinct !DILexicalBlock(scope: !244, file: !3, line: 706, column: 15)
!280 = !DILocalVariable(name: "p", scope: !281, file: !3, line: 726, type: !249)
!281 = distinct !DILexicalBlock(scope: !282, file: !3, line: 725, column: 17)
!282 = distinct !DILexicalBlock(scope: !283, file: !3, line: 723, column: 13)
!283 = distinct !DILexicalBlock(scope: !244, file: !3, line: 722, column: 15)
!284 = !DILocalVariable(name: "new_dest", scope: !285, file: !3, line: 737, type: !54)
!285 = distinct !DILexicalBlock(scope: !242, file: !3, line: 736, column: 5)
!286 = !DILocalVariable(name: "source", scope: !285, file: !3, line: 738, type: !54)
!287 = !DILocalVariable(name: "dest", scope: !285, file: !3, line: 739, type: !54)
!288 = !DILocalVariable(name: "unused", scope: !285, file: !3, line: 740, type: !71)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 7680, elements: !299)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !292, line: 50, size: 256, elements: !293)
!292 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!293 = !{!294, !295, !296, !298}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !291, file: !292, line: 52, baseType: !54, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !291, file: !292, line: 55, baseType: !189, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !291, file: !292, line: 56, baseType: !297, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !291, file: !292, line: 57, baseType: !189, size: 32, offset: 192)
!299 = !{!300}
!300 = !DISubrange(count: 30)
!301 = !DIGlobalVariableExpression(var: !302)
!302 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !303, file: !304, line: 146, type: !54, isLocal: true, isDefinition: true)
!303 = distinct !DICompileUnit(language: DW_LANG_C99, file: !304, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !305, retainedTypes: !330, globals: !334)
!304 = !DIFile(filename: "src/copy.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!305 = !{!5, !12, !19, !25, !31, !36, !306, !310, !317, !326}
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !307, line: 27, size: 32, elements: !308)
!307 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!308 = !{!309}
!309 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !311, line: 26, size: 32, elements: !312)
!311 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!312 = !{!313, !314, !315, !316}
!313 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0)
!314 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1)
!315 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2)
!316 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2)
!317 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !318, line: 45, size: 32, elements: !319)
!318 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!319 = !{!320, !321, !322, !323, !324, !325}
!320 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!321 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!322 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!323 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!324 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!325 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !327, line: 73, size: 32, elements: !328)
!327 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!328 = !{!329}
!329 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072)
!330 = !{!65, !126, !69, !112, !203, !331, !255, !332}
!331 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !333, line: 57, baseType: !216)
!333 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!334 = !{!335, !301, !341, !343, !353, !355}
!335 = !DIGlobalVariableExpression(var: !336)
!336 = distinct !DIGlobalVariable(name: "mask", scope: !337, file: !304, line: 2992, type: !65, isLocal: true, isDefinition: true)
!337 = distinct !DISubprogram(name: "cached_umask", scope: !304, file: !304, line: 2990, type: !338, isLocal: false, isDefinition: true, scopeLine: 2991, flags: DIFlagPrototyped, isOptimized: true, unit: !303, variables: !340)
!338 = !DISubroutineType(types: !339)
!339 = !{!65}
!340 = !{}
!341 = !DIGlobalVariableExpression(var: !342)
!342 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !303, file: !304, line: 147, type: !54, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344)
!344 = distinct !DIGlobalVariable(name: "zeros", scope: !345, file: !304, line: 350, type: !112, isLocal: true, isDefinition: true)
!345 = distinct !DISubprogram(name: "write_zeros", scope: !304, file: !304, line: 348, type: !346, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, unit: !303, variables: !348)
!346 = !DISubroutineType(types: !347)
!347 = !{!71, !189, !332}
!348 = !{!349, !350, !351}
!349 = !DILocalVariable(name: "fd", arg: 1, scope: !345, file: !304, line: 348, type: !189)
!350 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !345, file: !304, line: 348, type: !332)
!351 = !DILocalVariable(name: "n", scope: !352, file: !304, line: 369, type: !255)
!352 = distinct !DILexicalBlock(scope: !345, file: !304, line: 368, column: 5)
!353 = !DIGlobalVariableExpression(var: !354)
!354 = distinct !DIGlobalVariable(name: "nz", scope: !345, file: !304, line: 351, type: !255, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356)
!356 = distinct !DIGlobalVariable(name: "fallback", scope: !345, file: !304, line: 358, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8192, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 1024)
!360 = !DIGlobalVariableExpression(var: !361)
!361 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !362, file: !363, line: 45, type: !102, isLocal: true, isDefinition: true)
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, retainedTypes: !364, globals: !368)
!363 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!364 = !{!126, !112, !365}
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !366, line: 112, baseType: !367)
!366 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !68, line: 62, baseType: !203)
!368 = !{!360}
!369 = !DIGlobalVariableExpression(var: !370)
!370 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !371, file: !372, line: 38, type: !381, isLocal: true, isDefinition: true)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !373, globals: !380)
!372 = !DIFile(filename: "src/force-link.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!373 = !{!374, !377}
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !372, line: 39, size: 32, elements: !375)
!375 = !{!376}
!376 = !DIEnumerator(name: "x_suffix_len", value: 6)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !372, line: 44, size: 32, elements: !378)
!378 = !{!379}
!379 = !DIEnumerator(name: "smallsize", value: 256)
!380 = !{!369}
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 72, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 9)
!384 = !DIGlobalVariableExpression(var: !385)
!385 = distinct !DIGlobalVariable(name: "Version", scope: !386, file: !387, line: 2, type: !54, isLocal: false, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, globals: !388)
!387 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!388 = !{!384}
!389 = !DIGlobalVariableExpression(var: !390)
!390 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !391, file: !396, line: 69, type: !397, isLocal: false, isDefinition: true)
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !393, retainedTypes: !394, globals: !395)
!392 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!393 = !{!36}
!394 = !{!126, !331}
!395 = !{!389}
!396 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !398, line: 55, baseType: !399)
!398 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{null}
!402 = !DIGlobalVariableExpression(var: !403)
!403 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !404, file: !408, line: 83, type: !54, isLocal: false, isDefinition: true)
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !406, retainedTypes: !455, globals: !456)
!405 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!406 = !{!5, !407, !426, !431}
!407 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !409, file: !408, line: 285, size: 32, elements: !424)
!408 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!409 = distinct !DISubprogram(name: "find_backup_file_name", scope: !408, file: !408, line: 264, type: !410, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, unit: !404, variables: !412)
!410 = !DISubroutineType(types: !411)
!411 = !{!112, !54, !5}
!412 = !{!413, !414, !415, !416, !417, !418, !419, !422, !423}
!413 = !DILocalVariable(name: "file", arg: 1, scope: !409, file: !408, line: 264, type: !54)
!414 = !DILocalVariable(name: "backup_type", arg: 2, scope: !409, file: !408, line: 264, type: !5)
!415 = !DILocalVariable(name: "filelen", scope: !409, file: !408, line: 266, type: !255)
!416 = !DILocalVariable(name: "s", scope: !409, file: !408, line: 267, type: !112)
!417 = !DILocalVariable(name: "ssize", scope: !409, file: !408, line: 268, type: !255)
!418 = !DILocalVariable(name: "simple", scope: !409, file: !408, line: 269, type: !71)
!419 = !DILocalVariable(name: "env_suffix", scope: !420, file: !408, line: 274, type: !54)
!420 = distinct !DILexicalBlock(scope: !421, file: !408, line: 273, column: 5)
!421 = distinct !DILexicalBlock(scope: !409, file: !408, line: 272, column: 7)
!422 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !409, file: !408, line: 283, type: !255)
!423 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !409, file: !408, line: 284, type: !255)
!424 = !{!425}
!425 = !DIEnumerator(name: "GUESS", value: 9)
!426 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !408, line: 146, size: 32, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0)
!429 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1)
!430 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2)
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !432, line: 24, size: 32, elements: !433)
!432 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!434 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!435 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!436 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!437 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!438 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!439 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!440 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!441 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!442 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!443 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!444 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!445 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!446 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!447 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!448 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!449 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!450 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!451 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!452 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!453 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!454 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!455 = !{!54, !126, !69, !255}
!456 = !{!402, !457, !461}
!457 = !DIGlobalVariableExpression(var: !458)
!458 = distinct !DIGlobalVariable(name: "backup_types", scope: !404, file: !408, line: 325, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 256, elements: !180)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!461 = !DIGlobalVariableExpression(var: !462)
!462 = distinct !DIGlobalVariable(name: "backup_args", scope: !404, file: !408, line: 314, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 576, elements: !382)
!464 = !DIGlobalVariableExpression(var: !465)
!465 = distinct !DIGlobalVariable(name: "file_name", scope: !466, file: !469, line: 37, type: !54, isLocal: true, isDefinition: true)
!466 = distinct !DICompileUnit(language: DW_LANG_C99, file: !467, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, globals: !468)
!467 = !DIFile(filename: "./lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!468 = !{!464}
!469 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!470 = !DIGlobalVariableExpression(var: !471)
!471 = distinct !DIGlobalVariable(name: "file_name", scope: !472, file: !477, line: 36, type: !54, isLocal: true, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, globals: !474)
!473 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!474 = !{!470, !475}
!475 = !DIGlobalVariableExpression(var: !476)
!476 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !472, file: !477, line: 46, type: !71, isLocal: true, isDefinition: true)
!477 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!478 = !DIGlobalVariableExpression(var: !479)
!479 = distinct !DIGlobalVariable(name: "exit_failure", scope: !480, file: !483, line: 24, type: !484, isLocal: false, isDefinition: true)
!480 = distinct !DICompileUnit(language: DW_LANG_C99, file: !481, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, globals: !482)
!481 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!482 = !{!478}
!483 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!484 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !189)
!485 = !DIGlobalVariableExpression(var: !486)
!486 = distinct !DIGlobalVariable(name: "default_tuning", scope: !487, file: !491, line: 130, type: !492, isLocal: true, isDefinition: true)
!487 = distinct !DICompileUnit(language: DW_LANG_C99, file: !488, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, retainedTypes: !489, globals: !490)
!488 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!489 = !{!203, !126, !255}
!490 = !{!485}
!491 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !104, line: 65, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !104, line: 53, size: 160, elements: !495)
!495 = !{!496, !498, !499, !500, !501}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !494, file: !104, line: 58, baseType: !497, size: 32)
!497 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !494, file: !104, line: 59, baseType: !497, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !494, file: !104, line: 60, baseType: !497, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !494, file: !104, line: 61, baseType: !497, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !494, file: !104, line: 62, baseType: !71, size: 8, offset: 128)
!502 = !DIGlobalVariableExpression(var: !503)
!503 = distinct !DIGlobalVariable(name: "program_name", scope: !504, file: !508, line: 33, type: !54, isLocal: false, isDefinition: true)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, retainedTypes: !506, globals: !507)
!505 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!506 = !{!126, !112}
!507 = !{!502}
!508 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!509 = !DIGlobalVariableExpression(var: !510)
!510 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !511, file: !539, line: 77, type: !572, isLocal: false, isDefinition: true)
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !513, retainedTypes: !534, globals: !536)
!512 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!513 = !{!36, !514, !519}
!514 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !37, line: 242, size: 32, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!517 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!518 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!519 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !520, line: 46, size: 32, elements: !521)
!520 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533}
!522 = !DIEnumerator(name: "_ISupper", value: 256)
!523 = !DIEnumerator(name: "_ISlower", value: 512)
!524 = !DIEnumerator(name: "_ISalpha", value: 1024)
!525 = !DIEnumerator(name: "_ISdigit", value: 2048)
!526 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!527 = !DIEnumerator(name: "_ISspace", value: 8192)
!528 = !DIEnumerator(name: "_ISprint", value: 16384)
!529 = !DIEnumerator(name: "_ISgraph", value: 32768)
!530 = !DIEnumerator(name: "_ISblank", value: 1)
!531 = !DIEnumerator(name: "_IScntrl", value: 2)
!532 = !DIEnumerator(name: "_ISpunct", value: 4)
!533 = !DIEnumerator(name: "_ISalnum", value: 8)
!534 = !{!189, !535, !255, !112}
!535 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!536 = !{!509, !537, !544, !554, !556, !561, !568, !570}
!537 = !DIGlobalVariableExpression(var: !538)
!538 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !511, file: !539, line: 93, type: !540, isLocal: false, isDefinition: true)
!539 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 320, elements: !542)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!542 = !{!543}
!543 = !DISubrange(count: 10)
!544 = !DIGlobalVariableExpression(var: !545)
!545 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !511, file: !539, line: 1043, type: !546, isLocal: false, isDefinition: true)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !539, line: 57, size: 448, elements: !547)
!547 = !{!548, !549, !550, !552, !553}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !546, file: !539, line: 60, baseType: !36, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !546, file: !539, line: 63, baseType: !189, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !546, file: !539, line: 67, baseType: !551, size: 256, offset: 64)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !180)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !546, file: !539, line: 70, baseType: !54, size: 64, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !546, file: !539, line: 73, baseType: !54, size: 64, offset: 384)
!554 = !DIGlobalVariableExpression(var: !555)
!555 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !511, file: !539, line: 108, type: !546, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557)
!557 = distinct !DIGlobalVariable(name: "slot0", scope: !511, file: !539, line: 834, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 2048, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 256)
!561 = !DIGlobalVariableExpression(var: !562)
!562 = distinct !DIGlobalVariable(name: "slotvec", scope: !511, file: !539, line: 837, type: !563, isLocal: true, isDefinition: true)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !539, line: 826, size: 128, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !564, file: !539, line: 828, baseType: !255, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !564, file: !539, line: 829, baseType: !112, size: 64, offset: 64)
!568 = !DIGlobalVariableExpression(var: !569)
!569 = distinct !DIGlobalVariable(name: "nslots", scope: !511, file: !539, line: 835, type: !189, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571)
!571 = distinct !DIGlobalVariable(name: "slotvec0", scope: !511, file: !539, line: 836, type: !564, isLocal: true, isDefinition: true)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 704, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 11)
!575 = !DIGlobalVariableExpression(var: !576)
!576 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !577, file: !595, line: 74, type: !596, isLocal: true, isDefinition: true)
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !579, retainedTypes: !593, globals: !594)
!578 = !DIFile(filename: "./lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!579 = !{!310, !580}
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !582, file: !581, line: 192, size: 32, elements: !591)
!581 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!582 = distinct !DISubprogram(name: "x2nrealloc", scope: !581, file: !581, line: 180, type: !583, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !577, variables: !586)
!583 = !DISubroutineType(types: !584)
!584 = !{!126, !126, !585, !255}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!586 = !{!587, !588, !589, !590}
!587 = !DILocalVariable(name: "p", arg: 1, scope: !582, file: !581, line: 180, type: !126)
!588 = !DILocalVariable(name: "pn", arg: 2, scope: !582, file: !581, line: 180, type: !585)
!589 = !DILocalVariable(name: "s", arg: 3, scope: !582, file: !581, line: 180, type: !255)
!590 = !DILocalVariable(name: "n", scope: !582, file: !581, line: 182, type: !255)
!591 = !{!592}
!592 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!593 = !{!126}
!594 = !{!575}
!595 = !DIFile(filename: "lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 192, elements: !156)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !595, line: 72, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!189, !602, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!604 = !DIGlobalVariableExpression(var: !605)
!605 = distinct !DIGlobalVariable(name: "letters", scope: !606, file: !609, line: 185, type: !610, isLocal: true, isDefinition: true)
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, globals: !608)
!607 = !DIFile(filename: "./lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!608 = !{!604}
!609 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 504, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 63)
!613 = !DIGlobalVariableExpression(var: !614)
!614 = distinct !DIGlobalVariable(name: "ht", scope: !615, file: !616, line: 147, type: !102, isLocal: true, isDefinition: true)
!615 = distinct !DISubprogram(name: "utimecmp", scope: !616, file: !616, line: 116, type: !617, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, unit: !642, variables: !658)
!616 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!617 = !DISubroutineType(types: !618)
!618 = !{!189, !54, !619, !619, !189}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !199, line: 46, size: 1152, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !639, !640, !641}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !621, file: !199, line: 48, baseType: !202, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !621, file: !199, line: 53, baseType: !205, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !621, file: !199, line: 61, baseType: !207, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !621, file: !199, line: 62, baseType: !67, size: 32, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !621, file: !199, line: 64, baseType: !210, size: 32, offset: 224)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !621, file: !199, line: 65, baseType: !212, size: 32, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !621, file: !199, line: 67, baseType: !189, size: 32, offset: 288)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !621, file: !199, line: 69, baseType: !202, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !621, file: !199, line: 74, baseType: !216, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !621, file: !199, line: 78, baseType: !219, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !621, file: !199, line: 80, baseType: !221, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !621, file: !199, line: 91, baseType: !635, size: 128, offset: 576)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !224, line: 8, size: 128, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !635, file: !224, line: 10, baseType: !227, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !635, file: !224, line: 11, baseType: !229, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !621, file: !199, line: 92, baseType: !635, size: 128, offset: 704)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !621, file: !199, line: 93, baseType: !635, size: 128, offset: 832)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !621, file: !199, line: 106, baseType: !233, size: 192, offset: 960)
!642 = distinct !DICompileUnit(language: DW_LANG_C99, file: !643, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !644, globals: !648)
!643 = !DIFile(filename: "./lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!644 = !{!306, !645}
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !616, line: 47, size: 32, elements: !646)
!646 = !{!647}
!647 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1)
!648 = !{!613, !649}
!649 = !DIGlobalVariableExpression(var: !650)
!650 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !615, file: !616, line: 150, type: !651, isLocal: true, isDefinition: true)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !616, line: 60, size: 128, elements: !653)
!653 = !{!654, !656, !657}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !652, file: !616, line: 63, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !66, line: 60, baseType: !202)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !652, file: !616, line: 70, baseType: !189, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !652, file: !616, line: 74, baseType: !71, size: 8, offset: 96)
!658 = !{!659, !660, !661, !662, !663, !666, !667, !668, !669, !672, !673, !674, !677, !678, !679, !680, !681, !682, !684, !687, !688, !689, !690, !694, !695, !697, !699, !701}
!659 = !DILocalVariable(name: "dst_name", arg: 1, scope: !615, file: !616, line: 116, type: !54)
!660 = !DILocalVariable(name: "dst_stat", arg: 2, scope: !615, file: !616, line: 117, type: !619)
!661 = !DILocalVariable(name: "src_stat", arg: 3, scope: !615, file: !616, line: 118, type: !619)
!662 = !DILocalVariable(name: "options", arg: 4, scope: !615, file: !616, line: 119, type: !189)
!663 = !DILocalVariable(name: "dst_s", scope: !615, file: !616, line: 137, type: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !665, line: 7, baseType: !227)
!665 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!666 = !DILocalVariable(name: "src_s", scope: !615, file: !616, line: 138, type: !664)
!667 = !DILocalVariable(name: "dst_ns", scope: !615, file: !616, line: 139, type: !189)
!668 = !DILocalVariable(name: "src_ns", scope: !615, file: !616, line: 140, type: !189)
!669 = !DILocalVariable(name: "dst_res", scope: !670, file: !616, line: 151, type: !651)
!670 = distinct !DILexicalBlock(scope: !671, file: !616, line: 143, column: 5)
!671 = distinct !DILexicalBlock(scope: !615, file: !616, line: 142, column: 7)
!672 = !DILocalVariable(name: "tmp_dst_res", scope: !670, file: !616, line: 152, type: !652)
!673 = !DILocalVariable(name: "res", scope: !670, file: !616, line: 155, type: !189)
!674 = !DILocalVariable(name: "dst_a_s", scope: !675, file: !616, line: 229, type: !664)
!675 = distinct !DILexicalBlock(scope: !676, file: !616, line: 225, column: 9)
!676 = distinct !DILexicalBlock(scope: !670, file: !616, line: 224, column: 11)
!677 = !DILocalVariable(name: "dst_c_s", scope: !675, file: !616, line: 230, type: !664)
!678 = !DILocalVariable(name: "dst_m_s", scope: !675, file: !616, line: 231, type: !664)
!679 = !DILocalVariable(name: "dst_a_ns", scope: !675, file: !616, line: 232, type: !189)
!680 = !DILocalVariable(name: "dst_c_ns", scope: !675, file: !616, line: 233, type: !189)
!681 = !DILocalVariable(name: "dst_m_ns", scope: !675, file: !616, line: 234, type: !189)
!682 = !DILocalVariable(name: "odd_second", scope: !683, file: !616, line: 243, type: !71)
!683 = distinct !DILexicalBlock(scope: !675, file: !616, line: 242, column: 11)
!684 = !DILocalVariable(name: "a", scope: !685, file: !616, line: 252, type: !189)
!685 = distinct !DILexicalBlock(scope: !686, file: !616, line: 251, column: 15)
!686 = distinct !DILexicalBlock(scope: !683, file: !616, line: 245, column: 17)
!687 = !DILocalVariable(name: "c", scope: !685, file: !616, line: 253, type: !189)
!688 = !DILocalVariable(name: "m", scope: !685, file: !616, line: 254, type: !189)
!689 = !DILocalVariable(name: "SR10", scope: !685, file: !616, line: 258, type: !189)
!690 = !DILocalVariable(name: "timespec", scope: !691, file: !616, line: 280, type: !693)
!691 = distinct !DILexicalBlock(scope: !692, file: !616, line: 279, column: 13)
!692 = distinct !DILexicalBlock(scope: !675, file: !616, line: 278, column: 15)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 256, elements: !168)
!694 = !DILocalVariable(name: "dst_status", scope: !691, file: !616, line: 281, type: !621)
!695 = !DILocalVariable(name: "s", scope: !696, file: !616, line: 291, type: !664)
!696 = distinct !DILexicalBlock(scope: !691, file: !616, line: 290, column: 15)
!697 = !DILocalVariable(name: "stat_result", scope: !698, file: !616, line: 320, type: !189)
!698 = distinct !DILexicalBlock(scope: !691, file: !616, line: 319, column: 15)
!699 = !DILocalVariable(name: "old_res", scope: !700, file: !616, line: 345, type: !189)
!700 = distinct !DILexicalBlock(scope: !691, file: !616, line: 344, column: 15)
!701 = !DILocalVariable(name: "a", scope: !700, file: !616, line: 346, type: !189)
!702 = !DIGlobalVariableExpression(var: !703)
!703 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !704, file: !714, line: 73, type: !189, isLocal: true, isDefinition: true)
!704 = distinct !DICompileUnit(language: DW_LANG_C99, file: !705, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !706, globals: !711)
!705 = !DIFile(filename: "./lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!706 = !{!707}
!707 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !708, line: 35, size: 32, elements: !709)
!708 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!709 = !{!710}
!710 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000)
!711 = !{!702, !712}
!712 = !DIGlobalVariableExpression(var: !713)
!713 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !704, file: !714, line: 74, type: !189, isLocal: true, isDefinition: true)
!714 = !DIFile(filename: "lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!715 = !DIGlobalVariableExpression(var: !716)
!716 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !717, file: !720, line: 26, type: !721, isLocal: false, isDefinition: true)
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, globals: !719)
!718 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!719 = !{!715}
!720 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 376, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 47)
!724 = !DIGlobalVariableExpression(var: !725)
!725 = distinct !DIGlobalVariable(name: "can_write", scope: !726, file: !727, line: 35, type: !71, isLocal: true, isDefinition: true)
!726 = distinct !DISubprogram(name: "can_write_any_file", scope: !727, file: !727, line: 32, type: !728, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !730, variables: !735)
!727 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!728 = !DISubroutineType(types: !729)
!729 = !{!71}
!730 = distinct !DICompileUnit(language: DW_LANG_C99, file: !731, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, globals: !732)
!731 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!732 = !{!733, !724}
!733 = !DIGlobalVariableExpression(var: !734)
!734 = distinct !DIGlobalVariable(name: "initialized", scope: !726, file: !727, line: 34, type: !71, isLocal: true, isDefinition: true)
!735 = !{!736}
!736 = !DILocalVariable(name: "can", scope: !737, file: !727, line: 39, type: !71)
!737 = distinct !DILexicalBlock(scope: !738, file: !727, line: 38, column: 5)
!738 = distinct !DILexicalBlock(scope: !726, file: !727, line: 37, column: 7)
!739 = !DIGlobalVariableExpression(var: !740)
!740 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !741, file: !742, line: 335, type: !189, isLocal: true, isDefinition: true)
!741 = distinct !DISubprogram(name: "rpl_fcntl", scope: !742, file: !742, line: 272, type: !743, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !745, variables: !748)
!742 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!743 = !DISubroutineType(types: !744)
!744 = !{!189, !189, !189, null}
!745 = distinct !DICompileUnit(language: DW_LANG_C99, file: !746, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, globals: !747)
!746 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!747 = !{!739}
!748 = !{!749, !750, !751, !764, !765, !768, !771, !774}
!749 = !DILocalVariable(name: "fd", arg: 1, scope: !741, file: !742, line: 272, type: !189)
!750 = !DILocalVariable(name: "action", arg: 2, scope: !741, file: !742, line: 272, type: !189)
!751 = !DILocalVariable(name: "arg", scope: !741, file: !742, line: 274, type: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !753, line: 30, baseType: !754)
!753 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !746, line: 274, baseType: !755)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 192, elements: !762)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !746, line: 274, size: 192, elements: !757)
!757 = !{!758, !759, !760, !761}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !756, file: !746, line: 274, baseType: !69, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !756, file: !746, line: 274, baseType: !69, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !756, file: !746, line: 274, baseType: !126, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !756, file: !746, line: 274, baseType: !126, size: 64, offset: 128)
!762 = !{!763}
!763 = !DISubrange(count: 1)
!764 = !DILocalVariable(name: "result", scope: !741, file: !742, line: 275, type: !189)
!765 = !DILocalVariable(name: "target", scope: !766, file: !742, line: 322, type: !189)
!766 = distinct !DILexicalBlock(scope: !767, file: !742, line: 321, column: 7)
!767 = distinct !DILexicalBlock(scope: !741, file: !742, line: 278, column: 5)
!768 = !DILocalVariable(name: "flags", scope: !769, file: !742, line: 359, type: !189)
!769 = distinct !DILexicalBlock(scope: !770, file: !742, line: 358, column: 11)
!770 = distinct !DILexicalBlock(scope: !766, file: !742, line: 357, column: 13)
!771 = !DILocalVariable(name: "saved_errno", scope: !772, file: !742, line: 362, type: !189)
!772 = distinct !DILexicalBlock(scope: !773, file: !742, line: 361, column: 15)
!773 = distinct !DILexicalBlock(scope: !769, file: !742, line: 360, column: 17)
!774 = !DILocalVariable(name: "p", scope: !775, file: !742, line: 404, type: !126)
!775 = distinct !DILexicalBlock(scope: !767, file: !742, line: 402, column: 7)
!776 = !DIGlobalVariableExpression(var: !777)
!777 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !778, file: !1122, line: 120, type: !1123, isLocal: true, isDefinition: true)
!778 = distinct !DICompileUnit(language: DW_LANG_C99, file: !779, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !780, retainedTypes: !1119, globals: !1121)
!779 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!780 = !{!781}
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !782, line: 41, size: 32, elements: !783)
!782 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118}
!784 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!785 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!786 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!787 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!788 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!789 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!790 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!791 = !DIEnumerator(name: "DAY_1", value: 131079)
!792 = !DIEnumerator(name: "DAY_2", value: 131080)
!793 = !DIEnumerator(name: "DAY_3", value: 131081)
!794 = !DIEnumerator(name: "DAY_4", value: 131082)
!795 = !DIEnumerator(name: "DAY_5", value: 131083)
!796 = !DIEnumerator(name: "DAY_6", value: 131084)
!797 = !DIEnumerator(name: "DAY_7", value: 131085)
!798 = !DIEnumerator(name: "ABMON_1", value: 131086)
!799 = !DIEnumerator(name: "ABMON_2", value: 131087)
!800 = !DIEnumerator(name: "ABMON_3", value: 131088)
!801 = !DIEnumerator(name: "ABMON_4", value: 131089)
!802 = !DIEnumerator(name: "ABMON_5", value: 131090)
!803 = !DIEnumerator(name: "ABMON_6", value: 131091)
!804 = !DIEnumerator(name: "ABMON_7", value: 131092)
!805 = !DIEnumerator(name: "ABMON_8", value: 131093)
!806 = !DIEnumerator(name: "ABMON_9", value: 131094)
!807 = !DIEnumerator(name: "ABMON_10", value: 131095)
!808 = !DIEnumerator(name: "ABMON_11", value: 131096)
!809 = !DIEnumerator(name: "ABMON_12", value: 131097)
!810 = !DIEnumerator(name: "MON_1", value: 131098)
!811 = !DIEnumerator(name: "MON_2", value: 131099)
!812 = !DIEnumerator(name: "MON_3", value: 131100)
!813 = !DIEnumerator(name: "MON_4", value: 131101)
!814 = !DIEnumerator(name: "MON_5", value: 131102)
!815 = !DIEnumerator(name: "MON_6", value: 131103)
!816 = !DIEnumerator(name: "MON_7", value: 131104)
!817 = !DIEnumerator(name: "MON_8", value: 131105)
!818 = !DIEnumerator(name: "MON_9", value: 131106)
!819 = !DIEnumerator(name: "MON_10", value: 131107)
!820 = !DIEnumerator(name: "MON_11", value: 131108)
!821 = !DIEnumerator(name: "MON_12", value: 131109)
!822 = !DIEnumerator(name: "AM_STR", value: 131110)
!823 = !DIEnumerator(name: "PM_STR", value: 131111)
!824 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!825 = !DIEnumerator(name: "D_FMT", value: 131113)
!826 = !DIEnumerator(name: "T_FMT", value: 131114)
!827 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!828 = !DIEnumerator(name: "ERA", value: 131116)
!829 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!830 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!831 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!832 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!833 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!834 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!835 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!836 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!837 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!838 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!839 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!840 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!841 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!842 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!843 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!844 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!845 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!846 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!847 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!848 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!849 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!850 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!851 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!852 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!853 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!854 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!855 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!856 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!857 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!858 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!859 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!860 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!861 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!862 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!863 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!864 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!865 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!866 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!867 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!868 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!869 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!870 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!871 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!872 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!873 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!874 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!875 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!876 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!877 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!878 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!879 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!880 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!881 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!882 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!883 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!884 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!885 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!886 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!887 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!888 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!889 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!890 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!891 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!892 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!893 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!894 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!895 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!896 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!897 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!898 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!899 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!900 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!901 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!902 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!903 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!904 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!905 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!906 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!907 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!908 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!909 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!910 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!911 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!912 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!913 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!914 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!915 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!916 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!917 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!918 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!919 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!920 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!921 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!922 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!923 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!924 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!925 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!926 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!927 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!928 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!929 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!930 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!931 = !DIEnumerator(name: "CODESET", value: 14)
!932 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!933 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!934 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!935 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!936 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!937 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!938 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!939 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!940 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!941 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!942 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!943 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!944 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!945 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!946 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!947 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!948 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!949 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!950 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!951 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!952 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!953 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!954 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!955 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!956 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!957 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!958 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!959 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!960 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!961 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!962 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!963 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!964 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!965 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!966 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!967 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!968 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!969 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!970 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!971 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!972 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!973 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!974 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!975 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!976 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!977 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!978 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!979 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!980 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!981 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!982 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!983 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!984 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!985 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!986 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!987 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!988 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!989 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!990 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!991 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!992 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!993 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!994 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!995 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!996 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!997 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!998 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!999 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!1000 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!1001 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!1002 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!1003 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!1004 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!1005 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!1006 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!1007 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!1008 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!1009 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!1010 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!1011 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!1012 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!1013 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!1014 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!1015 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!1016 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!1017 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!1018 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!1019 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!1020 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!1021 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!1022 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!1023 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!1024 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!1025 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!1026 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!1027 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!1028 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!1029 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!1030 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!1031 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!1032 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!1033 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!1034 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!1035 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!1036 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!1037 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!1038 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!1039 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!1040 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!1041 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!1042 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!1043 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!1044 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!1045 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!1046 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!1047 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!1048 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!1049 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!1050 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!1051 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!1052 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!1053 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!1054 = !DIEnumerator(name: "THOUSEP", value: 65537)
!1055 = !DIEnumerator(name: "__GROUPING", value: 65538)
!1056 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!1057 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!1058 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!1059 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!1060 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!1061 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!1062 = !DIEnumerator(name: "__YESSTR", value: 327682)
!1063 = !DIEnumerator(name: "__NOSTR", value: 327683)
!1064 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!1065 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!1066 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!1067 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!1068 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!1069 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!1070 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!1071 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!1072 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!1073 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!1074 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!1075 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!1076 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!1077 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!1078 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!1079 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!1080 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!1081 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!1082 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!1083 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!1084 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!1085 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!1086 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!1087 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!1088 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!1089 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!1090 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!1091 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!1092 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!1093 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!1094 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!1095 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!1096 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!1097 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!1098 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!1099 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!1100 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!1101 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!1102 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!1103 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!1104 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!1105 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!1106 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!1107 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!1108 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!1109 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!1110 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!1111 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!1112 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!1113 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!1114 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!1115 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!1116 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!1117 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!1118 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!1119 = !{!126, !112, !1120}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!1121 = !{!776}
!1122 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1123 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!1124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1125, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1126, retainedTypes: !1207)
!1125 = !DIFile(filename: "src/extent-scan.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1126 = !{!1127}
!1127 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1128, file: !1125, line: 97, size: 32, elements: !1205)
!1128 = distinct !DISubprogram(name: "extent_scan_read", scope: !1125, file: !1125, line: 87, type: !1129, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !1124, variables: !1149)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!71, !1131}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !1133, line: 36, size: 384, elements: !1134)
!1133 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1134 = !{!1135, !1136, !1138, !1139, !1140, !1141, !1142}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1132, file: !1133, line: 39, baseType: !189, size: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !1132, file: !1133, line: 42, baseType: !1137, size: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !66, line: 86, baseType: !216)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !1132, file: !1133, line: 45, baseType: !69, size: 32, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !1132, file: !1133, line: 48, baseType: !255, size: 64, offset: 192)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !1132, file: !1133, line: 52, baseType: !71, size: 8, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !1132, file: !1133, line: 55, baseType: !71, size: 8, offset: 264)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !1132, file: !1133, line: 58, baseType: !1143, size: 64, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !1133, line: 23, size: 192, elements: !1145)
!1145 = !{!1146, !1147, !1148}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !1144, file: !1133, line: 26, baseType: !1137, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !1144, file: !1133, line: 29, baseType: !1137, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !1144, file: !1133, line: 32, baseType: !69, size: 32, offset: 128)
!1149 = !{!1150, !1151, !1152, !1153, !1190, !1192, !1194, !1196, !1197, !1204}
!1150 = !DILocalVariable(name: "scan", arg: 1, scope: !1128, file: !1125, line: 87, type: !1131)
!1151 = !DILocalVariable(name: "si", scope: !1128, file: !1125, line: 89, type: !69)
!1152 = !DILocalVariable(name: "last_ei", scope: !1128, file: !1125, line: 90, type: !1143)
!1153 = !DILocalVariable(name: "fiemap_buf", scope: !1154, file: !1125, line: 94, type: !1155)
!1154 = distinct !DILexicalBlock(scope: !1128, file: !1125, line: 93, column: 5)
!1155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1128, file: !1125, line: 94, size: 32768, elements: !1156)
!1156 = !{!1157, !1186}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1155, file: !1125, line: 94, baseType: !1158, size: 256)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap", file: !1159, line: 35, size: 256, elements: !1160)
!1159 = !DIFile(filename: "src/fiemap.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1160 = !{!1161, !1165, !1166, !1169, !1170, !1171, !1172}
