; ModuleID = 'coreutils-8.27/src/csplit.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__sigset_t = type { [16 x i64] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.control = type { i64, i64, i64, i32, i8, i8, i8, %struct.re_pattern_buffer }
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_dfa_t = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.buffer_record = type { i64, i64, i64, i64, i64, i8*, %struct.line*, %struct.line*, %struct.buffer_record* }
%struct.line = type { i64, i64, i64, [80 x %struct.cstring], %struct.line* }
%struct.cstring = type { i64, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.re_registers = type { i32, i32*, i32* }
%struct.__mbstate_t = type { i32, %union.anon.6 }
%union.anon.6 = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str.1 = private unnamed_addr constant [17 x i8] c"memory exhausted\00", align 1
@.str = private unnamed_addr constant [3 x i8] c"%s\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 183, type: !441, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !192, globals: !194)
!3 = !DIFile(filename: "src/csplit.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !138, !152, !156, !171, !179}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !6, file: !3, line: 1448, size: 32, elements: !136)
!6 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1343, type: !7, isLocal: false, isDefinition: true, scopeLine: 1344, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !13)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !9, !10}
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !{!14, !15, !16, !17, !21, !22, !24}
!14 = !DILocalVariable(name: "argc", arg: 1, scope: !6, file: !3, line: 1343, type: !9)
!15 = !DILocalVariable(name: "argv", arg: 2, scope: !6, file: !3, line: 1343, type: !10)
!16 = !DILocalVariable(name: "optc", scope: !6, file: !3, line: 1345, type: !9)
!17 = !DILocalVariable(name: "prefix_len", scope: !6, file: !3, line: 1413, type: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !19, line: 62, baseType: !20)
!19 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!20 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!21 = !DILocalVariable(name: "max_digit_string_len", scope: !6, file: !3, line: 1414, type: !18)
!22 = !DILocalVariable(name: "i", scope: !23, file: !3, line: 1427, type: !9)
!23 = distinct !DILexicalBlock(scope: !6, file: !3, line: 1426, column: 3)
!24 = !DILocalVariable(name: "act", scope: !23, file: !3, line: 1450, type: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !26, line: 24, size: 1216, elements: !27)
!26 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!27 = !{!28, !122, !131, !132}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !25, file: !26, line: 35, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !25, file: !26, line: 28, size: 64, elements: !30)
!30 = !{!31, !37}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !29, file: !26, line: 31, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !33, line: 68, baseType: !34)
!33 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !9}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !29, file: !26, line: 33, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !9, !41, !78}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !43, line: 124, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 36, size: 1024, elements: !45)
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !44, file: !43, line: 38, baseType: !9, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !44, file: !43, line: 40, baseType: !9, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !44, file: !43, line: 42, baseType: !9, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !44, file: !43, line: 48, baseType: !9, size: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !44, file: !43, line: 123, baseType: !51, size: 896, offset: 128)
!51 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !44, file: !43, line: 51, size: 896, elements: !52)
!52 = !{!53, !57, !66, !79, !85, !95, !111, !116}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !51, file: !43, line: 53, baseType: !54, size: 896)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 896, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 28)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !51, file: !43, line: 60, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 56, size: 64, elements: !59)
!59 = !{!60, !63}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !58, file: !43, line: 58, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !62, line: 142, baseType: !9)
!62 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !58, file: !43, line: 59, baseType: !64, size: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !62, line: 134, baseType: !65)
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !51, file: !43, line: 68, baseType: !67, size: 128)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 63, size: 128, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !67, file: !43, line: 65, baseType: !9, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !67, file: !43, line: 66, baseType: !9, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !67, file: !43, line: 67, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !73, line: 11, baseType: !74)
!73 = !DIFile(filename: "/usr/include/bits/types/sigval_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!74 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !73, line: 5, size: 64, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !74, file: !73, line: 7, baseType: !9, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !74, file: !73, line: 8, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !51, file: !43, line: 76, baseType: !80, size: 128)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 71, size: 128, elements: !81)
!81 = !{!82, !83, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !80, file: !43, line: 73, baseType: !61, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !80, file: !43, line: 74, baseType: !64, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !80, file: !43, line: 75, baseType: !72, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !51, file: !43, line: 86, baseType: !86, size: 256)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 79, size: 256, elements: !87)
!87 = !{!88, !89, !90, !91, !94}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !86, file: !43, line: 81, baseType: !61, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !86, file: !43, line: 82, baseType: !64, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !86, file: !43, line: 83, baseType: !9, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !86, file: !43, line: 84, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !62, line: 144, baseType: !93)
!93 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !86, file: !43, line: 85, baseType: !92, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !51, file: !43, line: 105, baseType: !96, size: 256)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 89, size: 256, elements: !97)
!97 = !{!98, !99, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !96, file: !43, line: 91, baseType: !78, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !96, file: !43, line: 93, baseType: !100, size: 16, offset: 64)
!100 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !96, file: !43, line: 104, baseType: !102, size: 128, offset: 128)
!102 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !96, file: !43, line: 94, size: 128, elements: !103)
!103 = !{!104, !109}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !102, file: !43, line: 101, baseType: !105, size: 128)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !102, file: !43, line: 97, size: 128, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !105, file: !43, line: 99, baseType: !78, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !105, file: !43, line: 100, baseType: !78, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !102, file: !43, line: 103, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !62, line: 41, baseType: !65)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !51, file: !43, line: 112, baseType: !112, size: 128)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 108, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !112, file: !43, line: 110, baseType: !93, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !112, file: !43, line: 111, baseType: !9, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !51, file: !43, line: 121, baseType: !117, size: 128)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 116, size: 128, elements: !118)
!118 = !{!119, !120, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !117, file: !43, line: 118, baseType: !78, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !117, file: !43, line: 119, baseType: !9, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !117, file: !43, line: 120, baseType: !65, size: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !25, file: !26, line: 43, baseType: !123, size: 1024, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !124, line: 8, baseType: !125)
!124 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 5, size: 1024, elements: !126)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !125, file: !124, line: 7, baseType: !128, size: 1024)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !25, file: !26, line: 46, baseType: !9, size: 32, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !25, file: !26, line: 49, baseType: !133, size: 64, offset: 1152)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null}
!136 = !{!137}
!137 = !DIEnumerator(name: "nsigs", value: 11)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !139, line: 32, size: 32, elements: !140)
!139 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151}
!141 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!142 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!143 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!144 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!145 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!146 = !DIEnumerator(name: "c_quoting_style", value: 5)
!147 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!148 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!149 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!150 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!151 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1232, size: 32, elements: !153)
!153 = !{!154, !155}
!154 = !DIEnumerator(name: "FLAG_THOUSANDS", value: 1)
!155 = !DIEnumerator(name: "FLAG_ALTERNATIVE", value: 2)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !157, line: 46, size: 32, elements: !158)
!157 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170}
!159 = !DIEnumerator(name: "_ISupper", value: 256)
!160 = !DIEnumerator(name: "_ISlower", value: 512)
!161 = !DIEnumerator(name: "_ISalpha", value: 1024)
!162 = !DIEnumerator(name: "_ISdigit", value: 2048)
!163 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!164 = !DIEnumerator(name: "_ISspace", value: 8192)
!165 = !DIEnumerator(name: "_ISprint", value: 16384)
!166 = !DIEnumerator(name: "_ISgraph", value: 32768)
!167 = !DIEnumerator(name: "_ISblank", value: 1)
!168 = !DIEnumerator(name: "_IScntrl", value: 2)
!169 = !DIEnumerator(name: "_ISpunct", value: 4)
!170 = !DIEnumerator(name: "_ISalnum", value: 8)
!171 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !172, line: 26, size: 32, elements: !173)
!172 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!173 = !{!174, !175, !176, !177, !178}
!174 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!175 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!176 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!177 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!178 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!179 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !181, file: !180, line: 192, size: 32, elements: !190)
!180 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!181 = distinct !DISubprogram(name: "x2nrealloc", scope: !180, file: !180, line: 180, type: !182, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !185)
!182 = !DISubroutineType(types: !183)
!183 = !{!78, !78, !184, !18}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!185 = !{!186, !187, !188, !189}
!186 = !DILocalVariable(name: "p", arg: 1, scope: !181, file: !180, line: 180, type: !78)
!187 = !DILocalVariable(name: "pn", arg: 2, scope: !181, file: !180, line: 180, type: !184)
!188 = !DILocalVariable(name: "s", arg: 3, scope: !181, file: !180, line: 180, type: !18)
!189 = !DILocalVariable(name: "n", scope: !181, file: !180, line: 182, type: !18)
!190 = !{!191}
!191 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!192 = !{!11, !78, !65, !32, !9, !193, !20, !18}
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !{!195, !201, !203, !206, !209, !211, !213, !254, !0, !256, !311, !313, !315, !318, !323, !335, !338, !341, !343, !366, !373, !375, !411, !413, !415, !417, !419, !421}
!195 = !DIGlobalVariableExpression(var: !196)
!196 = distinct !DIGlobalVariable(name: "sig", scope: !6, file: !3, line: 1428, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 352, elements: !199)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!199 = !{!200}
!200 = !DISubrange(count: 11)
!201 = !DIGlobalVariableExpression(var: !202)
!202 = distinct !DIGlobalVariable(name: "global_argv", scope: !2, file: !3, line: 161, type: !10, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204)
!204 = distinct !DIGlobalVariable(name: "suppress_count", scope: !2, file: !3, line: 164, type: !205, isLocal: true, isDefinition: true)
!205 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!206 = !DIGlobalVariableExpression(var: !207)
!207 = distinct !DIGlobalVariable(name: "remove_files", scope: !2, file: !3, line: 167, type: !208, isLocal: true, isDefinition: true)
!208 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !205)
!209 = !DIGlobalVariableExpression(var: !210)
!210 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !2, file: !3, line: 170, type: !205, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212)
!212 = distinct !DIGlobalVariable(name: "suppress_matched", scope: !2, file: !3, line: 173, type: !205, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214)
!214 = distinct !DIGlobalVariable(name: "controls", scope: !2, file: !3, line: 177, type: !215, isLocal: true, isDefinition: true)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control", file: !3, line: 51, size: 768, elements: !217)
!217 = !{!218, !222, !225, !226, !227, !228, !229, !230}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !216, file: !3, line: 53, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !220, line: 111, baseType: !221)
!220 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !62, line: 61, baseType: !93)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "lines_required", scope: !216, file: !3, line: 54, baseType: !223, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !220, line: 112, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !62, line: 62, baseType: !20)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !216, file: !3, line: 55, baseType: !223, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "argnum", scope: !216, file: !3, line: 56, baseType: !9, size: 32, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_forever", scope: !216, file: !3, line: 57, baseType: !205, size: 8, offset: 224)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !216, file: !3, line: 58, baseType: !205, size: 8, offset: 232)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "regexpr", scope: !216, file: !3, line: 59, baseType: !205, size: 8, offset: 240)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "re_compiled", scope: !216, file: !3, line: 60, baseType: !231, size: 512, offset: 256)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !232, line: 414, size: 512, elements: !233)
!232 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!233 = !{!234, !237, !239, !240, !242, !243, !246, !247, !248, !249, !250, !251, !252, !253}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !231, file: !232, line: 418, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !232, line: 418, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !231, file: !232, line: 421, baseType: !238, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !232, line: 57, baseType: !20)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !231, file: !232, line: 424, baseType: !238, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !231, file: !232, line: 427, baseType: !241, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !232, line: 73, baseType: !20)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !231, file: !232, line: 432, baseType: !11, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !231, file: !232, line: 438, baseType: !244, size: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !231, file: !232, line: 441, baseType: !18, size: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !231, file: !232, line: 447, baseType: !65, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !231, file: !232, line: 458, baseType: !65, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !231, file: !232, line: 462, baseType: !65, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !231, file: !232, line: 466, baseType: !65, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !231, file: !232, line: 470, baseType: !65, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !231, file: !232, line: 473, baseType: !65, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !231, file: !232, line: 476, baseType: !65, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!254 = !DIGlobalVariableExpression(var: !255)
!255 = distinct !DIGlobalVariable(name: "control_used", scope: !2, file: !3, line: 180, type: !18, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257)
!257 = distinct !DIGlobalVariable(name: "output_stream", scope: !2, file: !3, line: 155, type: !258, isLocal: true, isDefinition: true)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !260, line: 7, baseType: !261)
!260 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !262, line: 241, size: 1728, elements: !263)
!262 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !284, !285, !286, !287, !289, !290, !292, !296, !299, !301, !302, !303, !304, !305, !306, !307}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !261, file: !262, line: 242, baseType: !9, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !261, file: !262, line: 247, baseType: !11, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !261, file: !262, line: 248, baseType: !11, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !261, file: !262, line: 249, baseType: !11, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !261, file: !262, line: 250, baseType: !11, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !261, file: !262, line: 251, baseType: !11, size: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !261, file: !262, line: 252, baseType: !11, size: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !261, file: !262, line: 253, baseType: !11, size: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !261, file: !262, line: 254, baseType: !11, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !261, file: !262, line: 256, baseType: !11, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !261, file: !262, line: 257, baseType: !11, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !261, file: !262, line: 258, baseType: !11, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !261, file: !262, line: 260, baseType: !277, size: 64, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !262, line: 156, size: 192, elements: !279)
!279 = !{!280, !281, !283}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !278, file: !262, line: 157, baseType: !277, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !278, file: !262, line: 158, baseType: !282, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !278, file: !262, line: 162, baseType: !9, size: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !261, file: !262, line: 262, baseType: !282, size: 64, offset: 832)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !261, file: !262, line: 264, baseType: !9, size: 32, offset: 896)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !261, file: !262, line: 268, baseType: !9, size: 32, offset: 928)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !261, file: !262, line: 270, baseType: !288, size: 64, offset: 960)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !62, line: 140, baseType: !93)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !261, file: !262, line: 274, baseType: !193, size: 16, offset: 1024)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !261, file: !262, line: 275, baseType: !291, size: 8, offset: 1040)
!291 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !261, file: !262, line: 276, baseType: !293, size: 8, offset: 1048)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 1)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !261, file: !262, line: 280, baseType: !297, size: 64, offset: 1088)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !262, line: 150, baseType: null)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !261, file: !262, line: 289, baseType: !300, size: 64, offset: 1152)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !62, line: 141, baseType: !93)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !261, file: !262, line: 297, baseType: !78, size: 64, offset: 1216)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !261, file: !262, line: 298, baseType: !78, size: 64, offset: 1280)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !261, file: !262, line: 299, baseType: !78, size: 64, offset: 1344)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !261, file: !262, line: 300, baseType: !78, size: 64, offset: 1408)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !261, file: !262, line: 302, baseType: !18, size: 64, offset: 1472)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !261, file: !262, line: 303, baseType: !9, size: 32, offset: 1536)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !261, file: !262, line: 305, baseType: !308, size: 160, offset: 1568)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 20)
!311 = !DIGlobalVariableExpression(var: !312)
!312 = distinct !DIGlobalVariable(name: "output_filename", scope: !2, file: !3, line: 158, type: !11, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314)
!314 = distinct !DIGlobalVariable(name: "bytes_written", scope: !2, file: !3, line: 152, type: !223, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316)
!316 = distinct !DIGlobalVariable(name: "files_created", scope: !2, file: !3, line: 149, type: !317, isLocal: true, isDefinition: true)
!317 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !65)
!318 = !DIGlobalVariableExpression(var: !319)
!319 = distinct !DIGlobalVariable(name: "prefix", scope: !2, file: !3, line: 140, type: !320, isLocal: true, isDefinition: true)
!320 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!323 = !DIGlobalVariableExpression(var: !324)
!324 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 192, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 2816, elements: !199)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !328, line: 50, size: 256, elements: !329)
!328 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!329 = !{!330, !331, !332, !334}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !328, line: 52, baseType: !321, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !327, file: !328, line: 55, baseType: !9, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !327, file: !328, line: 56, baseType: !333, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !327, file: !328, line: 57, baseType: !9, size: 32, offset: 192)
!335 = !DIGlobalVariableExpression(var: !336)
!336 = distinct !DIGlobalVariable(name: "suffix", scope: !2, file: !3, line: 143, type: !337, isLocal: true, isDefinition: true)
!337 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!338 = !DIGlobalVariableExpression(var: !339)
!339 = distinct !DIGlobalVariable(name: "digits", scope: !2, file: !3, line: 146, type: !340, isLocal: true, isDefinition: true)
!340 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !9)
!341 = !DIGlobalVariableExpression(var: !342)
!342 = distinct !DIGlobalVariable(name: "filename_space", scope: !2, file: !3, line: 137, type: !337, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344)
!344 = distinct !DIGlobalVariable(name: "last_val", scope: !345, file: !3, line: 1184, type: !223, isLocal: true, isDefinition: true)
!345 = distinct !DISubprogram(name: "parse_patterns", scope: !3, file: !3, line: 1179, type: !346, isLocal: true, isDefinition: true, scopeLine: 1180, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !348)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !9, !9, !10}
!348 = !{!349, !350, !351, !352, !353, !354, !355}
!349 = !DILocalVariable(name: "argc", arg: 1, scope: !345, file: !3, line: 1179, type: !9)
!350 = !DILocalVariable(name: "start", arg: 2, scope: !345, file: !3, line: 1179, type: !9)
!351 = !DILocalVariable(name: "argv", arg: 3, scope: !345, file: !3, line: 1179, type: !10)
!352 = !DILocalVariable(name: "i", scope: !345, file: !3, line: 1181, type: !9)
!353 = !DILocalVariable(name: "p", scope: !345, file: !3, line: 1182, type: !215)
!354 = !DILocalVariable(name: "val", scope: !345, file: !3, line: 1183, type: !223)
!355 = !DILocalVariable(name: "buf", scope: !356, file: !3, line: 1204, type: !363)
!356 = distinct !DILexicalBlock(scope: !357, file: !3, line: 1203, column: 13)
!357 = distinct !DILexicalBlock(scope: !358, file: !3, line: 1202, column: 15)
!358 = distinct !DILexicalBlock(scope: !359, file: !3, line: 1193, column: 9)
!359 = distinct !DILexicalBlock(scope: !360, file: !3, line: 1188, column: 11)
!360 = distinct !DILexicalBlock(scope: !361, file: !3, line: 1187, column: 5)
!361 = distinct !DILexicalBlock(scope: !362, file: !3, line: 1186, column: 3)
!362 = distinct !DILexicalBlock(scope: !345, file: !3, line: 1186, column: 3)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 168, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 21)
!366 = !DIGlobalVariableExpression(var: !367)
!367 = distinct !DIGlobalVariable(name: "control_allocated", scope: !368, file: !3, line: 1070, type: !18, isLocal: true, isDefinition: true)
!368 = distinct !DISubprogram(name: "new_control_record", scope: !3, file: !3, line: 1068, type: !369, isLocal: true, isDefinition: true, scopeLine: 1069, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !371)
!369 = !DISubroutineType(types: !370)
!370 = !{!215}
!371 = !{!372}
!372 = !DILocalVariable(name: "p", scope: !368, file: !3, line: 1071, type: !215)
!373 = !DIGlobalVariableExpression(var: !374)
!374 = distinct !DIGlobalVariable(name: "current_line", scope: !2, file: !3, line: 131, type: !223, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376)
!376 = distinct !DIGlobalVariable(name: "prev_buf", scope: !377, file: !3, line: 560, type: !399, isLocal: true, isDefinition: true)
!377 = distinct !DISubprogram(name: "remove_line", scope: !3, file: !3, line: 555, type: !378, isLocal: true, isDefinition: true, scopeLine: 556, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !385)
!378 = !DISubroutineType(types: !379)
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cstring", file: !3, line: 80, size: 128, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !381, file: !3, line: 82, baseType: !18, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !381, file: !3, line: 83, baseType: !11, size: 64, offset: 64)
!385 = !{!386, !387}
!386 = !DILocalVariable(name: "line", scope: !377, file: !3, line: 562, type: !380)
!387 = !DILocalVariable(name: "l", scope: !377, file: !3, line: 563, type: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !3, line: 88, size: 10496, elements: !390)
!390 = !{!391, !392, !393, !394, !398}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !389, file: !3, line: 90, baseType: !18, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "insert_index", scope: !389, file: !3, line: 91, baseType: !18, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "retrieve_index", scope: !389, file: !3, line: 92, baseType: !18, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !389, file: !3, line: 93, baseType: !395, size: 10240, offset: 192)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 10240, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 80)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !389, file: !3, line: 94, baseType: !388, size: 64, offset: 10432)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer_record", file: !3, line: 100, size: 576, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_alloc", scope: !400, file: !3, line: 102, baseType: !18, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !400, file: !3, line: 103, baseType: !18, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "start_line", scope: !400, file: !3, line: 104, baseType: !223, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "first_available", scope: !400, file: !3, line: 105, baseType: !223, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "num_lines", scope: !400, file: !3, line: 106, baseType: !18, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !400, file: !3, line: 107, baseType: !11, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "line_start", scope: !400, file: !3, line: 108, baseType: !388, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "curr_line", scope: !400, file: !3, line: 109, baseType: !388, size: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !3, line: 110, baseType: !399, size: 64, offset: 512)
!411 = !DIGlobalVariableExpression(var: !412)
!412 = distinct !DIGlobalVariable(name: "head", scope: !2, file: !3, line: 119, type: !399, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414)
!414 = distinct !DIGlobalVariable(name: "have_read_eof", scope: !2, file: !3, line: 134, type: !205, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416)
!416 = distinct !DIGlobalVariable(name: "hold_count", scope: !2, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418)
!418 = distinct !DIGlobalVariable(name: "last_line_number", scope: !2, file: !3, line: 128, type: !223, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420)
!420 = distinct !DIGlobalVariable(name: "hold_area", scope: !2, file: !3, line: 122, type: !11, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422)
!422 = distinct !DIGlobalVariable(name: "infomap", scope: !423, file: !424, line: 632, type: !438, isLocal: true, isDefinition: true)
!423 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !424, file: !424, line: 630, type: !425, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !427)
!424 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!425 = !DISubroutineType(types: !426)
!426 = !{null, !321}
!427 = !{!428, !429, !430, !437}
!428 = !DILocalVariable(name: "program", arg: 1, scope: !423, file: !424, line: 630, type: !321)
!429 = !DILocalVariable(name: "node", scope: !423, file: !424, line: 642, type: !321)
!430 = !DILocalVariable(name: "map_prog", scope: !423, file: !424, line: 643, type: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !423, file: !424, line: 632, size: 128, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !433, file: !424, line: 632, baseType: !321, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !433, file: !424, line: 632, baseType: !321, size: 64, offset: 64)
!437 = !DILocalVariable(name: "lc_messages", scope: !423, file: !424, line: 655, type: !321)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 896, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 7)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !442, line: 7, baseType: !123)
!442 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!443 = !DIGlobalVariableExpression(var: !444)
!444 = distinct !DIGlobalVariable(name: "Version", scope: !445, file: !446, line: 2, type: !321, isLocal: false, isDefinition: true)
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, globals: !448)
!446 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!447 = !{}
!448 = !{!443}
!449 = !DIGlobalVariableExpression(var: !450)
!450 = distinct !DIGlobalVariable(name: "file_name", scope: !451, file: !456, line: 36, type: !321, isLocal: true, isDefinition: true)
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, globals: !453)
!452 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!453 = !{!449, !454}
!454 = !DIGlobalVariableExpression(var: !455)
!455 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !451, file: !456, line: 46, type: !205, isLocal: true, isDefinition: true)
!456 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!457 = !DIGlobalVariableExpression(var: !458)
!458 = distinct !DIGlobalVariable(name: "exit_failure", scope: !459, file: !462, line: 24, type: !340, isLocal: false, isDefinition: true)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, globals: !461)
!460 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!461 = !{!457}
!462 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!463 = !DIGlobalVariableExpression(var: !464)
!464 = distinct !DIGlobalVariable(name: "program_name", scope: !465, file: !469, line: 33, type: !321, isLocal: false, isDefinition: true)
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, retainedTypes: !467, globals: !468)
!466 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!467 = !{!78, !11}
!468 = !{!463}
!469 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!470 = !DIGlobalVariableExpression(var: !471)
!471 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !472, file: !484, line: 77, type: !519, isLocal: false, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !474, retainedTypes: !480, globals: !481)
!473 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!474 = !{!138, !475, !156}
!475 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !139, line: 242, size: 32, elements: !476)
!476 = !{!477, !478, !479}
!477 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!478 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!479 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!480 = !{!9, !193, !18, !11}
!481 = !{!470, !482, !489, !501, !503, !508, !515, !517}
!482 = !DIGlobalVariableExpression(var: !483)
!483 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !472, file: !484, line: 93, type: !485, isLocal: false, isDefinition: true)
!484 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 320, elements: !487)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!487 = !{!488}
!488 = !DISubrange(count: 10)
!489 = !DIGlobalVariableExpression(var: !490)
!490 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !472, file: !484, line: 1043, type: !491, isLocal: false, isDefinition: true)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !484, line: 57, size: 448, elements: !492)
!492 = !{!493, !494, !495, !499, !500}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !491, file: !484, line: 60, baseType: !138, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !491, file: !484, line: 63, baseType: !9, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !491, file: !484, line: 67, baseType: !496, size: 256, offset: 64)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 256, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 8)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !491, file: !484, line: 70, baseType: !321, size: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !491, file: !484, line: 73, baseType: !321, size: 64, offset: 384)
!501 = !DIGlobalVariableExpression(var: !502)
!502 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !472, file: !484, line: 108, type: !491, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504)
!504 = distinct !DIGlobalVariable(name: "slot0", scope: !472, file: !484, line: 834, type: !505, isLocal: true, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2048, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 256)
!508 = !DIGlobalVariableExpression(var: !509)
!509 = distinct !DIGlobalVariable(name: "slotvec", scope: !472, file: !484, line: 837, type: !510, isLocal: true, isDefinition: true)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !484, line: 826, size: 128, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !511, file: !484, line: 828, baseType: !18, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !511, file: !484, line: 829, baseType: !11, size: 64, offset: 64)
!515 = !DIGlobalVariableExpression(var: !516)
!516 = distinct !DIGlobalVariable(name: "nslots", scope: !472, file: !484, line: 835, type: !9, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518)
!518 = distinct !DIGlobalVariable(name: "slotvec0", scope: !472, file: !484, line: 836, type: !511, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 704, elements: !199)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!521 = !DIGlobalVariableExpression(var: !522)
!522 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !523, file: !526, line: 26, type: !527, isLocal: false, isDefinition: true)
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, globals: !525)
!524 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!525 = !{!521}
!526 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 376, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 47)
!530 = !DIGlobalVariableExpression(var: !531)
!531 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !532, file: !533, line: 335, type: !9, isLocal: true, isDefinition: true)
!532 = distinct !DISubprogram(name: "rpl_fcntl", scope: !533, file: !533, line: 272, type: !534, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !536, variables: !539)
!533 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!534 = !DISubroutineType(types: !535)
!535 = !{!9, !9, !9, null}
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, globals: !538)
!537 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!538 = !{!530}
!539 = !{!540, !541, !542, !553, !554, !557, !560, !563}
!540 = !DILocalVariable(name: "fd", arg: 1, scope: !532, file: !533, line: 272, type: !9)
!541 = !DILocalVariable(name: "action", arg: 2, scope: !532, file: !533, line: 272, type: !9)
!542 = !DILocalVariable(name: "arg", scope: !532, file: !533, line: 274, type: !543)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !544, line: 30, baseType: !545)
!544 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !537, line: 274, baseType: !546)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 192, elements: !294)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !537, line: 274, size: 192, elements: !548)
!548 = !{!549, !550, !551, !552}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !547, file: !537, line: 274, baseType: !65, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !547, file: !537, line: 274, baseType: !65, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !547, file: !537, line: 274, baseType: !78, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !547, file: !537, line: 274, baseType: !78, size: 64, offset: 128)
!553 = !DILocalVariable(name: "result", scope: !532, file: !533, line: 275, type: !9)
!554 = !DILocalVariable(name: "target", scope: !555, file: !533, line: 322, type: !9)
!555 = distinct !DILexicalBlock(scope: !556, file: !533, line: 321, column: 7)
!556 = distinct !DILexicalBlock(scope: !532, file: !533, line: 278, column: 5)
!557 = !DILocalVariable(name: "flags", scope: !558, file: !533, line: 359, type: !9)
!558 = distinct !DILexicalBlock(scope: !559, file: !533, line: 358, column: 11)
!559 = distinct !DILexicalBlock(scope: !555, file: !533, line: 357, column: 13)
!560 = !DILocalVariable(name: "saved_errno", scope: !561, file: !533, line: 362, type: !9)
!561 = distinct !DILexicalBlock(scope: !562, file: !533, line: 361, column: 15)
!562 = distinct !DILexicalBlock(scope: !558, file: !533, line: 360, column: 17)
!563 = !DILocalVariable(name: "p", scope: !564, file: !533, line: 404, type: !78)
!564 = distinct !DILexicalBlock(scope: !556, file: !533, line: 402, column: 7)
!565 = !DIGlobalVariableExpression(var: !566)
!566 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !567, file: !910, line: 120, type: !320, isLocal: true, isDefinition: true)
!567 = distinct !DICompileUnit(language: DW_LANG_C99, file: !568, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !569, retainedTypes: !908, globals: !909)
!568 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!569 = !{!570}
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !571, line: 41, size: 32, elements: !572)
!571 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907}
!573 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!574 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!575 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!576 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!577 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!578 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!579 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!580 = !DIEnumerator(name: "DAY_1", value: 131079)
!581 = !DIEnumerator(name: "DAY_2", value: 131080)
!582 = !DIEnumerator(name: "DAY_3", value: 131081)
!583 = !DIEnumerator(name: "DAY_4", value: 131082)
!584 = !DIEnumerator(name: "DAY_5", value: 131083)
!585 = !DIEnumerator(name: "DAY_6", value: 131084)
!586 = !DIEnumerator(name: "DAY_7", value: 131085)
!587 = !DIEnumerator(name: "ABMON_1", value: 131086)
!588 = !DIEnumerator(name: "ABMON_2", value: 131087)
!589 = !DIEnumerator(name: "ABMON_3", value: 131088)
!590 = !DIEnumerator(name: "ABMON_4", value: 131089)
!591 = !DIEnumerator(name: "ABMON_5", value: 131090)
!592 = !DIEnumerator(name: "ABMON_6", value: 131091)
!593 = !DIEnumerator(name: "ABMON_7", value: 131092)
!594 = !DIEnumerator(name: "ABMON_8", value: 131093)
!595 = !DIEnumerator(name: "ABMON_9", value: 131094)
!596 = !DIEnumerator(name: "ABMON_10", value: 131095)
!597 = !DIEnumerator(name: "ABMON_11", value: 131096)
!598 = !DIEnumerator(name: "ABMON_12", value: 131097)
!599 = !DIEnumerator(name: "MON_1", value: 131098)
!600 = !DIEnumerator(name: "MON_2", value: 131099)
!601 = !DIEnumerator(name: "MON_3", value: 131100)
!602 = !DIEnumerator(name: "MON_4", value: 131101)
!603 = !DIEnumerator(name: "MON_5", value: 131102)
!604 = !DIEnumerator(name: "MON_6", value: 131103)
!605 = !DIEnumerator(name: "MON_7", value: 131104)
!606 = !DIEnumerator(name: "MON_8", value: 131105)
!607 = !DIEnumerator(name: "MON_9", value: 131106)
!608 = !DIEnumerator(name: "MON_10", value: 131107)
!609 = !DIEnumerator(name: "MON_11", value: 131108)
!610 = !DIEnumerator(name: "MON_12", value: 131109)
!611 = !DIEnumerator(name: "AM_STR", value: 131110)
!612 = !DIEnumerator(name: "PM_STR", value: 131111)
!613 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!614 = !DIEnumerator(name: "D_FMT", value: 131113)
!615 = !DIEnumerator(name: "T_FMT", value: 131114)
!616 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!617 = !DIEnumerator(name: "ERA", value: 131116)
!618 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!619 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!620 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!621 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!622 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!623 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!624 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!625 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!626 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!627 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!628 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!629 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!630 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!631 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!632 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!633 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!634 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!635 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!636 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!637 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!638 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!639 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!640 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!641 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!642 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!643 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!644 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!645 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!646 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!647 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!648 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!649 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!650 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!651 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!652 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!653 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!654 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!655 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!656 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!657 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!658 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!659 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!660 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!661 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!662 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!663 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!664 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!665 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!666 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!667 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!668 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!669 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!670 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!671 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!672 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!673 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!674 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!675 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!676 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!677 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!678 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!679 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!680 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!681 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!682 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!683 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!684 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!685 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!686 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!687 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!688 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!689 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!690 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!691 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!692 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!693 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!694 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!695 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!696 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!697 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!698 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!699 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!700 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!701 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!702 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!703 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!704 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!705 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!706 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!707 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!708 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!709 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!710 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!711 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!712 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!713 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!714 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!715 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!716 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!717 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!718 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!719 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!720 = !DIEnumerator(name: "CODESET", value: 14)
!721 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!722 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!723 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!724 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!725 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!726 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!727 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!728 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!729 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!730 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!731 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!732 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!733 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!734 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!735 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!736 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!737 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!738 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!739 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!740 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!741 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!742 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!743 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!744 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!745 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!746 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!747 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!748 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!749 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!750 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!751 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!752 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!753 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!754 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!755 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!756 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!757 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!758 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!759 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!760 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!761 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!762 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!763 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!764 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!765 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!766 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!767 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!768 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!769 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!770 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!771 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!772 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!773 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!774 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!775 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!776 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!777 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!778 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!779 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!780 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!781 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!782 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!783 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!784 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!785 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!786 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!787 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!788 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!789 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!790 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!791 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!792 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!793 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!794 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!795 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!796 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!797 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!798 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!799 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!800 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!801 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!802 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!803 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!804 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!805 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!806 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!807 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!808 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!809 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!810 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!811 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!812 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!813 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!814 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!815 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!816 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!817 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!818 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!819 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!820 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!821 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!822 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!823 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!824 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!825 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!826 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!827 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!828 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!829 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!830 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!831 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!832 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!833 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!834 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!835 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!836 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!837 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!838 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!839 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!840 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!841 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!842 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!843 = !DIEnumerator(name: "THOUSEP", value: 65537)
!844 = !DIEnumerator(name: "__GROUPING", value: 65538)
!845 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!846 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!847 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!848 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!849 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!850 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!851 = !DIEnumerator(name: "__YESSTR", value: 327682)
!852 = !DIEnumerator(name: "__NOSTR", value: 327683)
!853 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!854 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!855 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!856 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!857 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!858 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!859 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!860 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!861 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!862 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!863 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!864 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!865 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!866 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!867 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!868 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!869 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!870 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!871 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!872 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!873 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!874 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!875 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!876 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!877 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!878 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!879 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!880 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!881 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!882 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!883 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!884 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!885 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!886 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!887 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!888 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!889 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!890 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!891 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!892 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!893 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!894 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!895 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!896 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!897 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!898 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!899 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!900 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!901 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!902 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!903 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!904 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!905 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!906 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!907 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!908 = !{!78, !11, !244}
!909 = !{!565}
!910 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!911 = distinct !DICompileUnit(language: DW_LANG_C99, file: !912, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447)
!912 = !DIFile(filename: "./lib/fd-reopen.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447)
!914 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, retainedTypes: !917)
!916 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!917 = !{!223}
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !920)
!919 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!920 = !{!921}
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !923, file: !922, line: 62, size: 32, elements: !937)
!922 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!923 = distinct !DISubprogram(name: "safe_read", scope: !922, file: !922, line: 56, type: !924, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !918, variables: !926)
!924 = !DISubroutineType(types: !925)
!925 = !{!18, !9, !78, !18}
!926 = !{!927, !928, !929, !930}
!927 = !DILocalVariable(name: "fd", arg: 1, scope: !923, file: !922, line: 56, type: !9)
!928 = !DILocalVariable(name: "buf", arg: 2, scope: !923, file: !922, line: 56, type: !78)
!929 = !DILocalVariable(name: "count", arg: 3, scope: !923, file: !922, line: 56, type: !18)
!930 = !DILocalVariable(name: "result", scope: !931, file: !922, line: 66, type: !934)
!931 = distinct !DILexicalBlock(scope: !932, file: !922, line: 65, column: 5)
!932 = distinct !DILexicalBlock(scope: !933, file: !922, line: 64, column: 3)
!933 = distinct !DILexicalBlock(scope: !923, file: !922, line: 64, column: 3)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !935, line: 109, baseType: !936)
!935 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !62, line: 181, baseType: !93)
!937 = !{!938}
!938 = !DIEnumerator(name: "BUGGY_READ_MAXIMUM", value: 2147475456)
!939 = distinct !DICompileUnit(language: DW_LANG_C99, file: !940, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447)
!940 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !943, retainedTypes: !948)
!942 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!943 = !{!944}
!944 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !945, line: 41, size: 32, elements: !946)
!945 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!946 = !{!947}
!947 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!948 = !{!78}
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !951, retainedTypes: !959)
!950 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!951 = !{!952}
!952 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !953, file: !180, line: 192, size: 32, elements: !190)
!953 = distinct !DISubprogram(name: "x2nrealloc", scope: !180, file: !180, line: 180, type: !182, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !949, variables: !954)
!954 = !{!955, !956, !957, !958}
!955 = !DILocalVariable(name: "p", arg: 1, scope: !953, file: !180, line: 180, type: !78)
!956 = !DILocalVariable(name: "pn", arg: 2, scope: !953, file: !180, line: 180, type: !184)
!957 = !DILocalVariable(name: "s", arg: 3, scope: !953, file: !180, line: 180, type: !18)
!958 = !DILocalVariable(name: "n", scope: !953, file: !180, line: 182, type: !18)
!959 = !{!18, !11, !78}
!960 = distinct !DICompileUnit(language: DW_LANG_C99, file: !961, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !962)
!961 = !DIFile(filename: "./lib/xdectoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!962 = !{!171}
!963 = distinct !DICompileUnit(language: DW_LANG_C99, file: !964, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !962)
!964 = !DIFile(filename: "./lib/xstrtoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!965 = distinct !DICompileUnit(language: DW_LANG_C99, file: !966, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !967, retainedTypes: !968)
!966 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!967 = !{!171, !156}
!968 = !{!9, !193}
!969 = distinct !DICompileUnit(language: DW_LANG_C99, file: !970, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, retainedTypes: !948)
!970 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!971 = distinct !DICompileUnit(language: DW_LANG_C99, file: !972, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447)
!972 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!973 = distinct !DICompileUnit(language: DW_LANG_C99, file: !974, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, retainedTypes: !948)
!974 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!975 = distinct !DICompileUnit(language: DW_LANG_C99, file: !976, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, retainedTypes: !948)
!976 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!977 = distinct !DICompileUnit(language: DW_LANG_C99, file: !978, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, retainedTypes: !979)
!978 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!979 = !{!18}
!980 = distinct !DICompileUnit(language: DW_LANG_C99, file: !981, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447)
!981 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!982 = distinct !DICompileUnit(language: DW_LANG_C99, file: !983, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447)
!983 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!984 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!985 = !{i32 2, !"Dwarf Version", i32 4}
!986 = !{i32 2, !"Debug Info Version", i32 3}
!987 = !{i32 1, !"wchar_size", i32 4}
!988 = !{i32 7, !"PIC Level", i32 2}
!989 = !{i32 7, !"PIE Level", i32 2}
!990 = distinct !DISubprogram(name: "xalloc_die", scope: !3, file: !3, line: 231, type: !134, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !447)
!991 = !DILocation(line: 233, column: 22, scope: !990)
!992 = !DILocation(line: 233, column: 3, scope: !990)
!993 = !DILocation(line: 234, column: 3, scope: !990)
!994 = distinct !DISubprogram(name: "cleanup_fatal", scope: !3, file: !3, line: 224, type: !134, isLocal: true, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !447)
!995 = !DILocation(line: 213, column: 3, scope: !996, inlinedAt: !999)
!996 = distinct !DISubprogram(name: "cleanup", scope: !3, file: !3, line: 211, type: !134, isLocal: true, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !997)
!997 = !{!998}
!998 = !DILocalVariable(name: "oldset", scope: !996, file: !3, line: 213, type: !441)
!999 = distinct !DILocation(line: 226, column: 3, scope: !994)
!1000 = !DILocation(line: 215, column: 3, scope: !996, inlinedAt: !999)
!1001 = !DIExpression()
!1002 = !DILocation(line: 213, column: 12, scope: !996, inlinedAt: !999)
!1003 = !DILocation(line: 217, column: 3, scope: !996, inlinedAt: !999)
!1004 = !DILocation(line: 218, column: 3, scope: !996, inlinedAt: !999)
!1005 = !DILocation(line: 219, column: 3, scope: !996, inlinedAt: !999)
!1006 = !DILocation(line: 220, column: 1, scope: !996, inlinedAt: !999)
!1007 = !DILocation(line: 227, column: 3, scope: !994)
!1008 = distinct !DISubprogram(name: "close_output_file", scope: !3, file: !3, line: 1005, type: !134, isLocal: true, isDefinition: true, scopeLine: 1006, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1009)
!1009 = !{!1010, !1015, !1016, !1017}
!1010 = !DILocalVariable(name: "oldset", scope: !1011, file: !3, line: 1023, type: !441)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 1022, column: 9)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 1021, column: 11)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 1008, column: 5)
!1014 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 1007, column: 7)
!1015 = !DILocalVariable(name: "unlink_ok", scope: !1011, file: !3, line: 1024, type: !205)
!1016 = !DILocalVariable(name: "unlink_errno", scope: !1011, file: !3, line: 1025, type: !9)
!1017 = !DILocalVariable(name: "buf", scope: !1018, file: !3, line: 1041, type: !363)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 1040, column: 13)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 1039, column: 15)
!1020 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 1038, column: 9)
!1021 = !DILocation(line: 1007, column: 7, scope: !1014)
!1022 = !{!1023, !1023, i64 0}
!1023 = !{!"any pointer", !1024, i64 0}
!1024 = !{!"omnipotent char", !1025, i64 0}
!1025 = !{!"Simple C/C++ TBAA"}
!1026 = !DILocation(line: 1007, column: 7, scope: !1008)
!1027 = !DILocalVariable(name: "__stream", arg: 1, scope: !1028, file: !1029, line: 132, type: !258)
!1028 = distinct !DISubprogram(name: "ferror_unlocked", scope: !1029, file: !1029, line: 132, type: !1030, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1032)
!1029 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!9, !258}
!1032 = !{!1027}
!1033 = !DILocation(line: 132, column: 1, scope: !1028, inlinedAt: !1034)
!1034 = distinct !DILocation(line: 1009, column: 11, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 1009, column: 11)
!1036 = !DILocation(line: 134, column: 10, scope: !1028, inlinedAt: !1034)
!1037 = !{!1038, !1039, i64 0}
!1038 = !{!"_IO_FILE", !1039, i64 0, !1023, i64 8, !1023, i64 16, !1023, i64 24, !1023, i64 32, !1023, i64 40, !1023, i64 48, !1023, i64 56, !1023, i64 64, !1023, i64 72, !1023, i64 80, !1023, i64 88, !1023, i64 96, !1023, i64 104, !1039, i64 112, !1039, i64 116, !1040, i64 120, !1041, i64 128, !1024, i64 130, !1024, i64 131, !1023, i64 136, !1040, i64 144, !1023, i64 152, !1023, i64 160, !1023, i64 168, !1023, i64 176, !1040, i64 184, !1039, i64 192, !1024, i64 196}
!1039 = !{!"int", !1024, i64 0}
!1040 = !{!"long", !1024, i64 0}
!1041 = !{!"short", !1024, i64 0}
!1042 = !DILocation(line: 1009, column: 11, scope: !1035)
!1043 = !DILocation(line: 1009, column: 11, scope: !1013)
!1044 = !DILocation(line: 1011, column: 24, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 1010, column: 9)
!1046 = !DILocation(line: 1011, column: 49, scope: !1045)
!1047 = !DILocation(line: 1011, column: 11, scope: !1045)
!1048 = !DILocation(line: 1012, column: 25, scope: !1045)
!1049 = !DILocation(line: 1013, column: 11, scope: !1045)
!1050 = !DILocation(line: 1015, column: 11, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 1015, column: 11)
!1052 = !DILocation(line: 1015, column: 34, scope: !1051)
!1053 = !DILocation(line: 1015, column: 11, scope: !1013)
!1054 = !DILocation(line: 1017, column: 21, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 1016, column: 9)
!1056 = !{!1039, !1039, i64 0}
!1057 = !DILocation(line: 1017, column: 34, scope: !1055)
!1058 = !DILocation(line: 1017, column: 11, scope: !1055)
!1059 = !DILocation(line: 1018, column: 25, scope: !1055)
!1060 = !DILocation(line: 1019, column: 11, scope: !1055)
!1061 = !DILocation(line: 1021, column: 11, scope: !1012)
!1062 = !{!1040, !1040, i64 0}
!1063 = !DILocation(line: 1021, column: 25, scope: !1012)
!1064 = !DILocation(line: 1021, column: 30, scope: !1012)
!1065 = !DILocation(line: 1021, column: 11, scope: !1013)
!1066 = !DILocation(line: 1023, column: 11, scope: !1011)
!1067 = !DILocation(line: 1023, column: 20, scope: !1011)
!1068 = !DILocation(line: 1028, column: 11, scope: !1011)
!1069 = !DILocation(line: 1029, column: 32, scope: !1011)
!1070 = !DILocation(line: 1029, column: 24, scope: !1011)
!1071 = !DILocation(line: 1029, column: 49, scope: !1011)
!1072 = !DILocation(line: 1030, column: 26, scope: !1011)
!1073 = !DILocation(line: 1025, column: 15, scope: !1011)
!1074 = !DILocation(line: 1031, column: 28, scope: !1011)
!1075 = !DILocation(line: 1031, column: 25, scope: !1011)
!1076 = !DILocation(line: 1032, column: 11, scope: !1011)
!1077 = !DILocation(line: 1034, column: 15, scope: !1011)
!1078 = !DILocation(line: 1035, column: 43, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 1034, column: 15)
!1080 = !DILocation(line: 1035, column: 13, scope: !1079)
!1081 = !DILocation(line: 1036, column: 9, scope: !1012)
!1082 = !DILocation(line: 1036, column: 9, scope: !1011)
!1083 = !DILocation(line: 1039, column: 15, scope: !1020)
!1084 = !DILocation(line: 1041, column: 15, scope: !1018)
!1085 = !DILocation(line: 1041, column: 20, scope: !1018)
!1086 = !DILocation(line: 1042, column: 15, scope: !1018)
!1087 = !DILocation(line: 1043, column: 13, scope: !1019)
!1088 = !DILocation(line: 1043, column: 13, scope: !1018)
!1089 = !DILocation(line: 1045, column: 21, scope: !1013)
!1090 = !DILocation(line: 1046, column: 5, scope: !1013)
!1091 = !DILocation(line: 1047, column: 1, scope: !1008)
!1092 = distinct !DISubprogram(name: "delete_all_files", scope: !3, file: !3, line: 984, type: !1093, isLocal: true, isDefinition: true, scopeLine: 985, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1095)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{null, !205}
!1095 = !{!1096, !1097, !1098}
!1096 = !DILocalVariable(name: "in_signal_handler", arg: 1, scope: !1092, file: !3, line: 984, type: !205)
!1097 = !DILocalVariable(name: "i", scope: !1092, file: !3, line: 986, type: !65)
!1098 = !DILocalVariable(name: "name", scope: !1099, file: !3, line: 993, type: !321)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 992, column: 5)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 991, column: 3)
!1101 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 991, column: 3)
!1102 = !DILocation(line: 984, column: 24, scope: !1092)
!1103 = !DILocation(line: 988, column: 9, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 988, column: 7)
!1105 = !{!1106, !1106, i64 0}
!1106 = !{!"_Bool", !1024, i64 0}
!1107 = !{i8 0, i8 2}
!1108 = !DILocation(line: 988, column: 7, scope: !1092)
!1109 = !DILocation(line: 986, column: 16, scope: !1092)
!1110 = !DILocation(line: 991, column: 19, scope: !1100)
!1111 = !DILocation(line: 991, column: 17, scope: !1100)
!1112 = !DILocation(line: 991, column: 3, scope: !1101)
!1113 = !DILocation(line: 993, column: 26, scope: !1099)
!1114 = !DILocation(line: 993, column: 19, scope: !1099)
!1115 = !DILocation(line: 994, column: 11, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 994, column: 11)
!1117 = !DILocation(line: 994, column: 25, scope: !1116)
!1118 = !DILocation(line: 994, column: 30, scope: !1116)
!1119 = !DILocation(line: 995, column: 19, scope: !1116)
!1120 = !DILocation(line: 995, column: 32, scope: !1116)
!1121 = !DILocation(line: 995, column: 9, scope: !1116)
!1122 = !DILocation(line: 991, column: 35, scope: !1100)
!1123 = distinct !{!1123, !1112, !1124}
!1124 = !DILocation(line: 996, column: 5, scope: !1101)
!1125 = !DILocation(line: 998, column: 17, scope: !1092)
!1126 = !DILocation(line: 999, column: 1, scope: !1092)
!1127 = distinct !DISubprogram(name: "make_filename", scope: !3, file: !3, line: 935, type: !1128, isLocal: true, isDefinition: true, scopeLine: 936, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1130)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!11, !65}
!1130 = !{!1131}
!1131 = !DILocalVariable(name: "num", arg: 1, scope: !1127, file: !3, line: 935, type: !65)
!1132 = !DILocation(line: 935, column: 29, scope: !1127)
!1133 = !DILocation(line: 937, column: 11, scope: !1127)
!1134 = !DILocation(line: 937, column: 27, scope: !1127)
!1135 = !DILocalVariable(name: "__dest", arg: 1, scope: !1136, file: !1137, line: 88, type: !1140)
!1136 = distinct !DISubprogram(name: "strcpy", scope: !1137, file: !1137, line: 88, type: !1138, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1142)
!1137 = !DIFile(filename: "/usr/include/bits/string_fortified.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!11, !1140, !1141}
!1140 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!1141 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !321)
!1142 = !{!1135, !1143}
!1143 = !DILocalVariable(name: "__src", arg: 2, scope: !1136, file: !1137, line: 88, type: !1141)
!1144 = !DILocation(line: 88, column: 1, scope: !1136, inlinedAt: !1145)
!1145 = distinct !DILocation(line: 937, column: 3, scope: !1127)
!1146 = !DILocation(line: 90, column: 49, scope: !1136, inlinedAt: !1145)
!1147 = !DILocation(line: 90, column: 10, scope: !1136, inlinedAt: !1145)
!1148 = !DILocation(line: 938, column: 7, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1127, file: !3, line: 938, column: 7)
!1150 = !DILocation(line: 939, column: 5, scope: !1149)
!1151 = !DILocation(line: 938, column: 7, scope: !1127)
!1152 = !DILocation(line: 941, column: 5, scope: !1149)
!1153 = !DILocation(line: 942, column: 10, scope: !1127)
!1154 = !DILocation(line: 942, column: 3, scope: !1127)
!1155 = !DILocation(line: 1204, column: 20, scope: !356, inlinedAt: !1156)
!1156 = distinct !DILocation(line: 1424, column: 3, scope: !6)
!1157 = !DILocation(line: 1343, column: 11, scope: !6)
!1158 = !DILocation(line: 1343, column: 24, scope: !6)
!1159 = !DILocation(line: 1348, column: 21, scope: !6)
!1160 = !DILocation(line: 1348, column: 3, scope: !6)
!1161 = !DILocation(line: 1349, column: 3, scope: !6)
!1162 = !DILocation(line: 1350, column: 3, scope: !6)
!1163 = !DILocation(line: 1351, column: 3, scope: !6)
