; ModuleID = 'coreutils-8.27/src/date.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.table = type { i8*, i32, i32 }
%union.YYSTYPE = type { %struct.relative_time }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.timespec = type { i64, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.timezone = type { i32, i32 }
%struct.parser_control = type { i8*, i64, i32, i32, i64, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i64, i8, i64, i64, i64, i64, i64, i64, i64, i8, i64, [3 x %struct.table] }
%struct.textint = type { i8, i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

!315 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!316 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!317 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!318 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!319 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!320 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!321 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!322 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!323 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!324 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!325 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!326 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!327 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!328 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!329 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!330 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!331 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!332 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!333 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!334 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!335 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!336 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!337 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!338 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!339 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!340 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!341 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!342 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!343 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!344 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!345 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!346 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!347 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!348 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!349 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !351, line: 32, size: 32, elements: !352)
!351 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363}
!353 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!354 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!355 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!356 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!357 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!358 = !DIEnumerator(name: "c_quoting_style", value: 5)
!359 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!360 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!361 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!362 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!363 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!364 = !{!365, !368, !369, !370}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!370 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!371 = !{!372, !454, !459, !461, !0, !481, !495, !500, !506}
!372 = !DIGlobalVariableExpression(var: !373)
!373 = distinct !DIGlobalVariable(name: "rfc_3339_format", scope: !374, file: !3, line: 387, type: !451, isLocal: true, isDefinition: true)
!374 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 347, type: !375, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !379)
!375 = !DISubroutineType(types: !376)
!376 = !{!377, !377, !378}
!377 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!379 = !{!380, !381, !382, !383, !384, !385, !395, !397, !398, !399, !400, !433, !434, !435, !437, !440, !442, !443, !448}
!380 = !DILocalVariable(name: "argc", arg: 1, scope: !374, file: !3, line: 347, type: !377)
!381 = !DILocalVariable(name: "argv", arg: 2, scope: !374, file: !3, line: 347, type: !378)
!382 = !DILocalVariable(name: "optc", scope: !374, file: !3, line: 349, type: !377)
!383 = !DILocalVariable(name: "datestr", scope: !374, file: !3, line: 350, type: !365)
!384 = !DILocalVariable(name: "set_datestr", scope: !374, file: !3, line: 351, type: !365)
!385 = !DILocalVariable(name: "when", scope: !374, file: !3, line: 352, type: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !387, line: 8, size: 128, elements: !388)
!387 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!388 = !{!389, !393}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !386, file: !387, line: 10, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !391, line: 148, baseType: !392)
!391 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!392 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !386, file: !387, line: 11, baseType: !394, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !391, line: 184, baseType: !392)
!395 = !DILocalVariable(name: "set_date", scope: !374, file: !3, line: 353, type: !396)
!396 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!397 = !DILocalVariable(name: "format", scope: !374, file: !3, line: 354, type: !365)
!398 = !DILocalVariable(name: "batch_file", scope: !374, file: !3, line: 355, type: !368)
!399 = !DILocalVariable(name: "reference", scope: !374, file: !3, line: 356, type: !368)
!400 = !DILocalVariable(name: "refstats", scope: !374, file: !3, line: 357, type: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !402, line: 46, size: 1152, elements: !403)
!402 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!403 = !{!404, !407, !409, !411, !414, !416, !418, !419, !420, !422, !424, !426, !427, !428, !429}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !401, file: !402, line: 48, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !391, line: 133, baseType: !406)
!406 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !401, file: !402, line: 53, baseType: !408, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !391, line: 136, baseType: !406)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !401, file: !402, line: 61, baseType: !410, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !391, line: 139, baseType: !406)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !401, file: !402, line: 62, baseType: !412, size: 32, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !391, line: 138, baseType: !413)
!413 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !401, file: !402, line: 64, baseType: !415, size: 32, offset: 224)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !391, line: 134, baseType: !413)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !401, file: !402, line: 65, baseType: !417, size: 32, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !391, line: 135, baseType: !413)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !401, file: !402, line: 67, baseType: !377, size: 32, offset: 288)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !401, file: !402, line: 69, baseType: !405, size: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !401, file: !402, line: 74, baseType: !421, size: 64, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !391, line: 140, baseType: !392)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !401, file: !402, line: 78, baseType: !423, size: 64, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !391, line: 162, baseType: !392)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !401, file: !402, line: 80, baseType: !425, size: 64, offset: 512)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !391, line: 167, baseType: !392)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !401, file: !402, line: 91, baseType: !386, size: 128, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !401, file: !402, line: 92, baseType: !386, size: 128, offset: 704)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !401, file: !402, line: 93, baseType: !386, size: 128, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !401, file: !402, line: 106, baseType: !430, size: 192, offset: 960)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 192, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 3)
!433 = !DILocalVariable(name: "ok", scope: !374, file: !3, line: 358, type: !396)
!434 = !DILocalVariable(name: "option_specified_date", scope: !374, file: !3, line: 359, type: !377)
!435 = !DILocalVariable(name: "new_format", scope: !436, file: !3, line: 372, type: !365)
!436 = distinct !DILexicalBlock(scope: !374, file: !3, line: 371, column: 5)
!437 = !DILocalVariable(name: "i", scope: !438, file: !3, line: 393, type: !5)
!438 = distinct !DILexicalBlock(scope: !439, file: !3, line: 386, column: 11)
!439 = distinct !DILexicalBlock(scope: !436, file: !3, line: 375, column: 9)
!440 = !DILocalVariable(name: "i", scope: !441, file: !3, line: 409, type: !5)
!441 = distinct !DILexicalBlock(scope: !439, file: !3, line: 400, column: 11)
!442 = !DILocalVariable(name: "tzstring", scope: !374, file: !3, line: 507, type: !365)
!443 = !DILocalVariable(name: "tz", scope: !374, file: !3, line: 508, type: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !445, line: 594, baseType: !446)
!445 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !445, line: 594, flags: DIFlagFwdDecl)
!448 = !DILocalVariable(name: "valid_date", scope: !449, file: !3, line: 514, type: !396)
!449 = distinct !DILexicalBlock(scope: !450, file: !3, line: 513, column: 5)
!450 = distinct !DILexicalBlock(scope: !374, file: !3, line: 510, column: 7)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 768, elements: !452)
!452 = !{!432, !453}
!453 = !DISubrange(count: 32)
!454 = !DIGlobalVariableExpression(var: !455)
!455 = distinct !DIGlobalVariable(name: "iso_8601_format", scope: !374, file: !3, line: 401, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 1280, elements: !457)
!457 = !{!458, !453}
!458 = !DISubrange(count: 5)
!459 = !DIGlobalVariableExpression(var: !460)
!460 = distinct !DIGlobalVariable(name: "parse_datetime_flags", scope: !2, file: !3, line: 109, type: !413, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462)
!462 = distinct !DIGlobalVariable(name: "infomap", scope: !463, file: !464, line: 632, type: !478, isLocal: true, isDefinition: true)
!463 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !464, file: !464, line: 630, type: !465, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !467)
!464 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!465 = !DISubroutineType(types: !466)
!466 = !{null, !365}
!467 = !{!468, !469, !470, !477}
!468 = !DILocalVariable(name: "program", arg: 1, scope: !463, file: !464, line: 630, type: !365)
!469 = !DILocalVariable(name: "node", scope: !463, file: !464, line: 642, type: !365)
!470 = !DILocalVariable(name: "map_prog", scope: !463, file: !464, line: 643, type: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !463, file: !464, line: 632, size: 128, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !473, file: !464, line: 632, baseType: !365, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !473, file: !464, line: 632, baseType: !365, size: 64, offset: 64)
!477 = !DILocalVariable(name: "lc_messages", scope: !463, file: !464, line: 655, type: !365)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 896, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 7)
!481 = !DIGlobalVariableExpression(var: !482)
!482 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 88, type: !483, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 4096, elements: !493)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !486, line: 50, size: 256, elements: !487)
!486 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!487 = !{!488, !489, !490, !492}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !485, file: !486, line: 52, baseType: !365, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !485, file: !486, line: 55, baseType: !377, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !485, file: !486, line: 56, baseType: !491, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !485, file: !486, line: 57, baseType: !377, size: 32, offset: 192)
!493 = !{!494}
!494 = !DISubrange(count: 16)
!495 = !DIGlobalVariableExpression(var: !496)
!496 = distinct !DIGlobalVariable(name: "time_spec", scope: !2, file: !3, line: 68, type: !497, isLocal: true, isDefinition: true)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 160, elements: !499)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!499 = !{!458}
!500 = !DIGlobalVariableExpression(var: !501)
!501 = distinct !DIGlobalVariable(name: "time_spec_string", scope: !2, file: !3, line: 61, type: !502, isLocal: true, isDefinition: true)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 384, elements: !504)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!504 = !{!505}
!505 = !DISubrange(count: 6)
!506 = !DIGlobalVariableExpression(var: !507)
!507 = distinct !DIGlobalVariable(name: "rfc_email_format", scope: !2, file: !3, line: 76, type: !508, isLocal: true, isDefinition: true)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 200, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 25)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 112, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 14)
!514 = !DIGlobalVariableExpression(var: !515)
!515 = distinct !DIGlobalVariable(name: "Version", scope: !516, file: !517, line: 2, type: !365, isLocal: false, isDefinition: true)
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !517, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, globals: !519)
!517 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!518 = !{}
!519 = !{!514}
!520 = !DIGlobalVariableExpression(var: !521)
!521 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !522, file: !527, line: 69, type: !528, isLocal: false, isDefinition: true)
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !524, retainedTypes: !525, globals: !526)
!523 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!524 = !{!350}
!525 = !{!369, !370}
!526 = !{!520}
!527 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !529, line: 55, baseType: !530)
!529 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{null}
!533 = !DIGlobalVariableExpression(var: !534)
!534 = distinct !DIGlobalVariable(name: "file_name", scope: !535, file: !540, line: 36, type: !365, isLocal: true, isDefinition: true)
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, globals: !537)
!536 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!537 = !{!533, !538}
!538 = !DIGlobalVariableExpression(var: !539)
!539 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !535, file: !540, line: 46, type: !396, isLocal: true, isDefinition: true)
!540 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!541 = !DIGlobalVariableExpression(var: !542)
!542 = distinct !DIGlobalVariable(name: "exit_failure", scope: !543, file: !546, line: 24, type: !547, isLocal: false, isDefinition: true)
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, globals: !545)
!544 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!545 = !{!541}
!546 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!547 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !377)
!548 = !DIGlobalVariableExpression(var: !549)
!549 = distinct !DIGlobalVariable(name: "yypact", scope: !550, file: !569, line: 1069, type: !782, isLocal: true, isDefinition: true)
!550 = distinct !DICompileUnit(language: DW_LANG_C99, file: !551, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !552, retainedTypes: !566, globals: !607)
!551 = !DIFile(filename: "./lib/parse-datetime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!552 = !{!553, !559, !562}
!553 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !554, line: 167, size: 32, elements: !555)
!554 = !DIFile(filename: "parse-datetime.y", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!555 = !{!556, !557, !558}
!556 = !DIEnumerator(name: "MERam", value: 0)
!557 = !DIEnumerator(name: "MERpm", value: 1)
!558 = !DIEnumerator(name: "MER24", value: 2)
!559 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !554, line: 1562, size: 32, elements: !560)
!560 = !{!561}
!561 = !DIEnumerator(name: "TZBUFSIZE", value: 100)
!562 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !554, line: 169, size: 32, elements: !563)
!563 = !{!564, !565}
!564 = !DIEnumerator(name: "BILLION", value: 1000000000)
!565 = !DIEnumerator(name: "LOG10_BILLION", value: 9)
!566 = !{!567, !413, !377, !605, !369}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !569, line: 900, size: 448, elements: !570)
!569 = !DIFile(filename: "parse-datetime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!570 = !{!571, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !568, file: !569, line: 902, baseType: !572, size: 16)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int16", file: !569, line: 743, baseType: !573)
!573 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !568, file: !569, line: 903, baseType: !575, size: 448)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !569, line: 703, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !569, line: 691, size: 448, elements: !577)
!577 = !{!578, !579, !588, !593}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !576, file: !554, line: 559, baseType: !392, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !576, file: !554, line: 560, baseType: !580, size: 192)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !554, line: 156, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 151, size: 192, elements: !582)
!582 = !{!583, !584, !585}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !581, file: !554, line: 153, baseType: !396, size: 8)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !581, file: !554, line: 154, baseType: !392, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !581, file: !554, line: 155, baseType: !586, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !587, line: 62, baseType: !406)
!587 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!588 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !576, file: !554, line: 561, baseType: !589, size: 128)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !387, line: 8, size: 128, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !589, file: !387, line: 10, baseType: !390, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !589, file: !387, line: 11, baseType: !394, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !576, file: !554, line: 562, baseType: !594, size: 448)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !554, line: 182, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 172, size: 448, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !604}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !595, file: !554, line: 175, baseType: !392, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !595, file: !554, line: 176, baseType: !392, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !595, file: !554, line: 177, baseType: !392, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !595, file: !554, line: 178, baseType: !392, size: 64, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !595, file: !554, line: 179, baseType: !392, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !595, file: !554, line: 180, baseType: !603, size: 64, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_time_t", file: !554, line: 117, baseType: !392)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !595, file: !554, line: 181, baseType: !392, size: 64, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !606, line: 7, baseType: !390)
!606 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!607 = !{!608, !548, !692, !699, !707, !710, !715, !720, !722, !727, !729, !731, !735, !738, !743, !748, !753, !758, !763, !766, !779}
!608 = !DIGlobalVariableExpression(var: !609)
!609 = distinct !DIGlobalVariable(name: "yyval_default", scope: !610, file: !569, line: 1644, type: !575, isLocal: true, isDefinition: true)
!610 = distinct !DISubprogram(name: "yyparse", scope: !569, file: !569, line: 1635, type: !611, isLocal: false, isDefinition: true, scopeLine: 1636, flags: DIFlagPrototyped, isOptimized: true, unit: !550, variables: !657)
!611 = !DISubroutineType(types: !612)
!612 = !{!377, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !554, line: 253, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 191, size: 2880, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !615, file: !554, line: 194, baseType: !365, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !615, file: !554, line: 197, baseType: !392, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !615, file: !554, line: 200, baseType: !377, size: 32, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !615, file: !554, line: 203, baseType: !377, size: 32, offset: 160)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !615, file: !554, line: 206, baseType: !392, size: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !615, file: !554, line: 209, baseType: !377, size: 32, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !615, file: !554, line: 212, baseType: !580, size: 192, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !615, file: !554, line: 213, baseType: !392, size: 64, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !615, file: !554, line: 214, baseType: !392, size: 64, offset: 576)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !615, file: !554, line: 215, baseType: !392, size: 64, offset: 640)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !615, file: !554, line: 216, baseType: !392, size: 64, offset: 704)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !615, file: !554, line: 217, baseType: !589, size: 128, offset: 768)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !615, file: !554, line: 220, baseType: !594, size: 448, offset: 896)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !615, file: !554, line: 223, baseType: !396, size: 8, offset: 1344)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !615, file: !554, line: 224, baseType: !396, size: 8, offset: 1352)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !615, file: !554, line: 225, baseType: !586, size: 64, offset: 1408)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !615, file: !554, line: 226, baseType: !586, size: 64, offset: 1472)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !615, file: !554, line: 227, baseType: !586, size: 64, offset: 1536)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !615, file: !554, line: 228, baseType: !586, size: 64, offset: 1600)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !615, file: !554, line: 229, baseType: !586, size: 64, offset: 1664)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !615, file: !554, line: 230, baseType: !586, size: 64, offset: 1728)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !615, file: !554, line: 231, baseType: !586, size: 64, offset: 1792)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !615, file: !554, line: 234, baseType: !396, size: 8, offset: 1856)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !615, file: !554, line: 237, baseType: !586, size: 64, offset: 1920)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !615, file: !554, line: 238, baseType: !586, size: 64, offset: 1984)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !615, file: !554, line: 239, baseType: !586, size: 64, offset: 2048)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dsts_seen", scope: !615, file: !554, line: 240, baseType: !586, size: 64, offset: 2112)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !615, file: !554, line: 241, baseType: !586, size: 64, offset: 2176)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !615, file: !554, line: 242, baseType: !586, size: 64, offset: 2240)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !615, file: !554, line: 243, baseType: !586, size: 64, offset: 2304)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !615, file: !554, line: 246, baseType: !396, size: 8, offset: 2368)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "debug_default_input_timezone", scope: !615, file: !554, line: 249, baseType: !392, size: 64, offset: 2432)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !615, file: !554, line: 252, baseType: !650, size: 384, offset: 2496)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 384, elements: !431)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !554, line: 164, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 159, size: 128, elements: !653)
!653 = !{!654, !655, !656}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !652, file: !554, line: 161, baseType: !365, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !652, file: !554, line: 162, baseType: !377, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !652, file: !554, line: 163, baseType: !377, size: 32, offset: 96)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !668, !670, !671, !673, !675, !676, !677, !678, !679, !680, !681, !682, !685, !687, !688, !690}
!658 = !DILocalVariable(name: "pc", arg: 1, scope: !610, file: !569, line: 1635, type: !613)
!659 = !DILocalVariable(name: "yychar", scope: !610, file: !569, line: 1638, type: !377)
!660 = !DILocalVariable(name: "yylval", scope: !610, file: !569, line: 1645, type: !575)
!661 = !DILocalVariable(name: "yynerrs", scope: !610, file: !569, line: 1648, type: !377)
!662 = !DILocalVariable(name: "yystate", scope: !610, file: !569, line: 1650, type: !377)
!663 = !DILocalVariable(name: "yyerrstatus", scope: !610, file: !569, line: 1652, type: !377)
!664 = !DILocalVariable(name: "yyssa", scope: !610, file: !569, line: 1662, type: !665)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 320, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 20)
!668 = !DILocalVariable(name: "yyss", scope: !610, file: !569, line: 1663, type: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!670 = !DILocalVariable(name: "yyssp", scope: !610, file: !569, line: 1664, type: !669)
!671 = !DILocalVariable(name: "yyvsa", scope: !610, file: !569, line: 1667, type: !672)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 8960, elements: !666)
!673 = !DILocalVariable(name: "yyvs", scope: !610, file: !569, line: 1668, type: !674)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!675 = !DILocalVariable(name: "yyvsp", scope: !610, file: !569, line: 1669, type: !674)
!676 = !DILocalVariable(name: "yystacksize", scope: !610, file: !569, line: 1671, type: !406)
!677 = !DILocalVariable(name: "yyn", scope: !610, file: !569, line: 1673, type: !377)
!678 = !DILocalVariable(name: "yyresult", scope: !610, file: !569, line: 1674, type: !377)
!679 = !DILocalVariable(name: "yytoken", scope: !610, file: !569, line: 1676, type: !377)
!680 = !DILocalVariable(name: "yyval", scope: !610, file: !569, line: 1679, type: !575)
!681 = !DILocalVariable(name: "yylen", scope: !610, file: !569, line: 1692, type: !377)
!682 = !DILocalVariable(name: "yysize", scope: !683, file: !569, line: 1720, type: !406)
!683 = distinct !DILexicalBlock(scope: !684, file: !569, line: 1718, column: 5)
!684 = distinct !DILexicalBlock(scope: !610, file: !569, line: 1717, column: 7)
!685 = !DILocalVariable(name: "yyss1", scope: !686, file: !569, line: 1754, type: !669)
!686 = distinct !DILexicalBlock(scope: !683, file: !569, line: 1753, column: 7)
!687 = !DILocalVariable(name: "yyptr", scope: !686, file: !569, line: 1755, type: !567)
!688 = !DILocalVariable(name: "yynewbytes", scope: !689, file: !569, line: 1759, type: !406)
!689 = distinct !DILexicalBlock(scope: !686, file: !569, line: 1759, column: 9)
!690 = !DILocalVariable(name: "yynewbytes", scope: !691, file: !569, line: 1760, type: !406)
!691 = distinct !DILexicalBlock(scope: !686, file: !569, line: 1760, column: 9)
!692 = !DIGlobalVariableExpression(var: !693)
!693 = distinct !DIGlobalVariable(name: "yytranslate", scope: !550, file: !569, line: 979, type: !694, isLocal: true, isDefinition: true)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 2224, elements: !697)
!695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_uint8", file: !569, line: 725, baseType: !370)
!697 = !{!698}
!698 = !DISubrange(count: 278)
!699 = !DIGlobalVariableExpression(var: !700)
!700 = distinct !DIGlobalVariable(name: "yycheck", scope: !550, file: !569, line: 1139, type: !701, isLocal: true, isDefinition: true)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 904, elements: !705)
!702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !569, line: 731, baseType: !704)
!704 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!705 = !{!706}
!706 = !DISubrange(count: 113)
!707 = !DIGlobalVariableExpression(var: !708)
!708 = distinct !DIGlobalVariable(name: "yytable", scope: !550, file: !569, line: 1123, type: !709, isLocal: true, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 904, elements: !705)
!710 = !DIGlobalVariableExpression(var: !711)
!711 = distinct !DIGlobalVariable(name: "yydefact", scope: !550, file: !569, line: 1088, type: !712, isLocal: true, isDefinition: true)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 912, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 114)
!715 = !DIGlobalVariableExpression(var: !716)
!716 = distinct !DIGlobalVariable(name: "yyr2", scope: !550, file: !569, line: 1189, type: !717, isLocal: true, isDefinition: true)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 736, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 92)
!720 = !DIGlobalVariableExpression(var: !721)
!721 = distinct !DIGlobalVariable(name: "yyr1", scope: !550, file: !569, line: 1174, type: !717, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723)
!723 = distinct !DIGlobalVariable(name: "yypgoto", scope: !550, file: !569, line: 1105, type: !724, isLocal: true, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 208, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 26)
!727 = !DIGlobalVariableExpression(var: !728)
!728 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !550, file: !569, line: 1113, type: !724, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730)
!730 = distinct !DIGlobalVariable(name: "yystos", scope: !550, file: !569, line: 1157, type: !712, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732)
!732 = distinct !DIGlobalVariable(name: "meridian_table", scope: !550, file: !554, line: 982, type: !733, isLocal: true, isDefinition: true)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 640, elements: !499)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!735 = !DIGlobalVariableExpression(var: !736)
!736 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !550, file: !554, line: 996, type: !737, isLocal: true, isDefinition: true)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 3200, elements: !509)
!738 = !DIGlobalVariableExpression(var: !739)
!739 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !550, file: !554, line: 1070, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 512, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 4)
!743 = !DIGlobalVariableExpression(var: !744)
!744 = distinct !DIGlobalVariable(name: "time_zone_table", scope: !550, file: !554, line: 1083, type: !745, isLocal: true, isDefinition: true)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 6144, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 48)
!748 = !DIGlobalVariableExpression(var: !749)
!749 = distinct !DIGlobalVariable(name: "dst_table", scope: !550, file: !554, line: 991, type: !750, isLocal: true, isDefinition: true)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 128, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 1)
!753 = !DIGlobalVariableExpression(var: !754)
!754 = distinct !DIGlobalVariable(name: "time_units_table", scope: !550, file: !554, line: 1025, type: !755, isLocal: true, isDefinition: true)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 1408, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 11)
!758 = !DIGlobalVariableExpression(var: !759)
!759 = distinct !DIGlobalVariable(name: "relative_time_table", scope: !550, file: !554, line: 1041, type: !760, isLocal: true, isDefinition: true)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 2688, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 21)
!763 = !DIGlobalVariableExpression(var: !764)
!764 = distinct !DIGlobalVariable(name: "military_table", scope: !550, file: !554, line: 1139, type: !765, isLocal: true, isDefinition: true)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 3328, elements: !725)
!766 = !DIGlobalVariableExpression(var: !767)
!767 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !768, file: !554, line: 333, type: !778, isLocal: true, isDefinition: true)
!768 = distinct !DISubprogram(name: "str_days", scope: !554, file: !554, line: 330, type: !769, isLocal: true, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: true, unit: !550, variables: !771)
!769 = !DISubroutineType(types: !770)
!770 = !{!365, !613, !368, !586}
!771 = !{!772, !773, !774, !775}
!772 = !DILocalVariable(name: "pc", arg: 1, scope: !768, file: !554, line: 330, type: !613)
!773 = !DILocalVariable(name: "buffer", arg: 2, scope: !768, file: !554, line: 330, type: !368)
!774 = !DILocalVariable(name: "n", arg: 3, scope: !768, file: !554, line: 330, type: !586)
!775 = !DILocalVariable(name: "l", scope: !776, file: !554, line: 382, type: !586)
!776 = distinct !DILexicalBlock(scope: !777, file: !554, line: 381, column: 5)
!777 = distinct !DILexicalBlock(scope: !768, file: !554, line: 380, column: 7)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 896, elements: !512)
!779 = !DIGlobalVariableExpression(var: !780)
!780 = distinct !DIGlobalVariable(name: "days_values", scope: !768, file: !554, line: 349, type: !781, isLocal: true, isDefinition: true)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 448, elements: !479)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 912, elements: !713)
!783 = !DIGlobalVariableExpression(var: !784)
!784 = distinct !DIGlobalVariable(name: "program_name", scope: !785, file: !789, line: 33, type: !365, isLocal: false, isDefinition: true)
!785 = distinct !DICompileUnit(language: DW_LANG_C99, file: !786, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, retainedTypes: !787, globals: !788)
!786 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!787 = !{!369, !368}
!788 = !{!783}
!789 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!790 = !DIGlobalVariableExpression(var: !791)
!791 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !792, file: !820, line: 77, type: !855, isLocal: false, isDefinition: true)
!792 = distinct !DICompileUnit(language: DW_LANG_C99, file: !793, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !794, retainedTypes: !815, globals: !817)
!793 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!794 = !{!350, !795, !800}
!795 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !351, line: 242, size: 32, elements: !796)
!796 = !{!797, !798, !799}
!797 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!798 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!799 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!800 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !801, line: 46, size: 32, elements: !802)
!801 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!802 = !{!803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814}
!803 = !DIEnumerator(name: "_ISupper", value: 256)
!804 = !DIEnumerator(name: "_ISlower", value: 512)
!805 = !DIEnumerator(name: "_ISalpha", value: 1024)
!806 = !DIEnumerator(name: "_ISdigit", value: 2048)
!807 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!808 = !DIEnumerator(name: "_ISspace", value: 8192)
!809 = !DIEnumerator(name: "_ISprint", value: 16384)
!810 = !DIEnumerator(name: "_ISgraph", value: 32768)
!811 = !DIEnumerator(name: "_ISblank", value: 1)
!812 = !DIEnumerator(name: "_IScntrl", value: 2)
!813 = !DIEnumerator(name: "_ISpunct", value: 4)
!814 = !DIEnumerator(name: "_ISalnum", value: 8)
!815 = !{!377, !816, !586, !368}
!816 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!817 = !{!790, !818, !825, !837, !839, !844, !851, !853}
!818 = !DIGlobalVariableExpression(var: !819)
!819 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !792, file: !820, line: 93, type: !821, isLocal: false, isDefinition: true)
!820 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 320, elements: !823)
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!823 = !{!824}
!824 = !DISubrange(count: 10)
!825 = !DIGlobalVariableExpression(var: !826)
!826 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !792, file: !820, line: 1043, type: !827, isLocal: false, isDefinition: true)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !820, line: 57, size: 448, elements: !828)
!828 = !{!829, !830, !831, !835, !836}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !827, file: !820, line: 60, baseType: !350, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !827, file: !820, line: 63, baseType: !377, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !827, file: !820, line: 67, baseType: !832, size: 256, offset: 64)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 256, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 8)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !827, file: !820, line: 70, baseType: !365, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !827, file: !820, line: 73, baseType: !365, size: 64, offset: 384)
!837 = !DIGlobalVariableExpression(var: !838)
!838 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !792, file: !820, line: 108, type: !827, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840)
!840 = distinct !DIGlobalVariable(name: "slot0", scope: !792, file: !820, line: 834, type: !841, isLocal: true, isDefinition: true)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 2048, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 256)
!844 = !DIGlobalVariableExpression(var: !845)
!845 = distinct !DIGlobalVariable(name: "slotvec", scope: !792, file: !820, line: 837, type: !846, isLocal: true, isDefinition: true)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !820, line: 826, size: 128, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !847, file: !820, line: 828, baseType: !586, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !847, file: !820, line: 829, baseType: !368, size: 64, offset: 64)
!851 = !DIGlobalVariableExpression(var: !852)
!852 = distinct !DIGlobalVariable(name: "nslots", scope: !792, file: !820, line: 835, type: !377, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854)
!854 = distinct !DIGlobalVariable(name: "slotvec0", scope: !792, file: !820, line: 836, type: !847, isLocal: true, isDefinition: true)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 704, elements: !756)
!856 = !DIGlobalVariableExpression(var: !857)
!857 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !858, file: !861, line: 26, type: !862, isLocal: false, isDefinition: true)
!858 = distinct !DICompileUnit(language: DW_LANG_C99, file: !859, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, globals: !860)
!859 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!860 = !{!856}
!861 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 376, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 47)
!865 = !DIGlobalVariableExpression(var: !866)
!866 = distinct !DIGlobalVariable(name: "__mon_yday", scope: !867, file: !875, line: 124, type: !886, isLocal: true, isDefinition: true)
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, retainedTypes: !869, globals: !872)
!868 = !DIFile(filename: "./lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!869 = !{!413, !377, !704, !370, !573, !816, !392, !406, !870, !871}
!870 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!871 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!872 = !{!873, !879, !882, !865}
!873 = !DIGlobalVariableExpression(var: !874, expr: !878)
!874 = distinct !DIGlobalVariable(name: "mktime_min", scope: !867, file: !875, line: 95, type: !876, isLocal: true, isDefinition: true)
!875 = !DIFile(filename: "lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!876 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_int", file: !875, line: 68, baseType: !392)
!878 = !DIExpression(DW_OP_constu, 9223372036854775808, DW_OP_stack_value)
!879 = !DIGlobalVariableExpression(var: !880, expr: !881)
!880 = distinct !DIGlobalVariable(name: "mktime_max", scope: !867, file: !875, line: 98, type: !876, isLocal: true, isDefinition: true)
!881 = !DIExpression(DW_OP_constu, 9223372036854775807, DW_OP_stack_value)
!882 = !DIGlobalVariableExpression(var: !883)
!883 = distinct !DIGlobalVariable(name: "localtime_offset", scope: !867, file: !875, line: 462, type: !884, isLocal: true, isDefinition: true)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "mktime_offset_t", file: !885, line: 30, baseType: !605)
!885 = !DIFile(filename: "./lib/mktime-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !887, size: 416, elements: !888)
!887 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !816)
!888 = !{!889, !890}
!889 = !DISubrange(count: 2)
!890 = !DISubrange(count: 13)
!891 = !DIGlobalVariableExpression(var: !892)
!892 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !893, file: !899, line: 120, type: !900, isLocal: true, isDefinition: true)
!893 = distinct !DICompileUnit(language: DW_LANG_C99, file: !894, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !895, retainedTypes: !896, globals: !898)
!894 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!895 = !{!12}
!896 = !{!369, !368, !897}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!898 = !{!891}
!899 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!900 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !365)
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, retainedTypes: !903)
!902 = !DIFile(filename: "./lib/fprintftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!903 = !{!586, !365, !413, !377, !370}
!904 = distinct !DICompileUnit(language: DW_LANG_C99, file: !905, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518)
!905 = !DIFile(filename: "./lib/gettime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!906 = distinct !DICompileUnit(language: DW_LANG_C99, file: !907, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, retainedTypes: !908)
!907 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!908 = !{!909}
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !910, line: 111, baseType: !911)
!910 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !391, line: 61, baseType: !392)
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, retainedTypes: !914)
!913 = !DIFile(filename: "./lib/posixtm.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!914 = !{!605, !413}
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518)
!916 = !DIFile(filename: "./lib/settime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!917 = distinct !DICompileUnit(language: DW_LANG_C99, file: !918, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, retainedTypes: !919)
!918 = !DIFile(filename: "./lib/strftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!919 = !{!365, !413, !586, !369, !920, !377, !370}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!922 = distinct !DICompileUnit(language: DW_LANG_C99, file: !923, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !924, retainedTypes: !929)
!923 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!924 = !{!925}
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !926, line: 41, size: 32, elements: !927)
!926 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!927 = !{!928}
!928 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!929 = !{!369}
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !932, retainedTypes: !946)
!931 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!932 = !{!933}
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !935, file: !934, line: 192, size: 32, elements: !944)
!934 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!935 = distinct !DISubprogram(name: "x2nrealloc", scope: !934, file: !934, line: 180, type: !936, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !930, variables: !939)
!936 = !DISubroutineType(types: !937)
!937 = !{!369, !369, !938, !586}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!939 = !{!940, !941, !942, !943}
!940 = !DILocalVariable(name: "p", arg: 1, scope: !935, file: !934, line: 180, type: !369)
!941 = !DILocalVariable(name: "pn", arg: 2, scope: !935, file: !934, line: 180, type: !938)
!942 = !DILocalVariable(name: "s", arg: 3, scope: !935, file: !934, line: 180, type: !586)
!943 = !DILocalVariable(name: "n", scope: !935, file: !934, line: 182, type: !586)
!944 = !{!945}
!945 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!946 = !{!586, !368, !369}
!947 = distinct !DICompileUnit(language: DW_LANG_C99, file: !948, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518)
!948 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, retainedTypes: !929)
!950 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!951 = distinct !DICompileUnit(language: DW_LANG_C99, file: !952, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518)
!952 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!953 = distinct !DICompileUnit(language: DW_LANG_C99, file: !954, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, retainedTypes: !929)
!954 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!955 = distinct !DICompileUnit(language: DW_LANG_C99, file: !956, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, retainedTypes: !929)
!956 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!957 = distinct !DICompileUnit(language: DW_LANG_C99, file: !958, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, retainedTypes: !959)
!958 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!959 = !{!586}
!960 = distinct !DICompileUnit(language: DW_LANG_C99, file: !961, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !962, retainedTypes: !967, globals: !968)
!961 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!962 = !{!963}
!963 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !964, line: 49, size: 32, elements: !965)
!964 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!965 = !{!966}
!966 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119)
!967 = !{!368}
!968 = !{!969}
!969 = !DIGlobalVariableExpression(var: !970)
!970 = distinct !DIGlobalVariable(name: "local_tz", scope: !960, file: !964, line: 54, type: !971, isLocal: true, isDefinition: true)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !445, line: 594, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !975, line: 21, size: 128, elements: !976)
!975 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!976 = !{!977, !978, !979}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !974, file: !975, line: 25, baseType: !973, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !974, file: !975, line: 36, baseType: !367, size: 8, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !974, file: !975, line: 48, baseType: !980, offset: 72)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, elements: !981)
!981 = !{!982}
!982 = !DISubrange(count: -1)
!983 = distinct !DICompileUnit(language: DW_LANG_C99, file: !984, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518)
!984 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!985 = distinct !DICompileUnit(language: DW_LANG_C99, file: !986, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518)
!986 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!987 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!988 = !{i32 2, !"Dwarf Version", i32 4}
!989 = !{i32 2, !"Debug Info Version", i32 3}
!990 = !{i32 1, !"wchar_size", i32 4}
!991 = !{i32 7, !"PIC Level", i32 2}
!992 = !{i32 7, !"PIE Level", i32 2}
!993 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 124, type: !994, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !996)
!994 = !DISubroutineType(types: !995)
!995 = !{null, !377}
!996 = !{!997}
!997 = !DILocalVariable(name: "status", arg: 1, scope: !993, file: !3, line: 124, type: !377)
!998 = !DIExpression()
!999 = !DILocation(line: 124, column: 12, scope: !993)
!1000 = !DILocation(line: 126, column: 14, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !993, file: !3, line: 126, column: 7)
!1002 = !DILocation(line: 126, column: 7, scope: !993)
!1003 = !DILocation(line: 127, column: 5, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 127, column: 5)
!1005 = !{!1006, !1006, i64 0}
!1006 = !{!"any pointer", !1007, i64 0}
!1007 = !{!"omnipotent char", !1008, i64 0}
!1008 = !{!"Simple C/C++ TBAA"}
!1009 = !DILocation(line: 130, column: 7, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 129, column: 5)
!1011 = !DILocation(line: 135, column: 7, scope: !1010)
!1012 = !DILocation(line: 587, column: 3, scope: !1013, inlinedAt: !1014)
!1013 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !464, file: !464, line: 585, type: !531, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !518)
!1014 = distinct !DILocation(line: 139, column: 7, scope: !1010)
!1015 = !DILocation(line: 141, column: 7, scope: !1010)
!1016 = !DILocation(line: 144, column: 7, scope: !1010)
!1017 = !DILocation(line: 148, column: 7, scope: !1010)
!1018 = !DILocation(line: 151, column: 7, scope: !1010)
!1019 = !DILocation(line: 158, column: 7, scope: !1010)
!1020 = !DILocation(line: 162, column: 7, scope: !1010)
!1021 = !DILocation(line: 168, column: 7, scope: !1010)
!1022 = !DILocation(line: 171, column: 7, scope: !1010)
!1023 = !DILocation(line: 175, column: 7, scope: !1010)
!1024 = !DILocation(line: 176, column: 7, scope: !1010)
!1025 = !DILocation(line: 177, column: 7, scope: !1010)
!1026 = !DILocation(line: 184, column: 7, scope: !1010)
!1027 = !DILocation(line: 190, column: 7, scope: !1010)
!1028 = !DILocation(line: 196, column: 7, scope: !1010)
!1029 = !DILocation(line: 201, column: 7, scope: !1010)
!1030 = !DILocation(line: 207, column: 7, scope: !1010)
!1031 = !DILocation(line: 213, column: 7, scope: !1010)
!1032 = !DILocation(line: 223, column: 7, scope: !1010)
!1033 = !DILocation(line: 229, column: 7, scope: !1010)
!1034 = !DILocation(line: 235, column: 7, scope: !1010)
!1035 = !DILocation(line: 241, column: 7, scope: !1010)
!1036 = !DILocation(line: 250, column: 7, scope: !1010)
!1037 = !DILocation(line: 259, column: 7, scope: !1010)
!1038 = !DILocation(line: 266, column: 7, scope: !1010)
!1039 = !DILocation(line: 630, column: 34, scope: !463, inlinedAt: !1040)
!1040 = distinct !DILocation(line: 278, column: 7, scope: !1010)
!1041 = !DILocation(line: 642, column: 15, scope: !463, inlinedAt: !1040)
!1042 = !DILocation(line: 651, column: 3, scope: !463, inlinedAt: !1040)
!1043 = !DILocation(line: 655, column: 29, scope: !463, inlinedAt: !1040)
!1044 = !DILocation(line: 655, column: 15, scope: !463, inlinedAt: !1040)
!1045 = !DILocation(line: 656, column: 7, scope: !1046, inlinedAt: !1040)
!1046 = distinct !DILexicalBlock(scope: !463, file: !464, line: 656, column: 7)
!1047 = !DILocation(line: 656, column: 19, scope: !1046, inlinedAt: !1040)
!1048 = !DILocation(line: 656, column: 22, scope: !1046, inlinedAt: !1040)
!1049 = !DILocation(line: 656, column: 7, scope: !463, inlinedAt: !1040)
!1050 = !DILocation(line: 662, column: 7, scope: !1051, inlinedAt: !1040)
!1051 = distinct !DILexicalBlock(scope: !1046, file: !464, line: 657, column: 5)
!1052 = !DILocation(line: 664, column: 5, scope: !1051, inlinedAt: !1040)
!1053 = !DILocation(line: 665, column: 3, scope: !463, inlinedAt: !1040)
!1054 = !DILocation(line: 667, column: 3, scope: !463, inlinedAt: !1040)
!1055 = !DILocation(line: 280, column: 3, scope: !993)
!1056 = !DILocation(line: 347, column: 11, scope: !374)
!1057 = !DILocation(line: 347, column: 24, scope: !374)
!1058 = !DILocation(line: 350, column: 15, scope: !374)
!1059 = !DILocation(line: 351, column: 15, scope: !374)
!1060 = !DILocation(line: 352, column: 3, scope: !374)
!1061 = !DILocation(line: 353, column: 8, scope: !374)
!1062 = !DILocation(line: 354, column: 15, scope: !374)
!1063 = !DILocation(line: 355, column: 9, scope: !374)
!1064 = !DILocation(line: 356, column: 9, scope: !374)
!1065 = !DILocation(line: 357, column: 3, scope: !374)
!1066 = !DILocation(line: 362, column: 21, scope: !374)
!1067 = !DILocation(line: 362, column: 3, scope: !374)
!1068 = !DILocation(line: 363, column: 3, scope: !374)
!1069 = !DILocation(line: 364, column: 3, scope: !374)
!1070 = !DILocation(line: 365, column: 3, scope: !374)
!1071 = !DILocation(line: 367, column: 3, scope: !374)
!1072 = !DILocation(line: 369, column: 3, scope: !374)
!1073 = !DILocation(line: 369, column: 18, scope: !374)
!1074 = !DILocation(line: 349, column: 7, scope: !374)
!1075 = !DILocation(line: 377, column: 21, scope: !439)
!1076 = !DILocation(line: 378, column: 11, scope: !439)
!1077 = distinct !{!1077, !1072, !1078}
!1078 = !DILocation(line: 446, column: 5, scope: !374)
!1079 = !DILocation(line: 380, column: 32, scope: !439)
!1080 = !{!1081, !1081, i64 0}
!1081 = !{!"int", !1007, i64 0}
!1082 = !DILocation(line: 381, column: 11, scope: !439)
!1083 = !DILocation(line: 383, column: 24, scope: !439)
!1084 = !DILocation(line: 384, column: 11, scope: !439)
!1085 = !DILocation(line: 394, column: 15, scope: !438)
!1086 = !{!1007, !1007, i64 0}
!1087 = !DILocation(line: 393, column: 28, scope: !438)
!1088 = !DILocation(line: 396, column: 26, scope: !438)
!1089 = !DILocation(line: 372, column: 19, scope: !436)
!1090 = !DILocation(line: 410, column: 16, scope: !441)
!1091 = !DILocation(line: 411, column: 18, scope: !441)
!1092 = !DILocation(line: 409, column: 28, scope: !441)
!1093 = !DILocation(line: 413, column: 26, scope: !441)
!1094 = !DILocation(line: 417, column: 23, scope: !439)
!1095 = !DILocation(line: 418, column: 11, scope: !439)
!1096 = !DILocation(line: 423, column: 25, scope: !439)
!1097 = !DILocation(line: 425, column: 11, scope: !439)
!1098 = !DILocation(line: 430, column: 15, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !439, file: !3, line: 430, column: 15)
!1100 = !DILocation(line: 430, column: 45, scope: !1099)
!1101 = !DILocation(line: 430, column: 15, scope: !439)
!1102 = !DILocation(line: 431, column: 13, scope: !1099)
!1103 = !DILocation(line: 434, column: 9, scope: !439)
!1104 = !DILocation(line: 435, column: 9, scope: !439)
!1105 = !DILocation(line: 437, column: 11, scope: !439)
!1106 = !DILocation(line: 440, column: 11, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !436, file: !3, line: 440, column: 11)
!1108 = !DILocation(line: 440, column: 11, scope: !436)
!1109 = !DILocation(line: 442, column: 15, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 442, column: 15)
!1111 = distinct !DILexicalBlock(scope: !1107, file: !3, line: 441, column: 9)
!1112 = !DILocation(line: 442, column: 15, scope: !1111)
!1113 = !DILocation(line: 443, column: 13, scope: !1110)
!1114 = !DILocation(line: 448, column: 29, scope: !374)
!1115 = !DILocation(line: 449, column: 31, scope: !374)
!1116 = !DILocation(line: 450, column: 31, scope: !374)
!1117 = !DILocation(line: 449, column: 28, scope: !374)
!1118 = !DILocation(line: 450, column: 28, scope: !374)
!1119 = !DILocation(line: 359, column: 7, scope: !374)
!1120 = !DILocation(line: 452, column: 29, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !374, file: !3, line: 452, column: 7)
!1122 = !DILocation(line: 452, column: 7, scope: !374)
!1123 = !DILocation(line: 455, column: 9, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 453, column: 5)
!1125 = !DILocation(line: 454, column: 7, scope: !1124)
!1126 = !DILocation(line: 456, column: 7, scope: !1124)
!1127 = !DILocation(line: 459, column: 7, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !374, file: !3, line: 459, column: 7)
!1129 = !DILocation(line: 459, column: 19, scope: !1128)
!1130 = !DILocation(line: 459, column: 16, scope: !1128)
!1131 = !DILocation(line: 462, column: 11, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 460, column: 5)
!1133 = !DILocation(line: 461, column: 7, scope: !1132)
!1134 = !DILocation(line: 463, column: 7, scope: !1132)
!1135 = !DILocation(line: 466, column: 7, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !374, file: !3, line: 466, column: 7)
!1137 = !DILocation(line: 466, column: 14, scope: !1136)
!1138 = !DILocation(line: 466, column: 7, scope: !374)
!1139 = !DILocation(line: 468, column: 18, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 468, column: 11)
!1141 = distinct !DILexicalBlock(scope: !1136, file: !3, line: 467, column: 5)
!1142 = !DILocation(line: 468, column: 22, scope: !1140)
!1143 = !DILocation(line: 468, column: 11, scope: !1141)
!1144 = !DILocation(line: 470, column: 24, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 469, column: 9)
!1146 = !DILocation(line: 470, column: 59, scope: !1145)
!1147 = !DILocation(line: 470, column: 66, scope: !1145)
!1148 = !DILocation(line: 470, column: 54, scope: !1145)
!1149 = !DILocation(line: 470, column: 47, scope: !1145)
!1150 = !DILocation(line: 470, column: 11, scope: !1145)
!1151 = !DILocation(line: 471, column: 11, scope: !1145)
!1152 = !DILocation(line: 474, column: 11, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 474, column: 11)
!1154 = !DILocation(line: 474, column: 27, scope: !1153)
!1155 = !DILocation(line: 474, column: 11, scope: !1141)
!1156 = !DILocation(line: 476, column: 15, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 476, column: 15)
!1158 = distinct !DILexicalBlock(scope: !1153, file: !3, line: 475, column: 9)
!1159 = !DILocation(line: 476, column: 15, scope: !1158)
!1160 = !DILocation(line: 477, column: 13, scope: !1157)
!1161 = !DILocation(line: 478, column: 31, scope: !1158)
!1162 = !DILocation(line: 478, column: 35, scope: !1158)
!1163 = !DILocation(line: 491, column: 7, scope: !374)
!1164 = !DILocation(line: 480, column: 25, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1153, file: !3, line: 480, column: 16)
!1166 = !DILocation(line: 483, column: 18, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 481, column: 9)
!1168 = !DILocation(line: 486, column: 30, scope: !1167)
!1169 = !DILocation(line: 486, column: 25, scope: !1167)
!1170 = !DILocation(line: 486, column: 18, scope: !1167)
!1171 = !DILocation(line: 482, column: 11, scope: !1167)
!1172 = !DILocation(line: 487, column: 11, scope: !1167)
!1173 = !DILocation(line: 491, column: 8, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !374, file: !3, line: 491, column: 7)
!1175 = !DILocation(line: 493, column: 16, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1174, file: !3, line: 492, column: 5)
!1177 = !DILocation(line: 494, column: 13, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1176, file: !3, line: 494, column: 11)
!1179 = !DILocation(line: 494, column: 11, scope: !1176)
!1180 = !DILocation(line: 505, column: 5, scope: !1176)
!1181 = !DILocation(line: 507, column: 26, scope: !374)
!1182 = !DILocation(line: 507, column: 15, scope: !374)
!1183 = !DILocation(line: 508, column: 19, scope: !374)
!1184 = !DILocation(line: 508, column: 14, scope: !374)
!1185 = !DILocation(line: 510, column: 7, scope: !374)
!1186 = !DILocalVariable(name: "input_filename", arg: 1, scope: !1187, file: !3, line: 289, type: !365)
!1187 = distinct !DISubprogram(name: "batch_convert", scope: !3, file: !3, line: 289, type: !1188, isLocal: true, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1190)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!396, !365, !365, !444, !365}
!1190 = !{!1186, !1191, !1192, !1193, !1194, !1195, !1243, !1244, !1245, !1246}
!1191 = !DILocalVariable(name: "format", arg: 2, scope: !1187, file: !3, line: 289, type: !365)
!1192 = !DILocalVariable(name: "tz", arg: 3, scope: !1187, file: !3, line: 290, type: !444)
!1193 = !DILocalVariable(name: "tzstring", arg: 4, scope: !1187, file: !3, line: 290, type: !365)
!1194 = !DILocalVariable(name: "ok", scope: !1187, file: !3, line: 292, type: !396)
!1195 = !DILocalVariable(name: "in_stream", scope: !1187, file: !3, line: 293, type: !1196)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1198, line: 7, baseType: !1199)
!1198 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1200, line: 241, size: 1728, elements: !1201)
!1200 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1201 = !{!1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1230, !1233, !1235, !1236, !1237, !1238, !1239, !1240, !1241}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1199, file: !1200, line: 242, baseType: !377, size: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1199, file: !1200, line: 247, baseType: !368, size: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1199, file: !1200, line: 248, baseType: !368, size: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1199, file: !1200, line: 249, baseType: !368, size: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1199, file: !1200, line: 250, baseType: !368, size: 64, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1199, file: !1200, line: 251, baseType: !368, size: 64, offset: 320)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1199, file: !1200, line: 252, baseType: !368, size: 64, offset: 384)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1199, file: !1200, line: 253, baseType: !368, size: 64, offset: 448)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1199, file: !1200, line: 254, baseType: !368, size: 64, offset: 512)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1199, file: !1200, line: 256, baseType: !368, size: 64, offset: 576)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1199, file: !1200, line: 257, baseType: !368, size: 64, offset: 640)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1199, file: !1200, line: 258, baseType: !368, size: 64, offset: 704)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1199, file: !1200, line: 260, baseType: !1215, size: 64, offset: 768)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1200, line: 156, size: 192, elements: !1217)
!1217 = !{!1218, !1219, !1221}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1216, file: !1200, line: 157, baseType: !1215, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1216, file: !1200, line: 158, baseType: !1220, size: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1216, file: !1200, line: 162, baseType: !377, size: 32, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1199, file: !1200, line: 262, baseType: !1220, size: 64, offset: 832)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1199, file: !1200, line: 264, baseType: !377, size: 32, offset: 896)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1199, file: !1200, line: 268, baseType: !377, size: 32, offset: 928)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1199, file: !1200, line: 270, baseType: !421, size: 64, offset: 960)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1199, file: !1200, line: 274, baseType: !816, size: 16, offset: 1024)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1199, file: !1200, line: 275, baseType: !704, size: 8, offset: 1040)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1199, file: !1200, line: 276, baseType: !1229, size: 8, offset: 1048)
!1229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 8, elements: !751)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1199, file: !1200, line: 280, baseType: !1231, size: 64, offset: 1088)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1200, line: 150, baseType: null)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1199, file: !1200, line: 289, baseType: !1234, size: 64, offset: 1152)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !391, line: 141, baseType: !392)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1199, file: !1200, line: 297, baseType: !369, size: 64, offset: 1216)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1199, file: !1200, line: 298, baseType: !369, size: 64, offset: 1280)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1199, file: !1200, line: 299, baseType: !369, size: 64, offset: 1344)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1199, file: !1200, line: 300, baseType: !369, size: 64, offset: 1408)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1199, file: !1200, line: 302, baseType: !586, size: 64, offset: 1472)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1199, file: !1200, line: 303, baseType: !377, size: 32, offset: 1536)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1199, file: !1200, line: 305, baseType: !1242, size: 160, offset: 1568)
!1242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 160, elements: !666)
!1243 = !DILocalVariable(name: "line", scope: !1187, file: !3, line: 294, type: !368)
!1244 = !DILocalVariable(name: "buflen", scope: !1187, file: !3, line: 295, type: !586)
!1245 = !DILocalVariable(name: "when", scope: !1187, file: !3, line: 296, type: !386)
!1246 = !DILocalVariable(name: "line_length", scope: !1247, file: !3, line: 317, type: !1248)
!1247 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 316, column: 5)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !1249, line: 71, baseType: !1250)
!1249 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !391, line: 181, baseType: !392)
!1251 = !DILocation(line: 289, column: 28, scope: !1187, inlinedAt: !1252)
!1252 = distinct !DILocation(line: 511, column: 10, scope: !450)
!1253 = !DILocation(line: 289, column: 56, scope: !1187, inlinedAt: !1252)
!1254 = !DILocation(line: 290, column: 27, scope: !1187, inlinedAt: !1252)
!1255 = !DILocation(line: 290, column: 43, scope: !1187, inlinedAt: !1252)
!1256 = !DILocation(line: 294, column: 3, scope: !1187, inlinedAt: !1252)
!1257 = !DILocation(line: 295, column: 3, scope: !1187, inlinedAt: !1252)
!1258 = !DILocation(line: 296, column: 3, scope: !1187, inlinedAt: !1252)
!1259 = !DILocation(line: 298, column: 7, scope: !1260, inlinedAt: !1252)
!1260 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 298, column: 7)
!1261 = !DILocation(line: 298, column: 7, scope: !1187, inlinedAt: !1252)
!1262 = !DILocation(line: 300, column: 24, scope: !1263, inlinedAt: !1252)
!1263 = distinct !DILexicalBlock(scope: !1260, file: !3, line: 299, column: 5)
!1264 = !DILocation(line: 301, column: 19, scope: !1263, inlinedAt: !1252)
!1265 = !DILocation(line: 293, column: 9, scope: !1187, inlinedAt: !1252)
!1266 = !DILocation(line: 302, column: 5, scope: !1263, inlinedAt: !1252)
!1267 = !DILocation(line: 305, column: 19, scope: !1268, inlinedAt: !1252)
!1268 = distinct !DILexicalBlock(scope: !1260, file: !3, line: 304, column: 5)
!1269 = !DILocation(line: 306, column: 21, scope: !1270, inlinedAt: !1252)
!1270 = distinct !DILexicalBlock(scope: !1268, file: !3, line: 306, column: 11)
!1271 = !DILocation(line: 306, column: 11, scope: !1268, inlinedAt: !1252)
!1272 = !DILocation(line: 308, column: 11, scope: !1273, inlinedAt: !1252)
!1273 = distinct !DILexicalBlock(scope: !1270, file: !3, line: 307, column: 9)
!1274 = !DILocation(line: 294, column: 9, scope: !1187, inlinedAt: !1252)
!1275 = !DILocation(line: 312, column: 8, scope: !1187, inlinedAt: !1252)
!1276 = !DILocation(line: 295, column: 10, scope: !1187, inlinedAt: !1252)
!1277 = !DILocation(line: 313, column: 10, scope: !1187, inlinedAt: !1252)
!1278 = !{!1279, !1279, i64 0}
!1279 = !{!"long", !1007, i64 0}
!1280 = !DILocation(line: 292, column: 8, scope: !1187, inlinedAt: !1252)
!1281 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !1282, file: !1283, line: 115, type: !378)
!1282 = distinct !DISubprogram(name: "getline", scope: !1283, file: !1283, line: 115, type: !1284, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1286)
!1283 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!1250, !378, !938, !1196}
!1286 = !{!1281, !1287, !1288}
!1287 = !DILocalVariable(name: "__n", arg: 2, scope: !1282, file: !1283, line: 115, type: !938)
!1288 = !DILocalVariable(name: "__stream", arg: 3, scope: !1282, file: !1283, line: 115, type: !1196)
!1289 = !DILocation(line: 115, column: 17, scope: !1282, inlinedAt: !1290)
!1290 = distinct !DILocation(line: 317, column: 29, scope: !1247, inlinedAt: !1252)
!1291 = !DILocation(line: 115, column: 36, scope: !1282, inlinedAt: !1290)
!1292 = !DILocation(line: 115, column: 47, scope: !1282, inlinedAt: !1290)
!1293 = !DILocation(line: 117, column: 10, scope: !1282, inlinedAt: !1290)
!1294 = !DILocation(line: 317, column: 15, scope: !1247, inlinedAt: !1252)
!1295 = !DILocation(line: 318, column: 23, scope: !1296, inlinedAt: !1252)
!1296 = distinct !DILexicalBlock(scope: !1247, file: !3, line: 318, column: 11)
!1297 = !DILocation(line: 318, column: 11, scope: !1247, inlinedAt: !1252)
!1298 = !DILocation(line: 324, column: 37, scope: !1299, inlinedAt: !1252)
!1299 = distinct !DILexicalBlock(scope: !1247, file: !3, line: 324, column: 11)
!1300 = !DILocation(line: 325, column: 30, scope: !1299, inlinedAt: !1252)
!1301 = !DILocation(line: 296, column: 19, scope: !1187, inlinedAt: !1252)
!1302 = !DILocation(line: 324, column: 13, scope: !1299, inlinedAt: !1252)
!1303 = !DILocation(line: 324, column: 11, scope: !1247, inlinedAt: !1252)
!1304 = !DILocation(line: 327, column: 15, scope: !1305, inlinedAt: !1252)
!1305 = distinct !DILexicalBlock(scope: !1306, file: !3, line: 327, column: 15)
!1306 = distinct !DILexicalBlock(scope: !1299, file: !3, line: 326, column: 9)
!1307 = !DILocation(line: 327, column: 32, scope: !1305, inlinedAt: !1252)
!1308 = !DILocation(line: 327, column: 37, scope: !1305, inlinedAt: !1252)
!1309 = !DILocation(line: 327, column: 15, scope: !1306, inlinedAt: !1252)
!1310 = !DILocation(line: 328, column: 35, scope: !1305, inlinedAt: !1252)
!1311 = !DILocation(line: 328, column: 13, scope: !1305, inlinedAt: !1252)
!1312 = !DILocation(line: 329, column: 24, scope: !1306, inlinedAt: !1252)
!1313 = !DILocation(line: 329, column: 53, scope: !1306, inlinedAt: !1252)
!1314 = !DILocation(line: 329, column: 46, scope: !1306, inlinedAt: !1252)
!1315 = !DILocation(line: 329, column: 11, scope: !1306, inlinedAt: !1252)
!1316 = !DILocation(line: 331, column: 9, scope: !1306, inlinedAt: !1252)
!1317 = !DILocation(line: 334, column: 17, scope: !1318, inlinedAt: !1252)
!1318 = distinct !DILexicalBlock(scope: !1299, file: !3, line: 333, column: 9)
!1319 = !DILocation(line: 334, column: 14, scope: !1318, inlinedAt: !1252)
!1320 = distinct !{!1320, !1321, !1322}
!1321 = !DILocation(line: 315, column: 3, scope: !1187)
!1322 = !DILocation(line: 336, column: 5, scope: !1187)
!1323 = !DILocation(line: 338, column: 7, scope: !1324, inlinedAt: !1252)
!1324 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 338, column: 7)
!1325 = !DILocation(line: 338, column: 26, scope: !1324, inlinedAt: !1252)
!1326 = !DILocation(line: 338, column: 7, scope: !1187, inlinedAt: !1252)
!1327 = !DILocation(line: 339, column: 5, scope: !1324, inlinedAt: !1252)
!1328 = !DILocation(line: 341, column: 9, scope: !1187, inlinedAt: !1252)
!1329 = !DILocation(line: 341, column: 3, scope: !1187, inlinedAt: !1252)
!1330 = !DILocation(line: 343, column: 10, scope: !1187, inlinedAt: !1252)
!1331 = !DILocation(line: 344, column: 1, scope: !1187, inlinedAt: !1252)
!1332 = !DILocation(line: 511, column: 5, scope: !450)
!1333 = !DILocation(line: 514, column: 12, scope: !449)
!1334 = !DILocation(line: 358, column: 8, scope: !374)
!1335 = !DILocation(line: 517, column: 34, scope: !1336)
!1336 = distinct !DILexicalBlock(scope: !449, file: !3, line: 517, column: 11)
!1337 = !DILocation(line: 519, column: 15, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1339, file: !3, line: 519, column: 15)
!1339 = distinct !DILexicalBlock(scope: !1336, file: !3, line: 518, column: 9)
!1340 = !DILocation(line: 519, column: 22, scope: !1338)
!1341 = !DILocation(line: 519, column: 15, scope: !1339)
!1342 = !DILocation(line: 352, column: 19, scope: !374)
!1343 = !DILocation(line: 534, column: 15, scope: !1344)
!1344 = distinct !DILexicalBlock(scope: !1338, file: !3, line: 532, column: 13)
!1345 = !DILocation(line: 559, column: 11, scope: !449)
!1346 = !DILocation(line: 540, column: 15, scope: !1347)
!1347 = distinct !DILexicalBlock(scope: !1336, file: !3, line: 538, column: 9)
!1348 = !DILocation(line: 357, column: 15, scope: !374)
!1349 = !DILocalVariable(name: "__path", arg: 1, scope: !1350, file: !1351, line: 449, type: !365)
!1350 = distinct !DISubprogram(name: "stat", scope: !1351, file: !1351, line: 449, type: !1352, isLocal: false, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1355)
!1351 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!377, !365, !1354}
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!1355 = !{!1349, !1356}
!1356 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1350, file: !1351, line: 449, type: !1354)
!1357 = !DILocation(line: 449, column: 1, scope: !1350, inlinedAt: !1358)
!1358 = distinct !DILocation(line: 542, column: 19, scope: !1359)
!1359 = distinct !DILexicalBlock(scope: !1360, file: !3, line: 542, column: 19)
!1360 = distinct !DILexicalBlock(scope: !1361, file: !3, line: 541, column: 13)
!1361 = distinct !DILexicalBlock(scope: !1347, file: !3, line: 540, column: 15)
!1362 = !DILocation(line: 451, column: 10, scope: !1350, inlinedAt: !1358)
!1363 = !DILocation(line: 542, column: 47, scope: !1359)
!1364 = !DILocation(line: 542, column: 19, scope: !1360)
!1365 = !DILocation(line: 543, column: 17, scope: !1359)
!1366 = !DILocalVariable(name: "st", arg: 1, scope: !1367, file: !1368, line: 140, type: !1371)
!1367 = distinct !DISubprogram(name: "get_stat_mtime", scope: !1368, file: !1368, line: 140, type: !1369, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1373)
!1368 = !DIFile(filename: "./lib/stat-time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1369 = !DISubroutineType(types: !1370)
!1370 = !{!386, !1371}
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64)
!1372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!1373 = !{!1366}
!1374 = !DILocation(line: 140, column: 36, scope: !1367, inlinedAt: !1375)
!1375 = distinct !DILocation(line: 544, column: 22, scope: !1360)
!1376 = !DILocation(line: 143, column: 10, scope: !1367, inlinedAt: !1375)
!1377 = !DILocation(line: 544, column: 22, scope: !1360)
!1378 = !DILocation(line: 545, column: 13, scope: !1360)
!1379 = !DILocation(line: 548, column: 19, scope: !1380)
!1380 = distinct !DILexicalBlock(scope: !1381, file: !3, line: 548, column: 19)
!1381 = distinct !DILexicalBlock(scope: !1361, file: !3, line: 547, column: 13)
!1382 = !DILocation(line: 548, column: 19, scope: !1381)
!1383 = !DILocation(line: 551, column: 45, scope: !1381)
!1384 = !DILocation(line: 550, column: 28, scope: !1381)
!1385 = !DILocation(line: 556, column: 11, scope: !449)
!1386 = !DILocation(line: 524, column: 25, scope: !1387)
!1387 = distinct !DILexicalBlock(scope: !1338, file: !3, line: 520, column: 13)
!1388 = !DILocation(line: 525, column: 45, scope: !1387)
!1389 = !DILocation(line: 525, column: 28, scope: !1387)
!1390 = !DILocation(line: 529, column: 20, scope: !1387)
!1391 = !DILocation(line: 529, column: 28, scope: !1387)
!1392 = !{!1393, !1279, i64 8}
!1393 = !{!"timespec", !1279, i64 0, !1279, i64 8}
!1394 = !DILocation(line: 557, column: 9, scope: !1395)
!1395 = distinct !DILexicalBlock(scope: !449, file: !3, line: 556, column: 11)
!1396 = !DILocation(line: 559, column: 11, scope: !1397)
!1397 = distinct !DILexicalBlock(scope: !449, file: !3, line: 559, column: 11)
!1398 = !DILocation(line: 563, column: 15, scope: !1399)
!1399 = distinct !DILexicalBlock(scope: !1400, file: !3, line: 563, column: 15)
!1400 = distinct !DILexicalBlock(scope: !1397, file: !3, line: 560, column: 9)
!1401 = !DILocation(line: 563, column: 31, scope: !1399)
!1402 = !DILocation(line: 563, column: 15, scope: !1400)
!1403 = !DILocation(line: 565, column: 25, scope: !1404)
!1404 = distinct !DILexicalBlock(scope: !1399, file: !3, line: 564, column: 13)
!1405 = !DILocation(line: 565, column: 32, scope: !1404)
!1406 = !DILocation(line: 565, column: 15, scope: !1404)
!1407 = !DILocation(line: 567, column: 13, scope: !1404)
!1408 = !DILocation(line: 570, column: 13, scope: !449)
!1409 = !DILocation(line: 570, column: 10, scope: !449)
!1410 = !DILocation(line: 575, column: 10, scope: !374)
!1411 = !DILocation(line: 576, column: 1, scope: !374)
!1412 = distinct !DISubprogram(name: "show_date", scope: !3, file: !3, line: 582, type: !1413, isLocal: true, isDefinition: true, scopeLine: 583, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1415)
!1413 = !DISubroutineType(types: !1414)
!1414 = !{!396, !365, !386, !444}
!1415 = !{!1416, !1417, !1418, !1419, !1434}
!1416 = !DILocalVariable(name: "format", arg: 1, scope: !1412, file: !3, line: 582, type: !365)
!1417 = !DILocalVariable(name: "when", arg: 2, scope: !1412, file: !3, line: 582, type: !386)
!1418 = !DILocalVariable(name: "tz", arg: 3, scope: !1412, file: !3, line: 582, type: !444)
!1419 = !DILocalVariable(name: "tm", scope: !1412, file: !3, line: 584, type: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !1421, line: 7, size: 448, elements: !1422)
!1421 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1422 = !{!1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !1420, file: !1421, line: 9, baseType: !377, size: 32)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !1420, file: !1421, line: 10, baseType: !377, size: 32, offset: 32)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !1420, file: !1421, line: 11, baseType: !377, size: 32, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !1420, file: !1421, line: 12, baseType: !377, size: 32, offset: 96)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !1420, file: !1421, line: 13, baseType: !377, size: 32, offset: 128)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !1420, file: !1421, line: 14, baseType: !377, size: 32, offset: 160)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !1420, file: !1421, line: 15, baseType: !377, size: 32, offset: 192)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !1420, file: !1421, line: 16, baseType: !377, size: 32, offset: 224)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !1420, file: !1421, line: 17, baseType: !377, size: 32, offset: 256)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !1420, file: !1421, line: 20, baseType: !392, size: 64, offset: 320)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !1420, file: !1421, line: 21, baseType: !365, size: 64, offset: 384)
!1434 = !DILocalVariable(name: "buf", scope: !1435, file: !3, line: 598, type: !1437)
!1435 = distinct !DILexicalBlock(scope: !1436, file: !3, line: 597, column: 5)
!1436 = distinct !DILexicalBlock(scope: !1412, file: !3, line: 586, column: 7)
!1437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 168, elements: !761)
!1438 = !DILocation(line: 582, column: 24, scope: !1412)
!1439 = !DILocation(line: 582, column: 65, scope: !1412)
!1440 = !DILocation(line: 584, column: 3, scope: !1412)
!1441 = !DILocation(line: 584, column: 13, scope: !1412)
!1442 = !DILocation(line: 586, column: 7, scope: !1436)
!1443 = !DILocation(line: 586, column: 7, scope: !1412)
!1444 = !DILocation(line: 588, column: 18, scope: !1445)
!1445 = distinct !DILexicalBlock(scope: !1446, file: !3, line: 588, column: 11)
!1446 = distinct !DILexicalBlock(scope: !1436, file: !3, line: 587, column: 5)
!1447 = !DILocation(line: 588, column: 11, scope: !1446)
!1448 = !DILocation(line: 589, column: 9, scope: !1445)
!1449 = !DILocation(line: 590, column: 20, scope: !1446)
!1450 = !DILocation(line: 590, column: 50, scope: !1446)
!1451 = !DILocation(line: 590, column: 45, scope: !1446)
!1452 = !DILocation(line: 590, column: 7, scope: !1446)
!1453 = !DILocation(line: 592, column: 9, scope: !1454)
!1454 = distinct !DILexicalBlock(scope: !1446, file: !3, line: 591, column: 11)
!1455 = !DILocation(line: 593, column: 7, scope: !1446)
!1456 = !DILocalVariable(name: "__c", arg: 1, scope: !1457, file: !1283, line: 88, type: !377)
!1457 = distinct !DISubprogram(name: "fputc_unlocked", scope: !1283, file: !1283, line: 88, type: !1458, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1460)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!377, !377, !1196}
!1460 = !{!1456, !1461}
!1461 = !DILocalVariable(name: "__stream", arg: 2, scope: !1457, file: !1283, line: 88, type: !1196)
!1462 = !DILocation(line: 88, column: 21, scope: !1457, inlinedAt: !1463)
!1463 = distinct !DILocation(line: 593, column: 7, scope: !1446)
!1464 = !DILocation(line: 88, column: 32, scope: !1457, inlinedAt: !1463)
!1465 = !DILocation(line: 90, column: 10, scope: !1457, inlinedAt: !1463)
!1466 = !{!1467, !1006, i64 40}
!1467 = !{!"_IO_FILE", !1081, i64 0, !1006, i64 8, !1006, i64 16, !1006, i64 24, !1006, i64 32, !1006, i64 40, !1006, i64 48, !1006, i64 56, !1006, i64 64, !1006, i64 72, !1006, i64 80, !1006, i64 88, !1006, i64 96, !1006, i64 104, !1081, i64 112, !1081, i64 116, !1279, i64 120, !1468, i64 128, !1007, i64 130, !1007, i64 131, !1006, i64 136, !1279, i64 144, !1006, i64 152, !1006, i64 160, !1006, i64 168, !1006, i64 176, !1279, i64 184, !1081, i64 192, !1007, i64 196}
!1468 = !{!"short", !1007, i64 0}
!1469 = !{!1467, !1006, i64 48}
!1470 = !{!"branch_weights", i32 2000, i32 1}
!1471 = !DILocation(line: 598, column: 7, scope: !1435)
!1472 = !DILocation(line: 598, column: 12, scope: !1435)
!1473 = !DILocation(line: 599, column: 20, scope: !1435)
!1474 = !DILocation(line: 600, column: 37, scope: !1435)
