; ModuleID = 'coreutils-8.27/src/dd.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__sigset_t = type { [16 x i64] }
%struct.symbol_value = type { [12 x i8], i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.mtget = type { i64, i64, i64, i64, i64, i32, i32 }
%struct.timezone = type { i32, i32 }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.__mbstate_t = type { i32, %union.anon.12 }
%union.anon.12 = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !87, line: 112, baseType: !88)
!87 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !89, line: 62, baseType: !85)
!89 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!90 = !{!91}
!91 = !DILocalVariable(name: "n", arg: 1, scope: !82, file: !81, line: 183, type: !86)
!92 = !{!93}
!93 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000)
!94 = !{!95, !98, !99, !86, !103, !109, !108, !110, !112}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !100, line: 86, baseType: !101)
!100 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !89, line: 140, baseType: !102)
!102 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !104, line: 68, baseType: !105)
!104 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !108}
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !87, line: 111, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !89, line: 61, baseType: !102)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !113, line: 62, baseType: !85)
!113 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!114 = !{!115, !117, !122, !124, !127, !129, !131, !133, !135, !140, !0, !159, !165, !167, !169, !182, !187, !192, !194, !196, !198, !200, !202, !204, !222, !224, !226, !228, !230, !232, !234, !236, !239, !242, !244, !246, !248, !250, !252, !254, !256, !258, !260, !262, !264, !266, !268, !270, !272, !274, !284, !286, !288, !290, !292, !294, !296, !298, !309, !322}
!115 = !DIGlobalVariableExpression(var: !116)
!116 = distinct !DIGlobalVariable(name: "page_size", scope: !2, file: !3, line: 151, type: !112, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118)
!118 = distinct !DIGlobalVariable(name: "start_time", scope: !2, file: !3, line: 214, type: !119, isLocal: true, isDefinition: true)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "xtime_t", file: !120, line: 36, baseType: !121)
!120 = !DIFile(filename: "./lib/xtime.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!121 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!122 = !DIGlobalVariableExpression(var: !123)
!123 = distinct !DIGlobalVariable(name: "next_time", scope: !2, file: !3, line: 217, type: !119, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125)
!125 = distinct !DIGlobalVariable(name: "input_seekable", scope: !2, file: !3, line: 223, type: !126, isLocal: true, isDefinition: true)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIGlobalVariableExpression(var: !128)
!128 = distinct !DIGlobalVariable(name: "input_seek_errno", scope: !2, file: !3, line: 227, type: !108, isLocal: true, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130)
!130 = distinct !DIGlobalVariable(name: "input_offset", scope: !2, file: !3, line: 231, type: !86, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132)
!132 = distinct !DIGlobalVariable(name: "i_nocache", scope: !2, file: !3, line: 267, type: !126, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134)
!134 = distinct !DIGlobalVariable(name: "o_nocache", scope: !2, file: !3, line: 267, type: !126, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136)
!136 = distinct !DIGlobalVariable(name: "trans_table", scope: !2, file: !3, line: 391, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 2048, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 256)
!140 = !DIGlobalVariableExpression(var: !141)
!141 = distinct !DIGlobalVariable(name: "infomap", scope: !142, file: !81, line: 632, type: !156, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !81, file: !81, line: 630, type: !143, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !145)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !95}
!145 = !{!146, !147, !148, !155}
!146 = !DILocalVariable(name: "program", arg: 1, scope: !142, file: !81, line: 630, type: !95)
!147 = !DILocalVariable(name: "node", scope: !142, file: !81, line: 642, type: !95)
!148 = !DILocalVariable(name: "map_prog", scope: !142, file: !81, line: 643, type: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !142, file: !81, line: 632, size: 128, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !151, file: !81, line: 632, baseType: !95, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !151, file: !81, line: 632, baseType: !95, size: 64, offset: 64)
!155 = !DILocalVariable(name: "lc_messages", scope: !142, file: !81, line: 655, type: !95)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 896, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 7)
!159 = !DIGlobalVariableExpression(var: !160)
!160 = distinct !DIGlobalVariable(name: "info_signal_count", scope: !2, file: !3, line: 264, type: !161, isLocal: true, isDefinition: true)
!161 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !163, line: 8, baseType: !164)
!163 = !DIFile(filename: "/usr/include/bits/types/sig_atomic_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !89, line: 203, baseType: !108)
!165 = !DIGlobalVariableExpression(var: !166)
!166 = distinct !DIGlobalVariable(name: "interrupt_signal", scope: !2, file: !3, line: 261, type: !161, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168)
!168 = distinct !DIGlobalVariable(name: "close_stdout_required", scope: !2, file: !3, line: 507, type: !126, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170)
!170 = distinct !DIGlobalVariable(name: "conversions", scope: !2, file: !3, line: 283, type: !171, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 2176, elements: !180)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "symbol_value", file: !3, line: 276, size: 128, elements: !174)
!174 = !{!175, !179}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "symbol", scope: !173, file: !3, line: 278, baseType: !176, size: 96)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 96, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 12)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !173, file: !3, line: 279, baseType: !108, size: 32, offset: 96)
!180 = !{!181}
!181 = !DISubrange(count: 17)
!182 = !DIGlobalVariableExpression(var: !183)
!183 = distinct !DIGlobalVariable(name: "flags", scope: !2, file: !3, line: 358, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 2432, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 19)
!187 = !DIGlobalVariableExpression(var: !188)
!188 = distinct !DIGlobalVariable(name: "statuses", scope: !2, file: !3, line: 382, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 512, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 4)
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "status_level", scope: !2, file: !3, line: 193, type: !108, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195)
!195 = distinct !DIGlobalVariable(name: "input_blocksize", scope: !2, file: !3, line: 154, type: !112, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "conversion_blocksize", scope: !2, file: !3, line: 160, type: !112, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199)
!199 = distinct !DIGlobalVariable(name: "skip_records", scope: !2, file: !3, line: 163, type: !86, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201)
!201 = distinct !DIGlobalVariable(name: "skip_bytes", scope: !2, file: !3, line: 167, type: !112, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203)
!203 = distinct !DIGlobalVariable(name: "warn_partial_read", scope: !2, file: !3, line: 235, type: !126, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205)
!205 = distinct !DIGlobalVariable(name: "prev_nread", scope: !206, file: !3, line: 1100, type: !209, isLocal: true, isDefinition: true)
!206 = distinct !DISubprogram(name: "iread", scope: !3, file: !3, line: 1083, type: !207, isLocal: true, isDefinition: true, scopeLine: 1084, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !212)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !108, !211, !112}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !100, line: 109, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !89, line: 181, baseType: !102)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!212 = !{!213, !214, !215, !216, !217}
!213 = !DILocalVariable(name: "fd", arg: 1, scope: !206, file: !3, line: 1083, type: !108)
!214 = !DILocalVariable(name: "buf", arg: 2, scope: !206, file: !3, line: 1083, type: !211)
!215 = !DILocalVariable(name: "size", arg: 3, scope: !206, file: !3, line: 1083, type: !112)
!216 = !DILocalVariable(name: "nread", scope: !206, file: !3, line: 1085, type: !209)
!217 = !DILocalVariable(name: "prev", scope: !218, file: !3, line: 1104, type: !86)
!218 = distinct !DILexicalBlock(scope: !219, file: !3, line: 1103, column: 9)
!219 = distinct !DILexicalBlock(scope: !220, file: !3, line: 1102, column: 11)
!220 = distinct !DILexicalBlock(scope: !221, file: !3, line: 1099, column: 5)
!221 = distinct !DILexicalBlock(scope: !206, file: !3, line: 1098, column: 7)
!222 = !DIGlobalVariableExpression(var: !223)
!223 = distinct !DIGlobalVariable(name: "progress_len", scope: !2, file: !3, line: 220, type: !108, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225)
!225 = distinct !DIGlobalVariable(name: "r_full", scope: !2, file: !3, line: 208, type: !86, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227)
!227 = distinct !DIGlobalVariable(name: "r_partial", scope: !2, file: !3, line: 205, type: !86, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229)
!229 = distinct !DIGlobalVariable(name: "w_full", scope: !2, file: !3, line: 202, type: !86, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231)
!231 = distinct !DIGlobalVariable(name: "w_partial", scope: !2, file: !3, line: 199, type: !86, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233)
!233 = distinct !DIGlobalVariable(name: "r_truncate", scope: !2, file: !3, line: 238, type: !86, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235)
!235 = distinct !DIGlobalVariable(name: "w_bytes", scope: !2, file: !3, line: 211, type: !86, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237)
!237 = distinct !DIGlobalVariable(name: "iread_fnc", scope: !2, file: !3, line: 270, type: !238, isLocal: true, isDefinition: true)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!239 = !DIGlobalVariableExpression(var: !240)
!240 = distinct !DIGlobalVariable(name: "ebcdic_to_ascii", scope: !2, file: !3, line: 470, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2048, elements: !138)
!242 = !DIGlobalVariableExpression(var: !243)
!243 = distinct !DIGlobalVariable(name: "translation_needed", scope: !2, file: !3, line: 196, type: !126, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245)
!245 = distinct !DIGlobalVariable(name: "ascii_to_ebcdic", scope: !2, file: !3, line: 398, type: !241, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247)
!247 = distinct !DIGlobalVariable(name: "newline_character", scope: !2, file: !3, line: 242, type: !97, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249)
!249 = distinct !DIGlobalVariable(name: "space_character", scope: !2, file: !3, line: 243, type: !97, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251)
!251 = distinct !DIGlobalVariable(name: "ascii_to_ibm", scope: !2, file: !3, line: 434, type: !241, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253)
!253 = distinct !DIGlobalVariable(name: "input_file", scope: !2, file: !3, line: 145, type: !95, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255)
!255 = distinct !DIGlobalVariable(name: "input_flags", scope: !2, file: !3, line: 189, type: !108, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257)
!257 = distinct !DIGlobalVariable(name: "output_file", scope: !2, file: !3, line: 148, type: !95, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259)
!259 = distinct !DIGlobalVariable(name: "output_flags", scope: !2, file: !3, line: 190, type: !108, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261)
!261 = distinct !DIGlobalVariable(name: "conversions_mask", scope: !2, file: !3, line: 186, type: !108, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263)
!263 = distinct !DIGlobalVariable(name: "seek_records", scope: !2, file: !3, line: 170, type: !86, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265)
!265 = distinct !DIGlobalVariable(name: "output_blocksize", scope: !2, file: !3, line: 157, type: !112, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267)
!267 = distinct !DIGlobalVariable(name: "seek_bytes", scope: !2, file: !3, line: 174, type: !86, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269)
!269 = distinct !DIGlobalVariable(name: "input_offset_overflow", scope: !2, file: !3, line: 232, type: !126, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271)
!271 = distinct !DIGlobalVariable(name: "obuf", scope: !2, file: !3, line: 249, type: !211, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273)
!273 = distinct !DIGlobalVariable(name: "ibuf", scope: !2, file: !3, line: 246, type: !211, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275)
!275 = distinct !DIGlobalVariable(name: "pending_spaces", scope: !276, file: !3, line: 1958, type: !112, isLocal: true, isDefinition: true)
!276 = distinct !DISubprogram(name: "copy_with_unblock", scope: !3, file: !3, line: 1954, type: !277, isLocal: true, isDefinition: true, scopeLine: 1955, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !279)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !95, !112}
!279 = !{!280, !281, !282, !283}
!280 = !DILocalVariable(name: "buf", arg: 1, scope: !276, file: !3, line: 1954, type: !95)
!281 = !DILocalVariable(name: "nread", arg: 2, scope: !276, file: !3, line: 1954, type: !112)
!282 = !DILocalVariable(name: "i", scope: !276, file: !3, line: 1956, type: !112)
!283 = !DILocalVariable(name: "c", scope: !276, file: !3, line: 1957, type: !97)
!284 = !DIGlobalVariableExpression(var: !285)
!285 = distinct !DIGlobalVariable(name: "char_is_saved", scope: !2, file: !3, line: 1617, type: !126, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287)
!287 = distinct !DIGlobalVariable(name: "saved_char", scope: !2, file: !3, line: 1620, type: !97, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289)
!289 = distinct !DIGlobalVariable(name: "oc", scope: !2, file: !3, line: 252, type: !112, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291)
!291 = distinct !DIGlobalVariable(name: "col", scope: !2, file: !3, line: 255, type: !112, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293)
!293 = distinct !DIGlobalVariable(name: "final_op_was_seek", scope: !2, file: !3, line: 177, type: !126, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295)
!295 = distinct !DIGlobalVariable(name: "max_records", scope: !2, file: !3, line: 180, type: !86, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297)
!297 = distinct !DIGlobalVariable(name: "max_bytes", scope: !2, file: !3, line: 183, type: !112, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299)
!299 = distinct !DIGlobalVariable(name: "output_offset", scope: !300, file: !3, line: 1053, type: !99, isLocal: true, isDefinition: true)
!300 = distinct !DISubprogram(name: "invalidate_cache", scope: !3, file: !3, line: 1023, type: !301, isLocal: true, isDefinition: true, scopeLine: 1024, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !303)
!301 = !DISubroutineType(types: !302)
!302 = !{!126, !108, !99}
!303 = !{!304, !305, !306, !307, !308}
!304 = !DILocalVariable(name: "fd", arg: 1, scope: !300, file: !3, line: 1023, type: !108)
!305 = !DILocalVariable(name: "len", arg: 2, scope: !300, file: !3, line: 1023, type: !99)
!306 = !DILocalVariable(name: "adv_ret", scope: !300, file: !3, line: 1025, type: !108)
!307 = !DILocalVariable(name: "clen", scope: !300, file: !3, line: 1028, type: !99)
!308 = !DILocalVariable(name: "pending", scope: !300, file: !3, line: 1033, type: !99)
!309 = !DIGlobalVariableExpression(var: !310)
!310 = distinct !DIGlobalVariable(name: "i_pending", scope: !311, file: !3, line: 1000, type: !99, isLocal: true, isDefinition: true)
!311 = distinct !DISubprogram(name: "cache_round", scope: !3, file: !3, line: 998, type: !312, isLocal: true, isDefinition: true, scopeLine: 999, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !314)
!312 = !DISubroutineType(types: !313)
!313 = !{!99, !108, !99}
!314 = !{!315, !316, !317, !319}
!315 = !DILocalVariable(name: "fd", arg: 1, scope: !311, file: !3, line: 998, type: !108)
!316 = !DILocalVariable(name: "len", arg: 2, scope: !311, file: !3, line: 998, type: !99)
!317 = !DILocalVariable(name: "pending", scope: !311, file: !3, line: 1001, type: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!319 = !DILocalVariable(name: "c_pending", scope: !320, file: !3, line: 1005, type: !86)
!320 = distinct !DILexicalBlock(scope: !321, file: !3, line: 1004, column: 5)
!321 = distinct !DILexicalBlock(scope: !311, file: !3, line: 1003, column: 7)
!322 = !DIGlobalVariableExpression(var: !323)
!323 = distinct !DIGlobalVariable(name: "o_pending", scope: !311, file: !3, line: 1000, type: !99, isLocal: true, isDefinition: true)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !325, line: 7, baseType: !326)
!325 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !327, line: 8, baseType: !328)
!327 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 5, size: 1024, elements: !329)
!329 = !{!330}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !328, file: !327, line: 7, baseType: !331, size: 1024)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 1024, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 16)
!334 = !DIGlobalVariableExpression(var: !335)
!335 = distinct !DIGlobalVariable(name: "Version", scope: !336, file: !337, line: 2, type: !95, isLocal: false, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338, globals: !339)
!337 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!338 = !{}
!339 = !{!334}
!340 = !DIGlobalVariableExpression(var: !341)
!341 = distinct !DIGlobalVariable(name: "file_name", scope: !342, file: !347, line: 36, type: !95, isLocal: true, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338, globals: !344)
!343 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!344 = !{!340, !345}
!345 = !DIGlobalVariableExpression(var: !346)
!346 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !342, file: !347, line: 46, type: !126, isLocal: true, isDefinition: true)
!347 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!348 = !DIGlobalVariableExpression(var: !349)
!349 = distinct !DIGlobalVariable(name: "exit_failure", scope: !350, file: !353, line: 24, type: !354, isLocal: false, isDefinition: true)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338, globals: !352)
!351 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!352 = !{!348}
!353 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!354 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!355 = !DIGlobalVariableExpression(var: !356)
!356 = distinct !DIGlobalVariable(name: "power_letter", scope: !357, file: !364, line: 36, type: !375, isLocal: true, isDefinition: true)
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !358, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !359, retainedTypes: !360, globals: !361)
!358 = !DIFile(filename: "./lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!359 = !{!67, !38}
!360 = !{!95}
!361 = !{!355, !362, !369}
!362 = !DIGlobalVariableExpression(var: !363)
!363 = distinct !DIGlobalVariable(name: "block_size_args", scope: !357, file: !364, line: 398, type: !365, isLocal: true, isDefinition: true)
!364 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 192, elements: !367)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!367 = !{!368}
!368 = !DISubrange(count: 3)
!369 = !DIGlobalVariableExpression(var: !370)
!370 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !357, file: !364, line: 399, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 64, elements: !373)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!373 = !{!374}
!374 = !DISubrange(count: 2)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 72, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 9)
!378 = !DIGlobalVariableExpression(var: !379)
!379 = distinct !DIGlobalVariable(name: "long_options", scope: !380, file: !383, line: 33, type: !384, isLocal: true, isDefinition: true)
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338, globals: !382)
!381 = !DIFile(filename: "./lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!382 = !{!378}
!383 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 768, elements: !367)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !387, line: 50, size: 256, elements: !388)
!387 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!388 = !{!389, !390, !391, !393}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !386, file: !387, line: 52, baseType: !95, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !386, file: !387, line: 55, baseType: !108, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !386, file: !387, line: 56, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !386, file: !387, line: 57, baseType: !108, size: 32, offset: 192)
!394 = !DIGlobalVariableExpression(var: !395)
!395 = distinct !DIGlobalVariable(name: "program_name", scope: !396, file: !400, line: 33, type: !95, isLocal: false, isDefinition: true)
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338, retainedTypes: !398, globals: !399)
!397 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!398 = !{!98, !211}
!399 = !{!394}
!400 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!401 = !DIGlobalVariableExpression(var: !402)
!402 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !403, file: !431, line: 77, type: !465, isLocal: false, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !426, globals: !428)
!404 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!405 = !{!5, !406, !411}
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !407)
!407 = !{!408, !409, !410}
!408 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!409 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!410 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !412, line: 46, size: 32, elements: !413)
!412 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!414 = !DIEnumerator(name: "_ISupper", value: 256)
!415 = !DIEnumerator(name: "_ISlower", value: 512)
!416 = !DIEnumerator(name: "_ISalpha", value: 1024)
!417 = !DIEnumerator(name: "_ISdigit", value: 2048)
!418 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!419 = !DIEnumerator(name: "_ISspace", value: 8192)
!420 = !DIEnumerator(name: "_ISprint", value: 16384)
!421 = !DIEnumerator(name: "_ISgraph", value: 32768)
!422 = !DIEnumerator(name: "_ISblank", value: 1)
!423 = !DIEnumerator(name: "_IScntrl", value: 2)
!424 = !DIEnumerator(name: "_ISpunct", value: 4)
!425 = !DIEnumerator(name: "_ISalnum", value: 8)
!426 = !{!108, !427, !112, !211}
!427 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!428 = !{!401, !429, !436, !449, !451, !454, !461, !463}
!429 = !DIGlobalVariableExpression(var: !430)
!430 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !403, file: !431, line: 93, type: !432, isLocal: false, isDefinition: true)
!431 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 320, elements: !434)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!434 = !{!435}
!435 = !DISubrange(count: 10)
!436 = !DIGlobalVariableExpression(var: !437)
!437 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !403, file: !431, line: 1043, type: !438, isLocal: false, isDefinition: true)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !431, line: 57, size: 448, elements: !439)
!439 = !{!440, !441, !442, !447, !448}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !438, file: !431, line: 60, baseType: !5, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !438, file: !431, line: 63, baseType: !108, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !438, file: !431, line: 67, baseType: !443, size: 256, offset: 64)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 256, elements: !445)
!444 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!445 = !{!446}
!446 = !DISubrange(count: 8)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !438, file: !431, line: 70, baseType: !95, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !438, file: !431, line: 73, baseType: !95, size: 64, offset: 384)
!449 = !DIGlobalVariableExpression(var: !450)
!450 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !403, file: !431, line: 108, type: !438, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452)
!452 = distinct !DIGlobalVariable(name: "slot0", scope: !403, file: !431, line: 834, type: !453, isLocal: true, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 2048, elements: !138)
!454 = !DIGlobalVariableExpression(var: !455)
!455 = distinct !DIGlobalVariable(name: "slotvec", scope: !403, file: !431, line: 837, type: !456, isLocal: true, isDefinition: true)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !431, line: 826, size: 128, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !457, file: !431, line: 828, baseType: !112, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !457, file: !431, line: 829, baseType: !211, size: 64, offset: 64)
!461 = !DIGlobalVariableExpression(var: !462)
!462 = distinct !DIGlobalVariable(name: "nslots", scope: !403, file: !431, line: 835, type: !108, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464)
!464 = distinct !DIGlobalVariable(name: "slotvec0", scope: !403, file: !431, line: 836, type: !457, isLocal: true, isDefinition: true)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 704, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 11)
!468 = !DIGlobalVariableExpression(var: !469)
!469 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !470, file: !473, line: 26, type: !474, isLocal: false, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338, globals: !472)
!471 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!472 = !{!468}
!473 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 376, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 47)
!477 = !DIGlobalVariableExpression(var: !478)
!478 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !479, file: !480, line: 335, type: !108, isLocal: true, isDefinition: true)
!479 = distinct !DISubprogram(name: "rpl_fcntl", scope: !480, file: !480, line: 272, type: !481, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !483, variables: !486)
!480 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!481 = !DISubroutineType(types: !482)
!482 = !{!108, !108, !108, null}
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338, globals: !485)
!484 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!485 = !{!477}
!486 = !{!487, !488, !489, !502, !503, !506, !509, !512}
!487 = !DILocalVariable(name: "fd", arg: 1, scope: !479, file: !480, line: 272, type: !108)
!488 = !DILocalVariable(name: "action", arg: 2, scope: !479, file: !480, line: 272, type: !108)
!489 = !DILocalVariable(name: "arg", scope: !479, file: !480, line: 274, type: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !491, line: 30, baseType: !492)
!491 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !484, line: 274, baseType: !493)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 192, elements: !500)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !484, line: 274, size: 192, elements: !495)
!495 = !{!496, !497, !498, !499}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !494, file: !484, line: 274, baseType: !444, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !494, file: !484, line: 274, baseType: !444, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !494, file: !484, line: 274, baseType: !98, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !494, file: !484, line: 274, baseType: !98, size: 64, offset: 128)
!500 = !{!501}
!501 = !DISubrange(count: 1)
!502 = !DILocalVariable(name: "result", scope: !479, file: !480, line: 275, type: !108)
!503 = !DILocalVariable(name: "target", scope: !504, file: !480, line: 322, type: !108)
!504 = distinct !DILexicalBlock(scope: !505, file: !480, line: 321, column: 7)
!505 = distinct !DILexicalBlock(scope: !479, file: !480, line: 278, column: 5)
!506 = !DILocalVariable(name: "flags", scope: !507, file: !480, line: 359, type: !108)
!507 = distinct !DILexicalBlock(scope: !508, file: !480, line: 358, column: 11)
!508 = distinct !DILexicalBlock(scope: !504, file: !480, line: 357, column: 13)
!509 = !DILocalVariable(name: "saved_errno", scope: !510, file: !480, line: 362, type: !108)
!510 = distinct !DILexicalBlock(scope: !511, file: !480, line: 361, column: 15)
!511 = distinct !DILexicalBlock(scope: !507, file: !480, line: 360, column: 17)
!512 = !DILocalVariable(name: "p", scope: !513, file: !480, line: 404, type: !98)
!513 = distinct !DILexicalBlock(scope: !505, file: !480, line: 402, column: 7)
!514 = !DIGlobalVariableExpression(var: !515)
!515 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !516, file: !521, line: 69, type: !522, isLocal: false, isDefinition: true)
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !517, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, retainedTypes: !519, globals: !520)
!517 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!518 = !{!5}
!519 = !{!98, !109}
!520 = !{!514}
!521 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !523, line: 55, baseType: !524)
!523 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{null}
!527 = !DIGlobalVariableExpression(var: !528)
!528 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !529, file: !873, line: 120, type: !874, isLocal: true, isDefinition: true)
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !531, retainedTypes: !870, globals: !872)
!530 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!531 = !{!532}
!532 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !533, line: 41, size: 32, elements: !534)
!533 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869}
!535 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!536 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!537 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!538 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!539 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!540 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!541 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!542 = !DIEnumerator(name: "DAY_1", value: 131079)
!543 = !DIEnumerator(name: "DAY_2", value: 131080)
!544 = !DIEnumerator(name: "DAY_3", value: 131081)
!545 = !DIEnumerator(name: "DAY_4", value: 131082)
!546 = !DIEnumerator(name: "DAY_5", value: 131083)
!547 = !DIEnumerator(name: "DAY_6", value: 131084)
!548 = !DIEnumerator(name: "DAY_7", value: 131085)
!549 = !DIEnumerator(name: "ABMON_1", value: 131086)
!550 = !DIEnumerator(name: "ABMON_2", value: 131087)
!551 = !DIEnumerator(name: "ABMON_3", value: 131088)
!552 = !DIEnumerator(name: "ABMON_4", value: 131089)
!553 = !DIEnumerator(name: "ABMON_5", value: 131090)
!554 = !DIEnumerator(name: "ABMON_6", value: 131091)
!555 = !DIEnumerator(name: "ABMON_7", value: 131092)
!556 = !DIEnumerator(name: "ABMON_8", value: 131093)
!557 = !DIEnumerator(name: "ABMON_9", value: 131094)
!558 = !DIEnumerator(name: "ABMON_10", value: 131095)
!559 = !DIEnumerator(name: "ABMON_11", value: 131096)
!560 = !DIEnumerator(name: "ABMON_12", value: 131097)
!561 = !DIEnumerator(name: "MON_1", value: 131098)
!562 = !DIEnumerator(name: "MON_2", value: 131099)
!563 = !DIEnumerator(name: "MON_3", value: 131100)
!564 = !DIEnumerator(name: "MON_4", value: 131101)
!565 = !DIEnumerator(name: "MON_5", value: 131102)
!566 = !DIEnumerator(name: "MON_6", value: 131103)
!567 = !DIEnumerator(name: "MON_7", value: 131104)
!568 = !DIEnumerator(name: "MON_8", value: 131105)
!569 = !DIEnumerator(name: "MON_9", value: 131106)
!570 = !DIEnumerator(name: "MON_10", value: 131107)
!571 = !DIEnumerator(name: "MON_11", value: 131108)
!572 = !DIEnumerator(name: "MON_12", value: 131109)
!573 = !DIEnumerator(name: "AM_STR", value: 131110)
!574 = !DIEnumerator(name: "PM_STR", value: 131111)
!575 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!576 = !DIEnumerator(name: "D_FMT", value: 131113)
!577 = !DIEnumerator(name: "T_FMT", value: 131114)
!578 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!579 = !DIEnumerator(name: "ERA", value: 131116)
!580 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!581 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!582 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!583 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!584 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!585 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!586 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!587 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!588 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!589 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!590 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!591 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!592 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!593 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!594 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!595 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!596 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!597 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!598 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!599 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!600 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!601 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!602 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!603 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!604 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!605 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!606 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!607 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!608 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!609 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!610 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!611 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!612 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!613 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!614 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!615 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!616 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!617 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!618 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!619 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!620 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!621 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!622 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!623 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!624 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!625 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!626 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!627 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!628 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!629 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!630 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!631 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!632 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!633 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!634 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!635 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!636 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!637 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!638 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!639 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!640 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!641 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!642 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!643 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!644 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!645 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!646 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!647 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!648 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!649 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!650 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!651 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!652 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!653 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!654 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!655 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!656 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!657 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!658 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!659 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!660 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!661 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!662 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!663 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!664 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!665 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!666 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!667 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!668 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!669 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!670 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!671 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!672 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!673 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!674 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!675 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!676 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!677 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!678 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!679 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!680 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!681 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!682 = !DIEnumerator(name: "CODESET", value: 14)
!683 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!684 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!685 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!686 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!687 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!688 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!689 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!690 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!691 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!692 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!693 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!694 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!695 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!696 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!697 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!698 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!699 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!700 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!701 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!702 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!703 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!704 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!705 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!706 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!707 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!708 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!709 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!710 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!711 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!712 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!713 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!714 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!715 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!716 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!717 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!718 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!719 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!720 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!721 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!722 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!723 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!724 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!725 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!726 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!727 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!728 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!729 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!730 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!731 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!732 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!733 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!734 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!735 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!736 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!737 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!738 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!739 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!740 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!741 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!742 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!743 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!744 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!745 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!746 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!747 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!748 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!749 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!750 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!751 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!752 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!753 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!754 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!755 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!756 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!757 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!758 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!759 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!760 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!761 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!762 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!763 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!764 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!765 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!766 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!767 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!768 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!769 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!770 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!771 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!772 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!773 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!774 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!775 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!776 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!777 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!778 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!779 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!780 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!781 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!782 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!783 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!784 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!785 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!786 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!787 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!788 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!789 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!790 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!791 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!792 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!793 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!794 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!795 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!796 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!797 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!798 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!799 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!800 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!801 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!802 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!803 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!804 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!805 = !DIEnumerator(name: "THOUSEP", value: 65537)
!806 = !DIEnumerator(name: "__GROUPING", value: 65538)
!807 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!808 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!809 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!810 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!811 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!812 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!813 = !DIEnumerator(name: "__YESSTR", value: 327682)
!814 = !DIEnumerator(name: "__NOSTR", value: 327683)
!815 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!816 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!817 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!818 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!819 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!820 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!821 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!822 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!823 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!824 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!825 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!826 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!827 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!828 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!829 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!830 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!831 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!832 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!833 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!834 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!835 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!836 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!837 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!838 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!839 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!840 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!841 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!842 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!843 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!844 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!845 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!846 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!847 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!848 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!849 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!850 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!851 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!852 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!853 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!854 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!855 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!856 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!857 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!858 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!859 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!860 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!861 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!862 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!863 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!864 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!865 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!866 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!867 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!868 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!869 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!870 = !{!98, !211, !871}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!872 = !{!527}
!873 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!874 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !95)
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338)
!876 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!877 = distinct !DICompileUnit(language: DW_LANG_C99, file: !878, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338)
!878 = !DIFile(filename: "./lib/fd-reopen.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338)
!880 = !DIFile(filename: "./lib/gethrxtime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!881 = distinct !DICompileUnit(language: DW_LANG_C99, file: !882, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338)
!882 = !DIFile(filename: "./lib/gettime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!883 = distinct !DICompileUnit(language: DW_LANG_C99, file: !884, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338)
!884 = !DIFile(filename: "./lib/verror.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!885 = distinct !DICompileUnit(language: DW_LANG_C99, file: !886, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !887, retainedTypes: !892)
!886 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!887 = !{!888}
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !889, line: 41, size: 32, elements: !890)
!889 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!890 = !{!891}
!891 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!892 = !{!98}
!893 = distinct !DICompileUnit(language: DW_LANG_C99, file: !894, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !895, retainedTypes: !909)
!894 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!895 = !{!896}
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !898, file: !897, line: 192, size: 32, elements: !907)
!897 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!898 = distinct !DISubprogram(name: "x2nrealloc", scope: !897, file: !897, line: 180, type: !899, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !893, variables: !902)
!899 = !DISubroutineType(types: !900)
!900 = !{!98, !98, !901, !112}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!902 = !{!903, !904, !905, !906}
!903 = !DILocalVariable(name: "p", arg: 1, scope: !898, file: !897, line: 180, type: !98)
!904 = !DILocalVariable(name: "pn", arg: 2, scope: !898, file: !897, line: 180, type: !901)
!905 = !DILocalVariable(name: "s", arg: 3, scope: !898, file: !897, line: 180, type: !112)
!906 = !DILocalVariable(name: "n", scope: !898, file: !897, line: 182, type: !112)
!907 = !{!908}
!908 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!909 = !{!112, !211, !98}
!910 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338)
!911 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !914, retainedTypes: !915)
!913 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!914 = !{!38, !411}
!915 = !{!108, !427}
!916 = distinct !DICompileUnit(language: DW_LANG_C99, file: !917, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338, retainedTypes: !918)
!917 = !DIFile(filename: "./lib/xvasprintf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!918 = !{!211}
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338, retainedTypes: !892)
!920 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338)
!922 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338, retainedTypes: !892)
!924 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338, retainedTypes: !892)
!926 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !928, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338, retainedTypes: !929)
!928 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!929 = !{!112}
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !338)
!931 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!932 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!933 = !{i32 2, !"Dwarf Version", i32 4}
!934 = !{i32 2, !"Debug Info Version", i32 3}
!935 = !{i32 1, !"wchar_size", i32 4}
!936 = !{i32 7, !"PIC Level", i32 2}
!937 = !{i32 7, !"PIE Level", i32 2}
!938 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 549, type: !106, isLocal: false, isDefinition: true, scopeLine: 550, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !939)
!939 = !{!940}
!940 = !DILocalVariable(name: "status", arg: 1, scope: !938, file: !3, line: 549, type: !108)
!941 = !DIExpression()
!942 = !DILocation(line: 549, column: 12, scope: !938)
!943 = !DILocation(line: 551, column: 14, scope: !944)
!944 = distinct !DILexicalBlock(scope: !938, file: !3, line: 551, column: 7)
!945 = !DILocation(line: 551, column: 7, scope: !938)
!946 = !DILocation(line: 552, column: 5, scope: !947)
!947 = distinct !DILexicalBlock(scope: !944, file: !3, line: 552, column: 5)
!948 = !{!949, !949, i64 0}
!949 = !{!"any pointer", !950, i64 0}
!950 = !{!"omnipotent char", !951, i64 0}
!951 = !{!"Simple C/C++ TBAA"}
!952 = !DILocation(line: 555, column: 7, scope: !953)
!953 = distinct !DILexicalBlock(scope: !944, file: !3, line: 554, column: 5)
!954 = !DILocation(line: 560, column: 7, scope: !953)
!955 = !DILocation(line: 569, column: 7, scope: !953)
!956 = !DILocation(line: 582, column: 7, scope: !953)
!957 = !DILocation(line: 591, column: 7, scope: !953)
!958 = !DILocation(line: 604, column: 7, scope: !953)
!959 = !DILocation(line: 612, column: 7, scope: !953)
!960 = !DILocation(line: 621, column: 9, scope: !961)
!961 = distinct !DILexicalBlock(scope: !953, file: !3, line: 620, column: 11)
!962 = !DILocation(line: 623, column: 9, scope: !963)
!963 = distinct !DILexicalBlock(scope: !953, file: !3, line: 622, column: 11)
!964 = !DILocation(line: 625, column: 9, scope: !965)
!965 = distinct !DILexicalBlock(scope: !953, file: !3, line: 624, column: 11)
!966 = !DILocation(line: 627, column: 9, scope: !967)
!967 = distinct !DILexicalBlock(scope: !953, file: !3, line: 626, column: 11)
!968 = !DILocation(line: 628, column: 7, scope: !953)
!969 = !DILocation(line: 631, column: 9, scope: !970)
!970 = distinct !DILexicalBlock(scope: !953, file: !3, line: 630, column: 11)
!971 = !DILocation(line: 633, column: 9, scope: !972)
!972 = distinct !DILexicalBlock(scope: !953, file: !3, line: 632, column: 11)
!973 = !DILocation(line: 636, column: 9, scope: !974)
!974 = distinct !DILexicalBlock(scope: !953, file: !3, line: 635, column: 11)
!975 = !DILocation(line: 640, column: 9, scope: !976)
!976 = distinct !DILexicalBlock(scope: !953, file: !3, line: 639, column: 11)
!977 = !DILocation(line: 643, column: 9, scope: !978)
!978 = distinct !DILexicalBlock(scope: !953, file: !3, line: 642, column: 11)
!979 = !DILocation(line: 651, column: 9, scope: !980)
!980 = distinct !DILexicalBlock(scope: !953, file: !3, line: 650, column: 11)
!981 = !DILocation(line: 654, column: 9, scope: !982)
!982 = distinct !DILexicalBlock(scope: !953, file: !3, line: 653, column: 11)
!983 = !DILocation(line: 657, column: 9, scope: !984)
!984 = distinct !DILexicalBlock(scope: !953, file: !3, line: 656, column: 11)
!985 = !DILocation(line: 661, column: 9, scope: !986)
!986 = distinct !DILexicalBlock(scope: !953, file: !3, line: 660, column: 7)
!987 = !DILocation(line: 671, column: 7, scope: !953)
!988 = !DILocation(line: 672, column: 7, scope: !953)
!989 = !DILocation(line: 642, column: 15, scope: !142, inlinedAt: !990)
!990 = distinct !DILocation(line: 673, column: 7, scope: !953)
!991 = !DILocation(line: 651, column: 3, scope: !142, inlinedAt: !990)
!992 = !DILocation(line: 655, column: 29, scope: !142, inlinedAt: !990)
!993 = !DILocation(line: 655, column: 15, scope: !142, inlinedAt: !990)
!994 = !DILocation(line: 656, column: 7, scope: !995, inlinedAt: !990)
!995 = distinct !DILexicalBlock(scope: !142, file: !81, line: 656, column: 7)
!996 = !DILocation(line: 656, column: 19, scope: !995, inlinedAt: !990)
!997 = !DILocation(line: 656, column: 22, scope: !995, inlinedAt: !990)
!998 = !DILocation(line: 656, column: 7, scope: !142, inlinedAt: !990)
!999 = !DILocation(line: 662, column: 7, scope: !1000, inlinedAt: !990)
!1000 = distinct !DILexicalBlock(scope: !995, file: !81, line: 657, column: 5)
!1001 = !DILocation(line: 664, column: 5, scope: !1000, inlinedAt: !990)
!1002 = !DILocation(line: 665, column: 3, scope: !142, inlinedAt: !990)
!1003 = !DILocation(line: 667, column: 3, scope: !142, inlinedAt: !990)
!1004 = !DILocation(line: 675, column: 3, scope: !938)
!1005 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 2340, type: !1006, isLocal: false, isDefinition: true, scopeLine: 2341, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1009)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!108, !108, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!1009 = !{!1010, !1011, !1012, !1013, !1014, !1015, !1020, !1021, !1024, !1025, !1028}
!1010 = !DILocalVariable(name: "argc", arg: 1, scope: !1005, file: !3, line: 2340, type: !108)
!1011 = !DILocalVariable(name: "argv", arg: 2, scope: !1005, file: !3, line: 2340, type: !1008)
!1012 = !DILocalVariable(name: "i", scope: !1005, file: !3, line: 2342, type: !108)
!1013 = !DILocalVariable(name: "exit_status", scope: !1005, file: !3, line: 2343, type: !108)
!1014 = !DILocalVariable(name: "offset", scope: !1005, file: !3, line: 2344, type: !99)
!1015 = !DILocalVariable(name: "perms", scope: !1016, file: !3, line: 2399, type: !1018)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 2398, column: 5)
!1017 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 2392, column: 7)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !100, line: 70, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !89, line: 138, baseType: !444)
!1020 = !DILocalVariable(name: "opts", scope: !1016, file: !3, line: 2400, type: !108)
!1021 = !DILocalVariable(name: "size", scope: !1022, file: !3, line: 2418, type: !86)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 2417, column: 9)
!1023 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 2416, column: 11)
!1024 = !DILocalVariable(name: "obs", scope: !1022, file: !3, line: 2419, type: !85)
!1025 = !DILocalVariable(name: "ftruncate_errno", scope: !1026, file: !3, line: 2435, type: !108)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 2429, column: 13)
!1027 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 2428, column: 15)
!1028 = !DILocalVariable(name: "stdout_stat", scope: !1026, file: !3, line: 2436, type: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1030, line: 46, size: 1152, elements: !1031)
!1030 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1031 = !{!1032, !1034, !1036, !1038, !1039, !1041, !1043, !1044, !1045, !1046, !1048, !1050, !1058, !1059, !1060}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1029, file: !1030, line: 48, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !89, line: 133, baseType: !85)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1029, file: !1030, line: 53, baseType: !1035, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !89, line: 136, baseType: !85)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1029, file: !1030, line: 61, baseType: !1037, size: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !89, line: 139, baseType: !85)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1029, file: !1030, line: 62, baseType: !1019, size: 32, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1029, file: !1030, line: 64, baseType: !1040, size: 32, offset: 224)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !89, line: 134, baseType: !444)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1029, file: !1030, line: 65, baseType: !1042, size: 32, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !89, line: 135, baseType: !444)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1029, file: !1030, line: 67, baseType: !108, size: 32, offset: 288)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1029, file: !1030, line: 69, baseType: !1033, size: 64, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1029, file: !1030, line: 74, baseType: !101, size: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1029, file: !1030, line: 78, baseType: !1047, size: 64, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !89, line: 162, baseType: !102)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1029, file: !1030, line: 80, baseType: !1049, size: 64, offset: 512)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !89, line: 167, baseType: !102)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1029, file: !1030, line: 91, baseType: !1051, size: 128, offset: 576)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1052, line: 8, size: 128, elements: !1053)
!1052 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1053 = !{!1054, !1056}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1051, file: !1052, line: 10, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !89, line: 148, baseType: !102)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1051, file: !1052, line: 11, baseType: !1057, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !89, line: 184, baseType: !102)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1029, file: !1030, line: 92, baseType: !1051, size: 128, offset: 704)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1029, file: !1030, line: 93, baseType: !1051, size: 128, offset: 832)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1029, file: !1030, line: 106, baseType: !1061, size: 192, offset: 960)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 192, elements: !367)
!1062 = !DILocation(line: 2340, column: 11, scope: !1005)
!1063 = !DILocation(line: 2340, column: 24, scope: !1005)
!1064 = !DILocation(line: 886, column: 49, scope: !1065, inlinedAt: !1159)
!1065 = distinct !DISubprogram(name: "install_signal_handlers", scope: !3, file: !3, line: 884, type: !525, isLocal: true, isDefinition: true, scopeLine: 885, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1066)
!1066 = !{!1067, !1068}
!1067 = !DILocalVariable(name: "catch_siginfo", scope: !1065, file: !3, line: 886, type: !126)
!1068 = !DILocalVariable(name: "act", scope: !1065, file: !3, line: 890, type: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !1070, line: 24, size: 1216, elements: !1071)
!1070 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1071 = !{!1072, !1156, !1157, !1158}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !1069, file: !1070, line: 35, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1069, file: !1070, line: 28, size: 64, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !1073, file: !1070, line: 31, baseType: !103, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !1073, file: !1070, line: 33, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{null, !108, !1080, !98}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !1082, line: 124, baseType: !1083)
!1082 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1082, line: 36, size: 1024, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088, !1089}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !1083, file: !1082, line: 38, baseType: !108, size: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !1083, file: !1082, line: 40, baseType: !108, size: 32, offset: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !1083, file: !1082, line: 42, baseType: !108, size: 32, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1083, file: !1082, line: 48, baseType: !108, size: 32, offset: 96)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !1083, file: !1082, line: 123, baseType: !1090, size: 896, offset: 128)
!1090 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1083, file: !1082, line: 51, size: 896, elements: !1091)
!1091 = !{!1092, !1096, !1102, !1114, !1120, !1129, !1145, !1150}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1090, file: !1082, line: 53, baseType: !1093, size: 896)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 896, elements: !1094)
!1094 = !{!1095}
!1095 = !DISubrange(count: 28)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !1090, file: !1082, line: 60, baseType: !1097, size: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1090, file: !1082, line: 56, size: 64, elements: !1098)
!1098 = !{!1099, !1101}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1097, file: !1082, line: 58, baseType: !1100, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !89, line: 142, baseType: !108)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1097, file: !1082, line: 59, baseType: !1040, size: 32, offset: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !1090, file: !1082, line: 68, baseType: !1103, size: 128)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1090, file: !1082, line: 63, size: 128, elements: !1104)
!1104 = !{!1105, !1106, !1107}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !1103, file: !1082, line: 65, baseType: !108, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !1103, file: !1082, line: 66, baseType: !108, size: 32, offset: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1103, file: !1082, line: 67, baseType: !1108, size: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !1109, line: 11, baseType: !1110)
!1109 = !DIFile(filename: "/usr/include/bits/types/sigval_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !1109, line: 5, size: 64, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !1110, file: !1109, line: 7, baseType: !108, size: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !1110, file: !1109, line: 8, baseType: !98, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !1090, file: !1082, line: 76, baseType: !1115, size: 128)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1090, file: !1082, line: 71, size: 128, elements: !1116)
!1116 = !{!1117, !1118, !1119}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1115, file: !1082, line: 73, baseType: !1100, size: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1115, file: !1082, line: 74, baseType: !1040, size: 32, offset: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1115, file: !1082, line: 75, baseType: !1108, size: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !1090, file: !1082, line: 86, baseType: !1121, size: 256)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1090, file: !1082, line: 79, size: 256, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1128}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1121, file: !1082, line: 81, baseType: !1100, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1121, file: !1082, line: 82, baseType: !1040, size: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !1121, file: !1082, line: 83, baseType: !108, size: 32, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !1121, file: !1082, line: 84, baseType: !1127, size: 64, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !89, line: 144, baseType: !102)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !1121, file: !1082, line: 85, baseType: !1127, size: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !1090, file: !1082, line: 105, baseType: !1130, size: 256)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1090, file: !1082, line: 89, size: 256, elements: !1131)
!1131 = !{!1132, !1133, !1135}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !1130, file: !1082, line: 91, baseType: !98, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !1130, file: !1082, line: 93, baseType: !1134, size: 16, offset: 64)
!1134 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !1130, file: !1082, line: 104, baseType: !1136, size: 128, offset: 128)
!1136 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1130, file: !1082, line: 94, size: 128, elements: !1137)
!1137 = !{!1138, !1143}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !1136, file: !1082, line: 101, baseType: !1139, size: 128)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1136, file: !1082, line: 97, size: 128, elements: !1140)
!1140 = !{!1141, !1142}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !1139, file: !1082, line: 99, baseType: !98, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !1139, file: !1082, line: 100, baseType: !98, size: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !1136, file: !1082, line: 103, baseType: !1144, size: 32)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !89, line: 41, baseType: !444)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !1090, file: !1082, line: 112, baseType: !1146, size: 128)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1090, file: !1082, line: 108, size: 128, elements: !1147)
!1147 = !{!1148, !1149}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !1146, file: !1082, line: 110, baseType: !102, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !1146, file: !1082, line: 111, baseType: !108, size: 32, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !1090, file: !1082, line: 121, baseType: !1151, size: 128)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1090, file: !1082, line: 116, size: 128, elements: !1152)
!1152 = !{!1153, !1154, !1155}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !1151, file: !1082, line: 118, baseType: !98, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !1151, file: !1082, line: 119, baseType: !108, size: 32, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !1151, file: !1082, line: 120, baseType: !444, size: 32, offset: 96)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !1069, file: !1070, line: 43, baseType: !326, size: 1024, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !1069, file: !1070, line: 46, baseType: !108, size: 32, offset: 1088)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !1069, file: !1070, line: 49, baseType: !524, size: 64, offset: 1152)
!1159 = distinct !DILocation(line: 2346, column: 3, scope: !1005)
!1160 = !DILocation(line: 886, column: 46, scope: !1065, inlinedAt: !1159)
!1161 = !DILocation(line: 890, column: 3, scope: !1065, inlinedAt: !1159)
!1162 = !DILocation(line: 891, column: 3, scope: !1065, inlinedAt: !1159)
!1163 = !DILocation(line: 892, column: 7, scope: !1065, inlinedAt: !1159)
!1164 = !DILocation(line: 893, column: 5, scope: !1165, inlinedAt: !1159)
!1165 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 892, column: 7)
!1166 = !DILocation(line: 890, column: 20, scope: !1065, inlinedAt: !1159)
!1167 = !DILocation(line: 894, column: 3, scope: !1065, inlinedAt: !1159)
!1168 = !DILocation(line: 895, column: 11, scope: !1169, inlinedAt: !1159)
!1169 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 895, column: 7)
!1170 = !{!950, !950, i64 0}
!1171 = !DILocation(line: 895, column: 22, scope: !1169, inlinedAt: !1159)
!1172 = !DILocation(line: 895, column: 7, scope: !1065, inlinedAt: !1159)
!1173 = !DILocation(line: 896, column: 5, scope: !1169, inlinedAt: !1159)
!1174 = !DILocation(line: 897, column: 7, scope: !1065, inlinedAt: !1159)
!1175 = !DILocation(line: 897, column: 17, scope: !1065, inlinedAt: !1159)
!1176 = !{i64 0, i64 128, !1170}
!1177 = !DILocation(line: 899, column: 7, scope: !1178, inlinedAt: !1159)
!1178 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 899, column: 7)
!1179 = !DILocation(line: 899, column: 7, scope: !1065, inlinedAt: !1159)
!1180 = !DILocation(line: 901, column: 22, scope: !1181, inlinedAt: !1159)
!1181 = distinct !DILexicalBlock(scope: !1178, file: !3, line: 900, column: 5)
!1182 = !DILocation(line: 905, column: 11, scope: !1181, inlinedAt: !1159)
!1183 = !DILocation(line: 905, column: 20, scope: !1181, inlinedAt: !1159)
!1184 = !{!1185, !1187, i64 136}
!1185 = !{!"sigaction", !950, i64 0, !1186, i64 8, !1187, i64 136, !949, i64 144}
!1186 = !{!"", !950, i64 0}
!1187 = !{!"int", !950, i64 0}
!1188 = !DILocation(line: 906, column: 7, scope: !1181, inlinedAt: !1159)
!1189 = !DILocation(line: 907, column: 5, scope: !1181, inlinedAt: !1159)
!1190 = !DILocation(line: 909, column: 7, scope: !1191, inlinedAt: !1159)
!1191 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 909, column: 7)
!1192 = !DILocation(line: 909, column: 7, scope: !1065, inlinedAt: !1159)
!1193 = !DILocation(line: 911, column: 22, scope: !1194, inlinedAt: !1159)
!1194 = distinct !DILexicalBlock(scope: !1191, file: !3, line: 910, column: 5)
!1195 = !DILocation(line: 912, column: 11, scope: !1194, inlinedAt: !1159)
!1196 = !DILocation(line: 912, column: 20, scope: !1194, inlinedAt: !1159)
!1197 = !DILocation(line: 913, column: 7, scope: !1194, inlinedAt: !1159)
!1198 = !DILocation(line: 914, column: 5, scope: !1194, inlinedAt: !1159)
!1199 = !DILocation(line: 929, column: 1, scope: !1065, inlinedAt: !1159)
!1200 = !DILocation(line: 2349, column: 21, scope: !1005)
!1201 = !DILocation(line: 2349, column: 3, scope: !1005)
!1202 = !DILocation(line: 2350, column: 3, scope: !1005)
!1203 = !DILocation(line: 2351, column: 3, scope: !1005)
!1204 = !DILocation(line: 2352, column: 3, scope: !1005)
!1205 = !DILocation(line: 2355, column: 3, scope: !1005)
!1206 = !DILocation(line: 2357, column: 15, scope: !1005)
!1207 = !DILocation(line: 2357, column: 13, scope: !1005)
!1208 = !{!1209, !1209, i64 0}
!1209 = !{!"long", !950, i64 0}
!1210 = !DILocation(line: 2359, column: 58, scope: !1005)
!1211 = !DILocation(line: 2359, column: 3, scope: !1005)
!1212 = !DILocation(line: 2363, column: 7, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 2363, column: 7)
!1214 = !DILocation(line: 2363, column: 48, scope: !1213)
!1215 = !DILocation(line: 2363, column: 7, scope: !1005)
!1216 = !DILocation(line: 2364, column: 5, scope: !1213)
!1217 = !DILocation(line: 2368, column: 20, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1219, file: !3, line: 2367, column: 3)
!1219 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 2367, column: 3)
!1220 = !DILocalVariable(name: "argc", arg: 1, scope: !1221, file: !3, line: 1371, type: !108)
!1221 = distinct !DISubprogram(name: "scanargs", scope: !3, file: !3, line: 1371, type: !1222, isLocal: true, isDefinition: true, scopeLine: 1372, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1226)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{null, !108, !1224}
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!1226 = !{!1220, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1237, !1238, !1247, !1248, !1249}
!1227 = !DILocalVariable(name: "argv", arg: 2, scope: !1221, file: !3, line: 1371, type: !1224)
!1228 = !DILocalVariable(name: "i", scope: !1221, file: !3, line: 1373, type: !108)
!1229 = !DILocalVariable(name: "blocksize", scope: !1221, file: !3, line: 1374, type: !112)
!1230 = !DILocalVariable(name: "count", scope: !1221, file: !3, line: 1375, type: !86)
!1231 = !DILocalVariable(name: "skip", scope: !1221, file: !3, line: 1376, type: !86)
!1232 = !DILocalVariable(name: "seek", scope: !1221, file: !3, line: 1377, type: !86)
!1233 = !DILocalVariable(name: "name", scope: !1234, file: !3, line: 1381, type: !95)
!1234 = distinct !DILexicalBlock(scope: !1235, file: !3, line: 1380, column: 5)
!1235 = distinct !DILexicalBlock(scope: !1236, file: !3, line: 1379, column: 3)
!1236 = distinct !DILexicalBlock(scope: !1221, file: !3, line: 1379, column: 3)
!1237 = !DILocalVariable(name: "val", scope: !1234, file: !3, line: 1382, type: !95)
!1238 = !DILocalVariable(name: "invalid", scope: !1239, file: !3, line: 1410, type: !1246)
!1239 = distinct !DILexicalBlock(scope: !1240, file: !3, line: 1409, column: 9)
!1240 = distinct !DILexicalBlock(scope: !1241, file: !3, line: 1405, column: 16)
!1241 = distinct !DILexicalBlock(scope: !1242, file: !3, line: 1402, column: 16)
!1242 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 1399, column: 16)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !3, line: 1396, column: 16)
!1244 = distinct !DILexicalBlock(scope: !1245, file: !3, line: 1394, column: 16)
!1245 = distinct !DILexicalBlock(scope: !1234, file: !3, line: 1392, column: 11)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "strtol_error", file: !39, line: 39, baseType: !38)
!1247 = !DILocalVariable(name: "n", scope: !1239, file: !3, line: 1411, type: !86)
!1248 = !DILocalVariable(name: "n_min", scope: !1239, file: !3, line: 1412, type: !86)
!1249 = !DILocalVariable(name: "n_max", scope: !1239, file: !3, line: 1413, type: !86)
!1250 = !DILocation(line: 1371, column: 15, scope: !1221, inlinedAt: !1251)
!1251 = distinct !DILocation(line: 2371, column: 3, scope: !1005)
!1252 = !DILocation(line: 1371, column: 34, scope: !1221, inlinedAt: !1251)
!1253 = !DILocation(line: 1374, column: 10, scope: !1221, inlinedAt: !1251)
!1254 = !DILocation(line: 1375, column: 13, scope: !1221, inlinedAt: !1251)
!1255 = !DILocation(line: 1376, column: 13, scope: !1221, inlinedAt: !1251)
!1256 = !DILocation(line: 1377, column: 13, scope: !1221, inlinedAt: !1251)
!1257 = !DILocation(line: 1379, column: 12, scope: !1236, inlinedAt: !1251)
!1258 = !{!1187, !1187, i64 0}
!1259 = !DILocation(line: 1373, column: 7, scope: !1221, inlinedAt: !1251)
!1260 = !DILocation(line: 1379, column: 22, scope: !1235, inlinedAt: !1251)
!1261 = !DILocation(line: 1379, column: 3, scope: !1236, inlinedAt: !1251)
!1262 = !DILocation(line: 1381, column: 26, scope: !1234, inlinedAt: !1251)
!1263 = !DILocation(line: 1381, column: 19, scope: !1234, inlinedAt: !1251)
!1264 = !DILocation(line: 1382, column: 25, scope: !1234, inlinedAt: !1251)
!1265 = !DILocation(line: 1382, column: 19, scope: !1234, inlinedAt: !1251)
!1266 = !DILocation(line: 1384, column: 15, scope: !1267, inlinedAt: !1251)
!1267 = distinct !DILexicalBlock(scope: !1234, file: !3, line: 1384, column: 11)
