; ModuleID = 'coreutils-8.27/src/df.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.fs_type_list = type { i8*, %struct.fs_type_list* }
%struct.fs_usage = type { i64, i64, i64, i64, i8, i64, i64 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.field_data_t = type { i32, i8*, i32, i8*, i64, i32, i8 }
%struct.mount_entry = type { i8*, i8*, i8*, i8*, i64, i8, %struct.mount_entry* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.devlist = type { i64, %struct.mount_entry*, %struct.devlist* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.field_values_t = type { i64, i64, i64, i64, i8, i64, i64, i8 }

!68 = !DIFile(filename: "./lib/mbsalign.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!69 = !{!70, !71, !72}
!70 = !DIEnumerator(name: "MBS_ALIGN_LEFT", value: 0)
!71 = !DIEnumerator(name: "MBS_ALIGN_RIGHT", value: 1)
!72 = !DIEnumerator(name: "MBS_ALIGN_CENTER", value: 2)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !74, line: 46, size: 32, elements: !75)
!74 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!76 = !DIEnumerator(name: "_ISupper", value: 256)
!77 = !DIEnumerator(name: "_ISlower", value: 512)
!78 = !DIEnumerator(name: "_ISalpha", value: 1024)
!79 = !DIEnumerator(name: "_ISdigit", value: 2048)
!80 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!81 = !DIEnumerator(name: "_ISspace", value: 8192)
!82 = !DIEnumerator(name: "_ISprint", value: 16384)
!83 = !DIEnumerator(name: "_ISgraph", value: 32768)
!84 = !DIEnumerator(name: "_ISblank", value: 1)
!85 = !DIEnumerator(name: "_IScntrl", value: 2)
!86 = !DIEnumerator(name: "_ISpunct", value: 4)
!87 = !DIEnumerator(name: "_ISalnum", value: 8)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !89, line: 24, size: 32, elements: !90)
!89 = !DIFile(filename: "./lib/canonicalize.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "CAN_EXISTING", value: 0)
!92 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1)
!93 = !DIEnumerator(name: "CAN_MISSING", value: 2)
!94 = !DIEnumerator(name: "CAN_NOLINKS", value: 4)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 21, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIEnumerator(name: "MBA_UNIBYTE_FALLBACK", value: 1)
!98 = !DIEnumerator(name: "MBA_UNIBYTE_ONLY", value: 2)
!99 = !DIEnumerator(name: "MBA_NO_LEFT_PAD", value: 4)
!100 = !DIEnumerator(name: "MBA_NO_RIGHT_PAD", value: 8)
!101 = !{!102, !104, !105, !108, !109, !110, !114, !117, !118}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 62, baseType: !107)
!106 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!107 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !111, line: 60, baseType: !112)
!111 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !113, line: 133, baseType: !107)
!113 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !115, line: 112, baseType: !116)
!115 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !113, line: 62, baseType: !107)
!117 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !{!120, !123, !125, !127, !129, !131, !133, !135, !0, !137, !144, !160, !162, !164, !176, !198, !212, !214, !216, !232, !237, !239, !243, !245}
!120 = !DIGlobalVariableExpression(var: !121)
!121 = distinct !DIGlobalVariable(name: "show_all_fs", scope: !2, file: !3, line: 61, type: !122, isLocal: true, isDefinition: true)
!122 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!123 = !DIGlobalVariableExpression(var: !124)
!124 = distinct !DIGlobalVariable(name: "show_local_fs", scope: !2, file: !3, line: 64, type: !122, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126)
!126 = distinct !DIGlobalVariable(name: "show_listed_fs", scope: !2, file: !3, line: 68, type: !122, isLocal: true, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128)
!128 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 71, type: !108, isLocal: true, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130)
!130 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 74, type: !114, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132)
!132 = distinct !DIGlobalVariable(name: "file_systems_processed", scope: !2, file: !3, line: 77, type: !122, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134)
!134 = distinct !DIGlobalVariable(name: "require_sync", scope: !2, file: !3, line: 83, type: !122, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136)
!136 = distinct !DIGlobalVariable(name: "exit_status", scope: !2, file: !3, line: 86, type: !108, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138)
!138 = distinct !DIGlobalVariable(name: "fs_exclude_list", scope: !2, file: !3, line: 112, type: !139, isLocal: true, isDefinition: true)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_type_list", file: !3, line: 90, size: 128, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "fs_name", scope: !140, file: !3, line: 92, baseType: !102, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "fs_next", scope: !140, file: !3, line: 93, baseType: !139, size: 64, offset: 64)
!144 = !DIGlobalVariableExpression(var: !145)
!145 = distinct !DIGlobalVariable(name: "mount_list", scope: !2, file: !3, line: 115, type: !146, isLocal: true, isDefinition: true)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !148, line: 26, size: 448, elements: !149)
!148 = !DIFile(filename: "./lib/mountlist.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!149 = !{!150, !151, !152, !153, !154, !155, !157, !158, !159}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !147, file: !148, line: 28, baseType: !102, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !147, file: !148, line: 29, baseType: !102, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !147, file: !148, line: 30, baseType: !102, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !147, file: !148, line: 32, baseType: !102, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !147, file: !148, line: 33, baseType: !110, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !147, file: !148, line: 34, baseType: !156, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!156 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !147, file: !148, line: 35, baseType: !156, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !147, file: !148, line: 36, baseType: !156, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !147, file: !148, line: 37, baseType: !146, size: 64, offset: 384)
!160 = !DIGlobalVariableExpression(var: !161)
!161 = distinct !DIGlobalVariable(name: "print_type", scope: !2, file: !3, line: 118, type: !122, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163)
!163 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !2, file: !3, line: 121, type: !122, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165)
!165 = distinct !DIGlobalVariable(name: "grand_fsu", scope: !2, file: !3, line: 124, type: !166, isLocal: true, isDefinition: true)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_usage", file: !167, line: 27, size: 448, elements: !168)
!167 = !DIFile(filename: "./lib/fsusage.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!168 = !{!169, !170, !171, !172, !173, !174, !175}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocksize", scope: !166, file: !167, line: 29, baseType: !114, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocks", scope: !166, file: !167, line: 30, baseType: !114, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bfree", scope: !166, file: !167, line: 31, baseType: !114, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail", scope: !166, file: !167, line: 32, baseType: !114, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail_top_bit_set", scope: !166, file: !167, line: 33, baseType: !122, size: 8, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_files", scope: !166, file: !167, line: 34, baseType: !114, size: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_ffree", scope: !166, file: !167, line: 35, baseType: !114, size: 64, offset: 384)
!176 = !DIGlobalVariableExpression(var: !177)
!177 = distinct !DIGlobalVariable(name: "infomap", scope: !178, file: !179, line: 632, type: !195, isLocal: true, isDefinition: true)
!178 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !179, file: !179, line: 630, type: !180, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !184)
!179 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!180 = !DISubroutineType(types: !181)
!181 = !{null, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!184 = !{!185, !186, !187, !194}
!185 = !DILocalVariable(name: "program", arg: 1, scope: !178, file: !179, line: 630, type: !182)
!186 = !DILocalVariable(name: "node", scope: !178, file: !179, line: 642, type: !182)
!187 = !DILocalVariable(name: "map_prog", scope: !178, file: !179, line: 643, type: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !178, file: !179, line: 632, size: 128, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !190, file: !179, line: 632, baseType: !182, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !190, file: !179, line: 632, baseType: !182, size: 64, offset: 64)
!194 = !DILocalVariable(name: "lc_messages", scope: !178, file: !179, line: 655, type: !182)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 896, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 7)
!198 = !DIGlobalVariableExpression(var: !199)
!199 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 253, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 4352, elements: !210)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !203, line: 50, size: 256, elements: !204)
!203 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!204 = !{!205, !206, !207, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 52, baseType: !182, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !202, file: !203, line: 55, baseType: !108, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !202, file: !203, line: 56, baseType: !208, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !202, file: !203, line: 57, baseType: !108, size: 32, offset: 192)
!210 = !{!211}
!211 = !DISubrange(count: 17)
!212 = !DIGlobalVariableExpression(var: !213)
!213 = distinct !DIGlobalVariable(name: "header_mode", scope: !2, file: !3, line: 135, type: !108, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215)
!215 = distinct !DIGlobalVariable(name: "ncolumns", scope: !2, file: !3, line: 222, type: !105, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217)
!217 = distinct !DIGlobalVariable(name: "columns", scope: !2, file: !3, line: 219, type: !218, isLocal: true, isDefinition: true)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field_data_t", file: !3, line: 164, size: 384, elements: !221)
!221 = !{!222, !224, !225, !227, !228, !229, !231}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !220, file: !3, line: 166, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "display_field_t", file: !3, line: 153, baseType: !47)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !220, file: !3, line: 167, baseType: !182, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !220, file: !3, line: 168, baseType: !226, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "field_type_t", file: !3, line: 161, baseType: !62)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "caption", scope: !220, file: !3, line: 169, baseType: !182, size: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !220, file: !3, line: 170, baseType: !105, size: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !220, file: !3, line: 171, baseType: !230, size: 32, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbs_align_t", file: !68, line: 19, baseType: !67)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !220, file: !3, line: 172, baseType: !122, size: 8, offset: 352)
!232 = !DIGlobalVariableExpression(var: !233)
!233 = distinct !DIGlobalVariable(name: "field_data", scope: !2, file: !3, line: 176, type: !234, isLocal: true, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 4608, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 12)
!237 = !DIGlobalVariableExpression(var: !238)
!238 = distinct !DIGlobalVariable(name: "all_args_string", scope: !2, file: !3, line: 214, type: !182, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240)
!240 = distinct !DIGlobalVariable(name: "table", scope: !2, file: !3, line: 238, type: !241, isLocal: true, isDefinition: true)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!243 = !DIGlobalVariableExpression(var: !244)
!244 = distinct !DIGlobalVariable(name: "nrows", scope: !2, file: !3, line: 241, type: !105, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246)
!246 = distinct !DIGlobalVariable(name: "devlist_table", scope: !2, file: !3, line: 57, type: !247, isLocal: true, isDefinition: true)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !249, line: 69, baseType: !250)
!249 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !249, line: 67, flags: DIFlagFwdDecl)
!251 = !DIGlobalVariableExpression(var: !252)
!252 = distinct !DIGlobalVariable(name: "Version", scope: !253, file: !254, line: 2, type: !182, isLocal: false, isDefinition: true)
!253 = distinct !DICompileUnit(language: DW_LANG_C99, file: !254, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, globals: !256)
!254 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!255 = !{}
!256 = !{!251}
!257 = !DIGlobalVariableExpression(var: !258)
!258 = distinct !DIGlobalVariable(name: "file_name", scope: !259, file: !264, line: 36, type: !182, isLocal: true, isDefinition: true)
!259 = distinct !DICompileUnit(language: DW_LANG_C99, file: !260, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, globals: !261)
!260 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!261 = !{!257, !262}
!262 = !DIGlobalVariableExpression(var: !263)
!263 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !259, file: !264, line: 46, type: !122, isLocal: true, isDefinition: true)
!264 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!265 = !DIGlobalVariableExpression(var: !266)
!266 = distinct !DIGlobalVariable(name: "exit_failure", scope: !267, file: !270, line: 24, type: !271, isLocal: false, isDefinition: true)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, globals: !269)
!268 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!269 = !{!265}
!270 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!271 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!272 = !DIGlobalVariableExpression(var: !273)
!273 = distinct !DIGlobalVariable(name: "default_tuning", scope: !274, file: !278, line: 130, type: !279, isLocal: true, isDefinition: true)
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !276, globals: !277)
!275 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!276 = !{!107, !104, !105}
!277 = !{!272}
!278 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !249, line: 65, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !249, line: 53, size: 160, elements: !282)
!282 = !{!283, !285, !286, !287, !288}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !281, file: !249, line: 58, baseType: !284, size: 32)
!284 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !281, file: !249, line: 59, baseType: !284, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !281, file: !249, line: 60, baseType: !284, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !281, file: !249, line: 61, baseType: !284, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !281, file: !249, line: 62, baseType: !122, size: 8, offset: 128)
!289 = !DIGlobalVariableExpression(var: !290)
!290 = distinct !DIGlobalVariable(name: "power_letter", scope: !291, file: !298, line: 36, type: !309, isLocal: true, isDefinition: true)
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !293, retainedTypes: !294, globals: !295)
!292 = !DIFile(filename: "./lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!293 = !{!20, !5}
!294 = !{!182}
!295 = !{!289, !296, !303}
!296 = !DIGlobalVariableExpression(var: !297)
!297 = distinct !DIGlobalVariable(name: "block_size_args", scope: !291, file: !298, line: 398, type: !299, isLocal: true, isDefinition: true)
!298 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 192, elements: !301)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!301 = !{!302}
!302 = !DISubrange(count: 3)
!303 = !DIGlobalVariableExpression(var: !304)
!304 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !291, file: !298, line: 399, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 64, elements: !307)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!307 = !{!308}
!308 = !DISubrange(count: 2)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 72, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 9)
!312 = !DIGlobalVariableExpression(var: !313)
!313 = distinct !DIGlobalVariable(name: "program_name", scope: !314, file: !318, line: 33, type: !182, isLocal: false, isDefinition: true)
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !316, globals: !317)
!315 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!316 = !{!104, !102}
!317 = !{!312}
!318 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!319 = !DIGlobalVariableExpression(var: !320)
!320 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !321, file: !333, line: 77, type: !368, isLocal: false, isDefinition: true)
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !323, retainedTypes: !329, globals: !330)
!322 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!323 = !{!33, !324, !73}
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !34, line: 242, size: 32, elements: !325)
!325 = !{!326, !327, !328}
!326 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!327 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!328 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!329 = !{!108, !109, !105, !102}
!330 = !{!319, !331, !338, !350, !352, !357, !364, !366}
!331 = !DIGlobalVariableExpression(var: !332)
!332 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !321, file: !333, line: 93, type: !334, isLocal: false, isDefinition: true)
!333 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 320, elements: !336)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!336 = !{!337}
!337 = !DISubrange(count: 10)
!338 = !DIGlobalVariableExpression(var: !339)
!339 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !321, file: !333, line: 1043, type: !340, isLocal: false, isDefinition: true)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !333, line: 57, size: 448, elements: !341)
!341 = !{!342, !343, !344, !348, !349}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !340, file: !333, line: 60, baseType: !33, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !340, file: !333, line: 63, baseType: !108, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !340, file: !333, line: 67, baseType: !345, size: 256, offset: 64)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 256, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 8)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !340, file: !333, line: 70, baseType: !182, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !340, file: !333, line: 73, baseType: !182, size: 64, offset: 384)
!350 = !DIGlobalVariableExpression(var: !351)
!351 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !321, file: !333, line: 108, type: !340, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353)
!353 = distinct !DIGlobalVariable(name: "slot0", scope: !321, file: !333, line: 834, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 2048, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 256)
!357 = !DIGlobalVariableExpression(var: !358)
!358 = distinct !DIGlobalVariable(name: "slotvec", scope: !321, file: !333, line: 837, type: !359, isLocal: true, isDefinition: true)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !333, line: 826, size: 128, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !360, file: !333, line: 828, baseType: !105, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !360, file: !333, line: 829, baseType: !102, size: 64, offset: 64)
!364 = !DIGlobalVariableExpression(var: !365)
!365 = distinct !DIGlobalVariable(name: "nslots", scope: !321, file: !333, line: 835, type: !108, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367)
!367 = distinct !DIGlobalVariable(name: "slotvec0", scope: !321, file: !333, line: 836, type: !360, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 704, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 11)
!371 = !DIGlobalVariableExpression(var: !372)
!372 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !373, file: !376, line: 26, type: !377, isLocal: false, isDefinition: true)
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, globals: !375)
!374 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!375 = !{!371}
!376 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 376, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 47)
!380 = !DIGlobalVariableExpression(var: !381)
!381 = distinct !DIGlobalVariable(name: "statvfs_works_cache", scope: !382, file: !383, line: 100, type: !108, isLocal: true, isDefinition: true)
!382 = distinct !DISubprogram(name: "statvfs_works", scope: !383, file: !383, line: 98, type: !384, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, unit: !386, variables: !390)
!383 = !DIFile(filename: "lib/fsusage.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!384 = !DISubroutineType(types: !385)
!385 = !{!108}
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !388, globals: !389)
!387 = !DIFile(filename: "./lib/fsusage.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!388 = !{!114}
!389 = !{!380}
!390 = !{!391}
!391 = !DILocalVariable(name: "name", scope: !382, file: !383, line: 101, type: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !393, line: 48, size: 3120, elements: !394)
!393 = !DIFile(filename: "/usr/include/sys/utsname.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!394 = !{!395, !399, !400, !401, !402, !403}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !392, file: !393, line: 51, baseType: !396, size: 520)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 520, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 65)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !392, file: !393, line: 54, baseType: !396, size: 520, offset: 520)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !392, file: !393, line: 57, baseType: !396, size: 520, offset: 1040)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !392, file: !393, line: 59, baseType: !396, size: 520, offset: 1560)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !392, file: !393, line: 62, baseType: !396, size: 520, offset: 2080)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !392, file: !393, line: 67, baseType: !396, size: 520, offset: 2600)
!404 = !DIGlobalVariableExpression(var: !405)
!405 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !406, file: !411, line: 69, type: !412, isLocal: false, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !408, retainedTypes: !409, globals: !410)
!407 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!408 = !{!33}
!409 = !{!104, !118}
!410 = !{!404}
!411 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !413, line: 55, baseType: !414)
!413 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{null}
!417 = !DIGlobalVariableExpression(var: !418)
!418 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !419, file: !763, line: 120, type: !764, isLocal: true, isDefinition: true)
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !421, retainedTypes: !760, globals: !762)
!420 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!421 = !{!422}
!422 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 41, size: 32, elements: !424)
!423 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759}
!425 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!426 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!427 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!428 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!429 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!430 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!431 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!432 = !DIEnumerator(name: "DAY_1", value: 131079)
!433 = !DIEnumerator(name: "DAY_2", value: 131080)
!434 = !DIEnumerator(name: "DAY_3", value: 131081)
!435 = !DIEnumerator(name: "DAY_4", value: 131082)
!436 = !DIEnumerator(name: "DAY_5", value: 131083)
!437 = !DIEnumerator(name: "DAY_6", value: 131084)
!438 = !DIEnumerator(name: "DAY_7", value: 131085)
!439 = !DIEnumerator(name: "ABMON_1", value: 131086)
!440 = !DIEnumerator(name: "ABMON_2", value: 131087)
!441 = !DIEnumerator(name: "ABMON_3", value: 131088)
!442 = !DIEnumerator(name: "ABMON_4", value: 131089)
!443 = !DIEnumerator(name: "ABMON_5", value: 131090)
!444 = !DIEnumerator(name: "ABMON_6", value: 131091)
!445 = !DIEnumerator(name: "ABMON_7", value: 131092)
!446 = !DIEnumerator(name: "ABMON_8", value: 131093)
!447 = !DIEnumerator(name: "ABMON_9", value: 131094)
!448 = !DIEnumerator(name: "ABMON_10", value: 131095)
!449 = !DIEnumerator(name: "ABMON_11", value: 131096)
!450 = !DIEnumerator(name: "ABMON_12", value: 131097)
!451 = !DIEnumerator(name: "MON_1", value: 131098)
!452 = !DIEnumerator(name: "MON_2", value: 131099)
!453 = !DIEnumerator(name: "MON_3", value: 131100)
!454 = !DIEnumerator(name: "MON_4", value: 131101)
!455 = !DIEnumerator(name: "MON_5", value: 131102)
!456 = !DIEnumerator(name: "MON_6", value: 131103)
!457 = !DIEnumerator(name: "MON_7", value: 131104)
!458 = !DIEnumerator(name: "MON_8", value: 131105)
!459 = !DIEnumerator(name: "MON_9", value: 131106)
!460 = !DIEnumerator(name: "MON_10", value: 131107)
!461 = !DIEnumerator(name: "MON_11", value: 131108)
!462 = !DIEnumerator(name: "MON_12", value: 131109)
!463 = !DIEnumerator(name: "AM_STR", value: 131110)
!464 = !DIEnumerator(name: "PM_STR", value: 131111)
!465 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!466 = !DIEnumerator(name: "D_FMT", value: 131113)
!467 = !DIEnumerator(name: "T_FMT", value: 131114)
!468 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!469 = !DIEnumerator(name: "ERA", value: 131116)
!470 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!471 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!472 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!473 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!474 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!475 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!476 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!477 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!478 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!479 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!480 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!481 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!482 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!483 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!484 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!485 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!486 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!487 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!488 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!489 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!490 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!491 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!492 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!493 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!494 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!495 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!496 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!497 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!498 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!499 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!500 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!501 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!502 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!503 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!504 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!505 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!506 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!507 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!508 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!509 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!510 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!511 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!512 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!513 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!514 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!515 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!516 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!517 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!518 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!519 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!520 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!521 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!522 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!523 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!524 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!525 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!526 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!527 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!528 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!529 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!530 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!531 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!532 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!533 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!534 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!535 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!536 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!537 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!538 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!539 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!540 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!541 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!542 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!543 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!544 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!545 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!546 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!547 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!548 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!549 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!550 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!551 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!552 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!553 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!554 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!555 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!556 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!557 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!558 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!559 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!560 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!561 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!562 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!563 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!564 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!565 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!566 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!567 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!568 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!569 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!570 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!571 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!572 = !DIEnumerator(name: "CODESET", value: 14)
!573 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!574 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!575 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!576 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!577 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!578 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!579 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!580 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!581 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!582 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!583 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!584 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!585 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!586 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!587 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!588 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!589 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!590 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!591 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!592 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!593 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!594 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!595 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!596 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!597 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!598 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!599 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!600 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!601 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!602 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!603 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!604 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!605 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!606 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!607 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!608 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!609 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!610 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!611 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!612 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!613 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!614 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!615 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!616 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!617 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!618 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!619 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!620 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!621 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!622 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!623 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!624 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!625 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!626 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!627 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!628 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!629 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!630 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!631 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!632 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!633 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!634 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!635 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!636 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!637 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!638 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!639 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!640 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!641 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!642 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!643 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!644 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!645 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!646 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!647 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!648 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!649 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!650 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!651 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!652 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!653 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!654 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!655 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!656 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!657 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!658 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!659 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!660 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!661 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!662 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!663 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!664 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!665 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!666 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!667 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!668 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!669 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!670 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!671 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!672 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!673 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!674 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!675 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!676 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!677 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!678 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!679 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!680 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!681 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!682 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!683 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!684 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!685 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!686 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!687 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!688 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!689 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!690 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!691 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!692 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!693 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!694 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!695 = !DIEnumerator(name: "THOUSEP", value: 65537)
!696 = !DIEnumerator(name: "__GROUPING", value: 65538)
!697 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!698 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!699 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!700 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!701 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!702 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!703 = !DIEnumerator(name: "__YESSTR", value: 327682)
!704 = !DIEnumerator(name: "__NOSTR", value: 327683)
!705 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!706 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!707 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!708 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!709 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!710 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!711 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!712 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!713 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!714 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!715 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!716 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!717 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!718 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!719 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!720 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!721 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!722 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!723 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!724 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!725 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!726 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!727 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!728 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!729 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!730 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!731 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!732 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!733 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!734 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!735 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!736 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!737 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!738 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!739 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!740 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!741 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!742 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!743 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!744 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!745 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!746 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!747 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!748 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!749 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!750 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!751 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!752 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!753 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!754 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!755 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!756 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!757 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!758 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!759 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!760 = !{!104, !102, !761}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!762 = !{!417}
!763 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!764 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !182)
!765 = !DIGlobalVariableExpression(var: !766)
!766 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !767, file: !768, line: 335, type: !108, isLocal: true, isDefinition: true)
!767 = distinct !DISubprogram(name: "rpl_fcntl", scope: !768, file: !768, line: 272, type: !769, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !771, variables: !774)
!768 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!769 = !DISubroutineType(types: !770)
!770 = !{!108, !108, !108, null}
!771 = distinct !DICompileUnit(language: DW_LANG_C99, file: !772, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, globals: !773)
!772 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!773 = !{!765}
!774 = !{!775, !776, !777, !790, !791, !794, !797, !800}
!775 = !DILocalVariable(name: "fd", arg: 1, scope: !767, file: !768, line: 272, type: !108)
!776 = !DILocalVariable(name: "action", arg: 2, scope: !767, file: !768, line: 272, type: !108)
!777 = !DILocalVariable(name: "arg", scope: !767, file: !768, line: 274, type: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !779, line: 30, baseType: !780)
!779 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !772, line: 274, baseType: !781)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 192, elements: !788)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !772, line: 274, size: 192, elements: !783)
!783 = !{!784, !785, !786, !787}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !782, file: !772, line: 274, baseType: !156, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !782, file: !772, line: 274, baseType: !156, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !782, file: !772, line: 274, baseType: !104, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !782, file: !772, line: 274, baseType: !104, size: 64, offset: 128)
!788 = !{!789}
!789 = !DISubrange(count: 1)
!790 = !DILocalVariable(name: "result", scope: !767, file: !768, line: 275, type: !108)
!791 = !DILocalVariable(name: "target", scope: !792, file: !768, line: 322, type: !108)
!792 = distinct !DILexicalBlock(scope: !793, file: !768, line: 321, column: 7)
!793 = distinct !DILexicalBlock(scope: !767, file: !768, line: 278, column: 5)
!794 = !DILocalVariable(name: "flags", scope: !795, file: !768, line: 359, type: !108)
!795 = distinct !DILexicalBlock(scope: !796, file: !768, line: 358, column: 11)
!796 = distinct !DILexicalBlock(scope: !792, file: !768, line: 357, column: 13)
!797 = !DILocalVariable(name: "saved_errno", scope: !798, file: !768, line: 362, type: !108)
!798 = distinct !DILexicalBlock(scope: !799, file: !768, line: 361, column: 15)
!799 = distinct !DILexicalBlock(scope: !795, file: !768, line: 360, column: 17)
!800 = !DILocalVariable(name: "p", scope: !801, file: !768, line: 404, type: !104)
!801 = distinct !DILexicalBlock(scope: !793, file: !768, line: 402, column: 7)
!802 = distinct !DICompileUnit(language: DW_LANG_C99, file: !803, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !408, retainedTypes: !804)
!803 = !DIFile(filename: "src/find-mount-point.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!804 = !{!102}
!805 = distinct !DICompileUnit(language: DW_LANG_C99, file: !806, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !807, retainedTypes: !808)
!806 = !DIFile(filename: "./lib/canonicalize.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!807 = !{!88}
!808 = !{!104}
!809 = distinct !DICompileUnit(language: DW_LANG_C99, file: !810, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!810 = !DIFile(filename: "./lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!811 = distinct !DICompileUnit(language: DW_LANG_C99, file: !812, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!812 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!813 = distinct !DICompileUnit(language: DW_LANG_C99, file: !814, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !804)
!814 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!815 = distinct !DICompileUnit(language: DW_LANG_C99, file: !816, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !316)
!816 = !DIFile(filename: "./lib/file-set.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!817 = distinct !DICompileUnit(language: DW_LANG_C99, file: !818, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!818 = !DIFile(filename: "./lib/hash-triple.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!819 = distinct !DICompileUnit(language: DW_LANG_C99, file: !820, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !388)
!820 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!821 = distinct !DICompileUnit(language: DW_LANG_C99, file: !822, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !823, retainedTypes: !824)
!822 = !DIFile(filename: "./lib/mbsalign.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!823 = !{!67, !95}
!824 = !{!104, !825}
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !826, line: 20, baseType: !156)
!826 = !DIFile(filename: "/usr/include/bits/types/wint_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!827 = distinct !DICompileUnit(language: DW_LANG_C99, file: !828, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !829, retainedTypes: !830)
!828 = !DIFile(filename: "./lib/mbswidth.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!829 = !{!73}
!830 = !{!105, !118, !108, !109}
!831 = distinct !DICompileUnit(language: DW_LANG_C99, file: !832, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!832 = !DIFile(filename: "./lib/same.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!833 = distinct !DICompileUnit(language: DW_LANG_C99, file: !834, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!834 = !DIFile(filename: "./lib/save-cwd.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!835 = distinct !DICompileUnit(language: DW_LANG_C99, file: !836, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !837, retainedTypes: !808)
!836 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!837 = !{!838}
!838 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !839, line: 41, size: 32, elements: !840)
!839 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!840 = !{!841}
!841 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!842 = distinct !DICompileUnit(language: DW_LANG_C99, file: !843, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !844, retainedTypes: !858)
!843 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!844 = !{!845}
!845 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !847, file: !846, line: 192, size: 32, elements: !856)
!846 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!847 = distinct !DISubprogram(name: "x2nrealloc", scope: !846, file: !846, line: 180, type: !848, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !842, variables: !851)
!848 = !DISubroutineType(types: !849)
!849 = !{!104, !104, !850, !105}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!851 = !{!852, !853, !854, !855}
!852 = !DILocalVariable(name: "p", arg: 1, scope: !847, file: !846, line: 180, type: !104)
!853 = !DILocalVariable(name: "pn", arg: 2, scope: !847, file: !846, line: 180, type: !850)
!854 = !DILocalVariable(name: "s", arg: 3, scope: !847, file: !846, line: 180, type: !105)
!855 = !DILocalVariable(name: "n", scope: !847, file: !846, line: 182, type: !105)
!856 = !{!857}
!857 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!858 = !{!105, !102, !104}
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!860 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!861 = distinct !DICompileUnit(language: DW_LANG_C99, file: !862, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!862 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!863 = distinct !DICompileUnit(language: DW_LANG_C99, file: !864, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !865)
!864 = !DIFile(filename: "./lib/xstrtol-error.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!865 = !{!5}
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !868, retainedTypes: !869)
!867 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!868 = !{!5, !73}
!869 = !{!108, !109}
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !808)
!871 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !316)
!873 = !DIFile(filename: "./lib/chdir-long.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !876)
!875 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!876 = !{!105}
!877 = distinct !DICompileUnit(language: DW_LANG_C99, file: !878, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !879)
!878 = !DIFile(filename: "./lib/mountlist.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!879 = !{!104, !112}
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !808)
!881 = !DIFile(filename: "./lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!883 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!885 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!886 = distinct !DICompileUnit(language: DW_LANG_C99, file: !887, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!887 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!888 = distinct !DICompileUnit(language: DW_LANG_C99, file: !889, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!889 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!891 = !DIFile(filename: "./lib/hash-pjw.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!893 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!895 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!896 = distinct !DICompileUnit(language: DW_LANG_C99, file: !897, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !808)
!897 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!898 = distinct !DICompileUnit(language: DW_LANG_C99, file: !899, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !808)
!899 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255)
!901 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!902 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!903 = !{i32 2, !"Dwarf Version", i32 4}
!904 = !{i32 2, !"Debug Info Version", i32 3}
!905 = !{i32 1, !"wchar_size", i32 4}
!906 = !{i32 7, !"PIC Level", i32 2}
!907 = !{i32 7, !"PIE Level", i32 2}
!908 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 1449, type: !909, isLocal: false, isDefinition: true, scopeLine: 1450, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !911)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !108}
!911 = !{!912}
!912 = !DILocalVariable(name: "status", arg: 1, scope: !908, file: !3, line: 1449, type: !108)
!913 = !DIExpression()
!914 = !DILocation(line: 1449, column: 12, scope: !908)
!915 = !DILocation(line: 1451, column: 14, scope: !916)
!916 = distinct !DILexicalBlock(scope: !908, file: !3, line: 1451, column: 7)
!917 = !DILocation(line: 1451, column: 7, scope: !908)
!918 = !DILocation(line: 1452, column: 5, scope: !919)
!919 = distinct !DILexicalBlock(scope: !916, file: !3, line: 1452, column: 5)
!920 = !{!921, !921, i64 0}
!921 = !{!"any pointer", !922, i64 0}
!922 = !{!"omnipotent char", !923, i64 0}
!923 = !{!"Simple C/C++ TBAA"}
!924 = !DILocation(line: 1455, column: 7, scope: !925)
!925 = distinct !DILexicalBlock(scope: !916, file: !3, line: 1454, column: 5)
!926 = !DILocation(line: 1456, column: 7, scope: !925)
!927 = !DILocation(line: 587, column: 3, scope: !928, inlinedAt: !929)
!928 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !179, file: !179, line: 585, type: !415, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !255)
!929 = distinct !DILocation(line: 1461, column: 7, scope: !925)
!930 = !DILocation(line: 1465, column: 7, scope: !925)
!931 = !DILocation(line: 1473, column: 7, scope: !925)
!932 = !DILocation(line: 1480, column: 7, scope: !925)
!933 = !DILocation(line: 1486, column: 7, scope: !925)
!934 = !DILocation(line: 1490, column: 7, scope: !925)
!935 = !DILocation(line: 1496, column: 7, scope: !925)
!936 = !DILocation(line: 1497, column: 7, scope: !925)
!937 = !DILocation(line: 604, column: 3, scope: !938, inlinedAt: !941)
!938 = distinct !DISubprogram(name: "emit_blocksize_note", scope: !179, file: !179, line: 602, type: !180, isLocal: true, isDefinition: true, scopeLine: 603, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !939)
!939 = !{!940}
!940 = !DILocalVariable(name: "program", arg: 1, scope: !938, file: !179, line: 602, type: !182)
!941 = distinct !DILocation(line: 1498, column: 7, scope: !925)
!942 = !DILocation(line: 595, column: 3, scope: !943, inlinedAt: !944)
!943 = distinct !DISubprogram(name: "emit_size_note", scope: !179, file: !179, line: 593, type: !415, isLocal: true, isDefinition: true, scopeLine: 594, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !255)
!944 = distinct !DILocation(line: 1499, column: 7, scope: !925)
!945 = !DILocation(line: 1500, column: 7, scope: !925)
!946 = !DILocation(line: 642, column: 15, scope: !178, inlinedAt: !947)
!947 = distinct !DILocation(line: 1505, column: 7, scope: !925)
!948 = !DILocation(line: 651, column: 3, scope: !178, inlinedAt: !947)
!949 = !DILocation(line: 655, column: 29, scope: !178, inlinedAt: !947)
!950 = !DILocation(line: 655, column: 15, scope: !178, inlinedAt: !947)
!951 = !DILocation(line: 656, column: 7, scope: !952, inlinedAt: !947)
!952 = distinct !DILexicalBlock(scope: !178, file: !179, line: 656, column: 7)
!953 = !DILocation(line: 656, column: 19, scope: !952, inlinedAt: !947)
!954 = !DILocation(line: 656, column: 22, scope: !952, inlinedAt: !947)
!955 = !DILocation(line: 656, column: 7, scope: !178, inlinedAt: !947)
!956 = !DILocation(line: 662, column: 7, scope: !957, inlinedAt: !947)
!957 = distinct !DILexicalBlock(scope: !952, file: !179, line: 657, column: 5)
!958 = !DILocation(line: 664, column: 5, scope: !957, inlinedAt: !947)
!959 = !DILocation(line: 665, column: 3, scope: !178, inlinedAt: !947)
!960 = !DILocation(line: 667, column: 3, scope: !178, inlinedAt: !947)
!961 = !DILocation(line: 1507, column: 3, scope: !908)
!962 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1511, type: !963, isLocal: false, isDefinition: true, scopeLine: 1512, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !965)
!963 = !DISubroutineType(types: !964)
!964 = !{!108, !108, !242}
!965 = !{!966, !967, !968, !1005, !1006, !1007, !1009, !1010, !1013, !1015, !1016, !1020, !1023, !1027, !1030, !1031}
!966 = !DILocalVariable(name: "argc", arg: 1, scope: !962, file: !3, line: 1511, type: !108)
!967 = !DILocalVariable(name: "argv", arg: 2, scope: !962, file: !3, line: 1511, type: !242)
!968 = !DILocalVariable(name: "stats", scope: !962, file: !3, line: 1513, type: !969)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !971, line: 46, size: 1152, elements: !972)
!971 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!972 = !{!973, !974, !976, !978, !980, !982, !984, !985, !986, !989, !991, !993, !1001, !1002, !1003}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !970, file: !971, line: 48, baseType: !112, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !970, file: !971, line: 53, baseType: !975, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !113, line: 136, baseType: !107)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !970, file: !971, line: 61, baseType: !977, size: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !113, line: 139, baseType: !107)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !970, file: !971, line: 62, baseType: !979, size: 32, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !113, line: 138, baseType: !156)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !970, file: !971, line: 64, baseType: !981, size: 32, offset: 224)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !113, line: 134, baseType: !156)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !970, file: !971, line: 65, baseType: !983, size: 32, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !113, line: 135, baseType: !156)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !970, file: !971, line: 67, baseType: !108, size: 32, offset: 288)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !970, file: !971, line: 69, baseType: !112, size: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !970, file: !971, line: 74, baseType: !987, size: 64, offset: 384)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !113, line: 140, baseType: !988)
!988 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !970, file: !971, line: 78, baseType: !990, size: 64, offset: 448)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !113, line: 162, baseType: !988)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !970, file: !971, line: 80, baseType: !992, size: 64, offset: 512)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !113, line: 167, baseType: !988)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !970, file: !971, line: 91, baseType: !994, size: 128, offset: 576)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !995, line: 8, size: 128, elements: !996)
!995 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!996 = !{!997, !999}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !994, file: !995, line: 10, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !113, line: 148, baseType: !988)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !994, file: !995, line: 11, baseType: !1000, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !113, line: 184, baseType: !988)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !970, file: !971, line: 92, baseType: !994, size: 128, offset: 704)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !970, file: !971, line: 93, baseType: !994, size: 128, offset: 832)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !970, file: !971, line: 106, baseType: !1004, size: 192, offset: 960)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 192, elements: !301)
!1005 = !DILocalVariable(name: "posix_format", scope: !962, file: !3, line: 1535, type: !122)
!1006 = !DILocalVariable(name: "msg_mut_excl", scope: !962, file: !3, line: 1537, type: !182)
!1007 = !DILocalVariable(name: "oi", scope: !1008, file: !3, line: 1541, type: !108)
!1008 = distinct !DILexicalBlock(scope: !962, file: !3, line: 1540, column: 5)
!1009 = !DILocalVariable(name: "c", scope: !1008, file: !3, line: 1542, type: !108)
!1010 = !DILocalVariable(name: "e", scope: !1011, file: !3, line: 1554, type: !5)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 1553, column: 11)
!1012 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 1548, column: 9)
!1013 = !DILocalVariable(name: "match", scope: !1014, file: !3, line: 1677, type: !122)
!1014 = distinct !DILexicalBlock(scope: !962, file: !3, line: 1676, column: 3)
!1015 = !DILocalVariable(name: "fs_incl", scope: !1014, file: !3, line: 1678, type: !139)
!1016 = !DILocalVariable(name: "fs_excl", scope: !1017, file: !3, line: 1681, type: !139)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 1680, column: 7)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 1679, column: 5)
!1019 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 1679, column: 5)
!1020 = !DILocalVariable(name: "i", scope: !1021, file: !3, line: 1702, type: !108)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 1701, column: 5)
!1022 = distinct !DILexicalBlock(scope: !962, file: !3, line: 1700, column: 7)
!1023 = !DILocalVariable(name: "fd", scope: !1024, file: !3, line: 1712, type: !108)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 1709, column: 9)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 1708, column: 7)
!1026 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 1708, column: 7)
!1027 = !DILocalVariable(name: "status", scope: !1028, file: !3, line: 1738, type: !108)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 1733, column: 5)
!1029 = distinct !DILexicalBlock(scope: !962, file: !3, line: 1732, column: 7)
!1030 = !DILocalVariable(name: "warning", scope: !1028, file: !3, line: 1747, type: !182)
!1031 = !DILocalVariable(name: "i", scope: !1032, file: !3, line: 1760, type: !108)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 1759, column: 5)
!1033 = distinct !DILexicalBlock(scope: !962, file: !3, line: 1758, column: 7)
!1034 = !DILocalVariable(name: "buf", scope: !1035, file: !3, line: 519, type: !1058)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 518, column: 9)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 514, column: 11)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 510, column: 5)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 509, column: 3)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 509, column: 3)
!1040 = distinct !DISubprogram(name: "get_header", scope: !3, file: !3, line: 503, type: !415, isLocal: true, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1041)
!1041 = !{!1042, !1043, !1044, !1034, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1057}
!1042 = !DILocalVariable(name: "col", scope: !1040, file: !3, line: 505, type: !105)
!1043 = !DILocalVariable(name: "cell", scope: !1037, file: !3, line: 511, type: !102)
!1044 = !DILocalVariable(name: "header", scope: !1037, file: !3, line: 512, type: !182)
!1045 = !DILocalVariable(name: "opts", scope: !1035, file: !3, line: 521, type: !108)
!1046 = !DILocalVariable(name: "q1000", scope: !1035, file: !3, line: 529, type: !114)
!1047 = !DILocalVariable(name: "q1024", scope: !1035, file: !3, line: 530, type: !114)
!1048 = !DILocalVariable(name: "divisible_by_1000", scope: !1035, file: !3, line: 531, type: !122)
!1049 = !DILocalVariable(name: "divisible_by_1024", scope: !1035, file: !3, line: 532, type: !122)
!1050 = !DILocalVariable(name: "num", scope: !1035, file: !3, line: 548, type: !102)
!1051 = !DILocalVariable(name: "buf", scope: !1052, file: !3, line: 559, type: !1054)
!1052 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 558, column: 9)
!1053 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 557, column: 16)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 168, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 21)
!1057 = !DILocalVariable(name: "num", scope: !1052, file: !3, line: 560, type: !102)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 5216, elements: !1059)
!1059 = !{!1060}
!1060 = !DISubrange(count: 652)
!1061 = !DILocation(line: 519, column: 16, scope: !1035, inlinedAt: !1062)
!1062 = distinct !DILocation(line: 1756, column: 3, scope: !962)
!1063 = !DILocation(line: 559, column: 16, scope: !1052, inlinedAt: !1062)
!1064 = !DILocation(line: 1511, column: 11, scope: !962)
!1065 = !DILocation(line: 1511, column: 24, scope: !962)
!1066 = !DILocation(line: 1516, column: 21, scope: !962)
!1067 = !DILocation(line: 1516, column: 3, scope: !962)
!1068 = !DILocation(line: 1517, column: 3, scope: !962)
!1069 = !DILocation(line: 1518, column: 3, scope: !962)
!1070 = !DILocation(line: 1519, column: 3, scope: !962)
!1071 = !DILocation(line: 1521, column: 3, scope: !962)
!1072 = !DILocation(line: 1523, column: 18, scope: !962)
!1073 = !DILocation(line: 1524, column: 19, scope: !962)
!1074 = !DILocation(line: 1527, column: 21, scope: !962)
!1075 = !{!1076, !1076, i64 0}
!1076 = !{!"int", !922, i64 0}
!1077 = !DILocation(line: 1532, column: 27, scope: !962)
!1078 = !{!1079, !1080, i64 0}
!1079 = !{!"fs_usage", !1080, i64 0, !1080, i64 8, !1080, i64 16, !1080, i64 24, !1081, i64 32, !1080, i64 40, !1080, i64 48}
!1080 = !{!"long", !922, i64 0}
!1081 = !{!"_Bool", !922, i64 0}
!1082 = !DILocation(line: 1535, column: 8, scope: !962)
!1083 = !DILocation(line: 1537, column: 30, scope: !962)
!1084 = !DILocation(line: 1537, column: 15, scope: !962)
!1085 = !DILocation(line: 1539, column: 3, scope: !962)
!1086 = !DILocation(line: 1541, column: 7, scope: !1008)
!1087 = !DILocation(line: 1541, column: 11, scope: !1008)
!1088 = !DILocation(line: 1542, column: 15, scope: !1008)
!1089 = !DILocation(line: 1542, column: 11, scope: !1008)
!1090 = !DILocation(line: 1544, column: 11, scope: !1008)
!1091 = !DILocation(line: 1551, column: 11, scope: !1012)
!1092 = !DILocation(line: 1554, column: 50, scope: !1011)
!1093 = !DILocation(line: 1554, column: 35, scope: !1011)
!1094 = !DILocation(line: 1554, column: 31, scope: !1011)
!1095 = !DILocation(line: 1556, column: 19, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 1556, column: 17)
!1097 = !DILocation(line: 1556, column: 17, scope: !1011)
!1098 = !DILocation(line: 1557, column: 33, scope: !1096)
!1099 = !DILocation(line: 1557, column: 54, scope: !1096)
!1100 = !DILocation(line: 1557, column: 15, scope: !1096)
!1101 = !DILocation(line: 1561, column: 15, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 1561, column: 15)
!1103 = !DILocation(line: 1561, column: 27, scope: !1102)
!1104 = !DILocation(line: 1561, column: 15, scope: !1012)
!1105 = !DILocation(line: 1563, column: 15, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 1562, column: 13)
!1107 = !DILocation(line: 1564, column: 15, scope: !1106)
!1108 = !DILocation(line: 1566, column: 23, scope: !1012)
!1109 = !DILocation(line: 1567, column: 11, scope: !1012)
!1110 = !DILocation(line: 1569, column: 29, scope: !1012)
!1111 = !DILocation(line: 1570, column: 29, scope: !1012)
!1112 = !{!1080, !1080, i64 0}
!1113 = !DILocation(line: 1571, column: 11, scope: !1012)
!1114 = !DILocation(line: 1573, column: 29, scope: !1012)
!1115 = !DILocation(line: 1574, column: 29, scope: !1012)
!1116 = !DILocation(line: 1575, column: 11, scope: !1012)
!1117 = !DILocation(line: 1577, column: 29, scope: !1012)
!1118 = !DILocation(line: 1578, column: 29, scope: !1012)
!1119 = !DILocation(line: 1579, column: 11, scope: !1012)
!1120 = !DILocation(line: 1582, column: 11, scope: !1012)
!1121 = !DILocation(line: 1584, column: 29, scope: !1012)
!1122 = !DILocation(line: 1585, column: 29, scope: !1012)
!1123 = !DILocation(line: 1586, column: 11, scope: !1012)
!1124 = !DILocation(line: 1588, column: 15, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 1588, column: 15)
!1126 = !DILocation(line: 1588, column: 27, scope: !1125)
!1127 = !DILocation(line: 1588, column: 15, scope: !1012)
!1128 = !DILocation(line: 1590, column: 15, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 1589, column: 13)
!1130 = !DILocation(line: 1591, column: 15, scope: !1129)
!1131 = !DILocation(line: 1594, column: 11, scope: !1012)
!1132 = !DILocation(line: 1596, column: 15, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 1596, column: 15)
!1134 = !DILocation(line: 1596, column: 27, scope: !1133)
!1135 = !DILocation(line: 1596, column: 15, scope: !1012)
!1136 = !DILocation(line: 1598, column: 15, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1133, file: !3, line: 1597, column: 13)
!1138 = !DILocation(line: 1599, column: 15, scope: !1137)
!1139 = !DILocation(line: 1605, column: 11, scope: !1012)
!1140 = !DILocation(line: 1608, column: 11, scope: !1012)
!1141 = !DILocation(line: 1613, column: 24, scope: !1012)
!1142 = !DILocalVariable(name: "fstype", arg: 1, scope: !1143, file: !3, line: 1425, type: !182)
!1143 = distinct !DISubprogram(name: "add_fs_type", scope: !3, file: !3, line: 1425, type: !180, isLocal: true, isDefinition: true, scopeLine: 1426, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1144)
!1144 = !{!1142, !1145}
!1145 = !DILocalVariable(name: "fsp", scope: !1143, file: !3, line: 1427, type: !139)
!1146 = !DIExpression(DW_OP_deref)
!1147 = !DILocation(line: 1425, column: 26, scope: !1143, inlinedAt: !1148)
!1148 = distinct !DILocation(line: 1613, column: 11, scope: !1012)
!1149 = !DILocation(line: 1429, column: 9, scope: !1143, inlinedAt: !1148)
!1150 = !DILocation(line: 1427, column: 24, scope: !1143, inlinedAt: !1148)
!1151 = !DILocation(line: 1430, column: 16, scope: !1143, inlinedAt: !1148)
!1152 = !{!1153, !921, i64 0}
!1153 = !{!"fs_type_list", !921, i64 0, !921, i64 8}
!1154 = !DILocation(line: 1431, column: 18, scope: !1143, inlinedAt: !1148)
!1155 = !DILocation(line: 1431, column: 8, scope: !1143, inlinedAt: !1148)
!1156 = !DILocation(line: 1431, column: 16, scope: !1143, inlinedAt: !1148)
!1157 = !{!1153, !921, i64 8}
!1158 = !DILocation(line: 1432, column: 18, scope: !1143, inlinedAt: !1148)
!1159 = !DILocation(line: 1614, column: 11, scope: !1012)
!1160 = !DILocation(line: 1620, column: 33, scope: !1012)
!1161 = !DILocalVariable(name: "fstype", arg: 1, scope: !1162, file: !3, line: 1438, type: !182)
!1162 = distinct !DISubprogram(name: "add_excluded_fs_type", scope: !3, file: !3, line: 1438, type: !180, isLocal: true, isDefinition: true, scopeLine: 1439, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1163)
!1163 = !{!1161, !1164}
!1164 = !DILocalVariable(name: "fsp", scope: !1162, file: !3, line: 1440, type: !139)
!1165 = !DILocation(line: 1438, column: 35, scope: !1162, inlinedAt: !1166)
!1166 = distinct !DILocation(line: 1620, column: 11, scope: !1012)
!1167 = !DILocation(line: 1442, column: 9, scope: !1162, inlinedAt: !1166)
!1168 = !DILocation(line: 1440, column: 24, scope: !1162, inlinedAt: !1166)
!1169 = !DILocation(line: 1443, column: 16, scope: !1162, inlinedAt: !1166)
!1170 = !DILocation(line: 1444, column: 18, scope: !1162, inlinedAt: !1166)
!1171 = !DILocation(line: 1444, column: 8, scope: !1162, inlinedAt: !1166)
!1172 = !DILocation(line: 1444, column: 16, scope: !1162, inlinedAt: !1166)
!1173 = !DILocation(line: 1445, column: 19, scope: !1162, inlinedAt: !1166)
!1174 = !DILocation(line: 1621, column: 11, scope: !1012)
!1175 = !DILocation(line: 1624, column: 15, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 1624, column: 15)
!1177 = !DILocation(line: 1624, column: 27, scope: !1176)
!1178 = !DILocation(line: 1624, column: 15, scope: !1012)
!1179 = !DILocation(line: 1626, column: 15, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1176, file: !3, line: 1625, column: 13)
!1181 = !DILocation(line: 1627, column: 15, scope: !1180)
!1182 = !DILocation(line: 1629, column: 15, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 1629, column: 15)
!1184 = !DILocation(line: 1629, column: 43, scope: !1183)
!1185 = !DILocation(line: 1629, column: 28, scope: !1183)
!1186 = !DILocation(line: 1631, column: 15, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1183, file: !3, line: 1630, column: 13)
!1188 = !DILocation(line: 1632, column: 15, scope: !1187)
!1189 = !DILocation(line: 1634, column: 15, scope: !1012)
!1190 = !DILocation(line: 1636, column: 15, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1192, file: !3, line: 1635, column: 13)
!1192 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 1634, column: 15)
!1193 = !DILocation(line: 1637, column: 15, scope: !1191)
!1194 = !DILocation(line: 1639, column: 23, scope: !1012)
!1195 = !DILocation(line: 1640, column: 15, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 1640, column: 15)
!1197 = !DILocation(line: 1640, column: 15, scope: !1012)
!1198 = !DILocation(line: 1641, column: 13, scope: !1196)
!1199 = !DILocation(line: 1646, column: 11, scope: !1012)
!1200 = !DILocation(line: 1648, column: 9, scope: !1012)
!1201 = !DILocation(line: 1649, column: 9, scope: !1012)
!1202 = !DILocation(line: 1652, column: 11, scope: !1012)
!1203 = !DILocation(line: 1654, column: 5, scope: !962)
!1204 = distinct !{!1204, !1085, !1203}
!1205 = !DILocation(line: 1656, column: 7, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !962, file: !3, line: 1656, column: 7)
!1207 = !DILocation(line: 1656, column: 25, scope: !1206)
!1208 = !DILocation(line: 1656, column: 7, scope: !962)
!1209 = !DILocation(line: 1658, column: 11, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1211, file: !3, line: 1658, column: 11)
!1211 = distinct !DILexicalBlock(scope: !1206, file: !3, line: 1657, column: 5)
!1212 = !DILocation(line: 1658, column: 11, scope: !1211)
!1213 = !DILocation(line: 1660, column: 29, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1210, file: !3, line: 1659, column: 9)
!1215 = !DILocation(line: 1661, column: 32, scope: !1214)
!1216 = !DILocation(line: 1661, column: 31, scope: !1214)
!1217 = !DILocation(line: 1661, column: 29, scope: !1214)
!1218 = !DILocation(line: 1662, column: 9, scope: !1214)
!1219 = !DILocation(line: 1664, column: 24, scope: !1210)
!1220 = !DILocation(line: 1664, column: 9, scope: !1210)
!1221 = !DILocation(line: 1668, column: 7, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !962, file: !3, line: 1668, column: 7)
!1223 = !DILocation(line: 1668, column: 34, scope: !1222)
!1224 = !DILocation(line: 1670, column: 12, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1222, file: !3, line: 1670, column: 12)
!1226 = !DILocation(line: 1670, column: 30, scope: !1225)
!1227 = !DILocation(line: 1670, column: 12, scope: !1222)
!1228 = !DILocation(line: 1671, column: 17, scope: !1225)
!1229 = !DILocation(line: 1671, column: 5, scope: !1225)
!1230 = !DILocation(line: 1672, column: 12, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1225, file: !3, line: 1672, column: 12)
!1232 = !DILocation(line: 1672, column: 12, scope: !1225)
!1233 = !DILocation(line: 1673, column: 17, scope: !1231)
!1234 = !DILocation(line: 1673, column: 5, scope: !1231)
!1235 = !DILocation(line: 1677, column: 10, scope: !1014)
!1236 = !DILocation(line: 1678, column: 26, scope: !1014)
!1237 = !DILocation(line: 1679, column: 5, scope: !1019)
!1238 = !DILocation(line: 1681, column: 30, scope: !1017)
!1239 = !DILocation(line: 1682, column: 9, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 1682, column: 9)
!1241 = !DILocation(line: 1682, column: 69, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1240, file: !3, line: 1682, column: 9)
!1243 = distinct !{!1243, !1239, !1244}
!1244 = !DILocation(line: 1692, column: 11, scope: !1240)
!1245 = !DILocation(line: 1684, column: 17, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1247, file: !3, line: 1684, column: 17)
!1247 = distinct !DILexicalBlock(scope: !1242, file: !3, line: 1683, column: 11)
!1248 = !DILocation(line: 1684, column: 17, scope: !1247)
!1249 = !DILocation(line: 1687, column: 24, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1246, file: !3, line: 1685, column: 15)
!1251 = !DILocation(line: 1688, column: 40, scope: !1250)
!1252 = !DILocation(line: 1688, column: 24, scope: !1250)
