; ModuleID = 'coreutils-8.27/src/dircolors.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon.6 }
%union.anon.6 = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION]... [FILE]\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 80, type: !279, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !241, globals: !242)
!3 = !DIFile(filename: "src/dircolors.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !10, !212, !226}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Shell_syntax", file: !3, line: 42, size: 32, elements: !6)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "SHELL_SYNTAX_BOURNE", value: 0)
!8 = !DIEnumerator(name: "SHELL_SYNTAX_C", value: 1)
!9 = !DIEnumerator(name: "SHELL_SYNTAX_UNKNOWN", value: 2)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !11, file: !3, line: 250, size: 32, elements: !207)
!11 = distinct !DISubprogram(name: "dc_parse_stream", scope: !3, file: !3, line: 239, type: !12, isLocal: true, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !80)
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !15, !78}
!14 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !17, line: 7, baseType: !18)
!17 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !19, line: 241, size: 1728, elements: !20)
!19 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!20 = !{!21, !23, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !44, !45, !46, !47, !51, !53, !55, !59, !62, !64, !66, !67, !68, !69, !73, !74}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !18, file: !19, line: 242, baseType: !22, size: 32)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !18, file: !19, line: 247, baseType: !24, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !18, file: !19, line: 248, baseType: !24, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !18, file: !19, line: 249, baseType: !24, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !18, file: !19, line: 250, baseType: !24, size: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !18, file: !19, line: 251, baseType: !24, size: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !18, file: !19, line: 252, baseType: !24, size: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !18, file: !19, line: 253, baseType: !24, size: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !18, file: !19, line: 254, baseType: !24, size: 64, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !18, file: !19, line: 256, baseType: !24, size: 64, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !18, file: !19, line: 257, baseType: !24, size: 64, offset: 640)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !18, file: !19, line: 258, baseType: !24, size: 64, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !18, file: !19, line: 260, baseType: !37, size: 64, offset: 768)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !19, line: 156, size: 192, elements: !39)
!39 = !{!40, !41, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !38, file: !19, line: 157, baseType: !37, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !38, file: !19, line: 158, baseType: !42, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !38, file: !19, line: 162, baseType: !22, size: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !18, file: !19, line: 262, baseType: !42, size: 64, offset: 832)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !18, file: !19, line: 264, baseType: !22, size: 32, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !18, file: !19, line: 268, baseType: !22, size: 32, offset: 928)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !18, file: !19, line: 270, baseType: !48, size: 64, offset: 960)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !49, line: 140, baseType: !50)
!49 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!50 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !18, file: !19, line: 274, baseType: !52, size: 16, offset: 1024)
!52 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !18, file: !19, line: 275, baseType: !54, size: 8, offset: 1040)
!54 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !18, file: !19, line: 276, baseType: !56, size: 8, offset: 1048)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 1)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !18, file: !19, line: 280, baseType: !60, size: 64, offset: 1088)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !19, line: 150, baseType: null)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !18, file: !19, line: 289, baseType: !63, size: 64, offset: 1152)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !49, line: 141, baseType: !50)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !18, file: !19, line: 297, baseType: !65, size: 64, offset: 1216)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !18, file: !19, line: 298, baseType: !65, size: 64, offset: 1280)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !18, file: !19, line: 299, baseType: !65, size: 64, offset: 1344)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !18, file: !19, line: 300, baseType: !65, size: 64, offset: 1408)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !18, file: !19, line: 302, baseType: !70, size: 64, offset: 1472)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 62, baseType: !72)
!71 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!72 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !18, file: !19, line: 303, baseType: !22, size: 32, offset: 1536)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !18, file: !19, line: 305, baseType: !75, size: 160, offset: 1568)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 160, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 20)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !93, !94, !95, !154, !159, !161, !164, !166, !169, !173, !176, !178, !181, !184, !189, !192, !194, !197, !199, !202, !204}
!81 = !DILocalVariable(name: "fp", arg: 1, scope: !11, file: !3, line: 239, type: !15)
!82 = !DILocalVariable(name: "filename", arg: 2, scope: !11, file: !3, line: 239, type: !78)
!83 = !DILocalVariable(name: "line_number", scope: !11, file: !3, line: 241, type: !70)
!84 = !DILocalVariable(name: "next_G_line", scope: !11, file: !3, line: 242, type: !78)
!85 = !DILocalVariable(name: "input_line", scope: !11, file: !3, line: 243, type: !24)
!86 = !DILocalVariable(name: "input_line_size", scope: !11, file: !3, line: 244, type: !70)
!87 = !DILocalVariable(name: "line", scope: !11, file: !3, line: 245, type: !78)
!88 = !DILocalVariable(name: "term", scope: !11, file: !3, line: 246, type: !78)
!89 = !DILocalVariable(name: "ok", scope: !11, file: !3, line: 247, type: !14)
!90 = !DILocalVariable(name: "state", scope: !11, file: !3, line: 250, type: !10)
!91 = !DILocalVariable(name: "keywd", scope: !92, file: !3, line: 259, type: !24)
!92 = distinct !DILexicalBlock(scope: !11, file: !3, line: 258, column: 5)
!93 = !DILocalVariable(name: "arg", scope: !92, file: !3, line: 259, type: !24)
!94 = !DILocalVariable(name: "unrecognized", scope: !92, file: !3, line: 260, type: !14)
!95 = !DILocalVariable(name: "__o", scope: !96, file: !3, line: 312, type: !103)
!96 = distinct !DILexicalBlock(scope: !97, file: !3, line: 312, column: 19)
!97 = distinct !DILexicalBlock(scope: !98, file: !3, line: 311, column: 17)
!98 = distinct !DILexicalBlock(scope: !99, file: !3, line: 310, column: 19)
!99 = distinct !DILexicalBlock(scope: !100, file: !3, line: 309, column: 13)
!100 = distinct !DILexicalBlock(scope: !101, file: !3, line: 308, column: 15)
!101 = distinct !DILexicalBlock(scope: !102, file: !3, line: 304, column: 9)
!102 = distinct !DILexicalBlock(scope: !92, file: !3, line: 296, column: 11)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !105, line: 174, size: 704, elements: !106)
!105 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!106 = !{!107, !108, !118, !119, !120, !121, !126, !127, !138, !149, !150, !152, !153}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !104, file: !105, line: 176, baseType: !70, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !104, file: !105, line: 177, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !105, line: 167, size: 128, elements: !111)
!111 = !{!112, !113, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !110, file: !105, line: 169, baseType: !24, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !110, file: !105, line: 170, baseType: !109, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !110, file: !105, line: 171, baseType: !115, offset: 128)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: -1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !104, file: !105, line: 178, baseType: !24, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !104, file: !105, line: 179, baseType: !24, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !104, file: !105, line: 180, baseType: !24, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !104, file: !105, line: 185, baseType: !122, size: 64, offset: 320)
!122 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !104, file: !105, line: 181, size: 64, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !122, file: !105, line: 183, baseType: !70, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !122, file: !105, line: 184, baseType: !65, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !104, file: !105, line: 186, baseType: !70, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !104, file: !105, line: 193, baseType: !128, size: 64, offset: 448)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !104, file: !105, line: 189, size: 64, elements: !129)
!129 = !{!130, !134}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !128, file: !105, line: 191, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!65, !70}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !128, file: !105, line: 192, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!65, !65, !70}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !104, file: !105, line: 198, baseType: !139, size: 64, offset: 512)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !104, file: !105, line: 194, size: 64, elements: !140)
!140 = !{!141, !145}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !139, file: !105, line: 196, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !65}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !139, file: !105, line: 197, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !65, !65}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !104, file: !105, line: 200, baseType: !65, size: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !104, file: !105, line: 201, baseType: !151, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!151 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !104, file: !105, line: 202, baseType: !151, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !104, file: !105, line: 206, baseType: !151, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!154 = !DILocalVariable(name: "__o1", scope: !155, file: !3, line: 312, type: !157)
!155 = distinct !DILexicalBlock(scope: !156, file: !3, line: 312, column: 19)
!156 = distinct !DILexicalBlock(scope: !96, file: !3, line: 312, column: 19)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!159 = !DILocalVariable(name: "__o", scope: !160, file: !3, line: 314, type: !103)
!160 = distinct !DILexicalBlock(scope: !97, file: !3, line: 314, column: 19)
!161 = !DILocalVariable(name: "__o1", scope: !162, file: !3, line: 314, type: !157)
!162 = distinct !DILexicalBlock(scope: !163, file: !3, line: 314, column: 19)
!163 = distinct !DILexicalBlock(scope: !160, file: !3, line: 314, column: 19)
!164 = !DILocalVariable(name: "__o", scope: !165, file: !3, line: 316, type: !103)
!165 = distinct !DILexicalBlock(scope: !97, file: !3, line: 316, column: 19)
!166 = !DILocalVariable(name: "__o1", scope: !167, file: !3, line: 316, type: !157)
!167 = distinct !DILexicalBlock(scope: !168, file: !3, line: 316, column: 19)
!168 = distinct !DILexicalBlock(scope: !165, file: !3, line: 316, column: 19)
!169 = !DILocalVariable(name: "__o", scope: !170, file: !3, line: 321, type: !103)
!170 = distinct !DILexicalBlock(scope: !171, file: !3, line: 321, column: 19)
!171 = distinct !DILexicalBlock(scope: !172, file: !3, line: 319, column: 17)
!172 = distinct !DILexicalBlock(scope: !98, file: !3, line: 318, column: 24)
!173 = !DILocalVariable(name: "__o1", scope: !174, file: !3, line: 321, type: !157)
!174 = distinct !DILexicalBlock(scope: !175, file: !3, line: 321, column: 19)
!175 = distinct !DILexicalBlock(scope: !170, file: !3, line: 321, column: 19)
!176 = !DILocalVariable(name: "__o", scope: !177, file: !3, line: 323, type: !103)
!177 = distinct !DILexicalBlock(scope: !171, file: !3, line: 323, column: 19)
!178 = !DILocalVariable(name: "__o1", scope: !179, file: !3, line: 323, type: !157)
!179 = distinct !DILexicalBlock(scope: !180, file: !3, line: 323, column: 19)
!180 = distinct !DILexicalBlock(scope: !177, file: !3, line: 323, column: 19)
!181 = !DILocalVariable(name: "i", scope: !182, file: !3, line: 333, type: !22)
!182 = distinct !DILexicalBlock(scope: !183, file: !3, line: 332, column: 17)
!183 = distinct !DILexicalBlock(scope: !172, file: !3, line: 325, column: 24)
!184 = !DILocalVariable(name: "__o", scope: !185, file: !3, line: 341, type: !103)
!185 = distinct !DILexicalBlock(scope: !186, file: !3, line: 341, column: 23)
!186 = distinct !DILexicalBlock(scope: !187, file: !3, line: 341, column: 23)
!187 = distinct !DILexicalBlock(scope: !188, file: !3, line: 340, column: 21)
!188 = distinct !DILexicalBlock(scope: !182, file: !3, line: 339, column: 23)
!189 = !DILocalVariable(name: "__o1", scope: !190, file: !3, line: 341, type: !157)
!190 = distinct !DILexicalBlock(scope: !191, file: !3, line: 341, column: 23)
!191 = distinct !DILexicalBlock(scope: !185, file: !3, line: 341, column: 23)
!192 = !DILocalVariable(name: "__o", scope: !193, file: !3, line: 341, type: !103)
!193 = distinct !DILexicalBlock(scope: !186, file: !3, line: 341, column: 23)
!194 = !DILocalVariable(name: "__o1", scope: !195, file: !3, line: 341, type: !157)
!195 = distinct !DILexicalBlock(scope: !196, file: !3, line: 341, column: 23)
!196 = distinct !DILexicalBlock(scope: !193, file: !3, line: 341, column: 23)
!197 = !DILocalVariable(name: "__o", scope: !198, file: !3, line: 342, type: !103)
!198 = distinct !DILexicalBlock(scope: !187, file: !3, line: 342, column: 23)
!199 = !DILocalVariable(name: "__o1", scope: !200, file: !3, line: 342, type: !157)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 342, column: 23)
!201 = distinct !DILexicalBlock(scope: !198, file: !3, line: 342, column: 23)
!202 = !DILocalVariable(name: "__o", scope: !203, file: !3, line: 344, type: !103)
!203 = distinct !DILexicalBlock(scope: !187, file: !3, line: 344, column: 23)
!204 = !DILocalVariable(name: "__o1", scope: !205, file: !3, line: 344, type: !157)
!205 = distinct !DILexicalBlock(scope: !206, file: !3, line: 344, column: 23)
!206 = distinct !DILexicalBlock(scope: !203, file: !3, line: 344, column: 23)
!207 = !{!208, !209, !210, !211}
!208 = !DIEnumerator(name: "ST_TERMNO", value: 0)
!209 = !DIEnumerator(name: "ST_TERMYES", value: 1)
!210 = !DIEnumerator(name: "ST_TERMSURE", value: 2)
!211 = !DIEnumerator(name: "ST_GLOBAL", value: 3)
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !213, line: 32, size: 32, elements: !214)
!213 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!215 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!216 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!217 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!218 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!219 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!220 = !DIEnumerator(name: "c_quoting_style", value: 5)
!221 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!222 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!223 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!224 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!225 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !227, line: 46, size: 32, elements: !228)
!227 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!229 = !DIEnumerator(name: "_ISupper", value: 256)
!230 = !DIEnumerator(name: "_ISlower", value: 512)
!231 = !DIEnumerator(name: "_ISalpha", value: 1024)
!232 = !DIEnumerator(name: "_ISdigit", value: 2048)
!233 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!234 = !DIEnumerator(name: "_ISspace", value: 8192)
!235 = !DIEnumerator(name: "_ISprint", value: 16384)
!236 = !DIEnumerator(name: "_ISgraph", value: 32768)
!237 = !DIEnumerator(name: "_ISblank", value: 1)
!238 = !DIEnumerator(name: "_IScntrl", value: 2)
!239 = !DIEnumerator(name: "_ISpunct", value: 4)
!240 = !DIEnumerator(name: "_ISalnum", value: 8)
!241 = !{!24, !65, !70, !72, !22, !52}
!242 = !{!243, !245, !0, !265, !271, !277}
!243 = !DIGlobalVariableExpression(var: !244)
!244 = distinct !DIGlobalVariable(name: "lsc_obstack", scope: !2, file: !3, line: 60, type: !104, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246)
!246 = distinct !DIGlobalVariable(name: "infomap", scope: !247, file: !248, line: 632, type: !262, isLocal: true, isDefinition: true)
!247 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !248, file: !248, line: 630, type: !249, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !251)
!248 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!249 = !DISubroutineType(types: !250)
!250 = !{null, !78}
!251 = !{!252, !253, !254, !261}
!252 = !DILocalVariable(name: "program", arg: 1, scope: !247, file: !248, line: 630, type: !78)
!253 = !DILocalVariable(name: "node", scope: !247, file: !248, line: 642, type: !78)
!254 = !DILocalVariable(name: "map_prog", scope: !247, file: !248, line: 643, type: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !247, file: !248, line: 632, size: 128, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !257, file: !248, line: 632, baseType: !78, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !257, file: !248, line: 632, baseType: !78, size: 64, offset: 64)
!261 = !DILocalVariable(name: "lc_messages", scope: !247, file: !248, line: 655, type: !78)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 896, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 7)
!265 = !DIGlobalVariableExpression(var: !266)
!266 = distinct !DIGlobalVariable(name: "G_line", scope: !2, file: !267, line: 1, type: !268, isLocal: true, isDefinition: true)
!267 = !DIFile(filename: "src/dircolors.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 33384, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 4173)
!271 = !DIGlobalVariableExpression(var: !272)
!272 = distinct !DIGlobalVariable(name: "slack_codes", scope: !2, file: !3, line: 62, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 2432, elements: !275)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!275 = !{!276}
!276 = !DISubrange(count: 38)
!277 = !DIGlobalVariableExpression(var: !278)
!278 = distinct !DIGlobalVariable(name: "ls_codes", scope: !2, file: !3, line: 72, type: !273, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 2048, elements: !289)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !282, line: 50, size: 256, elements: !283)
!282 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!283 = !{!284, !285, !286, !288}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !281, file: !282, line: 52, baseType: !78, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !281, file: !282, line: 55, baseType: !22, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !281, file: !282, line: 56, baseType: !287, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !281, file: !282, line: 57, baseType: !22, size: 32, offset: 192)
!289 = !{!290}
!290 = !DISubrange(count: 8)
!291 = !DIGlobalVariableExpression(var: !292)
!292 = distinct !DIGlobalVariable(name: "Version", scope: !293, file: !294, line: 2, type: !78, isLocal: false, isDefinition: true)
!293 = distinct !DICompileUnit(language: DW_LANG_C99, file: !294, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, globals: !296)
!294 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!295 = !{}
!296 = !{!291}
!297 = !DIGlobalVariableExpression(var: !298)
!298 = distinct !DIGlobalVariable(name: "file_name", scope: !299, file: !304, line: 36, type: !78, isLocal: true, isDefinition: true)
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, globals: !301)
!300 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!301 = !{!297, !302}
!302 = !DIGlobalVariableExpression(var: !303)
!303 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !299, file: !304, line: 46, type: !14, isLocal: true, isDefinition: true)
!304 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!305 = !DIGlobalVariableExpression(var: !306)
!306 = distinct !DIGlobalVariable(name: "exit_failure", scope: !307, file: !310, line: 24, type: !311, isLocal: false, isDefinition: true)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, globals: !309)
!308 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!309 = !{!305}
!310 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!311 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !22)
!312 = !DIGlobalVariableExpression(var: !313)
!313 = distinct !DIGlobalVariable(name: "program_name", scope: !314, file: !318, line: 33, type: !78, isLocal: false, isDefinition: true)
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !316, globals: !317)
!315 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!316 = !{!65, !24}
!317 = !{!312}
!318 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!319 = !DIGlobalVariableExpression(var: !320)
!320 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !321, file: !333, line: 77, type: !366, isLocal: false, isDefinition: true)
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !323, retainedTypes: !329, globals: !330)
!322 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!323 = !{!212, !324, !226}
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !213, line: 242, size: 32, elements: !325)
!325 = !{!326, !327, !328}
!326 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!327 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!328 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!329 = !{!22, !52, !70, !24}
!330 = !{!319, !331, !338, !348, !350, !355, !362, !364}
!331 = !DIGlobalVariableExpression(var: !332)
!332 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !321, file: !333, line: 93, type: !334, isLocal: false, isDefinition: true)
!333 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 320, elements: !336)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!336 = !{!337}
!337 = !DISubrange(count: 10)
!338 = !DIGlobalVariableExpression(var: !339)
!339 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !321, file: !333, line: 1043, type: !340, isLocal: false, isDefinition: true)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !333, line: 57, size: 448, elements: !341)
!341 = !{!342, !343, !344, !346, !347}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !340, file: !333, line: 60, baseType: !212, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !340, file: !333, line: 63, baseType: !22, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !340, file: !333, line: 67, baseType: !345, size: 256, offset: 64)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 256, elements: !289)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !340, file: !333, line: 70, baseType: !78, size: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !340, file: !333, line: 73, baseType: !78, size: 64, offset: 384)
!348 = !DIGlobalVariableExpression(var: !349)
!349 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !321, file: !333, line: 108, type: !340, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351)
!351 = distinct !DIGlobalVariable(name: "slot0", scope: !321, file: !333, line: 834, type: !352, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 2048, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 256)
!355 = !DIGlobalVariableExpression(var: !356)
!356 = distinct !DIGlobalVariable(name: "slotvec", scope: !321, file: !333, line: 837, type: !357, isLocal: true, isDefinition: true)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !333, line: 826, size: 128, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !358, file: !333, line: 828, baseType: !70, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !358, file: !333, line: 829, baseType: !24, size: 64, offset: 64)
!362 = !DIGlobalVariableExpression(var: !363)
!363 = distinct !DIGlobalVariable(name: "nslots", scope: !321, file: !333, line: 835, type: !22, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365)
!365 = distinct !DIGlobalVariable(name: "slotvec0", scope: !321, file: !333, line: 836, type: !358, isLocal: true, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 704, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 11)
!369 = !DIGlobalVariableExpression(var: !370)
!370 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !371, file: !374, line: 26, type: !375, isLocal: false, isDefinition: true)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, globals: !373)
!372 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!373 = !{!369}
!374 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 376, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 47)
!378 = !DIGlobalVariableExpression(var: !379)
!379 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !380, file: !384, line: 351, type: !385, isLocal: false, isDefinition: true)
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !382, globals: !383)
!381 = !DIFile(filename: "./lib/obstack.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!382 = !{!24, !65}
!383 = !{!378}
!384 = !DIFile(filename: "lib/obstack.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null}
!388 = !DIGlobalVariableExpression(var: !389)
!389 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !390, file: !735, line: 120, type: !736, isLocal: true, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !392, retainedTypes: !731, globals: !734)
!391 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!392 = !{!393}
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !394, line: 41, size: 32, elements: !395)
!394 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730}
!396 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!397 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!398 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!399 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!400 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!401 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!402 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!403 = !DIEnumerator(name: "DAY_1", value: 131079)
!404 = !DIEnumerator(name: "DAY_2", value: 131080)
!405 = !DIEnumerator(name: "DAY_3", value: 131081)
!406 = !DIEnumerator(name: "DAY_4", value: 131082)
!407 = !DIEnumerator(name: "DAY_5", value: 131083)
!408 = !DIEnumerator(name: "DAY_6", value: 131084)
!409 = !DIEnumerator(name: "DAY_7", value: 131085)
!410 = !DIEnumerator(name: "ABMON_1", value: 131086)
!411 = !DIEnumerator(name: "ABMON_2", value: 131087)
!412 = !DIEnumerator(name: "ABMON_3", value: 131088)
!413 = !DIEnumerator(name: "ABMON_4", value: 131089)
!414 = !DIEnumerator(name: "ABMON_5", value: 131090)
!415 = !DIEnumerator(name: "ABMON_6", value: 131091)
!416 = !DIEnumerator(name: "ABMON_7", value: 131092)
!417 = !DIEnumerator(name: "ABMON_8", value: 131093)
!418 = !DIEnumerator(name: "ABMON_9", value: 131094)
!419 = !DIEnumerator(name: "ABMON_10", value: 131095)
!420 = !DIEnumerator(name: "ABMON_11", value: 131096)
!421 = !DIEnumerator(name: "ABMON_12", value: 131097)
!422 = !DIEnumerator(name: "MON_1", value: 131098)
!423 = !DIEnumerator(name: "MON_2", value: 131099)
!424 = !DIEnumerator(name: "MON_3", value: 131100)
!425 = !DIEnumerator(name: "MON_4", value: 131101)
!426 = !DIEnumerator(name: "MON_5", value: 131102)
!427 = !DIEnumerator(name: "MON_6", value: 131103)
!428 = !DIEnumerator(name: "MON_7", value: 131104)
!429 = !DIEnumerator(name: "MON_8", value: 131105)
!430 = !DIEnumerator(name: "MON_9", value: 131106)
!431 = !DIEnumerator(name: "MON_10", value: 131107)
!432 = !DIEnumerator(name: "MON_11", value: 131108)
!433 = !DIEnumerator(name: "MON_12", value: 131109)
!434 = !DIEnumerator(name: "AM_STR", value: 131110)
!435 = !DIEnumerator(name: "PM_STR", value: 131111)
!436 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!437 = !DIEnumerator(name: "D_FMT", value: 131113)
!438 = !DIEnumerator(name: "T_FMT", value: 131114)
!439 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!440 = !DIEnumerator(name: "ERA", value: 131116)
!441 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!442 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!443 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!444 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!445 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!446 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!447 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!448 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!449 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!450 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!451 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!452 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!453 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!454 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!455 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!456 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!457 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!458 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!459 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!460 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!461 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!462 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!463 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!464 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!465 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!466 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!467 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!468 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!469 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!470 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!471 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!472 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!473 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!474 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!475 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!476 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!477 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!478 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!479 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!480 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!481 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!482 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!483 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!484 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!485 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!486 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!487 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!488 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!489 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!490 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!491 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!492 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!493 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!494 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!495 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!496 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!497 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!498 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!499 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!500 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!501 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!502 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!503 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!504 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!505 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!506 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!507 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!508 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!509 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!510 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!511 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!512 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!513 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!514 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!515 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!516 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!517 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!518 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!519 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!520 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!521 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!522 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!523 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!524 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!525 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!526 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!527 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!528 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!529 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!530 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!531 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!532 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!533 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!534 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!535 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!536 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!537 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!538 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!539 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!540 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!541 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!542 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!543 = !DIEnumerator(name: "CODESET", value: 14)
!544 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!545 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!546 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!547 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!548 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!549 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!550 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!551 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!552 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!553 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!554 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!555 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!556 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!557 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!558 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!559 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!560 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!561 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!562 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!563 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!564 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!565 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!566 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!567 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!568 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!569 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!570 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!571 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!572 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!573 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!574 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!575 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!576 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!577 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!578 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!579 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!580 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!581 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!582 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!583 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!584 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!585 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!586 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!587 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!588 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!589 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!590 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!591 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!592 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!593 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!594 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!595 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!596 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!597 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!598 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!599 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!600 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!601 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!602 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!603 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!604 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!605 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!606 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!607 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!608 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!609 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!610 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!611 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!612 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!613 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!614 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!615 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!616 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!617 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!618 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!619 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!620 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!621 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!622 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!623 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!624 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!625 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!626 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!627 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!628 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!629 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!630 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!631 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!632 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!633 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!634 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!635 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!636 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!637 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!638 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!639 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!640 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!641 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!642 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!643 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!644 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!645 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!646 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!647 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!648 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!649 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!650 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!651 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!652 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!653 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!654 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!655 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!656 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!657 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!658 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!659 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!660 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!661 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!662 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!663 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!664 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!665 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!666 = !DIEnumerator(name: "THOUSEP", value: 65537)
!667 = !DIEnumerator(name: "__GROUPING", value: 65538)
!668 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!669 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!670 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!671 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!672 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!673 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!674 = !DIEnumerator(name: "__YESSTR", value: 327682)
!675 = !DIEnumerator(name: "__NOSTR", value: 327683)
!676 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!677 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!678 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!679 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!680 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!681 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!682 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!683 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!684 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!685 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!686 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!687 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!688 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!689 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!690 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!691 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!692 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!693 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!694 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!695 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!696 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!697 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!698 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!699 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!700 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!701 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!702 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!703 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!704 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!705 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!706 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!707 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!708 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!709 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!710 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!711 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!712 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!713 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!714 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!715 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!716 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!717 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!718 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!719 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!720 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!721 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!722 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!723 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!724 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!725 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!726 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!727 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!728 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!729 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!730 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!731 = !{!65, !24, !732}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!734 = !{!388}
!735 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!736 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !78)
!737 = distinct !DICompileUnit(language: DW_LANG_C99, file: !738, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !739)
!738 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!739 = !{!740}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!742 = distinct !DICompileUnit(language: DW_LANG_C99, file: !743, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !744)
!743 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!744 = !{!24}
!745 = distinct !DICompileUnit(language: DW_LANG_C99, file: !746, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295)
!746 = !DIFile(filename: "./lib/freopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!747 = distinct !DICompileUnit(language: DW_LANG_C99, file: !748, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !749, retainedTypes: !754)
!748 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!749 = !{!750}
!750 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !751, line: 41, size: 32, elements: !752)
!751 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!752 = !{!753}
!753 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!754 = !{!65}
!755 = distinct !DICompileUnit(language: DW_LANG_C99, file: !756, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !757, retainedTypes: !771)
!756 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!757 = !{!758}
!758 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !760, file: !759, line: 192, size: 32, elements: !769)
!759 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!760 = distinct !DISubprogram(name: "x2nrealloc", scope: !759, file: !759, line: 180, type: !761, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !755, variables: !764)
!761 = !DISubroutineType(types: !762)
!762 = !{!65, !65, !763, !70}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!764 = !{!765, !766, !767, !768}
!765 = !DILocalVariable(name: "p", arg: 1, scope: !760, file: !759, line: 180, type: !65)
!766 = !DILocalVariable(name: "pn", arg: 2, scope: !760, file: !759, line: 180, type: !763)
!767 = !DILocalVariable(name: "s", arg: 3, scope: !760, file: !759, line: 180, type: !70)
!768 = !DILocalVariable(name: "n", scope: !760, file: !759, line: 182, type: !70)
!769 = !{!770}
!770 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!771 = !{!70, !24, !65}
!772 = distinct !DICompileUnit(language: DW_LANG_C99, file: !773, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295)
!773 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!774 = distinct !DICompileUnit(language: DW_LANG_C99, file: !775, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295)
!775 = !DIFile(filename: "./lib/xstrndup.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!776 = distinct !DICompileUnit(language: DW_LANG_C99, file: !777, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !754)
!777 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!778 = distinct !DICompileUnit(language: DW_LANG_C99, file: !779, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295)
!779 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!780 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !754)
!781 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!782 = distinct !DICompileUnit(language: DW_LANG_C99, file: !783, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !754)
!783 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!784 = distinct !DICompileUnit(language: DW_LANG_C99, file: !785, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !786)
!785 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!786 = !{!70}
!787 = distinct !DICompileUnit(language: DW_LANG_C99, file: !788, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295)
!788 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!789 = distinct !DICompileUnit(language: DW_LANG_C99, file: !790, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295)
!790 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!791 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!792 = !{i32 2, !"Dwarf Version", i32 4}
!793 = !{i32 2, !"Debug Info Version", i32 3}
!794 = !{i32 1, !"wchar_size", i32 4}
!795 = !{i32 7, !"PIC Level", i32 2}
!796 = !{i32 7, !"PIE Level", i32 2}
!797 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 93, type: !798, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !800)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !22}
!800 = !{!801}
!801 = !DILocalVariable(name: "status", arg: 1, scope: !797, file: !3, line: 93, type: !22)
!802 = !DIExpression()
!803 = !DILocation(line: 93, column: 12, scope: !797)
!804 = !DILocation(line: 95, column: 14, scope: !805)
!805 = distinct !DILexicalBlock(scope: !797, file: !3, line: 95, column: 7)
!806 = !DILocation(line: 95, column: 7, scope: !797)
!807 = !DILocation(line: 96, column: 5, scope: !808)
!808 = distinct !DILexicalBlock(scope: !805, file: !3, line: 96, column: 5)
!809 = !{!810, !810, i64 0}
!810 = !{!"any pointer", !811, i64 0}
!811 = !{!"omnipotent char", !812, i64 0}
!812 = !{!"Simple C/C++ TBAA"}
!813 = !DILocation(line: 99, column: 7, scope: !814)
!814 = distinct !DILexicalBlock(scope: !805, file: !3, line: 98, column: 5)
!815 = !DILocation(line: 100, column: 7, scope: !814)
!816 = !DILocation(line: 108, column: 7, scope: !814)
!817 = !DILocation(line: 109, column: 7, scope: !814)
!818 = !DILocation(line: 110, column: 7, scope: !814)
!819 = !DILocation(line: 642, column: 15, scope: !247, inlinedAt: !820)
!820 = distinct !DILocation(line: 116, column: 7, scope: !814)
!821 = !DILocation(line: 651, column: 3, scope: !247, inlinedAt: !820)
!822 = !DILocation(line: 655, column: 29, scope: !247, inlinedAt: !820)
!823 = !DILocation(line: 655, column: 15, scope: !247, inlinedAt: !820)
!824 = !DILocation(line: 656, column: 7, scope: !825, inlinedAt: !820)
!825 = distinct !DILexicalBlock(scope: !247, file: !248, line: 656, column: 7)
!826 = !DILocation(line: 656, column: 19, scope: !825, inlinedAt: !820)
!827 = !DILocation(line: 656, column: 22, scope: !825, inlinedAt: !820)
!828 = !DILocation(line: 656, column: 7, scope: !247, inlinedAt: !820)
!829 = !DILocation(line: 662, column: 7, scope: !830, inlinedAt: !820)
!830 = distinct !DILexicalBlock(scope: !825, file: !248, line: 657, column: 5)
!831 = !DILocation(line: 664, column: 5, scope: !830, inlinedAt: !820)
!832 = !DILocation(line: 665, column: 3, scope: !247, inlinedAt: !820)
!833 = !DILocation(line: 667, column: 3, scope: !247, inlinedAt: !820)
!834 = !DILocation(line: 119, column: 3, scope: !797)
!835 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 396, type: !836, isLocal: false, isDefinition: true, scopeLine: 397, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !839)
!836 = !DISubroutineType(types: !837)
!837 = !{!22, !22, !838}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!839 = !{!840, !841, !842, !843, !844, !845, !846, !849, !853, !855, !856, !858, !859, !860}
!840 = !DILocalVariable(name: "argc", arg: 1, scope: !835, file: !3, line: 396, type: !22)
!841 = !DILocalVariable(name: "argv", arg: 2, scope: !835, file: !3, line: 396, type: !838)
!842 = !DILocalVariable(name: "ok", scope: !835, file: !3, line: 398, type: !14)
!843 = !DILocalVariable(name: "optc", scope: !835, file: !3, line: 399, type: !22)
!844 = !DILocalVariable(name: "syntax", scope: !835, file: !3, line: 400, type: !5)
!845 = !DILocalVariable(name: "print_database", scope: !835, file: !3, line: 401, type: !14)
!846 = !DILocalVariable(name: "p", scope: !847, file: !3, line: 459, type: !78)
!847 = distinct !DILexicalBlock(scope: !848, file: !3, line: 458, column: 5)
!848 = distinct !DILexicalBlock(scope: !835, file: !3, line: 457, column: 7)
!849 = !DILocalVariable(name: "len", scope: !850, file: !3, line: 487, type: !70)
!850 = distinct !DILexicalBlock(scope: !851, file: !3, line: 486, column: 9)
!851 = distinct !DILexicalBlock(scope: !852, file: !3, line: 485, column: 11)
!852 = distinct !DILexicalBlock(scope: !848, file: !3, line: 467, column: 5)
!853 = !DILocalVariable(name: "__o", scope: !854, file: !3, line: 487, type: !157)
!854 = distinct !DILexicalBlock(scope: !850, file: !3, line: 487, column: 24)
!855 = !DILocalVariable(name: "s", scope: !850, file: !3, line: 488, type: !24)
!856 = !DILocalVariable(name: "__o1", scope: !857, file: !3, line: 488, type: !103)
!857 = distinct !DILexicalBlock(scope: !850, file: !3, line: 488, column: 21)
!858 = !DILocalVariable(name: "__value", scope: !857, file: !3, line: 488, type: !65)
!859 = !DILocalVariable(name: "prefix", scope: !850, file: !3, line: 489, type: !78)
!860 = !DILocalVariable(name: "suffix", scope: !850, file: !3, line: 490, type: !78)
!861 = !DILocation(line: 396, column: 11, scope: !835)
!862 = !DILocation(line: 396, column: 24, scope: !835)
!863 = !DILocation(line: 398, column: 8, scope: !835)
!864 = !DILocation(line: 400, column: 21, scope: !835)
!865 = !DILocation(line: 401, column: 8, scope: !835)
!866 = !DILocation(line: 404, column: 21, scope: !835)
!867 = !DILocation(line: 404, column: 3, scope: !835)
!868 = !DILocation(line: 405, column: 3, scope: !835)
!869 = !DILocation(line: 406, column: 3, scope: !835)
!870 = !DILocation(line: 407, column: 3, scope: !835)
!871 = !DILocation(line: 409, column: 3, scope: !835)
!872 = !DILocation(line: 411, column: 3, scope: !835)
!873 = !DILocation(line: 411, column: 18, scope: !835)
!874 = !DILocation(line: 399, column: 7, scope: !835)
!875 = distinct !{!875, !872, !876}
!876 = !DILocation(line: 432, column: 7, scope: !835)
!877 = !DILocation(line: 420, column: 9, scope: !878)
!878 = distinct !DILexicalBlock(scope: !835, file: !3, line: 413, column: 7)
!879 = !DILocation(line: 424, column: 9, scope: !878)
!880 = !DILocation(line: 426, column: 7, scope: !878)
!881 = !DILocation(line: 428, column: 7, scope: !878)
!882 = !DILocation(line: 431, column: 9, scope: !878)
!883 = !DILocation(line: 434, column: 11, scope: !835)
!884 = !{!885, !885, i64 0}
!885 = !{!"int", !811, i64 0}
!886 = !DILocation(line: 434, column: 8, scope: !835)
!887 = !DILocation(line: 435, column: 8, scope: !835)
!888 = !DILocation(line: 439, column: 7, scope: !889)
!889 = distinct !DILexicalBlock(scope: !835, file: !3, line: 439, column: 7)
!890 = !DILocation(line: 439, column: 32, scope: !889)
!891 = !DILocation(line: 439, column: 22, scope: !889)
!892 = !DILocation(line: 442, column: 14, scope: !893)
!893 = distinct !DILexicalBlock(scope: !889, file: !3, line: 440, column: 5)
!894 = !DILocation(line: 441, column: 7, scope: !893)
!895 = !DILocation(line: 444, column: 7, scope: !893)
!896 = !DILocation(line: 447, column: 8, scope: !897)
!897 = distinct !DILexicalBlock(scope: !835, file: !3, line: 447, column: 7)
!898 = !DILocation(line: 447, column: 25, scope: !897)
!899 = !DILocation(line: 447, column: 7, scope: !835)
!900 = !DILocation(line: 449, column: 20, scope: !901)
!901 = distinct !DILexicalBlock(scope: !897, file: !3, line: 448, column: 5)
!902 = !DILocation(line: 449, column: 50, scope: !901)
!903 = !DILocation(line: 449, column: 43, scope: !901)
!904 = !DILocation(line: 449, column: 7, scope: !901)
!905 = !DILocation(line: 450, column: 11, scope: !901)
!906 = !DILocation(line: 451, column: 9, scope: !907)
!907 = distinct !DILexicalBlock(scope: !901, file: !3, line: 450, column: 11)
!908 = !DILocation(line: 454, column: 7, scope: !901)
!909 = !DILocation(line: 457, column: 7, scope: !835)
!910 = !DILocation(line: 462, column: 11, scope: !911)
!911 = distinct !DILexicalBlock(scope: !847, file: !3, line: 461, column: 9)
!912 = !DILocation(line: 459, column: 19, scope: !847)
!913 = !DILocation(line: 463, column: 16, scope: !911)
!914 = !DILocation(line: 463, column: 27, scope: !911)
!915 = !DILocation(line: 463, column: 13, scope: !911)
!916 = !DILocation(line: 460, column: 16, scope: !847)
!917 = !DILocation(line: 460, column: 25, scope: !847)
!918 = !DILocation(line: 460, column: 7, scope: !847)
!919 = distinct !{!919, !918, !920}
!920 = !DILocation(line: 464, column: 9, scope: !847)
!921 = !DILocation(line: 469, column: 18, scope: !922)
!922 = distinct !DILexicalBlock(scope: !852, file: !3, line: 469, column: 11)
!923 = !DILocation(line: 469, column: 11, scope: !852)
!924 = !DILocation(line: 130, column: 11, scope: !925, inlinedAt: !930)
!925 = distinct !DISubprogram(name: "guess_shell_syntax", scope: !3, file: !3, line: 126, type: !926, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !928)
!926 = !DISubroutineType(types: !927)
!927 = !{!5}
!928 = !{!929}
!929 = !DILocalVariable(name: "shell", scope: !925, file: !3, line: 128, type: !24)
!930 = distinct !DILocation(line: 471, column: 20, scope: !931)
!931 = distinct !DILexicalBlock(scope: !922, file: !3, line: 470, column: 9)
!932 = !DILocation(line: 128, column: 9, scope: !925, inlinedAt: !930)
!933 = !DILocation(line: 131, column: 13, scope: !934, inlinedAt: !930)
!934 = distinct !DILexicalBlock(scope: !925, file: !3, line: 131, column: 7)
!935 = !DILocation(line: 131, column: 21, scope: !934, inlinedAt: !930)
!936 = !DILocation(line: 131, column: 24, scope: !934, inlinedAt: !930)
!937 = !{!811, !811, i64 0}
!938 = !DILocation(line: 131, column: 31, scope: !934, inlinedAt: !930)
!939 = !DILocation(line: 131, column: 7, scope: !925, inlinedAt: !930)
!940 = !DILocation(line: 134, column: 11, scope: !925, inlinedAt: !930)
!941 = !DILocation(line: 136, column: 7, scope: !942, inlinedAt: !930)
!942 = distinct !DILexicalBlock(scope: !925, file: !3, line: 136, column: 7)
!943 = !DILocation(line: 136, column: 28, scope: !942, inlinedAt: !930)
!944 = !DILocation(line: 136, column: 31, scope: !942, inlinedAt: !930)
!945 = !DILocation(line: 136, column: 7, scope: !925, inlinedAt: !930)
!946 = !DILocation(line: 474, column: 15, scope: !947)
!947 = distinct !DILexicalBlock(scope: !948, file: !3, line: 473, column: 13)
!948 = distinct !DILexicalBlock(scope: !931, file: !3, line: 472, column: 15)
!949 = !DILocation(line: 479, column: 7, scope: !852)
!950 = !DILocation(line: 480, column: 16, scope: !951)
!951 = distinct !DILexicalBlock(scope: !852, file: !3, line: 480, column: 11)
!952 = !DILocation(line: 480, column: 11, scope: !852)
!953 = !DILocation(line: 481, column: 14, scope: !951)
!954 = !DILocation(line: 485, column: 11, scope: !852)
!955 = !DILocation(line: 483, column: 29, scope: !951)
!956 = !DILocalVariable(name: "filename", arg: 1, scope: !957, file: !3, line: 374, type: !78)
!957 = distinct !DISubprogram(name: "dc_parse_file", scope: !3, file: !3, line: 374, type: !958, isLocal: true, isDefinition: true, scopeLine: 375, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !960)
!958 = !DISubroutineType(types: !959)
!959 = !{!14, !78}
!960 = !{!956, !961}
!961 = !DILocalVariable(name: "ok", scope: !957, file: !3, line: 376, type: !14)
!962 = !DILocation(line: 374, column: 28, scope: !957, inlinedAt: !963)
!963 = distinct !DILocation(line: 483, column: 14, scope: !951)
!964 = !DILocation(line: 378, column: 9, scope: !965, inlinedAt: !963)
!965 = distinct !DILexicalBlock(scope: !957, file: !3, line: 378, column: 7)
!966 = !DILocation(line: 378, column: 31, scope: !965, inlinedAt: !963)
!967 = !DILocation(line: 378, column: 58, scope: !965, inlinedAt: !963)
!968 = !DILocation(line: 378, column: 34, scope: !965, inlinedAt: !963)
!969 = !DILocation(line: 378, column: 65, scope: !965, inlinedAt: !963)
!970 = !DILocation(line: 378, column: 7, scope: !957, inlinedAt: !963)
!971 = !DILocation(line: 380, column: 17, scope: !972, inlinedAt: !963)
!972 = distinct !DILexicalBlock(scope: !965, file: !3, line: 379, column: 5)
!973 = !DILocation(line: 380, column: 30, scope: !972, inlinedAt: !963)
!974 = !DILocation(line: 380, column: 7, scope: !972, inlinedAt: !963)
!975 = !DILocation(line: 381, column: 7, scope: !972, inlinedAt: !963)
!976 = !DILocation(line: 384, column: 25, scope: !957, inlinedAt: !963)
!977 = !DILocation(line: 384, column: 8, scope: !957, inlinedAt: !963)
!978 = !DILocation(line: 386, column: 15, scope: !979, inlinedAt: !963)
!979 = distinct !DILexicalBlock(scope: !957, file: !3, line: 386, column: 7)
!980 = !DILocation(line: 386, column: 7, scope: !979, inlinedAt: !963)
!981 = !DILocation(line: 386, column: 22, scope: !979, inlinedAt: !963)
!982 = !DILocation(line: 386, column: 7, scope: !957, inlinedAt: !963)
!983 = !DILocation(line: 388, column: 17, scope: !984, inlinedAt: !963)
!984 = distinct !DILexicalBlock(scope: !979, file: !3, line: 387, column: 5)
!985 = !DILocation(line: 388, column: 30, scope: !984, inlinedAt: !963)
!986 = !DILocation(line: 388, column: 7, scope: !984, inlinedAt: !963)
!987 = !DILocation(line: 389, column: 7, scope: !984, inlinedAt: !963)
!988 = !DILocation(line: 487, column: 24, scope: !854)
!989 = !{!990, !810, i64 24}
!990 = !{!"obstack", !991, i64 0, !810, i64 8, !810, i64 16, !810, i64 24, !810, i64 32, !811, i64 40, !991, i64 48, !811, i64 56, !811, i64 64, !810, i64 72, !885, i64 80, !885, i64 80, !885, i64 80}
!991 = !{!"long", !811, i64 0}
!992 = !{!990, !810, i64 16}
!993 = !DILocation(line: 487, column: 18, scope: !850)
!994 = !DILocation(line: 488, column: 21, scope: !857)
!995 = !DILocation(line: 488, column: 21, scope: !996)
!996 = distinct !DILexicalBlock(scope: !857, file: !3, line: 488, column: 21)
!997 = !{!990, !991, i64 48}
!998 = !DILocation(line: 488, column: 21, scope: !999)
!999 = distinct !DILexicalBlock(scope: !857, file: !3, line: 488, column: 21)
!1000 = !{!990, !810, i64 8}
!1001 = !{!990, !810, i64 32}
!1002 = !DILocation(line: 488, column: 17, scope: !850)
!1003 = !DILocation(line: 492, column: 22, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !850, file: !3, line: 492, column: 15)
!1005 = !DILocation(line: 492, column: 15, scope: !850)
!1006 = !DILocation(line: 490, column: 23, scope: !850)
!1007 = !DILocation(line: 489, column: 23, scope: !850)
!1008 = !DILocation(line: 502, column: 11, scope: !850)
!1009 = !DILocation(line: 503, column: 11, scope: !850)
!1010 = !DILocation(line: 504, column: 11, scope: !850)
!1011 = !DILocation(line: 505, column: 9, scope: !850)
!1012 = !DILocation(line: 509, column: 1, scope: !835)
!1013 = !DILocation(line: 239, column: 24, scope: !11)
!1014 = !DILocation(line: 239, column: 40, scope: !11)
!1015 = !DILocation(line: 241, column: 10, scope: !11)
!1016 = !DILocation(line: 243, column: 3, scope: !11)
!1017 = !DILocation(line: 243, column: 9, scope: !11)
!1018 = !DILocation(line: 244, column: 3, scope: !11)
!1019 = !DILocation(line: 244, column: 10, scope: !11)
!1020 = !{!991, !991, i64 0}
!1021 = !DILocation(line: 247, column: 8, scope: !11)
!1022 = !DILocation(line: 250, column: 58, scope: !11)
!1023 = !DILocation(line: 253, column: 10, scope: !11)
!1024 = !DILocation(line: 246, column: 15, scope: !11)
!1025 = !DILocation(line: 254, column: 12, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !11, file: !3, line: 254, column: 7)
!1027 = !DILocation(line: 254, column: 20, scope: !1026)
!1028 = !DILocation(line: 254, column: 23, scope: !1026)
!1029 = !DILocation(line: 254, column: 29, scope: !1026)
!1030 = !DILocation(line: 254, column: 7, scope: !11)
!1031 = !DILocation(line: 255, column: 5, scope: !1026)
!1032 = !DILocation(line: 257, column: 3, scope: !11)
!1033 = !DILocation(line: 262, column: 7, scope: !92)
!1034 = !DILocation(line: 242, column: 15, scope: !11)
!1035 = !DILocation(line: 264, column: 11, scope: !92)
!1036 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !1037, file: !1038, line: 115, type: !838)
!1037 = distinct !DISubprogram(name: "getline", scope: !1038, file: !1038, line: 115, type: !1039, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1042)
!1038 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!1041, !838, !763, !15}
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !49, line: 181, baseType: !50)
!1042 = !{!1036, !1043, !1044}
!1043 = !DILocalVariable(name: "__n", arg: 2, scope: !1037, file: !1038, line: 115, type: !763)
!1044 = !DILocalVariable(name: "__stream", arg: 3, scope: !1037, file: !1038, line: 115, type: !15)
!1045 = !DILocation(line: 115, column: 17, scope: !1037, inlinedAt: !1046)
!1046 = distinct !DILocation(line: 266, column: 15, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 266, column: 15)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 265, column: 9)
!1049 = distinct !DILexicalBlock(scope: !92, file: !3, line: 264, column: 11)
!1050 = !DILocation(line: 115, column: 36, scope: !1037, inlinedAt: !1046)
!1051 = !DILocation(line: 115, column: 47, scope: !1037, inlinedAt: !1046)
!1052 = !DILocation(line: 117, column: 10, scope: !1037, inlinedAt: !1046)
!1053 = !DILocation(line: 266, column: 59, scope: !1047)
!1054 = !DILocation(line: 266, column: 15, scope: !1048)
!1055 = !DILocation(line: 268, column: 15, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 267, column: 13)
!1057 = !DILocation(line: 269, column: 15, scope: !1056)
!1058 = !DILocation(line: 275, column: 27, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 275, column: 15)
!1060 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 274, column: 9)
!1061 = !DILocation(line: 275, column: 15, scope: !1060)
!1062 = !DILocation(line: 245, column: 15, scope: !11)
!1063 = !DILocation(line: 278, column: 26, scope: !1060)
!1064 = !DILocation(line: 278, column: 47, scope: !1060)
!1065 = !DILocation(line: 278, column: 23, scope: !1060)
!1066 = !DILocalVariable(name: "line", arg: 1, scope: !1067, file: !3, line: 143, type: !78)
!1067 = distinct !DISubprogram(name: "parse_line", scope: !3, file: !3, line: 143, type: !1068, isLocal: true, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1070)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !78, !838, !838}
!1070 = !{!1066, !1071, !1072, !1073, !1074, !1075}
!1071 = !DILocalVariable(name: "keyword", arg: 2, scope: !1067, file: !3, line: 143, type: !838)
!1072 = !DILocalVariable(name: "arg", arg: 3, scope: !1067, file: !3, line: 143, type: !838)
!1073 = !DILocalVariable(name: "p", scope: !1067, file: !3, line: 145, type: !78)
!1074 = !DILocalVariable(name: "keyword_start", scope: !1067, file: !3, line: 146, type: !78)
!1075 = !DILocalVariable(name: "arg_start", scope: !1067, file: !3, line: 147, type: !78)
!1076 = !DILocation(line: 143, column: 25, scope: !1067, inlinedAt: !1077)
!1077 = distinct !DILocation(line: 281, column: 7, scope: !92)
!1078 = !DILocation(line: 145, column: 15, scope: !1067, inlinedAt: !1077)
!1079 = !DILocation(line: 152, column: 18, scope: !1080, inlinedAt: !1077)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 152, column: 3)
!1081 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 152, column: 3)
!1082 = !DILocation(line: 152, column: 8, scope: !1081, inlinedAt: !1077)
!1083 = !{!1084, !1084, i64 0}
!1084 = !{!"short", !811, i64 0}
!1085 = !DILocation(line: 152, column: 3, scope: !1081, inlinedAt: !1077)
!1086 = !DILocation(line: 152, column: 43, scope: !1080, inlinedAt: !1077)
!1087 = distinct !{!1087, !1088, !1089}
!1088 = !DILocation(line: 152, column: 3, scope: !1081)
!1089 = !DILocation(line: 153, column: 5, scope: !1081)
!1090 = !DILocation(line: 156, column: 18, scope: !1091, inlinedAt: !1077)
!1091 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 156, column: 7)
!1092 = !DILocation(line: 163, column: 7, scope: !1093, inlinedAt: !1077)
!1093 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 162, column: 5)
!1094 = !DILocation(line: 161, column: 11, scope: !1067, inlinedAt: !1077)
!1095 = !DILocation(line: 161, column: 41, scope: !1067, inlinedAt: !1077)
!1096 = !DILocation(line: 161, column: 35, scope: !1067, inlinedAt: !1077)
!1097 = !DIExpression(DW_OP_plus_uconst, 1, DW_OP_stack_value)
!1098 = distinct !{!1098, !1099, !1100}
!1099 = !DILocation(line: 161, column: 3, scope: !1067)
!1100 = !DILocation(line: 164, column: 5, scope: !1067)
!1101 = !DILocation(line: 166, column: 41, scope: !1067, inlinedAt: !1077)
!1102 = !DILocation(line: 166, column: 14, scope: !1067, inlinedAt: !1077)
!1103 = !DILocation(line: 167, column: 7, scope: !1104, inlinedAt: !1077)
!1104 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 167, column: 7)
!1105 = !DILocation(line: 167, column: 11, scope: !1104, inlinedAt: !1077)
!1106 = !DILocation(line: 167, column: 7, scope: !1067, inlinedAt: !1077)
!1107 = !DILocation(line: 170, column: 3, scope: !1067, inlinedAt: !1077)
!1108 = distinct !{!1108, !1109, !1110}
!1109 = !DILocation(line: 170, column: 3, scope: !1067)
!1110 = !DILocation(line: 174, column: 33, scope: !1067)
!1111 = !DILocation(line: 172, column: 7, scope: !1112, inlinedAt: !1077)
!1112 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 171, column: 5)
!1113 = !DILocation(line: 174, column: 10, scope: !1067, inlinedAt: !1077)
!1114 = !DILocation(line: 173, column: 5, scope: !1112, inlinedAt: !1077)
!1115 = !DILocation(line: 176, column: 18, scope: !1116, inlinedAt: !1077)
!1116 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 176, column: 7)
!1117 = !DILocation(line: 181, column: 3, scope: !1067, inlinedAt: !1077)
!1118 = !DILocation(line: 181, column: 10, scope: !1067, inlinedAt: !1077)
!1119 = !DILocation(line: 182, column: 5, scope: !1067, inlinedAt: !1077)
!1120 = distinct !{!1120, !1121, !1122}
!1121 = !DILocation(line: 181, column: 3, scope: !1067)
!1122 = !DILocation(line: 182, column: 7, scope: !1067)
!1123 = !DILocation(line: 184, column: 13, scope: !1124, inlinedAt: !1077)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 184, column: 3)
!1125 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 184, column: 3)
!1126 = !DILocation(line: 184, column: 3, scope: !1125, inlinedAt: !1077)
!1127 = !DIExpression(DW_OP_constu, 1, DW_OP_minus, DW_OP_stack_value)
!1128 = distinct !{!1128, !1129, !1130}
!1129 = !DILocation(line: 184, column: 3, scope: !1125)
!1130 = !DILocation(line: 185, column: 5, scope: !1125)
!1131 = !DILocation(line: 188, column: 33, scope: !1067, inlinedAt: !1077)
!1132 = !DILocation(line: 188, column: 10, scope: !1067, inlinedAt: !1077)
!1133 = !DILocation(line: 189, column: 1, scope: !1067, inlinedAt: !1077)
!1134 = !DILocation(line: 259, column: 13, scope: !92)
!1135 = !DILocation(line: 283, column: 17, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !92, file: !3, line: 283, column: 11)
!1137 = !DILocation(line: 283, column: 11, scope: !92)
!1138 = distinct !{!1138, !1032, !1139}
!1139 = !DILocation(line: 368, column: 5, scope: !11)
!1140 = !DILocation(line: 259, column: 21, scope: !92)
!1141 = !DILocation(line: 286, column: 15, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !92, file: !3, line: 286, column: 11)
!1143 = !DILocation(line: 286, column: 11, scope: !92)
!1144 = !DILocation(line: 288, column: 24, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 287, column: 9)
!1146 = !DILocation(line: 289, column: 18, scope: !1145)
!1147 = !DILocation(line: 288, column: 11, scope: !1145)
!1148 = !DILocation(line: 291, column: 11, scope: !1145)
!1149 = !DILocation(line: 292, column: 11, scope: !1145)
!1150 = !DILocation(line: 260, column: 12, scope: !92)
!1151 = !DILocation(line: 296, column: 11, scope: !102)
!1152 = !DILocation(line: 296, column: 40, scope: !102)
!1153 = !DILocation(line: 296, column: 11, scope: !92)
!1154 = !DILocation(line: 298, column: 15, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 298, column: 15)
!1156 = distinct !DILexicalBlock(scope: !102, file: !3, line: 297, column: 9)
!1157 = !DILocation(line: 298, column: 38, scope: !1155)
!1158 = !DILocation(line: 298, column: 15, scope: !1156)
!1159 = !DILocation(line: 300, column: 26, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1155, file: !3, line: 300, column: 20)
!1161 = !DILocation(line: 300, column: 20, scope: !1155)
!1162 = !DILocation(line: 305, column: 21, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !101, file: !3, line: 305, column: 15)
!1164 = !DILocation(line: 305, column: 15, scope: !101)
!1165 = !DILocation(line: 308, column: 21, scope: !100)
!1166 = !DILocation(line: 308, column: 15, scope: !101)
!1167 = !DILocation(line: 310, column: 19, scope: !98)
!1168 = !DILocation(line: 310, column: 19, scope: !99)
!1169 = !DILocation(line: 312, column: 19, scope: !96)
!1170 = !DILocation(line: 312, column: 19, scope: !155)
!1171 = !DILocation(line: 312, column: 19, scope: !156)
!1172 = !DILocation(line: 313, column: 19, scope: !97)
!1173 = !DILocation(line: 314, column: 19, scope: !160)
!1174 = !DILocation(line: 314, column: 19, scope: !162)
!1175 = !DILocation(line: 314, column: 19, scope: !163)
!1176 = !DILocation(line: 315, column: 19, scope: !97)
!1177 = !DILocation(line: 316, column: 19, scope: !165)
!1178 = !DILocation(line: 316, column: 19, scope: !167)
!1179 = !DILocation(line: 316, column: 19, scope: !168)
!1180 = !DILocation(line: 317, column: 17, scope: !97)
!1181 = !DILocation(line: 320, column: 19, scope: !171)
!1182 = !DILocation(line: 321, column: 19, scope: !170)
!1183 = !DILocation(line: 321, column: 19, scope: !174)
!1184 = !DILocation(line: 321, column: 19, scope: !175)
!1185 = !DILocation(line: 322, column: 19, scope: !171)
!1186 = !DILocation(line: 323, column: 19, scope: !177)
!1187 = !DILocation(line: 323, column: 19, scope: !179)
!1188 = !DILocation(line: 323, column: 19, scope: !180)
!1189 = !DILocation(line: 324, column: 17, scope: !171)
!1190 = !DILocation(line: 325, column: 24, scope: !183)
!1191 = !DILocation(line: 325, column: 56, scope: !183)
!1192 = !DILocation(line: 326, column: 24, scope: !183)
!1193 = !DILocation(line: 326, column: 27, scope: !183)
!1194 = !DILocation(line: 326, column: 57, scope: !183)
!1195 = !DILocation(line: 327, column: 24, scope: !183)
!1196 = !DILocation(line: 327, column: 27, scope: !183)
!1197 = !DILocation(line: 327, column: 60, scope: !183)
!1198 = !DILocation(line: 325, column: 24, scope: !172)
!1199 = !DILocation(line: 335, column: 31, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1201, file: !3, line: 335, column: 19)
!1201 = distinct !DILexicalBlock(scope: !182, file: !3, line: 335, column: 19)
!1202 = !DILocation(line: 335, column: 19, scope: !1201)
!1203 = distinct !{!1203, !1202, !1204}
!1204 = !DILocation(line: 337, column: 23, scope: !1201)
!1205 = !DILocation(line: 333, column: 23, scope: !182)
!1206 = !DILocation(line: 336, column: 25, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1200, file: !3, line: 336, column: 25)
!1208 = !DILocation(line: 336, column: 62, scope: !1207)
!1209 = !DILocation(line: 335, column: 55, scope: !1200)
!1210 = !DILocation(line: 336, column: 25, scope: !1200)
!1211 = !DILocation(line: 341, column: 23, scope: !185)
!1212 = !DILocation(line: 341, column: 23, scope: !190)
!1213 = !DILocation(line: 341, column: 23, scope: !191)
!1214 = !DILocation(line: 341, column: 23, scope: !193)
!1215 = !DILocation(line: 341, column: 23, scope: !195)
!1216 = !DILocation(line: 341, column: 23, scope: !196)
!1217 = !DILocation(line: 342, column: 23, scope: !198)
!1218 = !DILocation(line: 342, column: 23, scope: !200)
!1219 = !DILocation(line: 342, column: 23, scope: !201)
!1220 = !DILocation(line: 343, column: 23, scope: !187)
!1221 = !DILocation(line: 344, column: 23, scope: !203)
!1222 = !DILocation(line: 344, column: 23, scope: !205)
!1223 = !DILocation(line: 344, column: 23, scope: !206)
!1224 = !DILocation(line: 345, column: 21, scope: !187)
!1225 = !DILocation(line: 358, column: 49, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !92, file: !3, line: 358, column: 11)
!1227 = !DILocation(line: 358, column: 24, scope: !1226)
!1228 = !DILocation(line: 360, column: 24, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1226, file: !3, line: 359, column: 9)
!1230 = !DILocation(line: 361, column: 19, scope: !1229)
!1231 = !DILocation(line: 361, column: 30, scope: !1229)
!1232 = !DILocation(line: 361, column: 50, scope: !1229)
!1233 = !DILocation(line: 360, column: 11, scope: !1229)
!1234 = !DILocation(line: 364, column: 9, scope: !1229)
!1235 = !DILocation(line: 366, column: 7, scope: !92)
!1236 = !DILocation(line: 367, column: 7, scope: !92)
!1237 = !DILocation(line: 370, column: 10, scope: !11)
!1238 = !DILocation(line: 371, column: 1, scope: !11)
!1239 = !DILocation(line: 370, column: 3, scope: !11)
!1240 = distinct !DISubprogram(name: "append_quoted", scope: !3, file: !3, line: 195, type: !249, isLocal: true, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1241)
!1241 = !{!1242, !1243, !1244, !1248, !1251, !1253, !1256, !1258, !1261, !1264, !1267, !1269}
!1242 = !DILocalVariable(name: "str", arg: 1, scope: !1240, file: !3, line: 195, type: !78)
!1243 = !DILocalVariable(name: "need_backslash", scope: !1240, file: !3, line: 197, type: !14)
!1244 = !DILocalVariable(name: "__o", scope: !1245, file: !3, line: 204, type: !103)
!1245 = distinct !DILexicalBlock(scope: !1246, file: !3, line: 204, column: 11)
!1246 = distinct !DILexicalBlock(scope: !1247, file: !3, line: 202, column: 9)
!1247 = distinct !DILexicalBlock(scope: !1240, file: !3, line: 200, column: 5)
!1248 = !DILocalVariable(name: "__o1", scope: !1249, file: !3, line: 204, type: !157)
!1249 = distinct !DILexicalBlock(scope: !1250, file: !3, line: 204, column: 11)
!1250 = distinct !DILexicalBlock(scope: !1245, file: !3, line: 204, column: 11)
!1251 = !DILocalVariable(name: "__o", scope: !1252, file: !3, line: 205, type: !103)
!1252 = distinct !DILexicalBlock(scope: !1246, file: !3, line: 205, column: 11)
!1253 = !DILocalVariable(name: "__o1", scope: !1254, file: !3, line: 205, type: !157)
!1254 = distinct !DILexicalBlock(scope: !1255, file: !3, line: 205, column: 11)
!1255 = distinct !DILexicalBlock(scope: !1252, file: !3, line: 205, column: 11)
!1256 = !DILocalVariable(name: "__o", scope: !1257, file: !3, line: 206, type: !103)
!1257 = distinct !DILexicalBlock(scope: !1246, file: !3, line: 206, column: 11)
!1258 = !DILocalVariable(name: "__o1", scope: !1259, file: !3, line: 206, type: !157)
!1259 = distinct !DILexicalBlock(scope: !1260, file: !3, line: 206, column: 11)
!1260 = distinct !DILexicalBlock(scope: !1257, file: !3, line: 206, column: 11)
!1261 = !DILocalVariable(name: "__o", scope: !1262, file: !3, line: 218, type: !103)
!1262 = distinct !DILexicalBlock(scope: !1263, file: !3, line: 218, column: 13)
!1263 = distinct !DILexicalBlock(scope: !1246, file: !3, line: 217, column: 15)
!1264 = !DILocalVariable(name: "__o1", scope: !1265, file: !3, line: 218, type: !157)
!1265 = distinct !DILexicalBlock(scope: !1266, file: !3, line: 218, column: 13)
!1266 = distinct !DILexicalBlock(scope: !1262, file: !3, line: 218, column: 13)
!1267 = !DILocalVariable(name: "__o", scope: !1268, file: !3, line: 226, type: !103)
!1268 = distinct !DILexicalBlock(scope: !1247, file: !3, line: 226, column: 7)
!1269 = !DILocalVariable(name: "__o1", scope: !1270, file: !3, line: 226, type: !157)
!1270 = distinct !DILexicalBlock(scope: !1271, file: !3, line: 226, column: 7)
!1271 = distinct !DILexicalBlock(scope: !1268, file: !3, line: 226, column: 7)
!1272 = !DILocation(line: 195, column: 28, scope: !1240)
!1273 = !DILocation(line: 197, column: 8, scope: !1240)
!1274 = !DILocation(line: 199, column: 10, scope: !1240)
!1275 = !DILocation(line: 199, column: 15, scope: !1240)
!1276 = !DILocation(line: 199, column: 3, scope: !1240)
!1277 = !DILocation(line: 201, column: 7, scope: !1247)
!1278 = !DILocation(line: 204, column: 11, scope: !1245)
!1279 = !DILocation(line: 204, column: 11, scope: !1249)
!1280 = !DILocation(line: 204, column: 11, scope: !1250)
!1281 = !DILocation(line: 205, column: 11, scope: !1252)
!1282 = !DILocation(line: 205, column: 11, scope: !1254)
!1283 = !DILocation(line: 205, column: 11, scope: !1255)
!1284 = !DILocation(line: 206, column: 11, scope: !1257)
!1285 = !DILocation(line: 206, column: 11, scope: !1259)
!1286 = !DILocation(line: 206, column: 11, scope: !1260)
!1287 = !DILocation(line: 208, column: 11, scope: !1246)
!1288 = !DILocation(line: 212, column: 29, scope: !1246)
!1289 = !DILocation(line: 212, column: 26, scope: !1246)
!1290 = !DILocation(line: 213, column: 11, scope: !1246)
!1291 = !DILocation(line: 217, column: 15, scope: !1263)
!1292 = !DILocation(line: 217, column: 15, scope: !1246)
!1293 = !DILocation(line: 218, column: 13, scope: !1262)
!1294 = !DILocation(line: 218, column: 13, scope: !1265)
!1295 = !DILocation(line: 218, column: 13, scope: !1266)
!1296 = !DILocation(line: 218, column: 13, scope: !1263)
!1297 = !DILocation(line: 226, column: 7, scope: !1268)
!1298 = !DILocation(line: 226, column: 7, scope: !1270)
!1299 = !DILocation(line: 226, column: 7, scope: !1271)
!1300 = !DILocation(line: 227, column: 7, scope: !1247)
!1301 = distinct !{!1301, !1276, !1302}
!1302 = !DILocation(line: 228, column: 5, scope: !1240)
!1303 = !DILocation(line: 229, column: 1, scope: !1240)
