; ModuleID = 'coreutils-8.27/src/du.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.exclude = type { %struct.exclude_segment*, %struct.pattern_buffer* }
%struct.exclude_segment = type { %struct.exclude_segment*, i32, i32, %union.anon.11 }
%union.anon.11 = type { %struct.exclude_pattern }
%struct.exclude_pattern = type { %struct.patopts*, i64, i64 }
%struct.patopts = type { i32, %union.anon.0 }
%union.anon.0 = type { %struct.re_pattern_buffer }
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_dfa_t = type opaque
%struct.pattern_buffer = type { %struct.pattern_buffer*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.di_set = type { %struct.hash_table*, %struct.ino_map*, %struct.di_ent* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }

!94 = !DILocalVariable(name: "bit_flags", scope: !79, file: !3, line: 731, type: !74)
!95 = !DILocalVariable(name: "symlink_deref_bits", scope: !79, file: !3, line: 735, type: !74)
!96 = !DILocalVariable(name: "opt_summarize_only", scope: !79, file: !3, line: 738, type: !91)
!97 = !DILocalVariable(name: "oi", scope: !98, file: !3, line: 758, type: !74)
!98 = distinct !DILexicalBlock(scope: !79, file: !3, line: 757, column: 5)
!99 = !DILocalVariable(name: "c", scope: !98, file: !3, line: 759, type: !74)
!100 = !DILocalVariable(name: "tmp_ulong", scope: !101, file: !3, line: 811, type: !67)
!101 = distinct !DILexicalBlock(scope: !102, file: !3, line: 810, column: 11)
!102 = distinct !DILexicalBlock(scope: !98, file: !3, line: 765, column: 9)
!103 = !DILocalVariable(name: "e", scope: !104, file: !3, line: 842, type: !18)
!104 = distinct !DILexicalBlock(scope: !102, file: !3, line: 841, column: 11)
!105 = !DILocalVariable(name: "e", scope: !106, file: !3, line: 860, type: !18)
!106 = distinct !DILexicalBlock(scope: !102, file: !3, line: 859, column: 11)
!107 = !DILocalVariable(name: "d", scope: !108, file: !3, line: 944, type: !67)
!108 = distinct !DILexicalBlock(scope: !109, file: !3, line: 943, column: 5)
!109 = distinct !DILexicalBlock(scope: !79, file: !3, line: 942, column: 7)
!110 = !DILocalVariable(name: "p", scope: !111, file: !3, line: 976, type: !61)
!111 = distinct !DILexicalBlock(scope: !112, file: !3, line: 973, column: 13)
!112 = distinct !DILexicalBlock(scope: !113, file: !3, line: 972, column: 20)
!113 = distinct !DILexicalBlock(scope: !114, file: !3, line: 970, column: 15)
!114 = distinct !DILexicalBlock(scope: !115, file: !3, line: 966, column: 9)
!115 = distinct !DILexicalBlock(scope: !116, file: !3, line: 965, column: 11)
!116 = distinct !DILexicalBlock(scope: !117, file: !3, line: 964, column: 5)
!117 = distinct !DILexicalBlock(scope: !79, file: !3, line: 963, column: 7)
!118 = !DILocalVariable(name: "ai", scope: !79, file: !3, line: 1012, type: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !46, line: 23, flags: DIFlagFwdDecl)
!121 = !DILocalVariable(name: "files", scope: !122, file: !3, line: 1037, type: !82)
!122 = distinct !DILexicalBlock(scope: !123, file: !3, line: 1036, column: 5)
!123 = distinct !DILexicalBlock(scope: !79, file: !3, line: 1013, column: 7)
!124 = !DILocalVariable(name: "skip_file", scope: !125, file: !3, line: 1064, type: !91)
!125 = distinct !DILexicalBlock(scope: !79, file: !3, line: 1063, column: 5)
!126 = !DILocalVariable(name: "ai_err", scope: !125, file: !3, line: 1065, type: !45)
!127 = !DILocalVariable(name: "file_name", scope: !125, file: !3, line: 1066, type: !61)
!128 = !DILocalVariable(name: "file_number", scope: !129, file: !3, line: 1111, type: !67)
!129 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1107, column: 13)
!130 = distinct !DILexicalBlock(scope: !131, file: !3, line: 1104, column: 15)
!131 = distinct !DILexicalBlock(scope: !132, file: !3, line: 1099, column: 9)
!132 = distinct !DILexicalBlock(scope: !125, file: !3, line: 1098, column: 11)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 56, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 7)
!136 = !DIGlobalVariableExpression(var: !137)
!137 = distinct !DIGlobalVariable(name: "prefix_len", scope: !79, file: !3, line: 984, type: !138, isLocal: true, isDefinition: true)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!139 = !DIGlobalVariableExpression(var: !140)
!140 = distinct !DIGlobalVariable(name: "temp_argv", scope: !79, file: !3, line: 1060, type: !87, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142)
!142 = distinct !DIGlobalVariable(name: "di_files", scope: !2, file: !3, line: 66, type: !143, isLocal: true, isDefinition: true)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "di_set", file: !145, line: 13, flags: DIFlagFwdDecl)
!145 = !DIFile(filename: "./lib/di-set.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!146 = !DIGlobalVariableExpression(var: !147)
!147 = distinct !DIGlobalVariable(name: "di_mnt", scope: !2, file: !3, line: 69, type: !143, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149)
!149 = distinct !DIGlobalVariable(name: "hash_all", scope: !2, file: !3, line: 140, type: !91, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151)
!151 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 161, type: !74, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153)
!153 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 187, type: !154, isLocal: true, isDefinition: true)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !155, line: 594, baseType: !156)
!155 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !155, line: 594, flags: DIFlagFwdDecl)
!158 = !DIGlobalVariableExpression(var: !159)
!159 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 190, type: !63, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161)
!161 = distinct !DIGlobalVariable(name: "tot_dui", scope: !2, file: !3, line: 196, type: !162, isLocal: true, isDefinition: true)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "duinfo", file: !3, line: 76, size: 256, elements: !163)
!163 = !{!164, !165, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !162, file: !3, line: 79, baseType: !63, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !162, file: !3, line: 82, baseType: !63, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tmax", scope: !162, file: !3, line: 86, baseType: !167, size: 128, offset: 128)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !168, line: 8, size: 128, elements: !169)
!168 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !167, file: !168, line: 10, baseType: !72, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !167, file: !168, line: 11, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !66, line: 184, baseType: !73)
!173 = !DIGlobalVariableExpression(var: !174)
!174 = distinct !DIGlobalVariable(name: "infomap", scope: !175, file: !176, line: 632, type: !190, isLocal: true, isDefinition: true)
!175 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !176, file: !176, line: 630, type: !177, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !179)
!176 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!177 = !DISubroutineType(types: !178)
!178 = !{null, !58}
!179 = !{!180, !181, !182, !189}
!180 = !DILocalVariable(name: "program", arg: 1, scope: !175, file: !176, line: 630, type: !58)
!181 = !DILocalVariable(name: "node", scope: !175, file: !176, line: 642, type: !58)
!182 = !DILocalVariable(name: "map_prog", scope: !175, file: !176, line: 643, type: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !175, file: !176, line: 632, size: 128, elements: !186)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !185, file: !176, line: 632, baseType: !58, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !185, file: !176, line: 632, baseType: !58, size: 64, offset: 64)
!189 = !DILocalVariable(name: "lc_messages", scope: !175, file: !176, line: 655, type: !58)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 896, elements: !134)
!191 = !DIGlobalVariableExpression(var: !192)
!192 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 216, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 6656, elements: !203)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !196, line: 50, size: 256, elements: !197)
!196 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!197 = !{!198, !199, !200, !202}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !196, line: 52, baseType: !58, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !195, file: !196, line: 55, baseType: !74, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !195, file: !196, line: 56, baseType: !201, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !195, file: !196, line: 57, baseType: !74, size: 32, offset: 192)
!203 = !{!204}
!204 = !DISubrange(count: 26)
!205 = !DIGlobalVariableExpression(var: !206)
!206 = distinct !DIGlobalVariable(name: "opt_nul_terminate_output", scope: !2, file: !3, line: 143, type: !91, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208)
!208 = distinct !DIGlobalVariable(name: "opt_all", scope: !2, file: !3, line: 130, type: !91, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210)
!210 = distinct !DIGlobalVariable(name: "apparent_size", scope: !2, file: !3, line: 134, type: !91, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212)
!212 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !2, file: !3, line: 146, type: !91, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214)
!214 = distinct !DIGlobalVariable(name: "max_depth", scope: !2, file: !3, line: 154, type: !68, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216)
!216 = distinct !DIGlobalVariable(name: "opt_count_all", scope: !2, file: !3, line: 137, type: !91, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218)
!218 = distinct !DIGlobalVariable(name: "opt_threshold", scope: !2, file: !3, line: 158, type: !219, isLocal: true, isDefinition: true)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !64, line: 111, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !66, line: 61, baseType: !73)
!221 = !DIGlobalVariableExpression(var: !222)
!222 = distinct !DIGlobalVariable(name: "opt_separate_dirs", scope: !2, file: !3, line: 149, type: !91, isLocal: true, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224)
!224 = distinct !DIGlobalVariable(name: "opt_inodes", scope: !2, file: !3, line: 164, type: !91, isLocal: true, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226)
!226 = distinct !DIGlobalVariable(name: "opt_time", scope: !2, file: !3, line: 167, type: !91, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228)
!228 = distinct !DIGlobalVariable(name: "time_types", scope: !2, file: !3, line: 251, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 160, elements: !231)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!231 = !{!232}
!232 = !DISubrange(count: 5)
!233 = !DIGlobalVariableExpression(var: !234)
!234 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 247, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 384, elements: !237)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!237 = !{!238}
!238 = !DISubrange(count: 6)
!239 = !DIGlobalVariableExpression(var: !240)
!240 = distinct !DIGlobalVariable(name: "time_type", scope: !2, file: !3, line: 178, type: !40, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242)
!242 = distinct !DIGlobalVariable(name: "time_style", scope: !2, file: !3, line: 181, type: !58, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244)
!244 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 184, type: !58, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246)
!246 = distinct !DIGlobalVariable(name: "time_style_types", scope: !2, file: !3, line: 271, type: !247, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 96, elements: !249)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!249 = !{!250}
!250 = !DISubrange(count: 3)
!251 = !DIGlobalVariableExpression(var: !252)
!252 = distinct !DIGlobalVariable(name: "time_style_args", scope: !2, file: !3, line: 267, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 256, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 4)
!256 = !DIGlobalVariableExpression(var: !257)
!257 = distinct !DIGlobalVariable(name: "prev_level", scope: !2, file: !3, line: 73, type: !68, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259)
!259 = distinct !DIGlobalVariable(name: "n_alloc", scope: !260, file: !3, line: 494, type: !68, isLocal: true, isDefinition: true)
!260 = distinct !DISubprogram(name: "process_file", scope: !3, file: !3, line: 488, type: !261, isLocal: true, isDefinition: true, scopeLine: 489, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !376)
!261 = !DISubroutineType(types: !262)
!262 = !{!91, !263, !374}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !265, line: 199, baseType: !266)
!265 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 80, size: 1024, elements: !267)
!267 = !{!268, !335, !336, !338, !340, !341, !342, !343, !344, !345, !352, !353, !356, !363}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !266, file: !265, line: 81, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !265, line: 201, size: 2112, elements: !271)
!271 = !{!272, !273, !274, !275, !280, !281, !282, !283, !284, !285, !286, !287, !288, !290, !291, !295, !297, !298, !299, !331}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !270, file: !265, line: 202, baseType: !269, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !270, file: !265, line: 203, baseType: !269, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !270, file: !265, line: 204, baseType: !269, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !270, file: !265, line: 205, baseType: !276, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !278, line: 127, baseType: !279)
!278 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !278, line: 127, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !270, file: !265, line: 208, baseType: !73, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !270, file: !265, line: 209, baseType: !62, size: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !270, file: !265, line: 210, baseType: !61, size: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !270, file: !265, line: 211, baseType: !61, size: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !270, file: !265, line: 212, baseType: !74, size: 32, offset: 512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !270, file: !265, line: 213, baseType: !74, size: 32, offset: 544)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !270, file: !265, line: 214, baseType: !68, size: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !270, file: !265, line: 216, baseType: !263, size: 64, offset: 640)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !270, file: !265, line: 220, baseType: !289, size: 64, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !69, line: 51, baseType: !73)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !270, file: !265, line: 222, baseType: !68, size: 64, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !270, file: !265, line: 223, baseType: !292, size: 64, offset: 832)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !293, line: 75, baseType: !294)
!293 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !66, line: 139, baseType: !67)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !270, file: !265, line: 239, baseType: !296, size: 16, offset: 896)
!296 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !270, file: !265, line: 243, baseType: !296, size: 16, offset: 912)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !270, file: !265, line: 249, baseType: !296, size: 16, offset: 928)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !270, file: !265, line: 251, baseType: !300, size: 1152, offset: 960)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 1152, elements: !329)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !302, line: 46, size: 1152, elements: !303)
!302 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!303 = !{!304, !306, !308, !309, !312, !314, !316, !317, !318, !320, !322, !324, !325, !326, !327}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !301, file: !302, line: 48, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !66, line: 133, baseType: !67)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !301, file: !302, line: 53, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !66, line: 136, baseType: !67)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !301, file: !302, line: 61, baseType: !294, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !301, file: !302, line: 62, baseType: !310, size: 32, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !66, line: 138, baseType: !311)
!311 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !301, file: !302, line: 64, baseType: !313, size: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !66, line: 134, baseType: !311)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !301, file: !302, line: 65, baseType: !315, size: 32, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !66, line: 135, baseType: !311)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !301, file: !302, line: 67, baseType: !74, size: 32, offset: 288)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !301, file: !302, line: 69, baseType: !305, size: 64, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !301, file: !302, line: 74, baseType: !319, size: 64, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !66, line: 140, baseType: !73)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !301, file: !302, line: 78, baseType: !321, size: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !66, line: 162, baseType: !73)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !301, file: !302, line: 80, baseType: !323, size: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !66, line: 167, baseType: !73)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !301, file: !302, line: 91, baseType: !167, size: 128, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !301, file: !302, line: 92, baseType: !167, size: 128, offset: 704)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !301, file: !302, line: 93, baseType: !167, size: 128, offset: 832)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !301, file: !302, line: 106, baseType: !328, size: 192, offset: 960)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 192, elements: !249)
!329 = !{!330}
!330 = !DISubrange(count: 1)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !270, file: !265, line: 252, baseType: !332, offset: 2112)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: -1)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !266, file: !265, line: 82, baseType: !269, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !266, file: !265, line: 83, baseType: !337, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !266, file: !265, line: 84, baseType: !339, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !293, line: 60, baseType: !305)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !266, file: !265, line: 85, baseType: !61, size: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !266, file: !265, line: 86, baseType: !74, size: 32, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !266, file: !265, line: 87, baseType: !74, size: 32, offset: 352)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !266, file: !265, line: 89, baseType: !68, size: 64, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !266, file: !265, line: 90, baseType: !68, size: 64, offset: 448)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !266, file: !265, line: 91, baseType: !346, size: 64, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!74, !349, !349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !266, file: !265, line: 162, baseType: !74, size: 32, offset: 576)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !266, file: !265, line: 171, baseType: !354, size: 64, offset: 640)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !265, line: 171, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !266, file: !265, line: 193, baseType: !357, size: 64, offset: 704)
!357 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !265, line: 173, size: 64, elements: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !357, file: !265, line: 186, baseType: !354, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !357, file: !265, line: 192, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !265, line: 192, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !266, file: !265, line: 198, baseType: !364, size: 256, offset: 768)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !365, line: 39, baseType: !366)
!365 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !365, line: 31, size: 256, elements: !367)
!367 = !{!368, !370, !371, !372, !373}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !366, file: !365, line: 33, baseType: !369, size: 128)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 128, elements: !254)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !366, file: !365, line: 34, baseType: !74, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !366, file: !365, line: 35, baseType: !311, size: 32, offset: 160)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !366, file: !365, line: 36, baseType: !311, size: 32, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !366, file: !365, line: 37, baseType: !91, size: 8, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !265, line: 253, baseType: !270)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !387, !388, !392, !399, !404, !410}
!377 = !DILocalVariable(name: "fts", arg: 1, scope: !260, file: !3, line: 488, type: !263)
!378 = !DILocalVariable(name: "ent", arg: 2, scope: !260, file: !3, line: 488, type: !374)
!379 = !DILocalVariable(name: "ok", scope: !260, file: !3, line: 490, type: !91)
!380 = !DILocalVariable(name: "dui", scope: !260, file: !3, line: 491, type: !162)
!381 = !DILocalVariable(name: "dui_to_print", scope: !260, file: !3, line: 492, type: !162)
!382 = !DILocalVariable(name: "level", scope: !260, file: !3, line: 493, type: !68)
!383 = !DILocalVariable(name: "file", scope: !260, file: !3, line: 505, type: !58)
!384 = !DILocalVariable(name: "sb", scope: !260, file: !3, line: 506, type: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!387 = !DILocalVariable(name: "info", scope: !260, file: !3, line: 507, type: !74)
!388 = !DILocalVariable(name: "excluded", scope: !389, file: !3, line: 517, type: !91)
!389 = distinct !DILexicalBlock(scope: !390, file: !3, line: 516, column: 5)
!390 = distinct !DILexicalBlock(scope: !391, file: !3, line: 515, column: 12)
!391 = distinct !DILexicalBlock(scope: !260, file: !3, line: 509, column: 7)
!392 = !DILocalVariable(name: "e", scope: !393, file: !3, line: 525, type: !397)
!393 = distinct !DILexicalBlock(scope: !394, file: !3, line: 523, column: 13)
!394 = distinct !DILexicalBlock(scope: !395, file: !3, line: 522, column: 15)
!395 = distinct !DILexicalBlock(scope: !396, file: !3, line: 519, column: 9)
!396 = distinct !DILexicalBlock(scope: !389, file: !3, line: 518, column: 11)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!399 = !DILocalVariable(name: "e", scope: !400, file: !3, line: 558, type: !397)
!400 = distinct !DILexicalBlock(scope: !401, file: !3, line: 556, column: 13)
!401 = distinct !DILexicalBlock(scope: !402, file: !3, line: 555, column: 15)
!402 = distinct !DILexicalBlock(scope: !403, file: !3, line: 551, column: 9)
!403 = distinct !DILexicalBlock(scope: !389, file: !3, line: 547, column: 11)
!404 = !DILocalVariable(name: "i", scope: !405, file: !3, line: 616, type: !68)
!405 = distinct !DILexicalBlock(scope: !406, file: !3, line: 611, column: 9)
!406 = distinct !DILexicalBlock(scope: !407, file: !3, line: 610, column: 16)
!407 = distinct !DILexicalBlock(scope: !408, file: !3, line: 606, column: 11)
!408 = distinct !DILexicalBlock(scope: !409, file: !3, line: 605, column: 5)
!409 = distinct !DILexicalBlock(scope: !260, file: !3, line: 599, column: 7)
!410 = !DILocalVariable(name: "v", scope: !411, file: !3, line: 663, type: !63)
!411 = distinct !DILexicalBlock(scope: !412, file: !3, line: 661, column: 5)
!412 = distinct !DILexicalBlock(scope: !260, file: !3, line: 658, column: 7)
!413 = !DIGlobalVariableExpression(var: !414)
!414 = distinct !DIGlobalVariable(name: "dulvl", scope: !260, file: !3, line: 503, type: !415, isLocal: true, isDefinition: true)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dulevel", file: !3, line: 120, size: 512, elements: !417)
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ent", scope: !416, file: !3, line: 123, baseType: !162, size: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "subdir", scope: !416, file: !3, line: 126, baseType: !162, size: 256, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "exclude", file: !422, line: 47, flags: DIFlagFwdDecl)
!422 = !DIFile(filename: "./lib/exclude.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!423 = !DIGlobalVariableExpression(var: !424)
!424 = distinct !DIGlobalVariable(name: "Version", scope: !425, file: !426, line: 2, type: !58, isLocal: false, isDefinition: true)
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, globals: !428)
!426 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!427 = !{}
!428 = !{!423}
!429 = !DIGlobalVariableExpression(var: !430)
!430 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !431, file: !436, line: 69, type: !437, isLocal: false, isDefinition: true)
!431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !432, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !433, retainedTypes: !434, globals: !435)
!432 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!433 = !{!26}
!434 = !{!62, !75}
!435 = !{!429}
!436 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !438, line: 55, baseType: !439)
!438 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null}
!442 = !DIGlobalVariableExpression(var: !443)
!443 = distinct !DIGlobalVariable(name: "file_name", scope: !444, file: !449, line: 36, type: !58, isLocal: true, isDefinition: true)
!444 = distinct !DICompileUnit(language: DW_LANG_C99, file: !445, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, globals: !446)
!445 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!446 = !{!442, !447}
!447 = !DIGlobalVariableExpression(var: !448)
!448 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !444, file: !449, line: 46, type: !91, isLocal: true, isDefinition: true)
!449 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!450 = !DIGlobalVariableExpression(var: !451)
!451 = distinct !DIGlobalVariable(name: "exit_failure", scope: !452, file: !455, line: 24, type: !456, isLocal: false, isDefinition: true)
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !453, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, globals: !454)
!453 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!454 = !{!450}
!455 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!456 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !74)
!457 = !DIGlobalVariableExpression(var: !458)
!458 = distinct !DIGlobalVariable(name: "default_tuning", scope: !459, file: !463, line: 130, type: !464, isLocal: true, isDefinition: true)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !461, globals: !462)
!460 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!461 = !{!67, !62, !68}
!462 = !{!457}
!463 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !466, line: 65, baseType: !467)
!466 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !466, line: 53, size: 160, elements: !468)
!468 = !{!469, !471, !472, !473, !474}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !467, file: !466, line: 58, baseType: !470, size: 32)
!470 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !467, file: !466, line: 59, baseType: !470, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !467, file: !466, line: 60, baseType: !470, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !467, file: !466, line: 61, baseType: !470, size: 32, offset: 96)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !467, file: !466, line: 62, baseType: !91, size: 8, offset: 128)
!475 = !DIGlobalVariableExpression(var: !476)
!476 = distinct !DIGlobalVariable(name: "power_letter", scope: !477, file: !484, line: 36, type: !490, isLocal: true, isDefinition: true)
!477 = distinct !DICompileUnit(language: DW_LANG_C99, file: !478, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !479, retainedTypes: !480, globals: !481)
!478 = !DIFile(filename: "./lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!479 = !{!5, !18}
!480 = !{!58}
!481 = !{!475, !482, !486}
!482 = !DIGlobalVariableExpression(var: !483)
!483 = distinct !DIGlobalVariable(name: "block_size_args", scope: !477, file: !484, line: 398, type: !485, isLocal: true, isDefinition: true)
!484 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 192, elements: !249)
!486 = !DIGlobalVariableExpression(var: !487)
!487 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !477, file: !484, line: 399, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 64, elements: !88)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 72, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 9)
!493 = !DIGlobalVariableExpression(var: !494)
!494 = distinct !DIGlobalVariable(name: "program_name", scope: !495, file: !499, line: 33, type: !58, isLocal: false, isDefinition: true)
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !497, globals: !498)
!496 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!497 = !{!62, !61}
!498 = !{!493}
!499 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!500 = !DIGlobalVariableExpression(var: !501)
!501 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !502, file: !529, line: 77, type: !564, isLocal: false, isDefinition: true)
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !504, retainedTypes: !525, globals: !526)
!503 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!504 = !{!26, !505, !510}
!505 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !27, line: 242, size: 32, elements: !506)
!506 = !{!507, !508, !509}
!507 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!508 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!509 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !511, line: 46, size: 32, elements: !512)
!511 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!512 = !{!513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524}
!513 = !DIEnumerator(name: "_ISupper", value: 256)
!514 = !DIEnumerator(name: "_ISlower", value: 512)
!515 = !DIEnumerator(name: "_ISalpha", value: 1024)
!516 = !DIEnumerator(name: "_ISdigit", value: 2048)
!517 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!518 = !DIEnumerator(name: "_ISspace", value: 8192)
!519 = !DIEnumerator(name: "_ISprint", value: 16384)
!520 = !DIEnumerator(name: "_ISgraph", value: 32768)
!521 = !DIEnumerator(name: "_ISblank", value: 1)
!522 = !DIEnumerator(name: "_IScntrl", value: 2)
!523 = !DIEnumerator(name: "_ISpunct", value: 4)
!524 = !DIEnumerator(name: "_ISalnum", value: 8)
!525 = !{!74, !296, !68, !61}
!526 = !{!500, !527, !534, !546, !548, !553, !560, !562}
!527 = !DIGlobalVariableExpression(var: !528)
!528 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !502, file: !529, line: 93, type: !530, isLocal: false, isDefinition: true)
!529 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 320, elements: !532)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!532 = !{!533}
!533 = !DISubrange(count: 10)
!534 = !DIGlobalVariableExpression(var: !535)
!535 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !502, file: !529, line: 1043, type: !536, isLocal: false, isDefinition: true)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !529, line: 57, size: 448, elements: !537)
!537 = !{!538, !539, !540, !544, !545}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !536, file: !529, line: 60, baseType: !26, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !536, file: !529, line: 63, baseType: !74, size: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !536, file: !529, line: 67, baseType: !541, size: 256, offset: 64)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 256, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 8)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !536, file: !529, line: 70, baseType: !58, size: 64, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !536, file: !529, line: 73, baseType: !58, size: 64, offset: 384)
!546 = !DIGlobalVariableExpression(var: !547)
!547 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !502, file: !529, line: 108, type: !536, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549)
!549 = distinct !DIGlobalVariable(name: "slot0", scope: !502, file: !529, line: 834, type: !550, isLocal: true, isDefinition: true)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 256)
!553 = !DIGlobalVariableExpression(var: !554)
!554 = distinct !DIGlobalVariable(name: "slotvec", scope: !502, file: !529, line: 837, type: !555, isLocal: true, isDefinition: true)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !529, line: 826, size: 128, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !556, file: !529, line: 828, baseType: !68, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !556, file: !529, line: 829, baseType: !61, size: 64, offset: 64)
!560 = !DIGlobalVariableExpression(var: !561)
!561 = distinct !DIGlobalVariable(name: "nslots", scope: !502, file: !529, line: 835, type: !74, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563)
!563 = distinct !DIGlobalVariable(name: "slotvec0", scope: !502, file: !529, line: 836, type: !556, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 704, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 11)
!567 = !DIGlobalVariableExpression(var: !568)
!568 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !569, file: !572, line: 26, type: !573, isLocal: false, isDefinition: true)
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, globals: !571)
!570 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!571 = !{!567}
!572 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 376, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 47)
!576 = !DIGlobalVariableExpression(var: !577)
!577 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !578, file: !922, line: 120, type: !923, isLocal: true, isDefinition: true)
!578 = distinct !DICompileUnit(language: DW_LANG_C99, file: !579, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !580, retainedTypes: !919, globals: !921)
!579 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!580 = !{!581}
!581 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !582, line: 41, size: 32, elements: !583)
!582 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918}
!584 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!585 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!586 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!587 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!588 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!589 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!590 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!591 = !DIEnumerator(name: "DAY_1", value: 131079)
!592 = !DIEnumerator(name: "DAY_2", value: 131080)
!593 = !DIEnumerator(name: "DAY_3", value: 131081)
!594 = !DIEnumerator(name: "DAY_4", value: 131082)
!595 = !DIEnumerator(name: "DAY_5", value: 131083)
!596 = !DIEnumerator(name: "DAY_6", value: 131084)
!597 = !DIEnumerator(name: "DAY_7", value: 131085)
!598 = !DIEnumerator(name: "ABMON_1", value: 131086)
!599 = !DIEnumerator(name: "ABMON_2", value: 131087)
!600 = !DIEnumerator(name: "ABMON_3", value: 131088)
!601 = !DIEnumerator(name: "ABMON_4", value: 131089)
!602 = !DIEnumerator(name: "ABMON_5", value: 131090)
!603 = !DIEnumerator(name: "ABMON_6", value: 131091)
!604 = !DIEnumerator(name: "ABMON_7", value: 131092)
!605 = !DIEnumerator(name: "ABMON_8", value: 131093)
!606 = !DIEnumerator(name: "ABMON_9", value: 131094)
!607 = !DIEnumerator(name: "ABMON_10", value: 131095)
!608 = !DIEnumerator(name: "ABMON_11", value: 131096)
!609 = !DIEnumerator(name: "ABMON_12", value: 131097)
!610 = !DIEnumerator(name: "MON_1", value: 131098)
!611 = !DIEnumerator(name: "MON_2", value: 131099)
!612 = !DIEnumerator(name: "MON_3", value: 131100)
!613 = !DIEnumerator(name: "MON_4", value: 131101)
!614 = !DIEnumerator(name: "MON_5", value: 131102)
!615 = !DIEnumerator(name: "MON_6", value: 131103)
!616 = !DIEnumerator(name: "MON_7", value: 131104)
!617 = !DIEnumerator(name: "MON_8", value: 131105)
!618 = !DIEnumerator(name: "MON_9", value: 131106)
!619 = !DIEnumerator(name: "MON_10", value: 131107)
!620 = !DIEnumerator(name: "MON_11", value: 131108)
!621 = !DIEnumerator(name: "MON_12", value: 131109)
!622 = !DIEnumerator(name: "AM_STR", value: 131110)
!623 = !DIEnumerator(name: "PM_STR", value: 131111)
!624 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!625 = !DIEnumerator(name: "D_FMT", value: 131113)
!626 = !DIEnumerator(name: "T_FMT", value: 131114)
!627 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!628 = !DIEnumerator(name: "ERA", value: 131116)
!629 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!630 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!631 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!632 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!633 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!634 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!635 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!636 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!637 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!638 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!639 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!640 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!641 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!642 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!643 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!644 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!645 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!646 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!647 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!648 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!649 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!650 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!651 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!652 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!653 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!654 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!655 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!656 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!657 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!658 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!659 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!660 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!661 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!662 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!663 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!664 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!665 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!666 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!667 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!668 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!669 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!670 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!671 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!672 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!673 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!674 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!675 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!676 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!677 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!678 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!679 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!680 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!681 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!682 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!683 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!684 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!685 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!686 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!687 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!688 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!689 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!690 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!691 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!692 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!693 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!694 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!695 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!696 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!697 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!698 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!699 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!700 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!701 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!702 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!703 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!704 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!705 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!706 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!707 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!708 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!709 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!710 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!711 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!712 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!713 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!714 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!715 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!716 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!717 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!718 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!719 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!720 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!721 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!722 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!723 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!724 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!725 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!726 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!727 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!728 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!729 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!730 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!731 = !DIEnumerator(name: "CODESET", value: 14)
!732 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!733 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!734 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!735 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!736 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!737 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!738 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!739 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!740 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!741 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!742 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!743 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!744 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!745 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!746 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!747 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!748 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!749 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!750 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!751 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!752 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!753 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!754 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!755 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!756 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!757 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!758 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!759 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!760 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!761 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!762 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!763 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!764 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!765 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!766 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!767 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!768 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!769 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!770 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!771 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!772 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!773 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!774 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!775 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!776 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!777 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!778 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!779 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!780 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!781 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!782 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!783 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!784 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!785 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!786 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!787 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!788 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!789 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!790 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!791 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!792 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!793 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!794 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!795 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!796 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!797 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!798 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!799 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!800 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!801 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!802 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!803 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!804 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!805 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!806 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!807 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!808 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!809 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!810 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!811 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!812 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!813 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!814 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!815 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!816 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!817 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!818 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!819 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!820 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!821 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!822 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!823 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!824 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!825 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!826 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!827 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!828 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!829 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!830 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!831 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!832 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!833 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!834 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!835 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!836 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!837 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!838 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!839 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!840 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!841 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!842 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!843 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!844 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!845 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!846 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!847 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!848 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!849 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!850 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!851 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!852 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!853 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!854 = !DIEnumerator(name: "THOUSEP", value: 65537)
!855 = !DIEnumerator(name: "__GROUPING", value: 65538)
!856 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!857 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!858 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!859 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!860 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!861 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!862 = !DIEnumerator(name: "__YESSTR", value: 327682)
!863 = !DIEnumerator(name: "__NOSTR", value: 327683)
!864 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!865 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!866 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!867 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!868 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!869 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!870 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!871 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!872 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!873 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!874 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!875 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!876 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!877 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!878 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!879 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!880 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!881 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!882 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!883 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!884 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!885 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!886 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!887 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!888 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!889 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!890 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!891 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!892 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!893 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!894 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!895 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!896 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!897 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!898 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!899 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!900 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!901 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!902 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!903 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!904 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!905 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!906 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!907 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!908 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!909 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!910 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!911 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!912 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!913 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!914 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!915 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!916 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!917 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!918 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!919 = !{!62, !61, !920}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!921 = !{!576}
!922 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!923 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!924 = !DIGlobalVariableExpression(var: !925)
!925 = distinct !DIGlobalVariable(name: "is_basic_table", scope: !926, file: !930, line: 28, type: !931, isLocal: false, isDefinition: true)
!926 = distinct !DICompileUnit(language: DW_LANG_C99, file: !927, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !928, globals: !929)
!927 = !DIFile(filename: "./lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!928 = !{!75}
!929 = !{!924}
!930 = !DIFile(filename: "lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 256, elements: !542)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!933 = !DIGlobalVariableExpression(var: !934)
!934 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !935, file: !936, line: 335, type: !74, isLocal: true, isDefinition: true)
!935 = distinct !DISubprogram(name: "rpl_fcntl", scope: !936, file: !936, line: 272, type: !937, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !939, variables: !942)
!936 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!937 = !DISubroutineType(types: !938)
!938 = !{!74, !74, !74, null}
!939 = distinct !DICompileUnit(language: DW_LANG_C99, file: !940, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, globals: !941)
!940 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!941 = !{!933}
!942 = !{!943, !944, !945, !956, !957, !960, !963, !966}
!943 = !DILocalVariable(name: "fd", arg: 1, scope: !935, file: !936, line: 272, type: !74)
!944 = !DILocalVariable(name: "action", arg: 2, scope: !935, file: !936, line: 272, type: !74)
!945 = !DILocalVariable(name: "arg", scope: !935, file: !936, line: 274, type: !946)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !947, line: 30, baseType: !948)
!947 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !940, line: 274, baseType: !949)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 192, elements: !329)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !940, line: 274, size: 192, elements: !951)
!951 = !{!952, !953, !954, !955}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !950, file: !940, line: 274, baseType: !311, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !950, file: !940, line: 274, baseType: !311, size: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !950, file: !940, line: 274, baseType: !62, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !950, file: !940, line: 274, baseType: !62, size: 64, offset: 128)
!956 = !DILocalVariable(name: "result", scope: !935, file: !936, line: 275, type: !74)
!957 = !DILocalVariable(name: "target", scope: !958, file: !936, line: 322, type: !74)
!958 = distinct !DILexicalBlock(scope: !959, file: !936, line: 321, column: 7)
!959 = distinct !DILexicalBlock(scope: !935, file: !936, line: 278, column: 5)
!960 = !DILocalVariable(name: "flags", scope: !961, file: !936, line: 359, type: !74)
!961 = distinct !DILexicalBlock(scope: !962, file: !936, line: 358, column: 11)
!962 = distinct !DILexicalBlock(scope: !958, file: !936, line: 357, column: 13)
!963 = !DILocalVariable(name: "saved_errno", scope: !964, file: !936, line: 362, type: !74)
!964 = distinct !DILexicalBlock(scope: !965, file: !936, line: 361, column: 15)
!965 = distinct !DILexicalBlock(scope: !961, file: !936, line: 360, column: 17)
!966 = !DILocalVariable(name: "p", scope: !967, file: !936, line: 404, type: !62)
!967 = distinct !DILexicalBlock(scope: !959, file: !936, line: 402, column: 7)
!968 = !DIGlobalVariableExpression(var: !969)
!969 = distinct !DIGlobalVariable(name: "__mon_yday", scope: !970, file: !980, line: 124, type: !991, isLocal: true, isDefinition: true)
!970 = distinct !DICompileUnit(language: DW_LANG_C99, file: !971, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !972, globals: !977)
!971 = !DIFile(filename: "./lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!972 = !{!311, !74, !973, !75, !974, !296, !73, !67, !975, !976}
!973 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!974 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!975 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!976 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!977 = !{!978, !984, !987, !968}
!978 = !DIGlobalVariableExpression(var: !979, expr: !983)
!979 = distinct !DIGlobalVariable(name: "mktime_min", scope: !970, file: !980, line: 95, type: !981, isLocal: true, isDefinition: true)
!980 = !DIFile(filename: "lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_int", file: !980, line: 68, baseType: !73)
!983 = !DIExpression(DW_OP_constu, 9223372036854775808, DW_OP_stack_value)
!984 = !DIGlobalVariableExpression(var: !985, expr: !986)
!985 = distinct !DIGlobalVariable(name: "mktime_max", scope: !970, file: !980, line: 98, type: !981, isLocal: true, isDefinition: true)
!986 = !DIExpression(DW_OP_constu, 9223372036854775807, DW_OP_stack_value)
!987 = !DIGlobalVariableExpression(var: !988)
!988 = distinct !DIGlobalVariable(name: "localtime_offset", scope: !970, file: !980, line: 462, type: !989, isLocal: true, isDefinition: true)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "mktime_offset_t", file: !990, line: 30, baseType: !70)
!990 = !DIFile(filename: "./lib/mktime-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 416, elements: !993)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!993 = !{!89, !994}
!994 = !DISubrange(count: 13)
!995 = distinct !DICompileUnit(language: DW_LANG_C99, file: !996, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !997, retainedTypes: !998)
!996 = !DIFile(filename: "./lib/argv-iter.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!997 = !{!45}
!998 = !{!62}
!999 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1000, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1001, retainedTypes: !1038)
!1000 = !DIFile(filename: "./lib/di-set.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1001 = !{!1002, !1027}
!1002 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1004, file: !1003, line: 118, size: 32, elements: !1025)
!1003 = !DIFile(filename: "lib/di-set.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1004 = distinct !DISubprogram(name: "di_set_alloc", scope: !1003, file: !1003, line: 113, type: !1005, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, unit: !999, variables: !1023)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!1007}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "di_set", file: !1003, line: 59, size: 192, elements: !1009)
!1009 = !{!1010, !1013, !1017}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "dev_map", scope: !1008, file: !1003, line: 62, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !466, line: 67, flags: DIFlagFwdDecl)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ino_map", scope: !1008, file: !1003, line: 67, baseType: !1014, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "ino_map", file: !1016, line: 15, flags: DIFlagFwdDecl)
!1016 = !DIFile(filename: "./lib/ino-map.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !1008, file: !1003, line: 71, baseType: !1018, size: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "di_ent", file: !1003, line: 52, size: 128, elements: !1020)
!1020 = !{!1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1019, file: !1003, line: 54, baseType: !339, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ino_set", scope: !1019, file: !1003, line: 55, baseType: !1011, size: 64, offset: 64)
!1023 = !{!1024}
!1024 = !DILocalVariable(name: "dis", scope: !1004, file: !1003, line: 115, type: !1007)
!1025 = !{!1026}
!1026 = !DIEnumerator(name: "INITIAL_DEV_MAP_SIZE", value: 11)
!1027 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1028, file: !1003, line: 185, size: 32, elements: !1036)
!1028 = distinct !DISubprogram(name: "map_device", scope: !1003, file: !1003, line: 154, type: !1029, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: true, unit: !999, variables: !1031)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!1011, !1007, !339}
!1031 = !{!1032, !1033, !1034, !1035}
!1032 = !DILocalVariable(name: "dis", arg: 1, scope: !1028, file: !1003, line: 154, type: !1007)
!1033 = !DILocalVariable(name: "dev", arg: 2, scope: !1028, file: !1003, line: 154, type: !339)
!1034 = !DILocalVariable(name: "ent", scope: !1028, file: !1003, line: 157, type: !1018)
!1035 = !DILocalVariable(name: "probe", scope: !1028, file: !1003, line: 158, type: !1018)
!1036 = !{!1037}
!1037 = !DIEnumerator(name: "INITIAL_INO_SET_SIZE", value: 1021)
!1038 = !{!68, !1039, !1041}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashint", file: !1003, line: 33, baseType: !68)
!1042 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1043, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1044, retainedTypes: !1063)
!1043 = !DIFile(filename: "./lib/exclude.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1044 = !{!1045, !510, !1050}
!1045 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "exclude_type", file: !1046, line: 95, size: 32, elements: !1047)
!1046 = !DIFile(filename: "lib/exclude.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1047 = !{!1048, !1049}
!1048 = !DIEnumerator(name: "exclude_hash", value: 0)
!1049 = !DIEnumerator(name: "exclude_pattern", value: 1)
!1050 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1052, file: !1051, line: 192, size: 32, elements: !1061)
!1051 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1052 = distinct !DISubprogram(name: "x2nrealloc", scope: !1051, file: !1051, line: 180, type: !1053, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !1042, variables: !1056)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!62, !62, !1055, !68}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!1056 = !{!1057, !1058, !1059, !1060}
!1057 = !DILocalVariable(name: "p", arg: 1, scope: !1052, file: !1051, line: 180, type: !62)
!1058 = !DILocalVariable(name: "pn", arg: 2, scope: !1052, file: !1051, line: 180, type: !1055)
!1059 = !DILocalVariable(name: "s", arg: 3, scope: !1052, file: !1051, line: 180, type: !68)
!1060 = !DILocalVariable(name: "n", scope: !1052, file: !1051, line: 182, type: !68)
!1061 = !{!1062}
!1062 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1063 = !{!61, !74, !75, !296, !68, !920}
!1064 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1065, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !1066)
!1065 = !DIFile(filename: "./lib/fprintftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1066 = !{!68, !58, !311, !74, !75}
!1067 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1068, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427)
!1068 = !DIFile(filename: "./lib/freopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1069 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1070, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1071, retainedTypes: !1094)
!1070 = !DIFile(filename: "./lib/ino-map.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1071 = !{!1072}
!1072 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1074, file: !1073, line: 89, size: 32, elements: !1092)
!1073 = !DIFile(filename: "lib/ino-map.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1074 = distinct !DISubprogram(name: "ino_map_alloc", scope: !1073, file: !1073, line: 83, type: !1075, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !1069, variables: !1089)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!1077, !68}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ino_map", file: !1073, line: 38, size: 192, elements: !1079)
!1079 = !{!1080, !1081, !1082}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1078, file: !1073, line: 42, baseType: !1011, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "next_mapped_ino", scope: !1078, file: !1073, line: 45, baseType: !68, size: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !1078, file: !1073, line: 49, baseType: !1083, size: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ino_map_ent", file: !1073, line: 31, size: 128, elements: !1085)
!1085 = !{!1086, !1088}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1084, file: !1073, line: 33, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !293, line: 48, baseType: !307)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "mapped_ino", scope: !1084, file: !1073, line: 34, baseType: !68, size: 64, offset: 64)
!1089 = !{!1090, !1091}
!1090 = !DILocalVariable(name: "next_mapped_ino", arg: 1, scope: !1074, file: !1073, line: 83, type: !68)
!1091 = !DILocalVariable(name: "im", scope: !1074, file: !1073, line: 85, type: !1077)
!1092 = !{!1093}
!1093 = !DIEnumerator(name: "INITIAL_INO_MAP_TABLE_SIZE", value: 1021)
!1094 = !{!68}
!1095 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1096, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !1097)
!1096 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1097 = !{!219}
!1098 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1099, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1100, retainedTypes: !1101)
!1099 = !DIFile(filename: "./lib/mbscasecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1100 = !{!510}
!1101 = !{!74, !1102, !296, !68, !75}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!1104 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1105, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !1106)
!1105 = !DIFile(filename: "./lib/mbuiter.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1106 = !{!68, !75}
!1107 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1108, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !1109)
!1108 = !DIFile(filename: "./lib/strnlen1.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1109 = !{!58, !62}
!1110 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1111, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1112, retainedTypes: !998)
!1111 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1112 = !{!1113}
!1113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1114, line: 41, size: 32, elements: !1115)
!1114 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1115 = !{!1116}
!1116 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!1117 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1118, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1119, retainedTypes: !1127)
!1118 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1119 = !{!1120}
!1120 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1121, file: !1051, line: 192, size: 32, elements: !1061)
!1121 = distinct !DISubprogram(name: "x2nrealloc", scope: !1051, file: !1051, line: 180, type: !1053, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !1117, variables: !1122)
!1122 = !{!1123, !1124, !1125, !1126}
!1123 = !DILocalVariable(name: "p", arg: 1, scope: !1121, file: !1051, line: 180, type: !62)
!1124 = !DILocalVariable(name: "pn", arg: 2, scope: !1121, file: !1051, line: 180, type: !1055)
!1125 = !DILocalVariable(name: "s", arg: 3, scope: !1121, file: !1051, line: 180, type: !68)
!1126 = !DILocalVariable(name: "n", scope: !1121, file: !1051, line: 182, type: !68)
!1127 = !{!68, !61, !62}
!1128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1129, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427)
!1129 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1131, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !998)
!1131 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1132 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1133, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1134)
!1133 = !DIFile(filename: "./lib/xstrtoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1134 = !{!18}
!1135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1136, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1137, retainedTypes: !1138)
!1136 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1137 = !{!18, !510}
!1138 = !{!74, !296}
!1139 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1140, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1134)
!1140 = !DIFile(filename: "./lib/xstrtol-error.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1141 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1142, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1137, retainedTypes: !1138)
!1142 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1144, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !998)
!1144 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1146, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427)
!1146 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1147 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1148, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !998)
!1148 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1150, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !998)
!1150 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1152, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1153, retainedTypes: !1279)
!1152 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1153 = !{!1154, !1159, !1262, !1265, !1276}
!1154 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !1155, line: 160, size: 32, elements: !1156)
!1155 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1156 = !{!1157, !1158}
!1157 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!1158 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!1159 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1161, file: !1160, line: 54, size: 32, elements: !1260)
!1160 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1161 = distinct !DISubprogram(name: "setup_dir", scope: !1160, file: !1160, line: 50, type: !1162, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !1151, variables: !1258)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!91, !1164}
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !265, line: 199, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 80, size: 1024, elements: !1167)
!1167 = !{!1168, !1214, !1215, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1230, !1231, !1232, !1249}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1166, file: !265, line: 81, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !265, line: 201, size: 2112, elements: !1171)
!1171 = !{!1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1213}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1170, file: !265, line: 202, baseType: !1169, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1170, file: !265, line: 203, baseType: !1169, size: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1170, file: !265, line: 204, baseType: !1169, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !1170, file: !265, line: 205, baseType: !276, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1170, file: !265, line: 208, baseType: !73, size: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1170, file: !265, line: 209, baseType: !62, size: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1170, file: !265, line: 210, baseType: !61, size: 64, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1170, file: !265, line: 211, baseType: !61, size: 64, offset: 448)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1170, file: !265, line: 212, baseType: !74, size: 32, offset: 512)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1170, file: !265, line: 213, baseType: !74, size: 32, offset: 544)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1170, file: !265, line: 214, baseType: !68, size: 64, offset: 576)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !1170, file: !265, line: 216, baseType: !1164, size: 64, offset: 640)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !1170, file: !265, line: 220, baseType: !289, size: 64, offset: 704)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1170, file: !265, line: 222, baseType: !68, size: 64, offset: 768)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !1170, file: !265, line: 223, baseType: !292, size: 64, offset: 832)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !1170, file: !265, line: 239, baseType: !296, size: 16, offset: 896)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !1170, file: !265, line: 243, baseType: !296, size: 16, offset: 912)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !1170, file: !265, line: 249, baseType: !296, size: 16, offset: 928)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !1170, file: !265, line: 251, baseType: !1191, size: 1152, offset: 960)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1192, size: 1152, elements: !329)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !302, line: 46, size: 1152, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1210, !1211, !1212}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1192, file: !302, line: 48, baseType: !305, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1192, file: !302, line: 53, baseType: !307, size: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1192, file: !302, line: 61, baseType: !294, size: 64, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1192, file: !302, line: 62, baseType: !310, size: 32, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1192, file: !302, line: 64, baseType: !313, size: 32, offset: 224)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1192, file: !302, line: 65, baseType: !315, size: 32, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1192, file: !302, line: 67, baseType: !74, size: 32, offset: 288)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1192, file: !302, line: 69, baseType: !305, size: 64, offset: 320)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1192, file: !302, line: 74, baseType: !319, size: 64, offset: 384)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1192, file: !302, line: 78, baseType: !321, size: 64, offset: 448)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1192, file: !302, line: 80, baseType: !323, size: 64, offset: 512)
