; ModuleID = 'coreutils-8.27/src/expand.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert tabs in each FILE to spaces, writing to standard output.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.13 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1
@.str.14 = private unnamed_addr constant [75 x i8] c"\0AMandatory arguments to long options are mandatory for short options too.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "shortopts", scope: !2, file: !3, line: 51, type: !65, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !28)
!3 = !DIFile(filename: "src/expand.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, size: 32, elements: !7)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!8 = !DIEnumerator(name: "_ISupper", value: 256)
!9 = !DIEnumerator(name: "_ISlower", value: 512)
!10 = !DIEnumerator(name: "_ISalpha", value: 1024)
!11 = !DIEnumerator(name: "_ISdigit", value: 2048)
!12 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!13 = !DIEnumerator(name: "_ISspace", value: 8192)
!14 = !DIEnumerator(name: "_ISprint", value: 16384)
!15 = !DIEnumerator(name: "_ISgraph", value: 32768)
!16 = !DIEnumerator(name: "_ISblank", value: 1)
!17 = !DIEnumerator(name: "_IScntrl", value: 2)
!18 = !DIEnumerator(name: "_ISpunct", value: 4)
!19 = !DIEnumerator(name: "_ISalnum", value: 8)
!20 = !{!21, !23, !24, !25, !26, !27}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !{!29, !0, !51}
!29 = !DIGlobalVariableExpression(var: !30)
!30 = distinct !DIGlobalVariable(name: "infomap", scope: !31, file: !32, line: 632, type: !48, isLocal: true, isDefinition: true)
!31 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !32, file: !32, line: 630, type: !33, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !37)
!32 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!37 = !{!38, !39, !40, !47}
!38 = !DILocalVariable(name: "program", arg: 1, scope: !31, file: !32, line: 630, type: !35)
!39 = !DILocalVariable(name: "node", scope: !31, file: !32, line: 642, type: !35)
!40 = !DILocalVariable(name: "map_prog", scope: !31, file: !32, line: 643, type: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !31, file: !32, line: 632, size: 128, elements: !44)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !43, file: !32, line: 632, baseType: !35, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !43, file: !32, line: 632, baseType: !35, size: 64, offset: 64)
!47 = !DILocalVariable(name: "lc_messages", scope: !31, file: !32, line: 655, type: !35)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 896, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 7)
!51 = !DIGlobalVariableExpression(var: !52)
!52 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 53, type: !53, isLocal: true, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1280, elements: !63)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !56, line: 50, size: 256, elements: !57)
!56 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!57 = !{!58, !59, !60, !62}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !55, file: !56, line: 52, baseType: !35, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !55, file: !56, line: 55, baseType: !24, size: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !55, file: !56, line: 56, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !55, file: !56, line: 57, baseType: !24, size: 32, offset: 192)
!63 = !{!64}
!64 = !DISubrange(count: 5)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 272, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 34)
!68 = !DIGlobalVariableExpression(var: !69)
!69 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !70, file: !71, line: 32, type: !198, isLocal: false, isDefinition: true)
!70 = distinct !DICompileUnit(language: DW_LANG_C99, file: !71, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !72, retainedTypes: !112, globals: !119)
!71 = !DIFile(filename: "src/expand-common.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!72 = !{!5, !73, !87, !96}
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !74, line: 32, size: 32, elements: !75)
!74 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!76 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!77 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!78 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!79 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!80 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!81 = !DIEnumerator(name: "c_quoting_style", value: 5)
!82 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!83 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!84 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!85 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!86 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 45, size: 32, elements: !89)
!88 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!89 = !{!90, !91, !92, !93, !94, !95}
!90 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!91 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!92 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!93 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!94 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!95 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !98, file: !97, line: 192, size: 32, elements: !110)
!97 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!98 = distinct !DISubprogram(name: "x2nrealloc", scope: !97, file: !97, line: 180, type: !99, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !70, variables: !105)
!99 = !DISubroutineType(types: !100)
!100 = !{!23, !23, !101, !102}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 62, baseType: !104)
!103 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!104 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!105 = !{!106, !107, !108, !109}
!106 = !DILocalVariable(name: "p", arg: 1, scope: !98, file: !97, line: 180, type: !23)
!107 = !DILocalVariable(name: "pn", arg: 2, scope: !98, file: !97, line: 180, type: !101)
!108 = !DILocalVariable(name: "s", arg: 3, scope: !98, file: !97, line: 180, type: !102)
!109 = !DILocalVariable(name: "n", scope: !98, file: !97, line: 182, type: !102)
!110 = !{!111}
!111 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!112 = !{!24, !25, !113, !114, !23, !115}
!113 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !116, line: 112, baseType: !117)
!116 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !118, line: 62, baseType: !104)
!118 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!119 = !{!68, !120, !122, !184, !186, !188, !190, !192, !194, !196, !199, !204}
!120 = !DIGlobalVariableExpression(var: !121)
!121 = distinct !DIGlobalVariable(name: "exit_status", scope: !70, file: !71, line: 68, type: !24, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123)
!123 = distinct !DIGlobalVariable(name: "prev_file", scope: !124, file: !71, line: 280, type: !21, isLocal: true, isDefinition: true)
!124 = distinct !DISubprogram(name: "next_file", scope: !71, file: !71, line: 278, type: !125, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, unit: !70, variables: !181)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !129, line: 7, baseType: !130)
!129 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !131, line: 241, size: 1728, elements: !132)
!131 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !153, !154, !155, !156, !159, !160, !162, !166, !169, !171, !172, !173, !174, !175, !176, !177}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !130, file: !131, line: 242, baseType: !24, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !130, file: !131, line: 247, baseType: !21, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !130, file: !131, line: 248, baseType: !21, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !130, file: !131, line: 249, baseType: !21, size: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !130, file: !131, line: 250, baseType: !21, size: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !130, file: !131, line: 251, baseType: !21, size: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !130, file: !131, line: 252, baseType: !21, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !130, file: !131, line: 253, baseType: !21, size: 64, offset: 448)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !130, file: !131, line: 254, baseType: !21, size: 64, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !130, file: !131, line: 256, baseType: !21, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !130, file: !131, line: 257, baseType: !21, size: 64, offset: 640)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !130, file: !131, line: 258, baseType: !21, size: 64, offset: 704)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !130, file: !131, line: 260, baseType: !146, size: 64, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !131, line: 156, size: 192, elements: !148)
!148 = !{!149, !150, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !147, file: !131, line: 157, baseType: !146, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !147, file: !131, line: 158, baseType: !151, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !147, file: !131, line: 162, baseType: !24, size: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !130, file: !131, line: 262, baseType: !151, size: 64, offset: 832)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !130, file: !131, line: 264, baseType: !24, size: 32, offset: 896)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !130, file: !131, line: 268, baseType: !24, size: 32, offset: 928)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !130, file: !131, line: 270, baseType: !157, size: 64, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !118, line: 140, baseType: !158)
!158 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !130, file: !131, line: 274, baseType: !25, size: 16, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !130, file: !131, line: 275, baseType: !161, size: 8, offset: 1040)
!161 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !130, file: !131, line: 276, baseType: !163, size: 8, offset: 1048)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 1)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !130, file: !131, line: 280, baseType: !167, size: 64, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !131, line: 150, baseType: null)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !130, file: !131, line: 289, baseType: !170, size: 64, offset: 1152)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !118, line: 141, baseType: !158)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !130, file: !131, line: 297, baseType: !23, size: 64, offset: 1216)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !130, file: !131, line: 298, baseType: !23, size: 64, offset: 1280)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !130, file: !131, line: 299, baseType: !23, size: 64, offset: 1344)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !130, file: !131, line: 300, baseType: !23, size: 64, offset: 1408)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !130, file: !131, line: 302, baseType: !102, size: 64, offset: 1472)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !130, file: !131, line: 303, baseType: !24, size: 32, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !130, file: !131, line: 305, baseType: !178, size: 160, offset: 1568)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 20)
!181 = !{!182, !183}
!182 = !DILocalVariable(name: "fp", arg: 1, scope: !124, file: !71, line: 278, type: !127)
!183 = !DILocalVariable(name: "file", scope: !124, file: !71, line: 281, type: !21)
!184 = !DIGlobalVariableExpression(var: !185)
!185 = distinct !DIGlobalVariable(name: "max_column_width", scope: !70, file: !71, line: 41, type: !102, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187)
!187 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !70, file: !71, line: 53, type: !102, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189)
!189 = distinct !DIGlobalVariable(name: "tab_list", scope: !70, file: !71, line: 46, type: !114, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191)
!191 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !70, file: !71, line: 49, type: !102, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "extend_size", scope: !70, file: !71, line: 38, type: !115, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195)
!195 = distinct !DIGlobalVariable(name: "tab_size", scope: !70, file: !71, line: 35, type: !115, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !70, file: !71, line: 65, type: !198, isLocal: true, isDefinition: true)
!198 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!199 = !DIGlobalVariableExpression(var: !200)
!200 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !70, file: !71, line: 59, type: !201, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 2)
!204 = !DIGlobalVariableExpression(var: !205)
!205 = distinct !DIGlobalVariable(name: "file_list", scope: !70, file: !71, line: 56, type: !206, isLocal: true, isDefinition: true)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!207 = !DIGlobalVariableExpression(var: !208)
!208 = distinct !DIGlobalVariable(name: "Version", scope: !209, file: !210, line: 2, type: !35, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, globals: !212)
!210 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!211 = !{}
!212 = !{!207}
!213 = !DIGlobalVariableExpression(var: !214)
!214 = distinct !DIGlobalVariable(name: "file_name", scope: !215, file: !220, line: 36, type: !35, isLocal: true, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, globals: !217)
!216 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!217 = !{!213, !218}
!218 = !DIGlobalVariableExpression(var: !219)
!219 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !215, file: !220, line: 46, type: !198, isLocal: true, isDefinition: true)
!220 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!221 = !DIGlobalVariableExpression(var: !222)
!222 = distinct !DIGlobalVariable(name: "exit_failure", scope: !223, file: !226, line: 24, type: !227, isLocal: false, isDefinition: true)
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !224, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, globals: !225)
!224 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!225 = !{!221}
!226 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!227 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !24)
!228 = !DIGlobalVariableExpression(var: !229)
!229 = distinct !DIGlobalVariable(name: "program_name", scope: !230, file: !234, line: 33, type: !35, isLocal: false, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !232, globals: !233)
!231 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!232 = !{!23, !21}
!233 = !{!228}
!234 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!235 = !DIGlobalVariableExpression(var: !236)
!236 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !237, file: !249, line: 77, type: !284, isLocal: false, isDefinition: true)
!237 = distinct !DICompileUnit(language: DW_LANG_C99, file: !238, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !239, retainedTypes: !245, globals: !246)
!238 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!239 = !{!73, !240, !5}
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !74, line: 242, size: 32, elements: !241)
!241 = !{!242, !243, !244}
!242 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!243 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!244 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!245 = !{!24, !25, !102, !21}
!246 = !{!235, !247, !254, !266, !268, !273, !280, !282}
!247 = !DIGlobalVariableExpression(var: !248)
!248 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !237, file: !249, line: 93, type: !250, isLocal: false, isDefinition: true)
!249 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 320, elements: !252)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!252 = !{!253}
!253 = !DISubrange(count: 10)
!254 = !DIGlobalVariableExpression(var: !255)
!255 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !237, file: !249, line: 1043, type: !256, isLocal: false, isDefinition: true)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !249, line: 57, size: 448, elements: !257)
!257 = !{!258, !259, !260, !264, !265}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !256, file: !249, line: 60, baseType: !73, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !256, file: !249, line: 63, baseType: !24, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !256, file: !249, line: 67, baseType: !261, size: 256, offset: 64)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 256, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !256, file: !249, line: 70, baseType: !35, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !256, file: !249, line: 73, baseType: !35, size: 64, offset: 384)
!266 = !DIGlobalVariableExpression(var: !267)
!267 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !237, file: !249, line: 108, type: !256, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269)
!269 = distinct !DIGlobalVariable(name: "slot0", scope: !237, file: !249, line: 834, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 256)
!273 = !DIGlobalVariableExpression(var: !274)
!274 = distinct !DIGlobalVariable(name: "slotvec", scope: !237, file: !249, line: 837, type: !275, isLocal: true, isDefinition: true)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !249, line: 826, size: 128, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !276, file: !249, line: 828, baseType: !102, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !276, file: !249, line: 829, baseType: !21, size: 64, offset: 64)
!280 = !DIGlobalVariableExpression(var: !281)
!281 = distinct !DIGlobalVariable(name: "nslots", scope: !237, file: !249, line: 835, type: !24, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283)
!283 = distinct !DIGlobalVariable(name: "slotvec0", scope: !237, file: !249, line: 836, type: !276, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 704, elements: !286)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!286 = !{!287}
!287 = !DISubrange(count: 11)
!288 = !DIGlobalVariableExpression(var: !289)
!289 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !290, file: !293, line: 26, type: !294, isLocal: false, isDefinition: true)
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, globals: !292)
!291 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!292 = !{!288}
!293 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 376, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 47)
!297 = !DIGlobalVariableExpression(var: !298)
!298 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !299, file: !642, line: 120, type: !643, isLocal: true, isDefinition: true)
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !301, retainedTypes: !640, globals: !641)
!300 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!301 = !{!302}
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 41, size: 32, elements: !304)
!303 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!305 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!306 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!307 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!308 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!309 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!310 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!311 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!312 = !DIEnumerator(name: "DAY_1", value: 131079)
!313 = !DIEnumerator(name: "DAY_2", value: 131080)
!314 = !DIEnumerator(name: "DAY_3", value: 131081)
!315 = !DIEnumerator(name: "DAY_4", value: 131082)
!316 = !DIEnumerator(name: "DAY_5", value: 131083)
!317 = !DIEnumerator(name: "DAY_6", value: 131084)
!318 = !DIEnumerator(name: "DAY_7", value: 131085)
!319 = !DIEnumerator(name: "ABMON_1", value: 131086)
!320 = !DIEnumerator(name: "ABMON_2", value: 131087)
!321 = !DIEnumerator(name: "ABMON_3", value: 131088)
!322 = !DIEnumerator(name: "ABMON_4", value: 131089)
!323 = !DIEnumerator(name: "ABMON_5", value: 131090)
!324 = !DIEnumerator(name: "ABMON_6", value: 131091)
!325 = !DIEnumerator(name: "ABMON_7", value: 131092)
!326 = !DIEnumerator(name: "ABMON_8", value: 131093)
!327 = !DIEnumerator(name: "ABMON_9", value: 131094)
!328 = !DIEnumerator(name: "ABMON_10", value: 131095)
!329 = !DIEnumerator(name: "ABMON_11", value: 131096)
!330 = !DIEnumerator(name: "ABMON_12", value: 131097)
!331 = !DIEnumerator(name: "MON_1", value: 131098)
!332 = !DIEnumerator(name: "MON_2", value: 131099)
!333 = !DIEnumerator(name: "MON_3", value: 131100)
!334 = !DIEnumerator(name: "MON_4", value: 131101)
!335 = !DIEnumerator(name: "MON_5", value: 131102)
!336 = !DIEnumerator(name: "MON_6", value: 131103)
!337 = !DIEnumerator(name: "MON_7", value: 131104)
!338 = !DIEnumerator(name: "MON_8", value: 131105)
!339 = !DIEnumerator(name: "MON_9", value: 131106)
!340 = !DIEnumerator(name: "MON_10", value: 131107)
!341 = !DIEnumerator(name: "MON_11", value: 131108)
!342 = !DIEnumerator(name: "MON_12", value: 131109)
!343 = !DIEnumerator(name: "AM_STR", value: 131110)
!344 = !DIEnumerator(name: "PM_STR", value: 131111)
!345 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!346 = !DIEnumerator(name: "D_FMT", value: 131113)
!347 = !DIEnumerator(name: "T_FMT", value: 131114)
!348 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!349 = !DIEnumerator(name: "ERA", value: 131116)
!350 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!351 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!352 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!353 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!354 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!355 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!356 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!357 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!358 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!359 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!360 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!361 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!362 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!363 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!364 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!365 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!366 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!367 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!368 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!369 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!370 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!371 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!372 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!373 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!374 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!375 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!376 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!377 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!378 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!379 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!380 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!381 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!382 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!383 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!384 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!385 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!386 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!387 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!388 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!389 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!390 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!391 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!392 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!393 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!394 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!395 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!396 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!397 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!398 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!399 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!400 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!401 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!402 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!403 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!404 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!405 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!406 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!407 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!408 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!409 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!410 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!411 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!412 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!413 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!414 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!415 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!416 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!417 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!418 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!419 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!420 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!421 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!422 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!423 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!424 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!425 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!426 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!427 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!428 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!429 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!430 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!431 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!432 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!433 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!434 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!435 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!436 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!437 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!438 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!439 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!440 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!441 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!442 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!443 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!444 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!445 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!446 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!447 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!448 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!449 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!450 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!451 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!452 = !DIEnumerator(name: "CODESET", value: 14)
!453 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!454 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!455 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!456 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!457 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!458 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!459 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!460 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!461 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!462 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!463 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!464 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!465 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!466 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!467 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!468 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!469 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!470 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!471 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!472 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!473 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!474 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!475 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!476 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!477 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!478 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!479 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!480 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!481 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!482 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!483 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!484 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!485 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!486 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!487 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!488 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!489 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!490 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!491 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!492 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!493 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!494 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!495 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!496 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!497 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!498 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!499 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!500 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!501 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!502 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!503 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!504 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!505 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!506 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!507 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!508 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!509 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!510 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!511 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!512 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!513 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!514 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!515 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!516 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!517 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!518 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!519 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!520 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!521 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!522 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!523 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!524 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!525 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!526 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!527 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!528 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!529 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!530 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!531 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!532 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!533 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!534 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!535 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!536 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!537 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!538 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!539 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!540 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!541 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!542 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!543 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!544 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!545 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!546 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!547 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!548 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!549 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!550 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!551 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!552 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!553 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!554 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!555 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!556 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!557 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!558 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!559 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!560 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!561 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!562 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!563 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!564 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!565 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!566 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!567 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!568 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!569 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!570 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!571 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!572 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!573 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!574 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!575 = !DIEnumerator(name: "THOUSEP", value: 65537)
!576 = !DIEnumerator(name: "__GROUPING", value: 65538)
!577 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!578 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!579 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!580 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!581 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!582 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!583 = !DIEnumerator(name: "__YESSTR", value: 327682)
!584 = !DIEnumerator(name: "__NOSTR", value: 327683)
!585 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!586 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!587 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!588 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!589 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!590 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!591 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!592 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!593 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!594 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!595 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!596 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!597 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!598 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!599 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!600 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!601 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!602 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!603 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!604 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!605 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!606 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!607 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!608 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!609 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!610 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!611 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!612 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!613 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!614 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!615 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!616 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!617 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!618 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!619 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!620 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!621 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!622 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!623 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!624 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!625 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!626 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!627 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!628 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!629 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!630 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!631 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!632 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!633 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!634 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!635 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!636 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!637 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!638 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!639 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!640 = !{!23, !21, !26}
!641 = !{!297}
!642 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!643 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !35)
!644 = distinct !DICompileUnit(language: DW_LANG_C99, file: !645, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !646)
!645 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!646 = !{!87}
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !649, retainedTypes: !654)
!648 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!649 = !{!650}
!650 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !651, line: 41, size: 32, elements: !652)
!651 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!652 = !{!653}
!653 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!654 = !{!23}
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !657, retainedTypes: !665)
!656 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!657 = !{!658}
!658 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !659, file: !97, line: 192, size: 32, elements: !110)
!659 = distinct !DISubprogram(name: "x2nrealloc", scope: !97, file: !97, line: 180, type: !99, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !655, variables: !660)
!660 = !{!661, !662, !663, !664}
!661 = !DILocalVariable(name: "p", arg: 1, scope: !659, file: !97, line: 180, type: !23)
!662 = !DILocalVariable(name: "pn", arg: 2, scope: !659, file: !97, line: 180, type: !101)
!663 = !DILocalVariable(name: "s", arg: 3, scope: !659, file: !97, line: 180, type: !102)
!664 = !DILocalVariable(name: "n", scope: !659, file: !97, line: 182, type: !102)
!665 = !{!102, !21, !23}
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211)
!667 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211)
!669 = !DIFile(filename: "./lib/xstrndup.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !654)
!671 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211)
!673 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !654)
!675 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !654)
!677 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!678 = distinct !DICompileUnit(language: DW_LANG_C99, file: !679, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !680)
!679 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!680 = !{!102}
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211)
!682 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211)
!684 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!685 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!686 = !{i32 2, !"Dwarf Version", i32 4}
!687 = !{i32 2, !"Debug Info Version", i32 3}
!688 = !{i32 1, !"wchar_size", i32 4}
!689 = !{i32 7, !"PIC Level", i32 2}
!690 = !{i32 7, !"PIE Level", i32 2}
!691 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 63, type: !692, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !694)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !24}
!694 = !{!695}
!695 = !DILocalVariable(name: "status", arg: 1, scope: !691, file: !3, line: 63, type: !24)
!696 = !DIExpression()
!697 = !DILocation(line: 63, column: 12, scope: !691)
!698 = !DILocation(line: 65, column: 14, scope: !699)
!699 = distinct !DILexicalBlock(scope: !691, file: !3, line: 65, column: 7)
!700 = !DILocation(line: 65, column: 7, scope: !691)
!701 = !DILocation(line: 66, column: 5, scope: !702)
!702 = distinct !DILexicalBlock(scope: !699, file: !3, line: 66, column: 5)
!703 = !{!704, !704, i64 0}
!704 = !{!"any pointer", !705, i64 0}
!705 = !{!"omnipotent char", !706, i64 0}
!706 = !{!"Simple C/C++ TBAA"}
!707 = !DILocation(line: 69, column: 7, scope: !708)
!708 = distinct !DILexicalBlock(scope: !699, file: !3, line: 68, column: 5)
!709 = !DILocation(line: 73, column: 7, scope: !708)
!710 = !DILocation(line: 580, column: 3, scope: !711, inlinedAt: !714)
!711 = distinct !DISubprogram(name: "emit_stdin_note", scope: !32, file: !32, line: 578, type: !712, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !211)
!712 = !DISubroutineType(types: !713)
!713 = !{null}
!714 = distinct !DILocation(line: 77, column: 7, scope: !708)
!715 = !DILocation(line: 587, column: 3, scope: !716, inlinedAt: !717)
!716 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !32, file: !32, line: 585, type: !712, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !211)
!717 = distinct !DILocation(line: 78, column: 7, scope: !708)
!718 = !DILocation(line: 80, column: 7, scope: !708)
!719 = !DILocation(line: 84, column: 7, scope: !708)
!720 = !DILocation(line: 87, column: 7, scope: !708)
!721 = !DILocation(line: 88, column: 7, scope: !708)
!722 = !DILocation(line: 642, column: 15, scope: !31, inlinedAt: !723)
!723 = distinct !DILocation(line: 89, column: 7, scope: !708)
!724 = !DILocation(line: 651, column: 3, scope: !31, inlinedAt: !723)
!725 = !DILocation(line: 655, column: 29, scope: !31, inlinedAt: !723)
!726 = !DILocation(line: 655, column: 15, scope: !31, inlinedAt: !723)
!727 = !DILocation(line: 656, column: 7, scope: !728, inlinedAt: !723)
!728 = distinct !DILexicalBlock(scope: !31, file: !32, line: 656, column: 7)
!729 = !DILocation(line: 656, column: 19, scope: !728, inlinedAt: !723)
!730 = !DILocation(line: 656, column: 22, scope: !728, inlinedAt: !723)
!731 = !DILocation(line: 656, column: 7, scope: !31, inlinedAt: !723)
!732 = !DILocation(line: 662, column: 7, scope: !733, inlinedAt: !723)
!733 = distinct !DILexicalBlock(scope: !728, file: !32, line: 657, column: 5)
!734 = !DILocation(line: 664, column: 5, scope: !733, inlinedAt: !723)
!735 = !DILocation(line: 665, column: 3, scope: !31, inlinedAt: !723)
!736 = !DILocation(line: 667, column: 3, scope: !31, inlinedAt: !723)
!737 = !DILocation(line: 91, column: 3, scope: !691)
!738 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 184, type: !739, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !741)
!739 = !DISubroutineType(types: !740)
!740 = !{!24, !24, !206}
!741 = !{!742, !743, !744, !745}
!742 = !DILocalVariable(name: "argc", arg: 1, scope: !738, file: !3, line: 184, type: !24)
!743 = !DILocalVariable(name: "argv", arg: 2, scope: !738, file: !3, line: 184, type: !206)
!744 = !DILocalVariable(name: "c", scope: !738, file: !3, line: 186, type: !24)
!745 = !DILocalVariable(name: "tab_stop", scope: !746, file: !3, line: 215, type: !750)
!746 = distinct !DILexicalBlock(scope: !747, file: !3, line: 214, column: 13)
!747 = distinct !DILexicalBlock(scope: !748, file: !3, line: 211, column: 15)
!748 = distinct !DILexicalBlock(scope: !749, file: !3, line: 200, column: 9)
!749 = distinct !DILexicalBlock(scope: !738, file: !3, line: 198, column: 5)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 16, elements: !202)
!751 = !DILocation(line: 184, column: 11, scope: !738)
!752 = !DILocation(line: 184, column: 24, scope: !738)
!753 = !DILocation(line: 189, column: 21, scope: !738)
!754 = !DILocation(line: 189, column: 3, scope: !738)
!755 = !DILocation(line: 190, column: 3, scope: !738)
!756 = !DILocation(line: 191, column: 3, scope: !738)
!757 = !DILocation(line: 192, column: 3, scope: !738)
!758 = !DILocation(line: 194, column: 3, scope: !738)
!759 = !DILocation(line: 195, column: 23, scope: !738)
!760 = !{!761, !761, i64 0}
!761 = !{!"_Bool", !705, i64 0}
!762 = !DILocation(line: 197, column: 3, scope: !738)
!763 = !DILocation(line: 197, column: 15, scope: !738)
!764 = !DILocation(line: 186, column: 7, scope: !738)
!765 = !DILocation(line: 202, column: 31, scope: !748)
!766 = !DILocation(line: 203, column: 11, scope: !748)
!767 = !DILocation(line: 206, column: 28, scope: !748)
!768 = !DILocation(line: 206, column: 11, scope: !748)
!769 = !DILocation(line: 207, column: 11, scope: !748)
!770 = !DILocation(line: 211, column: 15, scope: !747)
!771 = !DILocation(line: 211, column: 15, scope: !748)
!772 = !DILocation(line: 212, column: 37, scope: !747)
!773 = !DILocation(line: 212, column: 13, scope: !747)
!774 = distinct !{!774, !762, !775}
!775 = !DILocation(line: 229, column: 5, scope: !738)
!776 = !DILocation(line: 215, column: 15, scope: !746)
!777 = !DILocation(line: 215, column: 20, scope: !746)
!778 = !DILocation(line: 216, column: 29, scope: !746)
!779 = !DILocation(line: 216, column: 27, scope: !746)
!780 = !{!705, !705, i64 0}
!781 = !DILocation(line: 217, column: 27, scope: !746)
!782 = !DILocation(line: 218, column: 15, scope: !746)
!783 = !DILocation(line: 219, column: 13, scope: !747)
!784 = !DILocation(line: 222, column: 9, scope: !748)
!785 = !DILocation(line: 224, column: 9, scope: !748)
!786 = !DILocation(line: 227, column: 11, scope: !748)
!787 = !DILocation(line: 231, column: 3, scope: !738)
!788 = !DILocation(line: 233, column: 20, scope: !738)
!789 = !{!790, !790, i64 0}
!790 = !{!"int", !705, i64 0}
!791 = !DILocation(line: 233, column: 27, scope: !738)
!792 = !DILocation(line: 233, column: 38, scope: !738)
!793 = !DILocation(line: 233, column: 19, scope: !738)
!794 = !DILocation(line: 233, column: 3, scope: !738)
!795 = !DILocation(line: 102, column: 14, scope: !796, inlinedAt: !851)
!796 = distinct !DISubprogram(name: "expand", scope: !3, file: !3, line: 99, type: !712, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !797)
!797 = !{!798, !839, !841, !842, !843, !844, !850}
!798 = !DILocalVariable(name: "fp", scope: !796, file: !3, line: 102, type: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !129, line: 7, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !131, line: 241, size: 1728, elements: !802)
!802 = !{!803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !801, file: !131, line: 242, baseType: !24, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !801, file: !131, line: 247, baseType: !21, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !801, file: !131, line: 248, baseType: !21, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !801, file: !131, line: 249, baseType: !21, size: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !801, file: !131, line: 250, baseType: !21, size: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !801, file: !131, line: 251, baseType: !21, size: 64, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !801, file: !131, line: 252, baseType: !21, size: 64, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !801, file: !131, line: 253, baseType: !21, size: 64, offset: 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !801, file: !131, line: 254, baseType: !21, size: 64, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !801, file: !131, line: 256, baseType: !21, size: 64, offset: 576)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !801, file: !131, line: 257, baseType: !21, size: 64, offset: 640)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !801, file: !131, line: 258, baseType: !21, size: 64, offset: 704)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !801, file: !131, line: 260, baseType: !816, size: 64, offset: 768)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !131, line: 156, size: 192, elements: !818)
!818 = !{!819, !820, !822}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !817, file: !131, line: 157, baseType: !816, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !817, file: !131, line: 158, baseType: !821, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !817, file: !131, line: 162, baseType: !24, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !801, file: !131, line: 262, baseType: !821, size: 64, offset: 832)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !801, file: !131, line: 264, baseType: !24, size: 32, offset: 896)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !801, file: !131, line: 268, baseType: !24, size: 32, offset: 928)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !801, file: !131, line: 270, baseType: !157, size: 64, offset: 960)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !801, file: !131, line: 274, baseType: !25, size: 16, offset: 1024)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !801, file: !131, line: 275, baseType: !161, size: 8, offset: 1040)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !801, file: !131, line: 276, baseType: !163, size: 8, offset: 1048)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !801, file: !131, line: 280, baseType: !167, size: 64, offset: 1088)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !801, file: !131, line: 289, baseType: !170, size: 64, offset: 1152)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !801, file: !131, line: 297, baseType: !23, size: 64, offset: 1216)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !801, file: !131, line: 298, baseType: !23, size: 64, offset: 1280)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !801, file: !131, line: 299, baseType: !23, size: 64, offset: 1344)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !801, file: !131, line: 300, baseType: !23, size: 64, offset: 1408)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !801, file: !131, line: 302, baseType: !102, size: 64, offset: 1472)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !801, file: !131, line: 303, baseType: !24, size: 32, offset: 1536)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !801, file: !131, line: 305, baseType: !178, size: 160, offset: 1568)
!839 = !DILocalVariable(name: "c", scope: !840, file: !3, line: 110, type: !24)
!840 = distinct !DILexicalBlock(scope: !796, file: !3, line: 108, column: 5)
!841 = !DILocalVariable(name: "convert", scope: !840, file: !3, line: 113, type: !198)
!842 = !DILocalVariable(name: "column", scope: !840, file: !3, line: 120, type: !115)
!843 = !DILocalVariable(name: "tab_index", scope: !840, file: !3, line: 123, type: !102)
!844 = !DILocalVariable(name: "next_tab_column", scope: !845, file: !3, line: 138, type: !115)
!845 = distinct !DILexicalBlock(scope: !846, file: !3, line: 136, column: 17)
!846 = distinct !DILexicalBlock(scope: !847, file: !3, line: 135, column: 19)
!847 = distinct !DILexicalBlock(scope: !848, file: !3, line: 134, column: 13)
!848 = distinct !DILexicalBlock(scope: !849, file: !3, line: 133, column: 15)
!849 = distinct !DILexicalBlock(scope: !840, file: !3, line: 129, column: 9)
!850 = !DILocalVariable(name: "last_tab", scope: !845, file: !3, line: 139, type: !198)
!851 = distinct !DILocation(line: 235, column: 3, scope: !738)
!852 = !DILocation(line: 102, column: 9, scope: !796, inlinedAt: !851)
!853 = !DILocation(line: 104, column: 8, scope: !854, inlinedAt: !851)
!854 = distinct !DILexicalBlock(scope: !796, file: !3, line: 104, column: 7)
!855 = !DILocation(line: 104, column: 7, scope: !796, inlinedAt: !851)
!856 = !DILocation(line: 107, column: 3, scope: !796, inlinedAt: !851)
!857 = !DILocation(line: 113, column: 12, scope: !840, inlinedAt: !851)
!858 = !DILocation(line: 120, column: 17, scope: !840, inlinedAt: !851)
!859 = !DILocation(line: 123, column: 7, scope: !840, inlinedAt: !851)
!860 = !DILocation(line: 123, column: 14, scope: !840, inlinedAt: !851)
!861 = !{!862, !862, i64 0}
!862 = !{!"long", !705, i64 0}
!863 = !DILocation(line: 128, column: 7, scope: !840, inlinedAt: !851)
!864 = distinct !{!864, !865, !866}
!865 = !DILocation(line: 128, column: 7, scope: !840)
!866 = !DILocation(line: 179, column: 23, scope: !840)
!867 = !DILocalVariable(name: "__fp", arg: 1, scope: !868, file: !869, line: 63, type: !799)
!868 = distinct !DISubprogram(name: "getc_unlocked", scope: !869, file: !869, line: 63, type: !870, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !872)
!869 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!870 = !DISubroutineType(types: !871)
!871 = !{!24, !799}
!872 = !{!867}
!873 = !DILocation(line: 63, column: 22, scope: !868, inlinedAt: !874)
!874 = distinct !DILocation(line: 130, column: 23, scope: !849, inlinedAt: !851)
!875 = !DILocation(line: 65, column: 10, scope: !868, inlinedAt: !874)
!876 = !{!877, !704, i64 8}
!877 = !{!"_IO_FILE", !790, i64 0, !704, i64 8, !704, i64 16, !704, i64 24, !704, i64 32, !704, i64 40, !704, i64 48, !704, i64 56, !704, i64 64, !704, i64 72, !704, i64 80, !704, i64 88, !704, i64 96, !704, i64 104, !790, i64 112, !790, i64 116, !862, i64 120, !878, i64 128, !705, i64 130, !705, i64 131, !704, i64 136, !862, i64 144, !704, i64 152, !704, i64 160, !704, i64 168, !704, i64 176, !862, i64 184, !790, i64 192, !705, i64 196}
!878 = !{!"short", !705, i64 0}
!879 = !{!877, !704, i64 16}
!880 = !{!"branch_weights", i32 2000, i32 1}
!881 = distinct !{!881, !882, !883}
!882 = !DILocation(line: 130, column: 11, scope: !849)
!883 = !DILocation(line: 131, column: 13, scope: !849)
!884 = !DILocation(line: 110, column: 11, scope: !840, inlinedAt: !851)
!885 = !DILocation(line: 130, column: 38, scope: !849, inlinedAt: !851)
!886 = !DILocation(line: 130, column: 34, scope: !849, inlinedAt: !851)
!887 = !DILocation(line: 130, column: 47, scope: !849, inlinedAt: !851)
!888 = !DILocation(line: 130, column: 11, scope: !849, inlinedAt: !851)
!889 = !DILocation(line: 133, column: 15, scope: !848, inlinedAt: !851)
!890 = !DILocation(line: 133, column: 15, scope: !849, inlinedAt: !851)
!891 = !DILocation(line: 135, column: 19, scope: !847, inlinedAt: !851)
!892 = !DILocation(line: 139, column: 24, scope: !845, inlinedAt: !851)
!893 = !DILocation(line: 139, column: 19, scope: !845, inlinedAt: !851)
!894 = !DILocation(line: 141, column: 37, scope: !845, inlinedAt: !851)
!895 = !DILocation(line: 138, column: 29, scope: !845, inlinedAt: !851)
!896 = !DILocation(line: 144, column: 23, scope: !897, inlinedAt: !851)
!897 = distinct !DILexicalBlock(scope: !845, file: !3, line: 144, column: 23)
!898 = !{i8 0, i8 2}
!899 = !DILocation(line: 145, column: 46, scope: !897, inlinedAt: !851)
!900 = !DILocation(line: 144, column: 23, scope: !845, inlinedAt: !851)
!901 = !DILocation(line: 147, column: 39, scope: !902, inlinedAt: !851)
!902 = distinct !DILexicalBlock(scope: !845, file: !3, line: 147, column: 23)
!903 = !DILocation(line: 147, column: 23, scope: !845, inlinedAt: !851)
!904 = !DILocation(line: 148, column: 21, scope: !902, inlinedAt: !851)
!905 = !DILocation(line: 150, column: 35, scope: !845, inlinedAt: !851)
!906 = !DILocation(line: 150, column: 19, scope: !845, inlinedAt: !851)
!907 = !DILocation(line: 107, column: 10, scope: !908, inlinedAt: !913)
!908 = distinct !DISubprogram(name: "putchar_unlocked", scope: !869, file: !869, line: 105, type: !909, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !911)
!909 = !DISubroutineType(types: !910)
!910 = !{!24, !24}
!911 = !{!912}
!912 = !DILocalVariable(name: "__c", arg: 1, scope: !908, file: !869, line: 105, type: !24)
!913 = distinct !DILocation(line: 151, column: 25, scope: !914, inlinedAt: !851)
!914 = distinct !DILexicalBlock(scope: !845, file: !3, line: 151, column: 25)
!915 = !DILocation(line: 105, column: 23, scope: !908, inlinedAt: !913)
!916 = !{!877, !704, i64 40}
!917 = !{!877, !704, i64 48}
!918 = !DILocation(line: 151, column: 25, scope: !845, inlinedAt: !851)
!919 = !DILocation(line: 151, column: 39, scope: !914, inlinedAt: !851)
!920 = !DILocation(line: 152, column: 23, scope: !914, inlinedAt: !851)
!921 = !DILocation(line: 150, column: 26, scope: !845, inlinedAt: !851)
!922 = distinct !{!922, !923, !924}
!923 = !DILocation(line: 150, column: 19, scope: !845)
!924 = !DILocation(line: 152, column: 23, scope: !845)
!925 = !DILocation(line: 155, column: 17, scope: !846, inlinedAt: !851)
!926 = !DILocation(line: 155, column: 17, scope: !845, inlinedAt: !851)
!927 = !DILocation(line: 160, column: 30, scope: !928, inlinedAt: !851)
!928 = distinct !DILexicalBlock(scope: !929, file: !3, line: 157, column: 17)
!929 = distinct !DILexicalBlock(scope: !846, file: !3, line: 156, column: 24)
!930 = !DILocation(line: 160, column: 29, scope: !928, inlinedAt: !851)
!931 = !DILocation(line: 160, column: 26, scope: !928, inlinedAt: !851)
!932 = !DILocation(line: 161, column: 34, scope: !928, inlinedAt: !851)
!933 = !DILocation(line: 161, column: 33, scope: !928, inlinedAt: !851)
!934 = !DILocation(line: 161, column: 32, scope: !928, inlinedAt: !851)
!935 = !DILocation(line: 161, column: 29, scope: !928, inlinedAt: !851)
!936 = !DILocation(line: 162, column: 17, scope: !928, inlinedAt: !851)
!937 = !DILocation(line: 165, column: 25, scope: !938, inlinedAt: !851)
!938 = distinct !DILexicalBlock(scope: !929, file: !3, line: 164, column: 17)
!939 = !DILocation(line: 166, column: 24, scope: !940, inlinedAt: !851)
!940 = distinct !DILexicalBlock(scope: !938, file: !3, line: 166, column: 23)
!941 = !DILocation(line: 166, column: 23, scope: !938, inlinedAt: !851)
!942 = !DILocation(line: 167, column: 21, scope: !940, inlinedAt: !851)
!943 = !DILocation(line: 170, column: 26, scope: !847, inlinedAt: !851)
!944 = !DILocation(line: 170, column: 46, scope: !847, inlinedAt: !851)
!945 = !DILocation(line: 170, column: 52, scope: !847, inlinedAt: !851)
!946 = !{!878, !878, i64 0}
!947 = !DILocation(line: 170, column: 50, scope: !847, inlinedAt: !851)
!948 = !DILocation(line: 170, column: 23, scope: !847, inlinedAt: !851)
!949 = !DILocation(line: 171, column: 13, scope: !847, inlinedAt: !851)
!950 = !DILocation(line: 173, column: 17, scope: !951, inlinedAt: !851)
!951 = distinct !DILexicalBlock(scope: !849, file: !3, line: 173, column: 15)
!952 = !DILocation(line: 173, column: 15, scope: !849, inlinedAt: !851)
!953 = !DILocation(line: 105, column: 23, scope: !908, inlinedAt: !954)
!954 = distinct !DILocation(line: 176, column: 15, scope: !955, inlinedAt: !851)
!955 = distinct !DILexicalBlock(scope: !849, file: !3, line: 176, column: 15)
!956 = !DILocation(line: 107, column: 10, scope: !908, inlinedAt: !954)
!957 = !DILocation(line: 176, column: 15, scope: !849, inlinedAt: !851)
!958 = !DILocation(line: 176, column: 27, scope: !955, inlinedAt: !851)
!959 = !DILocation(line: 177, column: 13, scope: !955, inlinedAt: !851)
!960 = !DILocation(line: 179, column: 16, scope: !840, inlinedAt: !851)
!961 = !DILocation(line: 178, column: 9, scope: !849, inlinedAt: !851)
!962 = !DILocation(line: 180, column: 5, scope: !796, inlinedAt: !851)
!963 = distinct !{!963, !964, !965}
!964 = !DILocation(line: 107, column: 3, scope: !796)
!965 = !DILocation(line: 180, column: 5, scope: !796)
!966 = !DILocation(line: 237, column: 3, scope: !738)
!967 = !DILocation(line: 239, column: 10, scope: !738)
!968 = !DILocation(line: 239, column: 3, scope: !738)
!969 = distinct !DISubprogram(name: "add_tab_stop", scope: !71, file: !71, line: 74, type: !970, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, unit: !70, variables: !972)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !115}
!972 = !{!973, !974, !975}
!973 = !DILocalVariable(name: "tabval", arg: 1, scope: !969, file: !71, line: 74, type: !115)
!974 = !DILocalVariable(name: "prev_column", scope: !969, file: !71, line: 76, type: !115)
!975 = !DILocalVariable(name: "column_width", scope: !969, file: !71, line: 77, type: !115)
!976 = !DILocation(line: 74, column: 25, scope: !969)
!977 = !DILocation(line: 76, column: 27, scope: !969)
!978 = !DILocation(line: 76, column: 44, scope: !969)
!979 = !DILocation(line: 76, column: 68, scope: !969)
!980 = !DILocation(line: 76, column: 13, scope: !969)
!981 = !DILocation(line: 77, column: 40, scope: !969)
!982 = !DILocation(line: 77, column: 59, scope: !969)
!983 = !DILocation(line: 77, column: 28, scope: !969)
!984 = !DILocation(line: 77, column: 13, scope: !969)
!985 = !DILocation(line: 79, column: 25, scope: !986)
!986 = distinct !DILexicalBlock(scope: !969, file: !71, line: 79, column: 7)
!987 = !DILocation(line: 79, column: 22, scope: !986)
!988 = !DILocation(line: 79, column: 7, scope: !969)
!989 = !DILocation(line: 81, column: 3, scope: !969)
!990 = !DILocation(line: 80, column: 16, scope: !986)
!991 = !DILocation(line: 180, column: 19, scope: !98, inlinedAt: !992)
!992 = distinct !DILocation(line: 80, column: 16, scope: !986)
!993 = !DILocation(line: 180, column: 30, scope: !98, inlinedAt: !992)
!994 = !DILocation(line: 180, column: 41, scope: !98, inlinedAt: !992)
!995 = !DILocation(line: 182, column: 10, scope: !98, inlinedAt: !992)
!996 = !DILocation(line: 184, column: 9, scope: !997, inlinedAt: !992)
!997 = distinct !DILexicalBlock(scope: !98, file: !97, line: 184, column: 7)
!998 = !DILocation(line: 184, column: 7, scope: !98, inlinedAt: !992)
!999 = !DILocation(line: 186, column: 11, scope: !1000, inlinedAt: !992)
!1000 = distinct !DILexicalBlock(scope: !997, file: !97, line: 185, column: 5)
!1001 = !DILocation(line: 205, column: 11, scope: !1002, inlinedAt: !992)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !97, line: 204, column: 11)
!1003 = distinct !DILexicalBlock(scope: !997, file: !97, line: 199, column: 5)
!1004 = !DILocation(line: 204, column: 11, scope: !1003, inlinedAt: !992)
!1005 = !DILocation(line: 206, column: 9, scope: !1002, inlinedAt: !992)
!1006 = !DILocation(line: 207, column: 14, scope: !1003, inlinedAt: !992)
!1007 = !DILocation(line: 207, column: 18, scope: !1003, inlinedAt: !992)
!1008 = !DILocation(line: 207, column: 9, scope: !1003, inlinedAt: !992)
!1009 = !DILocation(line: 210, column: 7, scope: !98, inlinedAt: !992)
!1010 = !DILocation(line: 211, column: 25, scope: !98, inlinedAt: !992)
!1011 = !DILocation(line: 211, column: 10, scope: !98, inlinedAt: !992)
!1012 = !DILocation(line: 80, column: 14, scope: !986)
!1013 = !DILocation(line: 80, column: 5, scope: !986)
!1014 = !DILocation(line: 81, column: 26, scope: !969)
!1015 = !DILocation(line: 81, column: 30, scope: !969)
!1016 = !DILocation(line: 83, column: 7, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !969, file: !71, line: 83, column: 7)
!1018 = !DILocation(line: 83, column: 24, scope: !1017)
!1019 = !DILocation(line: 83, column: 7, scope: !969)
!1020 = !DILocation(line: 87, column: 24, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1017, file: !71, line: 84, column: 5)
!1022 = !DILocation(line: 88, column: 5, scope: !1021)
!1023 = !DILocation(line: 89, column: 1, scope: !969)
!1024 = distinct !DISubprogram(name: "parse_tab_stops", scope: !71, file: !71, line: 111, type: !33, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !70, variables: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032, !1042}
!1026 = !DILocalVariable(name: "stops", arg: 1, scope: !1024, file: !71, line: 111, type: !35)
!1027 = !DILocalVariable(name: "have_tabval", scope: !1024, file: !71, line: 113, type: !198)
!1028 = !DILocalVariable(name: "tabval", scope: !1024, file: !71, line: 114, type: !115)
!1029 = !DILocalVariable(name: "extend_tabval", scope: !1024, file: !71, line: 115, type: !198)
!1030 = !DILocalVariable(name: "num_start", scope: !1024, file: !71, line: 116, type: !35)
!1031 = !DILocalVariable(name: "ok", scope: !1024, file: !71, line: 117, type: !198)
!1032 = !DILocalVariable(name: "len", scope: !1033, file: !71, line: 160, type: !102)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !71, line: 159, column: 13)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !71, line: 158, column: 15)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !71, line: 149, column: 9)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !71, line: 148, column: 16)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !71, line: 138, column: 16)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !71, line: 121, column: 11)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !71, line: 120, column: 5)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !71, line: 119, column: 3)
!1041 = distinct !DILexicalBlock(scope: !1024, file: !71, line: 119, column: 3)
!1042 = !DILocalVariable(name: "bad_num", scope: !1033, file: !71, line: 161, type: !21)
!1043 = !DILocation(line: 111, column: 30, scope: !1024)
!1044 = !DILocation(line: 113, column: 8, scope: !1024)
!1045 = !DILocation(line: 114, column: 13, scope: !1024)
!1046 = !DILocation(line: 115, column: 8, scope: !1024)
!1047 = !DILocation(line: 116, column: 15, scope: !1024)
!1048 = !DILocation(line: 117, column: 8, scope: !1024)
!1049 = !DILocation(line: 119, column: 3, scope: !1024)
!1050 = !DILocation(line: 119, column: 10, scope: !1040)
!1051 = !DILocation(line: 119, column: 3, scope: !1041)
!1052 = !DILocation(line: 121, column: 28, scope: !1038)
!1053 = !DILocation(line: 121, column: 11, scope: !1039)
!1054 = !DILocation(line: 123, column: 15, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !71, line: 123, column: 15)
!1056 = distinct !DILexicalBlock(scope: !1038, file: !71, line: 122, column: 9)
!1057 = !DILocation(line: 123, column: 15, scope: !1056)
!1058 = !DILocation(line: 125, column: 19, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !71, line: 125, column: 19)
!1060 = distinct !DILexicalBlock(scope: !1055, file: !71, line: 124, column: 13)
!1061 = !DILocation(line: 125, column: 19, scope: !1060)
!1062 = !DILocalVariable(name: "tabval", arg: 1, scope: !1063, file: !71, line: 92, type: !115)
!1063 = distinct !DISubprogram(name: "set_extend_size", scope: !71, file: !71, line: 92, type: !1064, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, unit: !70, variables: !1066)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!198, !115}
!1066 = !{!1062, !1067}
!1067 = !DILocalVariable(name: "ok", scope: !1063, file: !71, line: 94, type: !198)
!1068 = !DILocation(line: 92, column: 28, scope: !1063, inlinedAt: !1069)
!1069 = distinct !DILocation(line: 127, column: 25, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !71, line: 127, column: 23)
!1071 = distinct !DILexicalBlock(scope: !1059, file: !71, line: 126, column: 17)
!1072 = !DILocation(line: 94, column: 8, scope: !1063, inlinedAt: !1069)
!1073 = !DILocation(line: 96, column: 7, scope: !1074, inlinedAt: !1069)
!1074 = distinct !DILexicalBlock(scope: !1063, file: !71, line: 96, column: 7)
!1075 = !DILocation(line: 96, column: 7, scope: !1063, inlinedAt: !1069)
!1076 = !DILocation(line: 103, column: 15, scope: !1063, inlinedAt: !1069)
!1077 = !DILocation(line: 127, column: 23, scope: !1071)
!1078 = !DILocation(line: 99, column: 14, scope: !1079, inlinedAt: !1069)
!1079 = distinct !DILexicalBlock(scope: !1074, file: !71, line: 97, column: 5)
!1080 = !DILocation(line: 98, column: 7, scope: !1079, inlinedAt: !1069)
!1081 = !DILocation(line: 74, column: 25, scope: !969, inlinedAt: !1082)
!1082 = distinct !DILocation(line: 134, column: 17, scope: !1059)
!1083 = !DILocation(line: 76, column: 27, scope: !969, inlinedAt: !1082)
!1084 = !DILocation(line: 76, column: 44, scope: !969, inlinedAt: !1082)
!1085 = !DILocation(line: 76, column: 68, scope: !969, inlinedAt: !1082)
!1086 = !DILocation(line: 76, column: 13, scope: !969, inlinedAt: !1082)
!1087 = !DILocation(line: 77, column: 40, scope: !969, inlinedAt: !1082)
!1088 = !DILocation(line: 77, column: 59, scope: !969, inlinedAt: !1082)
!1089 = !DILocation(line: 77, column: 28, scope: !969, inlinedAt: !1082)
!1090 = !DILocation(line: 77, column: 13, scope: !969, inlinedAt: !1082)
!1091 = !DILocation(line: 79, column: 25, scope: !986, inlinedAt: !1082)
!1092 = !DILocation(line: 79, column: 22, scope: !986, inlinedAt: !1082)
!1093 = !DILocation(line: 79, column: 7, scope: !969, inlinedAt: !1082)
!1094 = !DILocation(line: 81, column: 3, scope: !969, inlinedAt: !1082)
!1095 = !DILocation(line: 80, column: 16, scope: !986, inlinedAt: !1082)
!1096 = !DILocation(line: 180, column: 19, scope: !98, inlinedAt: !1097)
!1097 = distinct !DILocation(line: 80, column: 16, scope: !986, inlinedAt: !1082)
!1098 = !DILocation(line: 180, column: 30, scope: !98, inlinedAt: !1097)
!1099 = !DILocation(line: 180, column: 41, scope: !98, inlinedAt: !1097)
!1100 = !DILocation(line: 182, column: 10, scope: !98, inlinedAt: !1097)
!1101 = !DILocation(line: 184, column: 9, scope: !997, inlinedAt: !1097)
!1102 = !DILocation(line: 184, column: 7, scope: !98, inlinedAt: !1097)
!1103 = !DILocation(line: 186, column: 11, scope: !1000, inlinedAt: !1097)
!1104 = !DILocation(line: 205, column: 11, scope: !1002, inlinedAt: !1097)
!1105 = !DILocation(line: 204, column: 11, scope: !1003, inlinedAt: !1097)
!1106 = !DILocation(line: 206, column: 9, scope: !1002, inlinedAt: !1097)
!1107 = !DILocation(line: 207, column: 14, scope: !1003, inlinedAt: !1097)
!1108 = !DILocation(line: 207, column: 18, scope: !1003, inlinedAt: !1097)
!1109 = !DILocation(line: 207, column: 9, scope: !1003, inlinedAt: !1097)
!1110 = !DILocation(line: 210, column: 7, scope: !98, inlinedAt: !1097)
!1111 = !DILocation(line: 211, column: 25, scope: !98, inlinedAt: !1097)
!1112 = !DILocation(line: 211, column: 10, scope: !98, inlinedAt: !1097)
!1113 = !DILocation(line: 80, column: 14, scope: !986, inlinedAt: !1082)
!1114 = !DILocation(line: 80, column: 5, scope: !986, inlinedAt: !1082)
!1115 = !DILocation(line: 81, column: 26, scope: !969, inlinedAt: !1082)
!1116 = !DILocation(line: 81, column: 30, scope: !969, inlinedAt: !1082)
!1117 = !DILocation(line: 83, column: 7, scope: !1017, inlinedAt: !1082)
!1118 = !DILocation(line: 83, column: 24, scope: !1017, inlinedAt: !1082)
!1119 = !DILocation(line: 83, column: 7, scope: !969, inlinedAt: !1082)
!1120 = !DILocation(line: 87, column: 24, scope: !1021, inlinedAt: !1082)
!1121 = !DILocation(line: 88, column: 5, scope: !1021, inlinedAt: !1082)
!1122 = !DILocation(line: 138, column: 23, scope: !1037)
!1123 = !DILocation(line: 138, column: 16, scope: !1038)
!1124 = !DILocation(line: 140, column: 15, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1126, file: !71, line: 140, column: 15)
!1126 = distinct !DILexicalBlock(scope: !1037, file: !71, line: 139, column: 9)
!1127 = !DILocation(line: 140, column: 15, scope: !1126)
!1128 = !DILocation(line: 142, column: 28, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1125, file: !71, line: 141, column: 13)
!1130 = !DILocation(line: 143, column: 22, scope: !1129)
!1131 = !DILocation(line: 142, column: 15, scope: !1129)
!1132 = !DILocation(line: 145, column: 13, scope: !1129)
!1133 = !DILocation(line: 138, column: 16, scope: !1037)
!1134 = !DILocation(line: 148, column: 16, scope: !1036)
!1135 = !DILocation(line: 148, column: 16, scope: !1037)
!1136 = !DILocation(line: 150, column: 16, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1035, file: !71, line: 150, column: 15)
!1138 = !DILocation(line: 150, column: 15, scope: !1035)
!1139 = !DILocation(line: 158, column: 16, scope: !1034)
!1140 = !DILocation(line: 158, column: 15, scope: !1035)
!1141 = !DILocation(line: 160, column: 28, scope: !1033)
!1142 = !DILocation(line: 160, column: 22, scope: !1033)
!1143 = !DILocation(line: 161, column: 31, scope: !1033)
!1144 = !DILocation(line: 161, column: 21, scope: !1033)
!1145 = !DILocation(line: 162, column: 28, scope: !1033)
!1146 = !DILocation(line: 162, column: 59, scope: !1033)
!1147 = !DILocation(line: 162, column: 15, scope: !1033)
!1148 = !DILocation(line: 163, column: 15, scope: !1033)
!1149 = !DILocation(line: 165, column: 33, scope: !1033)
!1150 = !DILocation(line: 165, column: 39, scope: !1033)
!1151 = !DILocation(line: 166, column: 13, scope: !1033)
!1152 = !DILocation(line: 170, column: 24, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1036, file: !71, line: 169, column: 9)
!1154 = !DILocation(line: 171, column: 18, scope: !1153)
!1155 = !DILocation(line: 170, column: 11, scope: !1153)
!1156 = !DILocation(line: 173, column: 11, scope: !1153)
!1157 = !DILocation(line: 119, column: 23, scope: !1040)
!1158 = !DILocation(line: 119, column: 3, scope: !1040)
!1159 = distinct !{!1159, !1051, !1160}
!1160 = !DILocation(line: 175, column: 5, scope: !1041)
!1161 = !DILocation(line: 177, column: 10, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1024, file: !71, line: 177, column: 7)
!1163 = !DILocation(line: 179, column: 11, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1165, file: !71, line: 179, column: 11)
!1165 = distinct !DILexicalBlock(scope: !1162, file: !71, line: 178, column: 5)
!1166 = !DILocation(line: 179, column: 11, scope: !1165)
!1167 = !DILocation(line: 92, column: 28, scope: !1063, inlinedAt: !1168)
!1168 = distinct !DILocation(line: 180, column: 15, scope: !1164)
!1169 = !DILocation(line: 94, column: 8, scope: !1063, inlinedAt: !1168)
!1170 = !DILocation(line: 96, column: 7, scope: !1074, inlinedAt: !1168)
!1171 = !DILocation(line: 96, column: 7, scope: !1063, inlinedAt: !1168)
!1172 = !DILocation(line: 99, column: 14, scope: !1079, inlinedAt: !1168)
!1173 = !DILocation(line: 98, column: 7, scope: !1079, inlinedAt: !1168)
!1174 = !DILocation(line: 102, column: 5, scope: !1079, inlinedAt: !1168)
!1175 = !DILocation(line: 103, column: 15, scope: !1063, inlinedAt: !1168)
!1176 = !DILocation(line: 180, column: 9, scope: !1164)
!1177 = !DILocation(line: 74, column: 25, scope: !969, inlinedAt: !1178)
!1178 = distinct !DILocation(line: 182, column: 9, scope: !1164)
!1179 = !DILocation(line: 76, column: 27, scope: !969, inlinedAt: !1178)
!1180 = !DILocation(line: 76, column: 44, scope: !969, inlinedAt: !1178)
!1181 = !DILocation(line: 76, column: 68, scope: !969, inlinedAt: !1178)
!1182 = !DILocation(line: 76, column: 13, scope: !969, inlinedAt: !1178)
!1183 = !DILocation(line: 77, column: 40, scope: !969, inlinedAt: !1178)
!1184 = !DILocation(line: 77, column: 59, scope: !969, inlinedAt: !1178)
!1185 = !DILocation(line: 77, column: 28, scope: !969, inlinedAt: !1178)
!1186 = !DILocation(line: 77, column: 13, scope: !969, inlinedAt: !1178)
!1187 = !DILocation(line: 79, column: 25, scope: !986, inlinedAt: !1178)
!1188 = !DILocation(line: 79, column: 22, scope: !986, inlinedAt: !1178)
!1189 = !DILocation(line: 79, column: 7, scope: !969, inlinedAt: !1178)
!1190 = !DILocation(line: 81, column: 3, scope: !969, inlinedAt: !1178)
!1191 = !DILocation(line: 80, column: 16, scope: !986, inlinedAt: !1178)
!1192 = !DILocation(line: 180, column: 19, scope: !98, inlinedAt: !1193)
!1193 = distinct !DILocation(line: 80, column: 16, scope: !986, inlinedAt: !1178)
!1194 = !DILocation(line: 180, column: 30, scope: !98, inlinedAt: !1193)
!1195 = !DILocation(line: 180, column: 41, scope: !98, inlinedAt: !1193)
!1196 = !DILocation(line: 182, column: 10, scope: !98, inlinedAt: !1193)
!1197 = !DILocation(line: 184, column: 9, scope: !997, inlinedAt: !1193)
!1198 = !DILocation(line: 184, column: 7, scope: !98, inlinedAt: !1193)
!1199 = !DILocation(line: 186, column: 11, scope: !1000, inlinedAt: !1193)
!1200 = !DILocation(line: 205, column: 11, scope: !1002, inlinedAt: !1193)
!1201 = !DILocation(line: 204, column: 11, scope: !1003, inlinedAt: !1193)
!1202 = !DILocation(line: 206, column: 9, scope: !1002, inlinedAt: !1193)
!1203 = !DILocation(line: 207, column: 14, scope: !1003, inlinedAt: !1193)
!1204 = !DILocation(line: 207, column: 18, scope: !1003, inlinedAt: !1193)
!1205 = !DILocation(line: 207, column: 9, scope: !1003, inlinedAt: !1193)
!1206 = !DILocation(line: 210, column: 7, scope: !98, inlinedAt: !1193)
!1207 = !DILocation(line: 211, column: 25, scope: !98, inlinedAt: !1193)
!1208 = !DILocation(line: 211, column: 10, scope: !98, inlinedAt: !1193)
!1209 = !DILocation(line: 80, column: 14, scope: !986, inlinedAt: !1178)
!1210 = !DILocation(line: 80, column: 5, scope: !986, inlinedAt: !1178)
!1211 = !DILocation(line: 81, column: 26, scope: !969, inlinedAt: !1178)
!1212 = !DILocation(line: 81, column: 30, scope: !969, inlinedAt: !1178)
!1213 = !DILocation(line: 83, column: 7, scope: !1017, inlinedAt: !1178)
!1214 = !DILocation(line: 83, column: 24, scope: !1017, inlinedAt: !1178)
!1215 = !DILocation(line: 83, column: 7, scope: !969, inlinedAt: !1178)
!1216 = !DILocation(line: 87, column: 24, scope: !1021, inlinedAt: !1178)
!1217 = !DILocation(line: 88, column: 5, scope: !1021, inlinedAt: !1178)
!1218 = !DILocation(line: 185, column: 9, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1024, file: !71, line: 185, column: 7)
!1220 = !DILocation(line: 185, column: 7, scope: !1024)
!1221 = !DILocation(line: 186, column: 5, scope: !1219)
!1222 = !DILocation(line: 187, column: 1, scope: !1024)
!1223 = distinct !DISubprogram(name: "finalize_tab_stops", scope: !71, file: !71, line: 217, type: !712, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: true, unit: !70, variables: !211)
!1224 = !DILocation(line: 219, column: 23, scope: !1223)
!1225 = !DILocation(line: 219, column: 33, scope: !1223)
!1226 = !DILocalVariable(name: "tabs", arg: 1, scope: !1227, file: !71, line: 193, type: !1230)
!1227 = distinct !DISubprogram(name: "validate_tab_stops", scope: !71, file: !71, line: 193, type: !1228, isLocal: true, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true, unit: !70, variables: !1232)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{null, !1230, !102}
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!1232 = !{!1226, !1233, !1234, !1235}
!1233 = !DILocalVariable(name: "entries", arg: 2, scope: !1227, file: !71, line: 193, type: !102)
!1234 = !DILocalVariable(name: "prev_tab", scope: !1227, file: !71, line: 195, type: !115)
!1235 = !DILocalVariable(name: "i", scope: !1227, file: !71, line: 196, type: !102)
!1236 = !DILocation(line: 193, column: 38, scope: !1227, inlinedAt: !1237)
!1237 = distinct !DILocation(line: 219, column: 3, scope: !1223)
!1238 = !DILocation(line: 193, column: 51, scope: !1227, inlinedAt: !1237)
!1239 = !DILocation(line: 195, column: 13, scope: !1227, inlinedAt: !1237)
!1240 = !DILocation(line: 196, column: 10, scope: !1227, inlinedAt: !1237)
!1241 = !DILocation(line: 198, column: 17, scope: !1242, inlinedAt: !1237)
!1242 = distinct !DILexicalBlock(scope: !1243, file: !71, line: 198, column: 3)
!1243 = distinct !DILexicalBlock(scope: !1227, file: !71, line: 198, column: 3)
!1244 = !DILocation(line: 198, column: 3, scope: !1243, inlinedAt: !1237)
!1245 = !DILocation(line: 200, column: 11, scope: !1246, inlinedAt: !1237)
!1246 = distinct !DILexicalBlock(scope: !1247, file: !71, line: 200, column: 11)
!1247 = distinct !DILexicalBlock(scope: !1242, file: !71, line: 199, column: 5)
!1248 = distinct !{!1248, !1249, !1250}
!1249 = !DILocation(line: 198, column: 3, scope: !1243)
!1250 = !DILocation(line: 205, column: 5, scope: !1243)
!1251 = !DILocation(line: 200, column: 19, scope: !1246, inlinedAt: !1237)
!1252 = !DILocation(line: 200, column: 11, scope: !1247, inlinedAt: !1237)
!1253 = !DILocation(line: 201, column: 9, scope: !1246, inlinedAt: !1237)
!1254 = !DILocation(line: 202, column: 19, scope: !1255, inlinedAt: !1237)
!1255 = distinct !DILexicalBlock(scope: !1247, file: !71, line: 202, column: 11)
!1256 = !DILocation(line: 198, column: 29, scope: !1242, inlinedAt: !1237)
!1257 = !DILocation(line: 202, column: 11, scope: !1247, inlinedAt: !1237)
!1258 = !DILocation(line: 203, column: 9, scope: !1255, inlinedAt: !1237)
!1259 = !DILocation(line: 222, column: 35, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1223, file: !71, line: 221, column: 7)
!1261 = !DILocation(line: 222, column: 33, scope: !1260)
!1262 = !DILocation(line: 222, column: 5, scope: !1260)
!1263 = !DILocation(line: 223, column: 27, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1260, file: !71, line: 223, column: 12)
!1265 = !DILocation(line: 223, column: 37, scope: !1264)
