; ModuleID = 'coreutils-8.27/src/fold.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [60 x i8] c"Wrap input lines in each FILE, writing to standard output.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.14 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1
@.str.15 = private unnamed_addr constant [75 x i8] c"\0AMandatory arguments to long options are mandatory for short options too.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "shortopts", scope: !2, file: !3, line: 47, type: !178, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !54)
!3 = !DIFile(filename: "src/fold.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19, !28}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 45, size: 32, elements: !21)
!20 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!23 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!24 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!25 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!26 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!27 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 46, size: 32, elements: !30)
!29 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!31 = !DIEnumerator(name: "_ISupper", value: 256)
!32 = !DIEnumerator(name: "_ISlower", value: 512)
!33 = !DIEnumerator(name: "_ISalpha", value: 1024)
!34 = !DIEnumerator(name: "_ISdigit", value: 2048)
!35 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!36 = !DIEnumerator(name: "_ISspace", value: 8192)
!37 = !DIEnumerator(name: "_ISprint", value: 16384)
!38 = !DIEnumerator(name: "_ISgraph", value: 32768)
!39 = !DIEnumerator(name: "_ISblank", value: 1)
!40 = !DIEnumerator(name: "_IScntrl", value: 2)
!41 = !DIEnumerator(name: "_ISpunct", value: 4)
!42 = !DIEnumerator(name: "_ISalnum", value: 8)
!43 = !{!44, !46, !47, !48, !49, !52, !53}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 62, baseType: !51)
!50 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!51 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !{!55, !58, !60, !62, !0, !84, !98, !176}
!55 = !DIGlobalVariableExpression(var: !56)
!56 = distinct !DIGlobalVariable(name: "break_spaces", scope: !2, file: !3, line: 39, type: !57, isLocal: true, isDefinition: true)
!57 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!58 = !DIGlobalVariableExpression(var: !59)
!59 = distinct !DIGlobalVariable(name: "count_bytes", scope: !2, file: !3, line: 42, type: !57, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61)
!61 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 45, type: !57, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63)
!63 = distinct !DIGlobalVariable(name: "infomap", scope: !64, file: !65, line: 632, type: !81, isLocal: true, isDefinition: true)
!64 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !65, file: !65, line: 630, type: !66, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !70)
!65 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!66 = !DISubroutineType(types: !67)
!67 = !{null, !68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!70 = !{!71, !72, !73, !80}
!71 = !DILocalVariable(name: "program", arg: 1, scope: !64, file: !65, line: 630, type: !68)
!72 = !DILocalVariable(name: "node", scope: !64, file: !65, line: 642, type: !68)
!73 = !DILocalVariable(name: "map_prog", scope: !64, file: !65, line: 643, type: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !64, file: !65, line: 632, size: 128, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !76, file: !65, line: 632, baseType: !68, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !76, file: !65, line: 632, baseType: !68, size: 64, offset: 64)
!80 = !DILocalVariable(name: "lc_messages", scope: !64, file: !65, line: 655, type: !68)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 896, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 7)
!84 = !DIGlobalVariableExpression(var: !85)
!85 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 49, type: !86, isLocal: true, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 1536, elements: !96)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !89, line: 50, size: 256, elements: !90)
!89 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!90 = !{!91, !92, !93, !95}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !88, file: !89, line: 52, baseType: !68, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !88, file: !89, line: 55, baseType: !47, size: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !88, file: !89, line: 56, baseType: !94, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !88, file: !89, line: 57, baseType: !47, size: 32, offset: 192)
!96 = !{!97}
!97 = !DISubrange(count: 6)
!98 = !DIGlobalVariableExpression(var: !99)
!99 = distinct !DIGlobalVariable(name: "line_out", scope: !100, file: !3, line: 126, type: !44, isLocal: true, isDefinition: true)
!100 = distinct !DISubprogram(name: "fold_file", scope: !3, file: !3, line: 120, type: !101, isLocal: true, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !103)
!101 = !DISubroutineType(types: !102)
!102 = !{!57, !68, !49}
!103 = !{!104, !105, !106, !162, !163, !164, !165, !166, !172, !173}
!104 = !DILocalVariable(name: "filename", arg: 1, scope: !100, file: !3, line: 120, type: !68)
!105 = !DILocalVariable(name: "width", arg: 2, scope: !100, file: !3, line: 120, type: !49)
!106 = !DILocalVariable(name: "istream", scope: !100, file: !3, line: 122, type: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !109, line: 7, baseType: !110)
!109 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !111, line: 241, size: 1728, elements: !112)
!111 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !133, !134, !135, !136, !140, !141, !143, !147, !150, !152, !153, !154, !155, !156, !157, !158}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !110, file: !111, line: 242, baseType: !47, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !110, file: !111, line: 247, baseType: !44, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !110, file: !111, line: 248, baseType: !44, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !110, file: !111, line: 249, baseType: !44, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !110, file: !111, line: 250, baseType: !44, size: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !110, file: !111, line: 251, baseType: !44, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !110, file: !111, line: 252, baseType: !44, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !110, file: !111, line: 253, baseType: !44, size: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !110, file: !111, line: 254, baseType: !44, size: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !110, file: !111, line: 256, baseType: !44, size: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !110, file: !111, line: 257, baseType: !44, size: 64, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !110, file: !111, line: 258, baseType: !44, size: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !110, file: !111, line: 260, baseType: !126, size: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !111, line: 156, size: 192, elements: !128)
!128 = !{!129, !130, !132}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !127, file: !111, line: 157, baseType: !126, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !127, file: !111, line: 158, baseType: !131, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !127, file: !111, line: 162, baseType: !47, size: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !110, file: !111, line: 262, baseType: !131, size: 64, offset: 832)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !110, file: !111, line: 264, baseType: !47, size: 32, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !110, file: !111, line: 268, baseType: !47, size: 32, offset: 928)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !110, file: !111, line: 270, baseType: !137, size: 64, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !138, line: 140, baseType: !139)
!138 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!139 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !110, file: !111, line: 274, baseType: !48, size: 16, offset: 1024)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !110, file: !111, line: 275, baseType: !142, size: 8, offset: 1040)
!142 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !110, file: !111, line: 276, baseType: !144, size: 8, offset: 1048)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 1)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !110, file: !111, line: 280, baseType: !148, size: 64, offset: 1088)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !111, line: 150, baseType: null)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !110, file: !111, line: 289, baseType: !151, size: 64, offset: 1152)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !138, line: 141, baseType: !139)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !110, file: !111, line: 297, baseType: !46, size: 64, offset: 1216)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !110, file: !111, line: 298, baseType: !46, size: 64, offset: 1280)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !110, file: !111, line: 299, baseType: !46, size: 64, offset: 1344)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !110, file: !111, line: 300, baseType: !46, size: 64, offset: 1408)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !110, file: !111, line: 302, baseType: !49, size: 64, offset: 1472)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !110, file: !111, line: 303, baseType: !47, size: 32, offset: 1536)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !110, file: !111, line: 305, baseType: !159, size: 160, offset: 1568)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 20)
!162 = !DILocalVariable(name: "c", scope: !100, file: !3, line: 123, type: !47)
!163 = !DILocalVariable(name: "column", scope: !100, file: !3, line: 124, type: !49)
!164 = !DILocalVariable(name: "offset_out", scope: !100, file: !3, line: 125, type: !49)
!165 = !DILocalVariable(name: "saved_errno", scope: !100, file: !3, line: 128, type: !47)
!166 = !DILocalVariable(name: "found_blank", scope: !167, file: !3, line: 169, type: !57)
!167 = distinct !DILexicalBlock(scope: !168, file: !3, line: 168, column: 13)
!168 = distinct !DILexicalBlock(scope: !169, file: !3, line: 167, column: 15)
!169 = distinct !DILexicalBlock(scope: !170, file: !3, line: 163, column: 9)
!170 = distinct !DILexicalBlock(scope: !171, file: !3, line: 162, column: 11)
!171 = distinct !DILexicalBlock(scope: !100, file: !3, line: 147, column: 5)
!172 = !DILocalVariable(name: "logical_end", scope: !167, file: !3, line: 170, type: !49)
!173 = !DILocalVariable(name: "i", scope: !174, file: !3, line: 185, type: !49)
!174 = distinct !DILexicalBlock(scope: !175, file: !3, line: 184, column: 17)
!175 = distinct !DILexicalBlock(scope: !167, file: !3, line: 183, column: 19)
!176 = !DIGlobalVariableExpression(var: !177)
!177 = distinct !DIGlobalVariable(name: "allocated_out", scope: !100, file: !3, line: 127, type: !49, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 280, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 35)
!181 = !DIGlobalVariableExpression(var: !182)
!182 = distinct !DIGlobalVariable(name: "Version", scope: !183, file: !184, line: 2, type: !68, isLocal: false, isDefinition: true)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, globals: !186)
!184 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!185 = !{}
!186 = !{!181}
!187 = !DIGlobalVariableExpression(var: !188)
!188 = distinct !DIGlobalVariable(name: "file_name", scope: !189, file: !194, line: 36, type: !68, isLocal: true, isDefinition: true)
!189 = distinct !DICompileUnit(language: DW_LANG_C99, file: !190, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, globals: !191)
!190 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!191 = !{!187, !192}
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !189, file: !194, line: 46, type: !57, isLocal: true, isDefinition: true)
!194 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!195 = !DIGlobalVariableExpression(var: !196)
!196 = distinct !DIGlobalVariable(name: "exit_failure", scope: !197, file: !200, line: 24, type: !201, isLocal: false, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, globals: !199)
!198 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!199 = !{!195}
!200 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!201 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !47)
!202 = !DIGlobalVariableExpression(var: !203)
!203 = distinct !DIGlobalVariable(name: "program_name", scope: !204, file: !208, line: 33, type: !68, isLocal: false, isDefinition: true)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !206, globals: !207)
!205 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!206 = !{!46, !44}
!207 = !{!202}
!208 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!209 = !DIGlobalVariableExpression(var: !210)
!210 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !211, file: !223, line: 77, type: !259, isLocal: false, isDefinition: true)
!211 = distinct !DICompileUnit(language: DW_LANG_C99, file: !212, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !219, globals: !220)
!212 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!213 = !{!5, !214, !28}
!214 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !215)
!215 = !{!216, !217, !218}
!216 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!217 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!218 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!219 = !{!47, !48, !49, !44}
!220 = !{!209, !221, !228, !241, !243, !248, !255, !257}
!221 = !DIGlobalVariableExpression(var: !222)
!222 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !211, file: !223, line: 93, type: !224, isLocal: false, isDefinition: true)
!223 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 320, elements: !226)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!226 = !{!227}
!227 = !DISubrange(count: 10)
!228 = !DIGlobalVariableExpression(var: !229)
!229 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !211, file: !223, line: 1043, type: !230, isLocal: false, isDefinition: true)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !223, line: 57, size: 448, elements: !231)
!231 = !{!232, !233, !234, !239, !240}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !230, file: !223, line: 60, baseType: !5, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !230, file: !223, line: 63, baseType: !47, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !230, file: !223, line: 67, baseType: !235, size: 256, offset: 64)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 256, elements: !237)
!236 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!237 = !{!238}
!238 = !DISubrange(count: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !230, file: !223, line: 70, baseType: !68, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !230, file: !223, line: 73, baseType: !68, size: 64, offset: 384)
!241 = !DIGlobalVariableExpression(var: !242)
!242 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !211, file: !223, line: 108, type: !230, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244)
!244 = distinct !DIGlobalVariable(name: "slot0", scope: !211, file: !223, line: 834, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 256)
!248 = !DIGlobalVariableExpression(var: !249)
!249 = distinct !DIGlobalVariable(name: "slotvec", scope: !211, file: !223, line: 837, type: !250, isLocal: true, isDefinition: true)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !223, line: 826, size: 128, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !251, file: !223, line: 828, baseType: !49, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !251, file: !223, line: 829, baseType: !44, size: 64, offset: 64)
!255 = !DIGlobalVariableExpression(var: !256)
!256 = distinct !DIGlobalVariable(name: "nslots", scope: !211, file: !223, line: 835, type: !47, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258)
!258 = distinct !DIGlobalVariable(name: "slotvec0", scope: !211, file: !223, line: 836, type: !251, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 704, elements: !261)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!261 = !{!262}
!262 = !DISubrange(count: 11)
!263 = !DIGlobalVariableExpression(var: !264)
!264 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !265, file: !268, line: 26, type: !269, isLocal: false, isDefinition: true)
!265 = distinct !DICompileUnit(language: DW_LANG_C99, file: !266, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, globals: !267)
!266 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!267 = !{!263}
!268 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 376, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 47)
!272 = !DIGlobalVariableExpression(var: !273)
!273 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !274, file: !617, line: 120, type: !618, isLocal: true, isDefinition: true)
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !276, retainedTypes: !615, globals: !616)
!275 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!276 = !{!277}
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !278, line: 41, size: 32, elements: !279)
!278 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!280 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!281 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!282 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!283 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!284 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!285 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!286 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!287 = !DIEnumerator(name: "DAY_1", value: 131079)
!288 = !DIEnumerator(name: "DAY_2", value: 131080)
!289 = !DIEnumerator(name: "DAY_3", value: 131081)
!290 = !DIEnumerator(name: "DAY_4", value: 131082)
!291 = !DIEnumerator(name: "DAY_5", value: 131083)
!292 = !DIEnumerator(name: "DAY_6", value: 131084)
!293 = !DIEnumerator(name: "DAY_7", value: 131085)
!294 = !DIEnumerator(name: "ABMON_1", value: 131086)
!295 = !DIEnumerator(name: "ABMON_2", value: 131087)
!296 = !DIEnumerator(name: "ABMON_3", value: 131088)
!297 = !DIEnumerator(name: "ABMON_4", value: 131089)
!298 = !DIEnumerator(name: "ABMON_5", value: 131090)
!299 = !DIEnumerator(name: "ABMON_6", value: 131091)
!300 = !DIEnumerator(name: "ABMON_7", value: 131092)
!301 = !DIEnumerator(name: "ABMON_8", value: 131093)
!302 = !DIEnumerator(name: "ABMON_9", value: 131094)
!303 = !DIEnumerator(name: "ABMON_10", value: 131095)
!304 = !DIEnumerator(name: "ABMON_11", value: 131096)
!305 = !DIEnumerator(name: "ABMON_12", value: 131097)
!306 = !DIEnumerator(name: "MON_1", value: 131098)
!307 = !DIEnumerator(name: "MON_2", value: 131099)
!308 = !DIEnumerator(name: "MON_3", value: 131100)
!309 = !DIEnumerator(name: "MON_4", value: 131101)
!310 = !DIEnumerator(name: "MON_5", value: 131102)
!311 = !DIEnumerator(name: "MON_6", value: 131103)
!312 = !DIEnumerator(name: "MON_7", value: 131104)
!313 = !DIEnumerator(name: "MON_8", value: 131105)
!314 = !DIEnumerator(name: "MON_9", value: 131106)
!315 = !DIEnumerator(name: "MON_10", value: 131107)
!316 = !DIEnumerator(name: "MON_11", value: 131108)
!317 = !DIEnumerator(name: "MON_12", value: 131109)
!318 = !DIEnumerator(name: "AM_STR", value: 131110)
!319 = !DIEnumerator(name: "PM_STR", value: 131111)
!320 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!321 = !DIEnumerator(name: "D_FMT", value: 131113)
!322 = !DIEnumerator(name: "T_FMT", value: 131114)
!323 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!324 = !DIEnumerator(name: "ERA", value: 131116)
!325 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!326 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!327 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!328 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!329 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!330 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!331 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!332 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!333 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!334 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!335 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!336 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!337 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!338 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!339 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!340 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!341 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!342 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!343 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!344 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!345 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!346 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!347 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!348 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!349 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!350 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!351 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!352 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!353 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!354 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!355 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!356 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!357 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!358 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!359 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!360 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!361 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!362 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!363 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!364 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!365 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!366 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!367 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!368 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!369 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!370 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!371 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!372 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!373 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!374 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!375 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!376 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!377 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!378 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!379 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!380 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!381 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!382 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!383 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!384 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!385 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!386 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!387 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!388 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!389 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!390 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!391 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!392 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!393 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!394 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!395 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!396 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!397 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!398 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!399 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!400 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!401 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!402 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!403 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!404 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!405 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!406 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!407 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!408 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!409 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!410 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!411 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!412 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!413 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!414 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!415 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!416 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!417 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!418 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!419 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!420 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!421 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!422 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!423 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!424 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!425 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!426 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!427 = !DIEnumerator(name: "CODESET", value: 14)
!428 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!429 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!430 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!431 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!432 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!433 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!434 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!435 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!436 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!437 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!438 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!439 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!440 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!441 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!442 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!443 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!444 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!445 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!446 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!447 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!448 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!449 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!450 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!451 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!452 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!453 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!454 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!455 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!456 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!457 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!458 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!459 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!460 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!461 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!462 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!463 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!464 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!465 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!466 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!467 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!468 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!469 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!470 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!471 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!472 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!473 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!474 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!475 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!476 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!477 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!478 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!479 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!480 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!481 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!482 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!483 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!484 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!485 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!486 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!487 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!488 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!489 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!490 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!491 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!492 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!493 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!494 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!495 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!496 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!497 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!498 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!499 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!500 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!501 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!502 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!503 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!504 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!505 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!506 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!507 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!508 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!509 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!510 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!511 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!512 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!513 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!514 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!515 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!516 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!517 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!518 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!519 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!520 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!521 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!522 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!523 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!524 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!525 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!526 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!527 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!528 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!529 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!530 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!531 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!532 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!533 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!534 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!535 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!536 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!537 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!538 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!539 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!540 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!541 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!542 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!543 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!544 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!545 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!546 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!547 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!548 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!549 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!550 = !DIEnumerator(name: "THOUSEP", value: 65537)
!551 = !DIEnumerator(name: "__GROUPING", value: 65538)
!552 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!553 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!554 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!555 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!556 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!557 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!558 = !DIEnumerator(name: "__YESSTR", value: 327682)
!559 = !DIEnumerator(name: "__NOSTR", value: 327683)
!560 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!561 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!562 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!563 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!564 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!565 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!566 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!567 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!568 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!569 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!570 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!571 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!572 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!573 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!574 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!575 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!576 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!577 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!578 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!579 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!580 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!581 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!582 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!583 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!584 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!585 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!586 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!587 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!588 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!589 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!590 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!591 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!592 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!593 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!594 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!595 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!596 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!597 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!598 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!599 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!600 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!601 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!602 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!603 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!604 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!605 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!606 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!607 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!608 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!609 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!610 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!611 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!612 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!613 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!614 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!615 = !{!46, !44, !52}
!616 = !{!272}
!617 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!618 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !68)
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !620, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !621)
!620 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!621 = !{!19}
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !624, retainedTypes: !629)
!623 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!624 = !{!625}
!625 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !626, line: 41, size: 32, elements: !627)
!626 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!627 = !{!628}
!628 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!629 = !{!46}
!630 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !632, retainedTypes: !646)
!631 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!632 = !{!633}
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !635, file: !634, line: 192, size: 32, elements: !644)
!634 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!635 = distinct !DISubprogram(name: "x2nrealloc", scope: !634, file: !634, line: 180, type: !636, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !630, variables: !639)
!636 = !DISubroutineType(types: !637)
!637 = !{!46, !46, !638, !49}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!639 = !{!640, !641, !642, !643}
!640 = !DILocalVariable(name: "p", arg: 1, scope: !635, file: !634, line: 180, type: !46)
!641 = !DILocalVariable(name: "pn", arg: 2, scope: !635, file: !634, line: 180, type: !638)
!642 = !DILocalVariable(name: "s", arg: 3, scope: !635, file: !634, line: 180, type: !49)
!643 = !DILocalVariable(name: "n", scope: !635, file: !634, line: 182, type: !49)
!644 = !{!645}
!645 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!646 = !{!49, !44, !46}
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185)
!648 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !651)
!650 = !DIFile(filename: "./lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!651 = !{!652}
!652 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !653, line: 26, size: 32, elements: !654)
!653 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!654 = !{!655, !656, !657, !658, !659}
!655 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!656 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!657 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!658 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!659 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!660 = distinct !DICompileUnit(language: DW_LANG_C99, file: !661, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !662, retainedTypes: !663)
!661 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!662 = !{!652, !28}
!663 = !{!47, !48}
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !629)
!665 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185)
!667 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !629)
!669 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !629)
!671 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !674)
!673 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!674 = !{!49}
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185)
!676 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185)
!678 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!679 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!680 = !{i32 2, !"Dwarf Version", i32 4}
!681 = !{i32 2, !"Debug Info Version", i32 3}
!682 = !{i32 1, !"wchar_size", i32 4}
!683 = !{i32 7, !"PIC Level", i32 2}
!684 = !{i32 7, !"PIE Level", i32 2}
!685 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 60, type: !686, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !688)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !47}
!688 = !{!689}
!689 = !DILocalVariable(name: "status", arg: 1, scope: !685, file: !3, line: 60, type: !47)
!690 = !DIExpression()
!691 = !DILocation(line: 60, column: 12, scope: !685)
!692 = !DILocation(line: 62, column: 14, scope: !693)
!693 = distinct !DILexicalBlock(scope: !685, file: !3, line: 62, column: 7)
!694 = !DILocation(line: 62, column: 7, scope: !685)
!695 = !DILocation(line: 63, column: 5, scope: !696)
!696 = distinct !DILexicalBlock(scope: !693, file: !3, line: 63, column: 5)
!697 = !{!698, !698, i64 0}
!698 = !{!"any pointer", !699, i64 0}
!699 = !{!"omnipotent char", !700, i64 0}
!700 = !{!"Simple C/C++ TBAA"}
!701 = !DILocation(line: 66, column: 7, scope: !702)
!702 = distinct !DILexicalBlock(scope: !693, file: !3, line: 65, column: 5)
!703 = !DILocation(line: 70, column: 7, scope: !702)
!704 = !DILocation(line: 580, column: 3, scope: !705, inlinedAt: !708)
!705 = distinct !DISubprogram(name: "emit_stdin_note", scope: !65, file: !65, line: 578, type: !706, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !185)
!706 = !DISubroutineType(types: !707)
!707 = !{null}
!708 = distinct !DILocation(line: 74, column: 7, scope: !702)
!709 = !DILocation(line: 587, column: 3, scope: !710, inlinedAt: !711)
!710 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !65, file: !65, line: 585, type: !706, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !185)
!711 = distinct !DILocation(line: 75, column: 7, scope: !702)
!712 = !DILocation(line: 77, column: 7, scope: !702)
!713 = !DILocation(line: 82, column: 7, scope: !702)
!714 = !DILocation(line: 83, column: 7, scope: !702)
!715 = !DILocation(line: 642, column: 15, scope: !64, inlinedAt: !716)
!716 = distinct !DILocation(line: 84, column: 7, scope: !702)
!717 = !DILocation(line: 651, column: 3, scope: !64, inlinedAt: !716)
!718 = !DILocation(line: 655, column: 29, scope: !64, inlinedAt: !716)
!719 = !DILocation(line: 655, column: 15, scope: !64, inlinedAt: !716)
!720 = !DILocation(line: 656, column: 7, scope: !721, inlinedAt: !716)
!721 = distinct !DILexicalBlock(scope: !64, file: !65, line: 656, column: 7)
!722 = !DILocation(line: 656, column: 19, scope: !721, inlinedAt: !716)
!723 = !DILocation(line: 656, column: 22, scope: !721, inlinedAt: !716)
!724 = !DILocation(line: 656, column: 7, scope: !64, inlinedAt: !716)
!725 = !DILocation(line: 662, column: 7, scope: !726, inlinedAt: !716)
!726 = distinct !DILexicalBlock(scope: !721, file: !65, line: 657, column: 5)
!727 = !DILocation(line: 664, column: 5, scope: !726, inlinedAt: !716)
!728 = !DILocation(line: 665, column: 3, scope: !64, inlinedAt: !716)
!729 = !DILocation(line: 667, column: 3, scope: !64, inlinedAt: !716)
!730 = !DILocation(line: 86, column: 3, scope: !685)
!731 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 240, type: !732, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !735)
!732 = !DISubroutineType(types: !733)
!733 = !{!47, !47, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!735 = !{!736, !737, !738, !739, !740, !741, !742}
!736 = !DILocalVariable(name: "argc", arg: 1, scope: !731, file: !3, line: 240, type: !47)
!737 = !DILocalVariable(name: "argv", arg: 2, scope: !731, file: !3, line: 240, type: !734)
!738 = !DILocalVariable(name: "width", scope: !731, file: !3, line: 242, type: !49)
!739 = !DILocalVariable(name: "i", scope: !731, file: !3, line: 243, type: !47)
!740 = !DILocalVariable(name: "optc", scope: !731, file: !3, line: 244, type: !47)
!741 = !DILocalVariable(name: "ok", scope: !731, file: !3, line: 245, type: !57)
!742 = !DILocalVariable(name: "optargbuf", scope: !743, file: !3, line: 259, type: !744)
!743 = distinct !DILexicalBlock(scope: !731, file: !3, line: 258, column: 5)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 16, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 2)
!747 = !DILocation(line: 240, column: 11, scope: !731)
!748 = !DILocation(line: 240, column: 24, scope: !731)
!749 = !DILocation(line: 242, column: 10, scope: !731)
!750 = !DILocation(line: 248, column: 21, scope: !731)
!751 = !DILocation(line: 248, column: 3, scope: !731)
!752 = !DILocation(line: 249, column: 3, scope: !731)
!753 = !DILocation(line: 250, column: 3, scope: !731)
!754 = !DILocation(line: 251, column: 3, scope: !731)
!755 = !DILocation(line: 253, column: 3, scope: !731)
!756 = !DILocation(line: 257, column: 18, scope: !731)
!757 = !DILocation(line: 244, column: 7, scope: !731)
!758 = !DILocation(line: 257, column: 71, scope: !731)
!759 = !DILocation(line: 257, column: 3, scope: !731)
!760 = !DILocation(line: 259, column: 7, scope: !743)
!761 = !DILocation(line: 259, column: 12, scope: !743)
!762 = !DILocation(line: 261, column: 7, scope: !743)
!763 = !DILocation(line: 283, column: 31, scope: !764)
!764 = distinct !DILexicalBlock(scope: !743, file: !3, line: 262, column: 9)
!765 = !DILocation(line: 265, column: 11, scope: !764)
!766 = !DILocation(line: 269, column: 11, scope: !764)
!767 = !DILocation(line: 273, column: 15, scope: !768)
!768 = distinct !DILexicalBlock(scope: !764, file: !3, line: 273, column: 15)
!769 = !DILocation(line: 273, column: 15, scope: !764)
!770 = !DILocation(line: 274, column: 19, scope: !768)
!771 = !DILocation(line: 274, column: 13, scope: !768)
!772 = !DILocation(line: 277, column: 30, scope: !773)
!773 = distinct !DILexicalBlock(scope: !768, file: !3, line: 276, column: 13)
!774 = !DILocation(line: 277, column: 28, scope: !773)
!775 = !{!699, !699, i64 0}
!776 = !DILocation(line: 278, column: 28, scope: !773)
!777 = !DILocation(line: 284, column: 31, scope: !764)
!778 = !DILocation(line: 283, column: 19, scope: !764)
!779 = !DILocation(line: 285, column: 11, scope: !764)
!780 = !DILocation(line: 287, column: 9, scope: !764)
!781 = !DILocation(line: 289, column: 9, scope: !764)
!782 = !DILocation(line: 292, column: 11, scope: !764)
!783 = !DILocation(line: 294, column: 5, scope: !731)
!784 = distinct !{!784, !759, !783}
!785 = !DILocation(line: 296, column: 15, scope: !786)
!786 = distinct !DILexicalBlock(scope: !731, file: !3, line: 296, column: 7)
!787 = !{!788, !788, i64 0}
!788 = !{!"int", !699, i64 0}
!789 = !DILocation(line: 296, column: 12, scope: !786)
!790 = !DILocation(line: 296, column: 7, scope: !731)
!791 = !DILocation(line: 297, column: 10, scope: !786)
!792 = !DILocation(line: 297, column: 8, scope: !786)
!793 = !DILocation(line: 245, column: 8, scope: !731)
!794 = !DILocation(line: 297, column: 5, scope: !786)
!795 = !DILocation(line: 243, column: 7, scope: !731)
!796 = !DILocation(line: 301, column: 26, scope: !797)
!797 = distinct !DILexicalBlock(scope: !798, file: !3, line: 301, column: 7)
!798 = distinct !DILexicalBlock(scope: !799, file: !3, line: 301, column: 7)
!799 = distinct !DILexicalBlock(scope: !786, file: !3, line: 299, column: 5)
!800 = !DILocation(line: 301, column: 7, scope: !798)
!801 = !DILocation(line: 302, column: 26, scope: !797)
!802 = !DILocation(line: 302, column: 15, scope: !797)
!803 = !DILocation(line: 302, column: 12, scope: !797)
!804 = !DILocation(line: 301, column: 35, scope: !797)
!805 = distinct !{!805, !800, !806}
!806 = !DILocation(line: 302, column: 40, scope: !798)
!807 = !DILocation(line: 305, column: 23, scope: !808)
!808 = distinct !DILexicalBlock(scope: !731, file: !3, line: 305, column: 7)
!809 = !DILocation(line: 305, column: 34, scope: !808)
!810 = !DILocation(line: 305, column: 26, scope: !808)
!811 = !DILocation(line: 305, column: 41, scope: !808)
!812 = !DILocation(line: 305, column: 7, scope: !731)
!813 = !DILocation(line: 306, column: 5, scope: !808)
!814 = !DILocation(line: 308, column: 10, scope: !731)
!815 = !DILocation(line: 308, column: 3, scope: !731)
!816 = !DILocation(line: 120, column: 24, scope: !100)
!817 = !DILocation(line: 120, column: 41, scope: !100)
!818 = !DILocation(line: 124, column: 10, scope: !100)
!819 = !DILocation(line: 125, column: 10, scope: !100)
!820 = !DILocation(line: 130, column: 7, scope: !821)
!821 = distinct !DILexicalBlock(scope: !100, file: !3, line: 130, column: 7)
!822 = !DILocation(line: 130, column: 7, scope: !100)
!823 = !DILocation(line: 132, column: 17, scope: !824)
!824 = distinct !DILexicalBlock(scope: !821, file: !3, line: 131, column: 5)
!825 = !DILocation(line: 122, column: 9, scope: !100)
!826 = !DILocation(line: 134, column: 5, scope: !824)
!827 = !DILocation(line: 136, column: 15, scope: !821)
!828 = !DILocation(line: 138, column: 15, scope: !829)
!829 = distinct !DILexicalBlock(scope: !100, file: !3, line: 138, column: 7)
!830 = !DILocation(line: 138, column: 7, scope: !100)
!831 = !DILocation(line: 140, column: 17, scope: !832)
!832 = distinct !DILexicalBlock(scope: !829, file: !3, line: 139, column: 5)
!833 = !DILocation(line: 140, column: 30, scope: !832)
!834 = !DILocation(line: 140, column: 7, scope: !832)
!835 = !DILocation(line: 141, column: 7, scope: !832)
!836 = !DILocation(line: 144, column: 3, scope: !100)
!837 = !DILocation(line: 146, column: 3, scope: !100)
!838 = !DILocalVariable(name: "__fp", arg: 1, scope: !839, file: !840, line: 63, type: !107)
!839 = distinct !DISubprogram(name: "getc_unlocked", scope: !840, file: !840, line: 63, type: !841, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !843)
!840 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!841 = !DISubroutineType(types: !842)
!842 = !{!47, !107}
!843 = !{!838}
!844 = !DILocation(line: 63, column: 22, scope: !839, inlinedAt: !845)
!845 = distinct !DILocation(line: 146, column: 15, scope: !100)
!846 = !DILocation(line: 65, column: 10, scope: !839, inlinedAt: !845)
!847 = !{!848, !698, i64 8}
!848 = !{!"_IO_FILE", !788, i64 0, !698, i64 8, !698, i64 16, !698, i64 24, !698, i64 32, !698, i64 40, !698, i64 48, !698, i64 56, !698, i64 64, !698, i64 72, !698, i64 80, !698, i64 88, !698, i64 96, !698, i64 104, !788, i64 112, !788, i64 116, !849, i64 120, !850, i64 128, !699, i64 130, !699, i64 131, !698, i64 136, !849, i64 144, !698, i64 152, !698, i64 160, !698, i64 168, !698, i64 176, !849, i64 184, !788, i64 192, !699, i64 196}
!849 = !{!"long", !699, i64 0}
!850 = !{!"short", !699, i64 0}
!851 = !{!848, !698, i64 16}
!852 = !{!"branch_weights", i32 2000, i32 1}
!853 = !DILocation(line: 123, column: 7, scope: !100)
!854 = !DILocation(line: 146, column: 31, scope: !100)
!855 = !DILocation(line: 148, column: 22, scope: !856)
!856 = distinct !DILexicalBlock(scope: !171, file: !3, line: 148, column: 11)
!857 = !DILocation(line: 148, column: 29, scope: !856)
!858 = !{!849, !849, i64 0}
!859 = !DILocation(line: 148, column: 26, scope: !856)
!860 = !DILocation(line: 148, column: 11, scope: !171)
!861 = !DILocation(line: 149, column: 20, scope: !856)
!862 = !DILocation(line: 149, column: 18, scope: !856)
!863 = !DILocation(line: 149, column: 9, scope: !856)
!864 = !DILocation(line: 151, column: 13, scope: !865)
!865 = distinct !DILexicalBlock(scope: !171, file: !3, line: 151, column: 11)
!866 = !DILocation(line: 151, column: 11, scope: !171)
!867 = !DILocation(line: 153, column: 11, scope: !868)
!868 = distinct !DILexicalBlock(scope: !865, file: !3, line: 152, column: 9)
!869 = !DILocation(line: 153, column: 34, scope: !868)
!870 = !DILocation(line: 154, column: 11, scope: !868)
!871 = !DILocation(line: 156, column: 11, scope: !868)
!872 = distinct !{!872, !837, !873}
!873 = !DILocation(line: 216, column: 5, scope: !100)
!874 = !DILocalVariable(name: "column", arg: 1, scope: !875, file: !3, line: 94, type: !49)
!875 = distinct !DISubprogram(name: "adjust_column", scope: !3, file: !3, line: 94, type: !876, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !878)
!876 = !DISubroutineType(types: !877)
!877 = !{!49, !49, !45}
!878 = !{!874, !879}
!879 = !DILocalVariable(name: "c", arg: 2, scope: !875, file: !3, line: 94, type: !45)
!880 = !DILocation(line: 94, column: 23, scope: !875, inlinedAt: !881)
!881 = distinct !DILocation(line: 160, column: 16, scope: !171)
!882 = !DILocation(line: 94, column: 36, scope: !875, inlinedAt: !881)
!883 = !DILocation(line: 96, column: 7, scope: !875, inlinedAt: !881)
!884 = !DILocation(line: 98, column: 11, scope: !885, inlinedAt: !881)
!885 = distinct !DILexicalBlock(scope: !886, file: !3, line: 97, column: 5)
!886 = distinct !DILexicalBlock(scope: !875, file: !3, line: 96, column: 7)
!887 = !DILocation(line: 100, column: 22, scope: !888, inlinedAt: !881)
!888 = distinct !DILexicalBlock(scope: !889, file: !3, line: 100, column: 15)
!889 = distinct !DILexicalBlock(scope: !890, file: !3, line: 99, column: 9)
!890 = distinct !DILexicalBlock(scope: !885, file: !3, line: 98, column: 11)
!891 = !DILocation(line: 101, column: 19, scope: !888, inlinedAt: !881)
!892 = !DILocation(line: 100, column: 15, scope: !889, inlinedAt: !881)
!893 = !DILocation(line: 106, column: 38, scope: !894, inlinedAt: !881)
!894 = distinct !DILexicalBlock(scope: !895, file: !3, line: 105, column: 16)
!895 = distinct !DILexicalBlock(scope: !890, file: !3, line: 103, column: 16)
!896 = !DILocation(line: 106, column: 29, scope: !894, inlinedAt: !881)
!897 = !DILocation(line: 106, column: 16, scope: !894, inlinedAt: !881)
!898 = !DILocation(line: 106, column: 9, scope: !894, inlinedAt: !881)
!899 = !DILocation(line: 108, column: 15, scope: !894, inlinedAt: !881)
!900 = !DILocation(line: 111, column: 11, scope: !886, inlinedAt: !881)
!901 = !DILocation(line: 162, column: 18, scope: !170)
!902 = !DILocation(line: 162, column: 11, scope: !171)
!903 = !DILocation(line: 167, column: 15, scope: !169)
!904 = !DILocation(line: 173, column: 15, scope: !167)
!905 = !DILocation(line: 169, column: 20, scope: !167)
!906 = !DILocation(line: 170, column: 22, scope: !167)
!907 = !DILocation(line: 176, column: 23, scope: !908)
!908 = distinct !DILexicalBlock(scope: !909, file: !3, line: 176, column: 23)
!909 = distinct !DILexicalBlock(scope: !167, file: !3, line: 174, column: 17)
!910 = distinct !{!910, !904, !911}
!911 = !DILocation(line: 181, column: 17, scope: !167)
!912 = !DILocation(line: 175, column: 19, scope: !909)
!913 = !{!850, !850, i64 0}
!914 = !DILocation(line: 176, column: 23, scope: !909)
!915 = !DILocation(line: 189, column: 19, scope: !174)
!916 = !DILocalVariable(name: "__c", arg: 1, scope: !917, file: !840, line: 105, type: !47)
!917 = distinct !DISubprogram(name: "putchar_unlocked", scope: !840, file: !840, line: 105, type: !918, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !920)
!918 = !DISubroutineType(types: !919)
!919 = !{!47, !47}
!920 = !{!916}
!921 = !DILocation(line: 105, column: 23, scope: !917, inlinedAt: !922)
!922 = distinct !DILocation(line: 191, column: 19, scope: !174)
!923 = !DILocation(line: 107, column: 10, scope: !917, inlinedAt: !922)
!924 = !{!848, !698, i64 40}
!925 = !{!848, !698, i64 48}
!926 = !DILocation(line: 194, column: 28, scope: !174)
!927 = !DILocation(line: 194, column: 47, scope: !174)
!928 = !DILocation(line: 195, column: 39, scope: !174)
!929 = !DILocation(line: 194, column: 19, scope: !174)
!930 = !DILocation(line: 185, column: 26, scope: !174)
!931 = !DILocation(line: 197, column: 42, scope: !932)
!932 = distinct !DILexicalBlock(scope: !933, file: !3, line: 197, column: 19)
!933 = distinct !DILexicalBlock(scope: !174, file: !3, line: 197, column: 19)
!934 = !DILocation(line: 197, column: 19, scope: !933)
!935 = !DILocation(line: 94, column: 23, scope: !875, inlinedAt: !936)
!936 = distinct !DILocation(line: 198, column: 30, scope: !932)
!937 = !DILocation(line: 94, column: 36, scope: !875, inlinedAt: !936)
!938 = !DILocation(line: 96, column: 7, scope: !875, inlinedAt: !936)
!939 = !DILocation(line: 198, column: 53, scope: !932)
!940 = !DILocation(line: 98, column: 11, scope: !885, inlinedAt: !936)
!941 = !DILocation(line: 100, column: 22, scope: !888, inlinedAt: !936)
!942 = !DILocation(line: 101, column: 19, scope: !888, inlinedAt: !936)
!943 = !DILocation(line: 100, column: 15, scope: !889, inlinedAt: !936)
!944 = !DILocation(line: 106, column: 38, scope: !894, inlinedAt: !936)
!945 = !DILocation(line: 106, column: 29, scope: !894, inlinedAt: !936)
!946 = !DILocation(line: 106, column: 16, scope: !894, inlinedAt: !936)
!947 = !DILocation(line: 106, column: 9, scope: !894, inlinedAt: !936)
!948 = !DILocation(line: 108, column: 15, scope: !894, inlinedAt: !936)
!949 = !DILocation(line: 111, column: 11, scope: !886, inlinedAt: !936)
!950 = !DILocation(line: 197, column: 57, scope: !932)
!951 = distinct !{!951, !934, !952}
!952 = !DILocation(line: 198, column: 64, scope: !933)
!953 = !DILocation(line: 203, column: 15, scope: !169)
!954 = !DILocation(line: 205, column: 38, scope: !955)
!955 = distinct !DILexicalBlock(scope: !956, file: !3, line: 204, column: 13)
!956 = distinct !DILexicalBlock(scope: !169, file: !3, line: 203, column: 15)
!957 = !DILocation(line: 206, column: 15, scope: !955)
!958 = !DILocation(line: 209, column: 34, scope: !169)
!959 = !DILocation(line: 210, column: 11, scope: !169)
!960 = !DILocation(line: 212, column: 11, scope: !169)
!961 = !DILocation(line: 215, column: 7, scope: !171)
!962 = !DILocation(line: 215, column: 26, scope: !171)
!963 = !DILocation(line: 215, column: 30, scope: !171)
!964 = !DILocation(line: 218, column: 17, scope: !100)
!965 = !DILocation(line: 128, column: 7, scope: !100)
!966 = !DILocation(line: 220, column: 7, scope: !967)
!967 = distinct !DILexicalBlock(scope: !100, file: !3, line: 220, column: 7)
!968 = !DILocation(line: 220, column: 7, scope: !100)
!969 = !DILocation(line: 221, column: 5, scope: !967)
!970 = !DILocalVariable(name: "__stream", arg: 1, scope: !971, file: !840, line: 132, type: !107)
!971 = distinct !DISubprogram(name: "ferror_unlocked", scope: !840, file: !840, line: 132, type: !841, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !972)
!972 = !{!970}
!973 = !DILocation(line: 132, column: 1, scope: !971, inlinedAt: !974)
!974 = distinct !DILocation(line: 223, column: 7, scope: !975)
!975 = distinct !DILexicalBlock(scope: !100, file: !3, line: 223, column: 7)
!976 = !DILocation(line: 134, column: 10, scope: !971, inlinedAt: !974)
!977 = !{!848, !788, i64 0}
!978 = !DILocation(line: 223, column: 7, scope: !975)
!979 = !DILocation(line: 223, column: 7, scope: !100)
!980 = !DILocation(line: 225, column: 36, scope: !981)
!981 = distinct !DILexicalBlock(scope: !975, file: !3, line: 224, column: 5)
!982 = !DILocation(line: 225, column: 7, scope: !981)
!983 = !DILocation(line: 226, column: 12, scope: !984)
!984 = distinct !DILexicalBlock(scope: !981, file: !3, line: 226, column: 11)
!985 = !DILocation(line: 226, column: 11, scope: !981)
!986 = !DILocation(line: 227, column: 9, scope: !984)
!987 = !DILocation(line: 230, column: 8, scope: !988)
!988 = distinct !DILexicalBlock(scope: !100, file: !3, line: 230, column: 7)
!989 = !DILocation(line: 230, column: 30, scope: !988)
!990 = !DILocation(line: 230, column: 33, scope: !988)
!991 = !DILocation(line: 230, column: 50, scope: !988)
!992 = !DILocation(line: 230, column: 7, scope: !100)
!993 = !DILocation(line: 232, column: 17, scope: !994)
!994 = distinct !DILexicalBlock(scope: !988, file: !3, line: 231, column: 5)
!995 = !DILocation(line: 232, column: 30, scope: !994)
!996 = !DILocation(line: 232, column: 7, scope: !994)
!997 = !DILocation(line: 233, column: 7, scope: !994)
!998 = !DILocation(line: 237, column: 1, scope: !100)
!999 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !194, file: !194, line: 41, type: !66, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !189, variables: !1000)
!1000 = !{!1001}
!1001 = !DILocalVariable(name: "file", arg: 1, scope: !999, file: !194, line: 41, type: !68)
!1002 = !DILocation(line: 41, column: 41, scope: !999)
!1003 = !DILocation(line: 43, column: 13, scope: !999)
!1004 = !DILocation(line: 44, column: 1, scope: !999)
!1005 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !194, file: !194, line: 78, type: !1006, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !189, variables: !1008)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{null, !57}
!1008 = !{!1009}
!1009 = !DILocalVariable(name: "ignore", arg: 1, scope: !1005, file: !194, line: 78, type: !57)
!1010 = !DILocation(line: 78, column: 37, scope: !1005)
!1011 = !DILocation(line: 80, column: 16, scope: !1005)
!1012 = !{!1013, !1013, i64 0}
!1013 = !{!"_Bool", !699, i64 0}
!1014 = !DILocation(line: 81, column: 1, scope: !1005)
!1015 = distinct !DISubprogram(name: "close_stdout", scope: !194, file: !194, line: 107, type: !706, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, unit: !189, variables: !1016)
!1016 = !{!1017}
!1017 = !DILocalVariable(name: "write_error", scope: !1018, file: !194, line: 112, type: !68)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !194, line: 111, column: 5)
!1019 = distinct !DILexicalBlock(scope: !1015, file: !194, line: 109, column: 7)
!1020 = !DILocation(line: 109, column: 21, scope: !1019)
!1021 = !DILocation(line: 109, column: 7, scope: !1019)
!1022 = !DILocation(line: 109, column: 29, scope: !1019)
!1023 = !DILocation(line: 110, column: 7, scope: !1019)
!1024 = !DILocation(line: 110, column: 12, scope: !1019)
!1025 = !{i8 0, i8 2}
!1026 = !DILocation(line: 114, column: 19, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1018, file: !194, line: 113, column: 11)
!1028 = !DILocation(line: 110, column: 25, scope: !1019)
!1029 = !DILocation(line: 110, column: 28, scope: !1019)
!1030 = !DILocation(line: 110, column: 34, scope: !1019)
!1031 = !DILocation(line: 109, column: 7, scope: !1015)
!1032 = !DILocation(line: 112, column: 33, scope: !1018)
!1033 = !DILocation(line: 112, column: 19, scope: !1018)
!1034 = !DILocation(line: 113, column: 11, scope: !1027)
!1035 = !DILocation(line: 113, column: 11, scope: !1018)
!1036 = !DILocation(line: 114, column: 36, scope: !1027)
!1037 = !DILocation(line: 114, column: 9, scope: !1027)
!1038 = !DILocation(line: 117, column: 9, scope: !1027)
!1039 = !DILocation(line: 119, column: 14, scope: !1018)
!1040 = !DILocation(line: 119, column: 7, scope: !1018)
!1041 = !DILocation(line: 122, column: 22, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1015, file: !194, line: 122, column: 8)
!1043 = !DILocation(line: 122, column: 8, scope: !1042)
!1044 = !DILocation(line: 122, column: 30, scope: !1042)
!1045 = !DILocation(line: 122, column: 8, scope: !1015)
!1046 = !DILocation(line: 123, column: 13, scope: !1042)
!1047 = !DILocation(line: 123, column: 6, scope: !1042)
!1048 = !DILocation(line: 124, column: 1, scope: !1015)
!1049 = distinct !DISubprogram(name: "fdadvise", scope: !1050, file: !1050, line: 31, type: !1051, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !619, variables: !1056)
!1050 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1051 = !DISubroutineType(types: !1052)
!1052 = !{null, !47, !1053, !1053, !1055}
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !1054, line: 57, baseType: !137)
!1054 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "fadvice_t", file: !20, line: 52, baseType: !19)
!1056 = !{!1057, !1058, !1059, !1060, !1061}
!1057 = !DILocalVariable(name: "fd", arg: 1, scope: !1049, file: !1050, line: 31, type: !47)
!1058 = !DILocalVariable(name: "offset", arg: 2, scope: !1049, file: !1050, line: 31, type: !1053)
!1059 = !DILocalVariable(name: "len", arg: 3, scope: !1049, file: !1050, line: 31, type: !1053)
!1060 = !DILocalVariable(name: "advice", arg: 4, scope: !1049, file: !1050, line: 31, type: !1055)
!1061 = !DILocalVariable(name: "__x", scope: !1062, file: !1050, line: 34, type: !47)
!1062 = distinct !DILexicalBlock(scope: !1049, file: !1050, line: 34, column: 3)
!1063 = !DILocation(line: 31, column: 15, scope: !1049)
!1064 = !DILocation(line: 31, column: 25, scope: !1049)
!1065 = !DILocation(line: 31, column: 39, scope: !1049)
!1066 = !DILocation(line: 31, column: 54, scope: !1049)
!1067 = !DILocation(line: 34, column: 3, scope: !1062)
!1068 = !DILocation(line: 36, column: 1, scope: !1049)
!1069 = distinct !DISubprogram(name: "fadvise", scope: !1050, file: !1050, line: 39, type: !1070, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !619, variables: !1112)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{null, !1072, !1055}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !109, line: 7, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !111, line: 241, size: 1728, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1074, file: !111, line: 242, baseType: !47, size: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1074, file: !111, line: 247, baseType: !44, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1074, file: !111, line: 248, baseType: !44, size: 64, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1074, file: !111, line: 249, baseType: !44, size: 64, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1074, file: !111, line: 250, baseType: !44, size: 64, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1074, file: !111, line: 251, baseType: !44, size: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1074, file: !111, line: 252, baseType: !44, size: 64, offset: 384)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1074, file: !111, line: 253, baseType: !44, size: 64, offset: 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1074, file: !111, line: 254, baseType: !44, size: 64, offset: 512)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1074, file: !111, line: 256, baseType: !44, size: 64, offset: 576)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1074, file: !111, line: 257, baseType: !44, size: 64, offset: 640)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1074, file: !111, line: 258, baseType: !44, size: 64, offset: 704)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1074, file: !111, line: 260, baseType: !1089, size: 64, offset: 768)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !111, line: 156, size: 192, elements: !1091)
!1091 = !{!1092, !1093, !1095}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1090, file: !111, line: 157, baseType: !1089, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1090, file: !111, line: 158, baseType: !1094, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1090, file: !111, line: 162, baseType: !47, size: 32, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1074, file: !111, line: 262, baseType: !1094, size: 64, offset: 832)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1074, file: !111, line: 264, baseType: !47, size: 32, offset: 896)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1074, file: !111, line: 268, baseType: !47, size: 32, offset: 928)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1074, file: !111, line: 270, baseType: !137, size: 64, offset: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1074, file: !111, line: 274, baseType: !48, size: 16, offset: 1024)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1074, file: !111, line: 275, baseType: !142, size: 8, offset: 1040)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1074, file: !111, line: 276, baseType: !144, size: 8, offset: 1048)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1074, file: !111, line: 280, baseType: !148, size: 64, offset: 1088)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1074, file: !111, line: 289, baseType: !151, size: 64, offset: 1152)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1074, file: !111, line: 297, baseType: !46, size: 64, offset: 1216)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1074, file: !111, line: 298, baseType: !46, size: 64, offset: 1280)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1074, file: !111, line: 299, baseType: !46, size: 64, offset: 1344)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1074, file: !111, line: 300, baseType: !46, size: 64, offset: 1408)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1074, file: !111, line: 302, baseType: !49, size: 64, offset: 1472)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1074, file: !111, line: 303, baseType: !47, size: 32, offset: 1536)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1074, file: !111, line: 305, baseType: !159, size: 160, offset: 1568)
!1112 = !{!1113, !1114}
!1113 = !DILocalVariable(name: "fp", arg: 1, scope: !1069, file: !1050, line: 39, type: !1072)
!1114 = !DILocalVariable(name: "advice", arg: 2, scope: !1069, file: !1050, line: 39, type: !1055)
!1115 = !DILocation(line: 39, column: 16, scope: !1069)
!1116 = !DILocation(line: 39, column: 30, scope: !1069)
!1117 = !DILocation(line: 41, column: 7, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1069, file: !1050, line: 41, column: 7)
!1119 = !DILocation(line: 41, column: 7, scope: !1069)
!1120 = !DILocation(line: 42, column: 15, scope: !1118)
!1121 = !DILocation(line: 31, column: 15, scope: !1049, inlinedAt: !1122)
!1122 = distinct !DILocation(line: 42, column: 5, scope: !1118)
!1123 = !DILocation(line: 31, column: 25, scope: !1049, inlinedAt: !1122)
!1124 = !DILocation(line: 31, column: 39, scope: !1049, inlinedAt: !1122)
!1125 = !DILocation(line: 31, column: 54, scope: !1049, inlinedAt: !1122)
!1126 = !DILocation(line: 34, column: 3, scope: !1062, inlinedAt: !1122)
!1127 = !DILocation(line: 42, column: 5, scope: !1118)
!1128 = !DILocation(line: 43, column: 1, scope: !1069)
!1129 = distinct !DISubprogram(name: "set_program_name", scope: !208, file: !208, line: 39, type: !66, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !204, variables: !1130)
!1130 = !{!1131, !1132, !1133}
!1131 = !DILocalVariable(name: "argv0", arg: 1, scope: !1129, file: !208, line: 39, type: !68)
!1132 = !DILocalVariable(name: "slash", scope: !1129, file: !208, line: 46, type: !68)
!1133 = !DILocalVariable(name: "base", scope: !1129, file: !208, line: 47, type: !68)
!1134 = !DILocation(line: 39, column: 31, scope: !1129)
!1135 = !DILocation(line: 51, column: 13, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1129, file: !208, line: 51, column: 7)
!1137 = !DILocation(line: 51, column: 7, scope: !1129)
!1138 = !DILocation(line: 55, column: 14, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1136, file: !208, line: 52, column: 5)
!1140 = !DILocation(line: 54, column: 7, scope: !1139)
!1141 = !DILocation(line: 56, column: 7, scope: !1139)
!1142 = !DILocation(line: 59, column: 11, scope: !1129)
!1143 = !DILocation(line: 46, column: 15, scope: !1129)
!1144 = !DILocation(line: 60, column: 17, scope: !1129)
!1145 = !DILocation(line: 60, column: 33, scope: !1129)
!1146 = !DILocation(line: 60, column: 11, scope: !1129)
!1147 = !DILocation(line: 47, column: 15, scope: !1129)
!1148 = !DILocation(line: 61, column: 12, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1129, file: !208, line: 61, column: 7)
!1150 = !DILocation(line: 61, column: 20, scope: !1149)
!1151 = !DILocation(line: 61, column: 25, scope: !1149)
!1152 = !DILocation(line: 61, column: 42, scope: !1149)
!1153 = !DILocation(line: 61, column: 28, scope: !1149)
!1154 = !DILocation(line: 61, column: 61, scope: !1149)
!1155 = !DILocation(line: 61, column: 7, scope: !1129)
!1156 = !DILocation(line: 64, column: 11, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !208, line: 64, column: 11)
!1158 = distinct !DILexicalBlock(scope: !1149, file: !208, line: 62, column: 5)
!1159 = !DILocation(line: 64, column: 36, scope: !1157)
!1160 = !DILocation(line: 64, column: 11, scope: !1158)
!1161 = !DILocation(line: 66, column: 24, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1157, file: !208, line: 65, column: 9)
!1163 = !DILocation(line: 70, column: 41, scope: !1162)
!1164 = !DILocation(line: 72, column: 9, scope: !1162)
!1165 = !DILocation(line: 84, column: 16, scope: !1129)
!1166 = !DILocation(line: 90, column: 27, scope: !1129)
!1167 = !DILocation(line: 92, column: 1, scope: !1129)
!1168 = distinct !DISubprogram(name: "clone_quoting_options", scope: !223, file: !223, line: 114, type: !1169, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, unit: !211, variables: !1172)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!1171, !1171}
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!1172 = !{!1173, !1174, !1175}
!1173 = !DILocalVariable(name: "o", arg: 1, scope: !1168, file: !223, line: 114, type: !1171)
!1174 = !DILocalVariable(name: "e", scope: !1168, file: !223, line: 116, type: !47)
!1175 = !DILocalVariable(name: "p", scope: !1168, file: !223, line: 117, type: !1171)
!1176 = !DILocation(line: 114, column: 48, scope: !1168)
!1177 = !DILocation(line: 116, column: 11, scope: !1168)
!1178 = !DILocation(line: 116, column: 7, scope: !1168)
!1179 = !DILocation(line: 117, column: 40, scope: !1168)
!1180 = !DILocation(line: 117, column: 31, scope: !1168)
!1181 = !DILocation(line: 117, column: 27, scope: !1168)
!1182 = !DILocation(line: 119, column: 9, scope: !1168)
!1183 = !DILocation(line: 120, column: 3, scope: !1168)
!1184 = distinct !DISubprogram(name: "get_quoting_style", scope: !223, file: !223, line: 125, type: !1185, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !211, variables: !1189)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!5, !1187}
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!1189 = !{!1190}
!1190 = !DILocalVariable(name: "o", arg: 1, scope: !1184, file: !223, line: 125, type: !1187)
!1191 = !DILocation(line: 125, column: 50, scope: !1184)
!1192 = !DILocation(line: 127, column: 11, scope: !1184)
!1193 = !DILocation(line: 127, column: 46, scope: !1184)
!1194 = !{!1195, !699, i64 0}
!1195 = !{!"quoting_options", !699, i64 0, !788, i64 4, !699, i64 8, !698, i64 40, !698, i64 48}
!1196 = !DILocation(line: 127, column: 3, scope: !1184)
!1197 = distinct !DISubprogram(name: "set_quoting_style", scope: !223, file: !223, line: 133, type: !1198, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, unit: !211, variables: !1200)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{null, !1171, !5}
!1200 = !{!1201, !1202}
!1201 = !DILocalVariable(name: "o", arg: 1, scope: !1197, file: !223, line: 133, type: !1171)
!1202 = !DILocalVariable(name: "s", arg: 2, scope: !1197, file: !223, line: 133, type: !5)
!1203 = !DILocation(line: 133, column: 44, scope: !1197)
!1204 = !DILocation(line: 133, column: 66, scope: !1197)
!1205 = !DILocation(line: 135, column: 4, scope: !1197)
!1206 = !DILocation(line: 135, column: 39, scope: !1197)
!1207 = !DILocation(line: 135, column: 45, scope: !1197)
!1208 = !DILocation(line: 136, column: 1, scope: !1197)
!1209 = distinct !DISubprogram(name: "set_char_quoting", scope: !223, file: !223, line: 144, type: !1210, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, unit: !211, variables: !1212)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!47, !1171, !45, !47}
!1212 = !{!1213, !1214, !1215, !1216, !1217, !1219, !1220}
!1213 = !DILocalVariable(name: "o", arg: 1, scope: !1209, file: !223, line: 144, type: !1171)
!1214 = !DILocalVariable(name: "c", arg: 2, scope: !1209, file: !223, line: 144, type: !45)
!1215 = !DILocalVariable(name: "i", arg: 3, scope: !1209, file: !223, line: 144, type: !47)
!1216 = !DILocalVariable(name: "uc", scope: !1209, file: !223, line: 146, type: !53)
!1217 = !DILocalVariable(name: "p", scope: !1209, file: !223, line: 147, type: !1218)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!1219 = !DILocalVariable(name: "shift", scope: !1209, file: !223, line: 149, type: !47)
!1220 = !DILocalVariable(name: "r", scope: !1209, file: !223, line: 150, type: !47)
!1221 = !DILocation(line: 144, column: 43, scope: !1209)
!1222 = !DILocation(line: 144, column: 51, scope: !1209)
!1223 = !DILocation(line: 144, column: 58, scope: !1209)
!1224 = !DILocation(line: 146, column: 17, scope: !1209)
!1225 = !DILocation(line: 148, column: 6, scope: !1209)
!1226 = !DILocation(line: 148, column: 62, scope: !1209)
!1227 = !DILocation(line: 148, column: 57, scope: !1209)
!1228 = !DILocation(line: 147, column: 17, scope: !1209)
!1229 = !DILocation(line: 149, column: 18, scope: !1209)
!1230 = !DILocation(line: 149, column: 15, scope: !1209)
!1231 = !DILocation(line: 149, column: 7, scope: !1209)
!1232 = !DILocation(line: 150, column: 12, scope: !1209)
!1233 = !DILocation(line: 150, column: 15, scope: !1209)
!1234 = !DILocation(line: 150, column: 25, scope: !1209)
!1235 = !DILocation(line: 150, column: 7, scope: !1209)
!1236 = !DILocation(line: 151, column: 13, scope: !1209)
!1237 = !DILocation(line: 151, column: 18, scope: !1209)
!1238 = !DILocation(line: 151, column: 23, scope: !1209)
!1239 = !DILocation(line: 151, column: 6, scope: !1209)
!1240 = !DILocation(line: 152, column: 3, scope: !1209)
!1241 = distinct !DISubprogram(name: "set_quoting_flags", scope: !223, file: !223, line: 160, type: !1242, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, unit: !211, variables: !1244)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!47, !1171, !47}
!1244 = !{!1245, !1246, !1247}
!1245 = !DILocalVariable(name: "o", arg: 1, scope: !1241, file: !223, line: 160, type: !1171)
!1246 = !DILocalVariable(name: "i", arg: 2, scope: !1241, file: !223, line: 160, type: !47)
!1247 = !DILocalVariable(name: "r", scope: !1241, file: !223, line: 162, type: !47)
!1248 = !DILocation(line: 160, column: 44, scope: !1241)
!1249 = !DILocation(line: 160, column: 51, scope: !1241)
!1250 = !DILocation(line: 163, column: 8, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1241, file: !223, line: 163, column: 7)
!1252 = !DILocation(line: 163, column: 7, scope: !1241)
!1253 = !DILocation(line: 165, column: 10, scope: !1241)
!1254 = !{!1195, !788, i64 4}
!1255 = !DILocation(line: 162, column: 7, scope: !1241)
!1256 = !DILocation(line: 166, column: 12, scope: !1241)
!1257 = !DILocation(line: 167, column: 3, scope: !1241)
!1258 = distinct !DISubprogram(name: "set_custom_quoting", scope: !223, file: !223, line: 171, type: !1259, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: true, unit: !211, variables: !1261)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{null, !1171, !68, !68}
!1261 = !{!1262, !1263, !1264}
!1262 = !DILocalVariable(name: "o", arg: 1, scope: !1258, file: !223, line: 171, type: !1171)
!1263 = !DILocalVariable(name: "left_quote", arg: 2, scope: !1258, file: !223, line: 172, type: !68)
!1264 = !DILocalVariable(name: "right_quote", arg: 3, scope: !1258, file: !223, line: 172, type: !68)
!1265 = !DILocation(line: 171, column: 45, scope: !1258)
!1266 = !DILocation(line: 172, column: 33, scope: !1258)
!1267 = !DILocation(line: 172, column: 57, scope: !1258)
!1268 = !DILocation(line: 174, column: 8, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1258, file: !223, line: 174, column: 7)
!1270 = !DILocation(line: 174, column: 7, scope: !1258)
!1271 = !DILocation(line: 176, column: 6, scope: !1258)
!1272 = !DILocation(line: 176, column: 12, scope: !1258)
!1273 = !DILocation(line: 177, column: 8, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1258, file: !223, line: 177, column: 7)
!1275 = !DILocation(line: 177, column: 23, scope: !1274)
!1276 = !DILocation(line: 177, column: 19, scope: !1274)
!1277 = !DILocation(line: 178, column: 5, scope: !1274)
!1278 = !DILocation(line: 179, column: 6, scope: !1258)
!1279 = !DILocation(line: 179, column: 17, scope: !1258)
!1280 = !{!1195, !698, i64 40}
!1281 = !DILocation(line: 180, column: 6, scope: !1258)
!1282 = !DILocation(line: 180, column: 18, scope: !1258)
!1283 = !{!1195, !698, i64 48}
!1284 = !DILocation(line: 181, column: 1, scope: !1258)
!1285 = distinct !DISubprogram(name: "quotearg_buffer", scope: !223, file: !223, line: 776, type: !1286, isLocal: false, isDefinition: true, scopeLine: 779, flags: DIFlagPrototyped, isOptimized: true, unit: !211, variables: !1288)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!49, !44, !49, !68, !49, !1187}
!1288 = !{!1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296}
!1289 = !DILocalVariable(name: "buffer", arg: 1, scope: !1285, file: !223, line: 776, type: !44)
!1290 = !DILocalVariable(name: "buffersize", arg: 2, scope: !1285, file: !223, line: 776, type: !49)
!1291 = !DILocalVariable(name: "arg", arg: 3, scope: !1285, file: !223, line: 777, type: !68)
!1292 = !DILocalVariable(name: "argsize", arg: 4, scope: !1285, file: !223, line: 777, type: !49)
!1293 = !DILocalVariable(name: "o", arg: 5, scope: !1285, file: !223, line: 778, type: !1187)
