; ModuleID = 'coreutils-8.27/src/ginstall.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, %struct.hash_table*, %struct.hash_table* }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "owner_name", scope: !2, file: !3, line: 74, type: !87, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !81, globals: !142)
!3 = !DIFile(filename: "src/install.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !12, !19, !25, !31, !36, !50, !58}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 28, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "no_backups", value: 0)
!9 = !DIEnumerator(name: "simple_backups", value: 1)
!10 = !DIEnumerator(name: "numbered_existing_backups", value: 2)
!11 = !DIEnumerator(name: "numbered_backups", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !13, line: 69, size: 32, elements: !14)
!13 = !DIFile(filename: "src/copy.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1)
!16 = !DIEnumerator(name: "DEREF_NEVER", value: 2)
!17 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3)
!18 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !13, line: 60, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1)
!22 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2)
!23 = !DIEnumerator(name: "I_ASK_USER", value: 3)
!24 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !13, line: 26, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0)
!28 = !DIEnumerator(name: "SPARSE_NEVER", value: 1)
!29 = !DIEnumerator(name: "SPARSE_AUTO", value: 2)
!30 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !13, line: 47, size: 32, elements: !32)
!32 = !{!33, !34, !35}
!33 = !DIEnumerator(name: "REFLINK_NEVER", value: 0)
!34 = !DIEnumerator(name: "REFLINK_AUTO", value: 1)
!35 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !37, line: 32, size: 32, elements: !38)
!37 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!39 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!40 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!41 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!42 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!43 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!44 = !DIEnumerator(name: "c_quoting_style", value: 5)
!45 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!46 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!47 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!48 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!49 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !51, line: 26, size: 32, elements: !52)
!51 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!54 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!55 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!56 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!57 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !60, file: !59, line: 39, size: 32, elements: !74)
!59 = !DIFile(filename: "./lib/savewd.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !59, line: 36, size: 64, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !60, file: !59, line: 66, baseType: !58, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !60, file: !59, line: 74, baseType: !64, size: 32, offset: 32)
!64 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !60, file: !59, line: 69, size: 32, elements: !65)
!65 = !{!66, !68, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !64, file: !59, line: 71, baseType: !67, size: 32)
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !64, file: !59, line: 72, baseType: !67, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !64, file: !59, line: 73, baseType: !70, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !71, line: 98, baseType: !72)
!71 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !73, line: 142, baseType: !67)
!73 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!74 = !{!75, !76, !77, !78, !79, !80}
!75 = !DIEnumerator(name: "INITIAL_STATE", value: 0)
!76 = !DIEnumerator(name: "FD_STATE", value: 1)
!77 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2)
!78 = !DIEnumerator(name: "FORKING_STATE", value: 3)
!79 = !DIEnumerator(name: "ERROR_STATE", value: 4)
!80 = !DIEnumerator(name: "FINAL_STATE", value: 5)
!81 = !{!82, !87, !89, !90, !93, !95}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !83, line: 68, baseType: !84)
!83 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !67}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !71, line: 80, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !73, line: 134, baseType: !92)
!92 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !71, line: 65, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !73, line: 135, baseType: !92)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !13, line: 98, size: 576, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !105, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !141}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !96, file: !13, line: 100, baseType: !5, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !96, file: !13, line: 103, baseType: !12, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !96, file: !13, line: 108, baseType: !19, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !96, file: !13, line: 111, baseType: !25, size: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !96, file: !13, line: 115, baseType: !103, size: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !71, line: 70, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !73, line: 138, baseType: !92)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !96, file: !13, line: 119, baseType: !106, size: 8, offset: 160)
!106 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !96, file: !13, line: 123, baseType: !106, size: 8, offset: 168)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !96, file: !13, line: 130, baseType: !106, size: 8, offset: 176)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !96, file: !13, line: 134, baseType: !106, size: 8, offset: 184)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !96, file: !13, line: 138, baseType: !106, size: 8, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !96, file: !13, line: 141, baseType: !106, size: 8, offset: 200)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !96, file: !13, line: 145, baseType: !106, size: 8, offset: 208)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !96, file: !13, line: 152, baseType: !106, size: 8, offset: 216)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !96, file: !13, line: 156, baseType: !106, size: 8, offset: 224)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !96, file: !13, line: 160, baseType: !106, size: 8, offset: 232)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !96, file: !13, line: 161, baseType: !106, size: 8, offset: 240)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !96, file: !13, line: 162, baseType: !106, size: 8, offset: 248)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !96, file: !13, line: 163, baseType: !106, size: 8, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !96, file: !13, line: 166, baseType: !106, size: 8, offset: 264)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !96, file: !13, line: 178, baseType: !106, size: 8, offset: 272)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !96, file: !13, line: 182, baseType: !106, size: 8, offset: 280)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !96, file: !13, line: 188, baseType: !106, size: 8, offset: 288)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !96, file: !13, line: 192, baseType: !106, size: 8, offset: 296)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !96, file: !13, line: 201, baseType: !106, size: 8, offset: 304)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !96, file: !13, line: 205, baseType: !106, size: 8, offset: 312)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !96, file: !13, line: 214, baseType: !106, size: 8, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !96, file: !13, line: 223, baseType: !106, size: 8, offset: 328)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !96, file: !13, line: 227, baseType: !106, size: 8, offset: 336)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !96, file: !13, line: 231, baseType: !106, size: 8, offset: 344)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !96, file: !13, line: 235, baseType: !106, size: 8, offset: 352)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !96, file: !13, line: 239, baseType: !106, size: 8, offset: 360)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !96, file: !13, line: 242, baseType: !106, size: 8, offset: 368)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !96, file: !13, line: 245, baseType: !106, size: 8, offset: 376)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !96, file: !13, line: 250, baseType: !106, size: 8, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !96, file: !13, line: 253, baseType: !31, size: 32, offset: 416)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !96, file: !13, line: 264, baseType: !137, size: 64, offset: 448)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !139, line: 69, baseType: !140)
!139 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !139, line: 67, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !96, file: !13, line: 267, baseType: !137, size: 64, offset: 512)
!142 = !{!0, !143, !145, !147, !149, !151, !173, !175, !189, !191, !193, !195, !197, !199, !201, !203, !218, !220}
!143 = !DIGlobalVariableExpression(var: !144)
!144 = distinct !DIGlobalVariable(name: "group_name", scope: !2, file: !3, line: 81, type: !87, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146)
!146 = distinct !DIGlobalVariable(name: "copy_only_if_needed", scope: !2, file: !3, line: 102, type: !106, isLocal: true, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148)
!148 = distinct !DIGlobalVariable(name: "strip_files", scope: !2, file: !3, line: 105, type: !106, isLocal: true, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150)
!150 = distinct !DIGlobalVariable(name: "dir_arg", scope: !2, file: !3, line: 108, type: !106, isLocal: true, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152)
!152 = distinct !DIGlobalVariable(name: "infomap", scope: !153, file: !154, line: 632, type: !170, isLocal: true, isDefinition: true)
!153 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !154, file: !154, line: 630, type: !155, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !159)
!154 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!155 = !DISubroutineType(types: !156)
!156 = !{null, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!159 = !{!160, !161, !162, !169}
!160 = !DILocalVariable(name: "program", arg: 1, scope: !153, file: !154, line: 630, type: !157)
!161 = !DILocalVariable(name: "node", scope: !153, file: !154, line: 642, type: !157)
!162 = !DILocalVariable(name: "map_prog", scope: !153, file: !154, line: 643, type: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !153, file: !154, line: 632, size: 128, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !165, file: !154, line: 632, baseType: !157, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !165, file: !154, line: 632, baseType: !157, size: 64, offset: 64)
!169 = !DILocalVariable(name: "lc_messages", scope: !153, file: !154, line: 655, type: !157)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 896, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 7)
!173 = !DIGlobalVariableExpression(var: !174)
!174 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !2, file: !3, line: 53, type: !67, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176)
!176 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 121, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 4608, elements: !187)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !180, line: 50, size: 256, elements: !181)
!180 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!181 = !{!182, !183, !184, !186}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !180, line: 52, baseType: !157, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !179, file: !180, line: 55, baseType: !67, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !179, file: !180, line: 56, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !179, file: !180, line: 57, baseType: !67, size: 32, offset: 192)
!187 = !{!188}
!188 = !DISubrange(count: 18)
!189 = !DIGlobalVariableExpression(var: !190)
!190 = distinct !DIGlobalVariable(name: "strip_program", scope: !2, file: !3, line: 111, type: !157, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192)
!192 = distinct !DIGlobalVariable(name: "use_default_selinux_context", scope: !2, file: !3, line: 54, type: !106, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194)
!194 = distinct !DIGlobalVariable(name: "mode", scope: !2, file: !3, line: 90, type: !103, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196)
!196 = distinct !DIGlobalVariable(name: "dir_mode_bits", scope: !2, file: !3, line: 99, type: !103, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198)
!198 = distinct !DIGlobalVariable(name: "dir_mode", scope: !2, file: !3, line: 93, type: !103, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200)
!200 = distinct !DIGlobalVariable(name: "owner_id", scope: !2, file: !3, line: 77, type: !90, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202)
!202 = distinct !DIGlobalVariable(name: "group_id", scope: !2, file: !3, line: 84, type: !93, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204)
!204 = distinct !DIGlobalVariable(name: "a_buff", scope: !205, file: !3, line: 149, type: !215, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "have_same_content", scope: !3, file: !3, line: 146, type: !206, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !208)
!206 = !DISubroutineType(types: !207)
!207 = !{!106, !67, !67}
!208 = !{!209, !210, !211}
!209 = !DILocalVariable(name: "a_fd", arg: 1, scope: !205, file: !3, line: 146, type: !67)
!210 = !DILocalVariable(name: "b_fd", arg: 2, scope: !205, file: !3, line: 146, type: !67)
!211 = !DILocalVariable(name: "size", scope: !205, file: !3, line: 152, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !213, line: 62, baseType: !214)
!213 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!214 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 32768, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 4096)
!218 = !DIGlobalVariableExpression(var: !219)
!219 = distinct !DIGlobalVariable(name: "b_buff", scope: !205, file: !3, line: 150, type: !215, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221)
!221 = distinct !DIGlobalVariable(name: "first_call", scope: !222, file: !3, line: 318, type: !106, isLocal: true, isDefinition: true)
!222 = distinct !DISubprogram(name: "setdefaultfilecon", scope: !3, file: !3, line: 314, type: !155, isLocal: true, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !223)
!223 = !{!224, !225, !261, !262, !265, !266}
!224 = !DILocalVariable(name: "file", arg: 1, scope: !222, file: !3, line: 314, type: !157)
!225 = !DILocalVariable(name: "st", scope: !222, file: !3, line: 316, type: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !227, line: 46, size: 1152, elements: !228)
!227 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!228 = !{!229, !231, !233, !235, !236, !237, !238, !239, !240, !243, !245, !247, !255, !256, !257}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !226, file: !227, line: 48, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !73, line: 133, baseType: !214)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !226, file: !227, line: 53, baseType: !232, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !73, line: 136, baseType: !214)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !226, file: !227, line: 61, baseType: !234, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !73, line: 139, baseType: !214)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !226, file: !227, line: 62, baseType: !104, size: 32, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !226, file: !227, line: 64, baseType: !91, size: 32, offset: 224)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !226, file: !227, line: 65, baseType: !94, size: 32, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !226, file: !227, line: 67, baseType: !67, size: 32, offset: 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !226, file: !227, line: 69, baseType: !230, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !226, file: !227, line: 74, baseType: !241, size: 64, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !73, line: 140, baseType: !242)
!242 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !226, file: !227, line: 78, baseType: !244, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !73, line: 162, baseType: !242)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !226, file: !227, line: 80, baseType: !246, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !73, line: 167, baseType: !242)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !226, file: !227, line: 91, baseType: !248, size: 128, offset: 576)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !249, line: 8, size: 128, elements: !250)
!249 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!250 = !{!251, !253}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !248, file: !249, line: 10, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !73, line: 148, baseType: !242)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !248, file: !249, line: 11, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !73, line: 184, baseType: !242)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !226, file: !227, line: 92, baseType: !248, size: 128, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !226, file: !227, line: 93, baseType: !248, size: 128, offset: 832)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !226, file: !227, line: 106, baseType: !258, size: 192, offset: 960)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 192, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 3)
!261 = !DILocalVariable(name: "scontext", scope: !222, file: !3, line: 317, type: !87)
!262 = !DILocalVariable(name: "p0", scope: !263, file: !3, line: 337, type: !157)
!263 = distinct !DILexicalBlock(scope: !264, file: !3, line: 329, column: 5)
!264 = distinct !DILexicalBlock(scope: !222, file: !3, line: 328, column: 7)
!265 = !DILocalVariable(name: "p", scope: !263, file: !3, line: 338, type: !157)
!266 = !DILocalVariable(name: "prefix", scope: !267, file: !3, line: 347, type: !87)
!267 = distinct !DILexicalBlock(scope: !268, file: !3, line: 346, column: 9)
!268 = distinct !DILexicalBlock(scope: !263, file: !3, line: 345, column: 11)
!269 = !DIGlobalVariableExpression(var: !270)
!270 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !271, file: !272, line: 146, type: !157, isLocal: true, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !273, retainedTypes: !298, globals: !302)
!272 = !DIFile(filename: "src/copy.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!273 = !{!5, !12, !19, !25, !31, !36, !274, !278, !285, !294}
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !275, line: 27, size: 32, elements: !276)
!275 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!276 = !{!277}
!277 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !279, line: 26, size: 32, elements: !280)
!279 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!280 = !{!281, !282, !283, !284}
!281 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0)
!282 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1)
!283 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2)
!284 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !286, line: 45, size: 32, elements: !287)
!286 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!287 = !{!288, !289, !290, !291, !292, !293}
!288 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!289 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!290 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!291 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!292 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!293 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 73, size: 32, elements: !296)
!295 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!296 = !{!297}
!297 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072)
!298 = !{!103, !89, !92, !87, !214, !299, !212, !300}
!299 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !301, line: 57, baseType: !241)
!301 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!302 = !{!303, !269, !309, !311, !321, !323}
!303 = !DIGlobalVariableExpression(var: !304)
!304 = distinct !DIGlobalVariable(name: "mask", scope: !305, file: !272, line: 2992, type: !103, isLocal: true, isDefinition: true)
!305 = distinct !DISubprogram(name: "cached_umask", scope: !272, file: !272, line: 2990, type: !306, isLocal: false, isDefinition: true, scopeLine: 2991, flags: DIFlagPrototyped, isOptimized: true, unit: !271, variables: !308)
!306 = !DISubroutineType(types: !307)
!307 = !{!103}
!308 = !{}
!309 = !DIGlobalVariableExpression(var: !310)
!310 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !271, file: !272, line: 147, type: !157, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312)
!312 = distinct !DIGlobalVariable(name: "zeros", scope: !313, file: !272, line: 350, type: !87, isLocal: true, isDefinition: true)
!313 = distinct !DISubprogram(name: "write_zeros", scope: !272, file: !272, line: 348, type: !314, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, unit: !271, variables: !316)
!314 = !DISubroutineType(types: !315)
!315 = !{!106, !67, !300}
!316 = !{!317, !318, !319}
!317 = !DILocalVariable(name: "fd", arg: 1, scope: !313, file: !272, line: 348, type: !67)
!318 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !313, file: !272, line: 348, type: !300)
!319 = !DILocalVariable(name: "n", scope: !320, file: !272, line: 369, type: !212)
!320 = distinct !DILexicalBlock(scope: !313, file: !272, line: 368, column: 5)
!321 = !DIGlobalVariableExpression(var: !322)
!322 = distinct !DIGlobalVariable(name: "nz", scope: !313, file: !272, line: 351, type: !212, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324)
!324 = distinct !DIGlobalVariable(name: "fallback", scope: !313, file: !272, line: 358, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 8192, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 1024)
!328 = !DIGlobalVariableExpression(var: !329)
!329 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !330, file: !331, line: 45, type: !137, isLocal: true, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !308, retainedTypes: !332, globals: !336)
!331 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!332 = !{!89, !87, !333}
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !334, line: 112, baseType: !335)
!334 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !73, line: 62, baseType: !214)
!336 = !{!328}
!337 = !DIGlobalVariableExpression(var: !338)
!338 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !339, file: !340, line: 38, type: !349, isLocal: true, isDefinition: true)
!339 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !341, globals: !348)
!340 = !DIFile(filename: "src/force-link.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!341 = !{!342, !345}
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !340, line: 39, size: 32, elements: !343)
!343 = !{!344}
!344 = !DIEnumerator(name: "x_suffix_len", value: 6)
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !340, line: 44, size: 32, elements: !346)
!346 = !{!347}
!347 = !DIEnumerator(name: "smallsize", value: 256)
!348 = !{!337}
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 72, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 9)
!352 = !DIGlobalVariableExpression(var: !353)
!353 = distinct !DIGlobalVariable(name: "Version", scope: !354, file: !355, line: 2, type: !157, isLocal: false, isDefinition: true)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !308, globals: !356)
!355 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!356 = !{!352}
!357 = !DIGlobalVariableExpression(var: !358)
!358 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !359, file: !363, line: 83, type: !157, isLocal: false, isDefinition: true)
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !361, retainedTypes: !410, globals: !411)
!360 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!361 = !{!5, !362, !381, !386}
!362 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !364, file: !363, line: 285, size: 32, elements: !379)
!363 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!364 = distinct !DISubprogram(name: "find_backup_file_name", scope: !363, file: !363, line: 264, type: !365, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, unit: !359, variables: !367)
!365 = !DISubroutineType(types: !366)
!366 = !{!87, !157, !5}
!367 = !{!368, !369, !370, !371, !372, !373, !374, !377, !378}
!368 = !DILocalVariable(name: "file", arg: 1, scope: !364, file: !363, line: 264, type: !157)
!369 = !DILocalVariable(name: "backup_type", arg: 2, scope: !364, file: !363, line: 264, type: !5)
!370 = !DILocalVariable(name: "filelen", scope: !364, file: !363, line: 266, type: !212)
!371 = !DILocalVariable(name: "s", scope: !364, file: !363, line: 267, type: !87)
!372 = !DILocalVariable(name: "ssize", scope: !364, file: !363, line: 268, type: !212)
!373 = !DILocalVariable(name: "simple", scope: !364, file: !363, line: 269, type: !106)
!374 = !DILocalVariable(name: "env_suffix", scope: !375, file: !363, line: 274, type: !157)
!375 = distinct !DILexicalBlock(scope: !376, file: !363, line: 273, column: 5)
!376 = distinct !DILexicalBlock(scope: !364, file: !363, line: 272, column: 7)
!377 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !364, file: !363, line: 283, type: !212)
!378 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !364, file: !363, line: 284, type: !212)
!379 = !{!380}
!380 = !DIEnumerator(name: "GUESS", value: 9)
!381 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !363, line: 146, size: 32, elements: !382)
!382 = !{!383, !384, !385}
!383 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0)
!384 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1)
!385 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2)
!386 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !387, line: 24, size: 32, elements: !388)
!387 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!389 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!390 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!391 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!392 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!393 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!394 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!395 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!396 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!397 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!398 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!399 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!400 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!401 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!402 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!403 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!404 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!405 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!406 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!407 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!408 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!409 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!410 = !{!157, !89, !92, !212}
!411 = !{!357, !412, !418}
!412 = !DIGlobalVariableExpression(var: !413)
!413 = distinct !DIGlobalVariable(name: "backup_types", scope: !359, file: !363, line: 325, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 256, elements: !416)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!416 = !{!417}
!417 = !DISubrange(count: 8)
!418 = !DIGlobalVariableExpression(var: !419)
!419 = distinct !DIGlobalVariable(name: "backup_args", scope: !359, file: !363, line: 314, type: !420, isLocal: true, isDefinition: true)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 576, elements: !350)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!422 = !DIGlobalVariableExpression(var: !423)
!423 = distinct !DIGlobalVariable(name: "file_name", scope: !424, file: !427, line: 37, type: !157, isLocal: true, isDefinition: true)
!424 = distinct !DICompileUnit(language: DW_LANG_C99, file: !425, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !308, globals: !426)
!425 = !DIFile(filename: "./lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!426 = !{!422}
!427 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!428 = !DIGlobalVariableExpression(var: !429)
!429 = distinct !DIGlobalVariable(name: "file_name", scope: !430, file: !435, line: 36, type: !157, isLocal: true, isDefinition: true)
!430 = distinct !DICompileUnit(language: DW_LANG_C99, file: !431, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !308, globals: !432)
!431 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!432 = !{!428, !433}
!433 = !DIGlobalVariableExpression(var: !434)
!434 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !430, file: !435, line: 46, type: !106, isLocal: true, isDefinition: true)
!435 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!436 = !DIGlobalVariableExpression(var: !437)
!437 = distinct !DIGlobalVariable(name: "exit_failure", scope: !438, file: !441, line: 24, type: !442, isLocal: false, isDefinition: true)
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !308, globals: !440)
!439 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!440 = !{!436}
!441 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!442 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!443 = !DIGlobalVariableExpression(var: !444)
!444 = distinct !DIGlobalVariable(name: "default_tuning", scope: !445, file: !449, line: 130, type: !450, isLocal: true, isDefinition: true)
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !308, retainedTypes: !447, globals: !448)
!446 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!447 = !{!214, !89, !212}
!448 = !{!443}
!449 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !139, line: 65, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !139, line: 53, size: 160, elements: !453)
!453 = !{!454, !456, !457, !458, !459}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !452, file: !139, line: 58, baseType: !455, size: 32)
!455 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !452, file: !139, line: 59, baseType: !455, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !452, file: !139, line: 60, baseType: !455, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !452, file: !139, line: 61, baseType: !455, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !452, file: !139, line: 62, baseType: !106, size: 8, offset: 128)
!460 = !DIGlobalVariableExpression(var: !461)
!461 = distinct !DIGlobalVariable(name: "program_name", scope: !462, file: !466, line: 33, type: !157, isLocal: false, isDefinition: true)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !308, retainedTypes: !464, globals: !465)
!463 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!464 = !{!89, !87}
!465 = !{!460}
!466 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!467 = !DIGlobalVariableExpression(var: !468)
!468 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !469, file: !497, line: 77, type: !530, isLocal: false, isDefinition: true)
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !470, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, retainedTypes: !492, globals: !494)
!470 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!471 = !{!36, !472, !477}
!472 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !37, line: 242, size: 32, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!475 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!476 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !478, line: 46, size: 32, elements: !479)
!478 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491}
!480 = !DIEnumerator(name: "_ISupper", value: 256)
!481 = !DIEnumerator(name: "_ISlower", value: 512)
!482 = !DIEnumerator(name: "_ISalpha", value: 1024)
!483 = !DIEnumerator(name: "_ISdigit", value: 2048)
!484 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!485 = !DIEnumerator(name: "_ISspace", value: 8192)
!486 = !DIEnumerator(name: "_ISprint", value: 16384)
!487 = !DIEnumerator(name: "_ISgraph", value: 32768)
!488 = !DIEnumerator(name: "_ISblank", value: 1)
!489 = !DIEnumerator(name: "_IScntrl", value: 2)
!490 = !DIEnumerator(name: "_ISpunct", value: 4)
!491 = !DIEnumerator(name: "_ISalnum", value: 8)
!492 = !{!67, !493, !212, !87}
!493 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!494 = !{!467, !495, !502, !512, !514, !519, !526, !528}
!495 = !DIGlobalVariableExpression(var: !496)
!496 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !469, file: !497, line: 93, type: !498, isLocal: false, isDefinition: true)
!497 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 320, elements: !500)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!500 = !{!501}
!501 = !DISubrange(count: 10)
!502 = !DIGlobalVariableExpression(var: !503)
!503 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !469, file: !497, line: 1043, type: !504, isLocal: false, isDefinition: true)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !497, line: 57, size: 448, elements: !505)
!505 = !{!506, !507, !508, !510, !511}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !504, file: !497, line: 60, baseType: !36, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !504, file: !497, line: 63, baseType: !67, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !504, file: !497, line: 67, baseType: !509, size: 256, offset: 64)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 256, elements: !416)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !504, file: !497, line: 70, baseType: !157, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !504, file: !497, line: 73, baseType: !157, size: 64, offset: 384)
!512 = !DIGlobalVariableExpression(var: !513)
!513 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !469, file: !497, line: 108, type: !504, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515)
!515 = distinct !DIGlobalVariable(name: "slot0", scope: !469, file: !497, line: 834, type: !516, isLocal: true, isDefinition: true)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 2048, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 256)
!519 = !DIGlobalVariableExpression(var: !520)
!520 = distinct !DIGlobalVariable(name: "slotvec", scope: !469, file: !497, line: 837, type: !521, isLocal: true, isDefinition: true)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !497, line: 826, size: 128, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !522, file: !497, line: 828, baseType: !212, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !522, file: !497, line: 829, baseType: !87, size: 64, offset: 64)
!526 = !DIGlobalVariableExpression(var: !527)
!527 = distinct !DIGlobalVariable(name: "nslots", scope: !469, file: !497, line: 835, type: !67, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529)
!529 = distinct !DIGlobalVariable(name: "slotvec0", scope: !469, file: !497, line: 836, type: !522, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 704, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 11)
!533 = !DIGlobalVariableExpression(var: !534)
!534 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !535, file: !553, line: 74, type: !554, isLocal: true, isDefinition: true)
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !537, retainedTypes: !551, globals: !552)
!536 = !DIFile(filename: "./lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!537 = !{!278, !538}
!538 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !540, file: !539, line: 192, size: 32, elements: !549)
!539 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!540 = distinct !DISubprogram(name: "x2nrealloc", scope: !539, file: !539, line: 180, type: !541, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !535, variables: !544)
!541 = !DISubroutineType(types: !542)
!542 = !{!89, !89, !543, !212}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!544 = !{!545, !546, !547, !548}
!545 = !DILocalVariable(name: "p", arg: 1, scope: !540, file: !539, line: 180, type: !89)
!546 = !DILocalVariable(name: "pn", arg: 2, scope: !540, file: !539, line: 180, type: !543)
!547 = !DILocalVariable(name: "s", arg: 3, scope: !540, file: !539, line: 180, type: !212)
!548 = !DILocalVariable(name: "n", scope: !540, file: !539, line: 182, type: !212)
!549 = !{!550}
!550 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!551 = !{!89}
!552 = !{!533}
!553 = !DIFile(filename: "lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 192, elements: !259)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !553, line: 72, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!67, !560, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!562 = !DIGlobalVariableExpression(var: !563)
!563 = distinct !DIGlobalVariable(name: "letters", scope: !564, file: !567, line: 185, type: !568, isLocal: true, isDefinition: true)
!564 = distinct !DICompileUnit(language: DW_LANG_C99, file: !565, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !308, globals: !566)
!565 = !DIFile(filename: "./lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!566 = !{!562}
!567 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 504, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 63)
!571 = !DIGlobalVariableExpression(var: !572)
!572 = distinct !DIGlobalVariable(name: "ht", scope: !573, file: !574, line: 147, type: !137, isLocal: true, isDefinition: true)
!573 = distinct !DISubprogram(name: "utimecmp", scope: !574, file: !574, line: 116, type: !575, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, unit: !600, variables: !616)
!574 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!575 = !DISubroutineType(types: !576)
!576 = !{!67, !157, !577, !577, !67}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !227, line: 46, size: 1152, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !597, !598, !599}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !579, file: !227, line: 48, baseType: !230, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !579, file: !227, line: 53, baseType: !232, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !579, file: !227, line: 61, baseType: !234, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !579, file: !227, line: 62, baseType: !104, size: 32, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !579, file: !227, line: 64, baseType: !91, size: 32, offset: 224)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !579, file: !227, line: 65, baseType: !94, size: 32, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !579, file: !227, line: 67, baseType: !67, size: 32, offset: 288)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !579, file: !227, line: 69, baseType: !230, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !579, file: !227, line: 74, baseType: !241, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !579, file: !227, line: 78, baseType: !244, size: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !579, file: !227, line: 80, baseType: !246, size: 64, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !579, file: !227, line: 91, baseType: !593, size: 128, offset: 576)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !249, line: 8, size: 128, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !593, file: !249, line: 10, baseType: !252, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !593, file: !249, line: 11, baseType: !254, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !579, file: !227, line: 92, baseType: !593, size: 128, offset: 704)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !579, file: !227, line: 93, baseType: !593, size: 128, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !579, file: !227, line: 106, baseType: !258, size: 192, offset: 960)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !602, globals: !606)
!601 = !DIFile(filename: "./lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!602 = !{!274, !603}
!603 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !574, line: 47, size: 32, elements: !604)
!604 = !{!605}
!605 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1)
!606 = !{!571, !607}
!607 = !DIGlobalVariableExpression(var: !608)
!608 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !573, file: !574, line: 150, type: !609, isLocal: true, isDefinition: true)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !574, line: 60, size: 128, elements: !611)
!611 = !{!612, !614, !615}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !610, file: !574, line: 63, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !71, line: 60, baseType: !230)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !610, file: !574, line: 70, baseType: !67, size: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !610, file: !574, line: 74, baseType: !106, size: 8, offset: 96)
!616 = !{!617, !618, !619, !620, !621, !624, !625, !626, !627, !630, !631, !632, !635, !636, !637, !638, !639, !640, !642, !645, !646, !647, !648, !654, !655, !657, !659, !661}
!617 = !DILocalVariable(name: "dst_name", arg: 1, scope: !573, file: !574, line: 116, type: !157)
!618 = !DILocalVariable(name: "dst_stat", arg: 2, scope: !573, file: !574, line: 117, type: !577)
!619 = !DILocalVariable(name: "src_stat", arg: 3, scope: !573, file: !574, line: 118, type: !577)
!620 = !DILocalVariable(name: "options", arg: 4, scope: !573, file: !574, line: 119, type: !67)
!621 = !DILocalVariable(name: "dst_s", scope: !573, file: !574, line: 137, type: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !623, line: 7, baseType: !252)
!623 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!624 = !DILocalVariable(name: "src_s", scope: !573, file: !574, line: 138, type: !622)
!625 = !DILocalVariable(name: "dst_ns", scope: !573, file: !574, line: 139, type: !67)
!626 = !DILocalVariable(name: "src_ns", scope: !573, file: !574, line: 140, type: !67)
!627 = !DILocalVariable(name: "dst_res", scope: !628, file: !574, line: 151, type: !609)
!628 = distinct !DILexicalBlock(scope: !629, file: !574, line: 143, column: 5)
!629 = distinct !DILexicalBlock(scope: !573, file: !574, line: 142, column: 7)
!630 = !DILocalVariable(name: "tmp_dst_res", scope: !628, file: !574, line: 152, type: !610)
!631 = !DILocalVariable(name: "res", scope: !628, file: !574, line: 155, type: !67)
!632 = !DILocalVariable(name: "dst_a_s", scope: !633, file: !574, line: 229, type: !622)
!633 = distinct !DILexicalBlock(scope: !634, file: !574, line: 225, column: 9)
!634 = distinct !DILexicalBlock(scope: !628, file: !574, line: 224, column: 11)
!635 = !DILocalVariable(name: "dst_c_s", scope: !633, file: !574, line: 230, type: !622)
!636 = !DILocalVariable(name: "dst_m_s", scope: !633, file: !574, line: 231, type: !622)
!637 = !DILocalVariable(name: "dst_a_ns", scope: !633, file: !574, line: 232, type: !67)
!638 = !DILocalVariable(name: "dst_c_ns", scope: !633, file: !574, line: 233, type: !67)
!639 = !DILocalVariable(name: "dst_m_ns", scope: !633, file: !574, line: 234, type: !67)
!640 = !DILocalVariable(name: "odd_second", scope: !641, file: !574, line: 243, type: !106)
!641 = distinct !DILexicalBlock(scope: !633, file: !574, line: 242, column: 11)
!642 = !DILocalVariable(name: "a", scope: !643, file: !574, line: 252, type: !67)
!643 = distinct !DILexicalBlock(scope: !644, file: !574, line: 251, column: 15)
!644 = distinct !DILexicalBlock(scope: !641, file: !574, line: 245, column: 17)
!645 = !DILocalVariable(name: "c", scope: !643, file: !574, line: 253, type: !67)
!646 = !DILocalVariable(name: "m", scope: !643, file: !574, line: 254, type: !67)
!647 = !DILocalVariable(name: "SR10", scope: !643, file: !574, line: 258, type: !67)
!648 = !DILocalVariable(name: "timespec", scope: !649, file: !574, line: 280, type: !651)
!649 = distinct !DILexicalBlock(scope: !650, file: !574, line: 279, column: 13)
!650 = distinct !DILexicalBlock(scope: !633, file: !574, line: 278, column: 15)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 256, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 2)
!654 = !DILocalVariable(name: "dst_status", scope: !649, file: !574, line: 281, type: !579)
!655 = !DILocalVariable(name: "s", scope: !656, file: !574, line: 291, type: !622)
!656 = distinct !DILexicalBlock(scope: !649, file: !574, line: 290, column: 15)
!657 = !DILocalVariable(name: "stat_result", scope: !658, file: !574, line: 320, type: !67)
!658 = distinct !DILexicalBlock(scope: !649, file: !574, line: 319, column: 15)
!659 = !DILocalVariable(name: "old_res", scope: !660, file: !574, line: 345, type: !67)
!660 = distinct !DILexicalBlock(scope: !649, file: !574, line: 344, column: 15)
!661 = !DILocalVariable(name: "a", scope: !660, file: !574, line: 346, type: !67)
!662 = !DIGlobalVariableExpression(var: !663)
!663 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !664, file: !674, line: 73, type: !67, isLocal: true, isDefinition: true)
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !666, globals: !671)
!665 = !DIFile(filename: "./lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!666 = !{!667}
!667 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !668, line: 35, size: 32, elements: !669)
!668 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!669 = !{!670}
!670 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000)
!671 = !{!662, !672}
!672 = !DIGlobalVariableExpression(var: !673)
!673 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !664, file: !674, line: 74, type: !67, isLocal: true, isDefinition: true)
!674 = !DIFile(filename: "lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!675 = !DIGlobalVariableExpression(var: !676)
!676 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !677, file: !680, line: 26, type: !681, isLocal: false, isDefinition: true)
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !308, globals: !679)
!678 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!679 = !{!675}
!680 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 376, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 47)
!684 = !DIGlobalVariableExpression(var: !685)
!685 = distinct !DIGlobalVariable(name: "can_write", scope: !686, file: !687, line: 35, type: !106, isLocal: true, isDefinition: true)
!686 = distinct !DISubprogram(name: "can_write_any_file", scope: !687, file: !687, line: 32, type: !688, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !690, variables: !695)
!687 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!688 = !DISubroutineType(types: !689)
!689 = !{!106}
!690 = distinct !DICompileUnit(language: DW_LANG_C99, file: !691, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !308, globals: !692)
!691 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!692 = !{!693, !684}
!693 = !DIGlobalVariableExpression(var: !694)
!694 = distinct !DIGlobalVariable(name: "initialized", scope: !686, file: !687, line: 34, type: !106, isLocal: true, isDefinition: true)
!695 = !{!696}
!696 = !DILocalVariable(name: "can", scope: !697, file: !687, line: 39, type: !106)
!697 = distinct !DILexicalBlock(scope: !698, file: !687, line: 38, column: 5)
!698 = distinct !DILexicalBlock(scope: !686, file: !687, line: 37, column: 7)
!699 = !DIGlobalVariableExpression(var: !700)
!700 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !701, file: !702, line: 335, type: !67, isLocal: true, isDefinition: true)
!701 = distinct !DISubprogram(name: "rpl_fcntl", scope: !702, file: !702, line: 272, type: !703, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !705, variables: !708)
!702 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!703 = !DISubroutineType(types: !704)
!704 = !{!67, !67, !67, null}
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !308, globals: !707)
!706 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!707 = !{!699}
!708 = !{!709, !710, !711, !724, !725, !728, !731, !734}
!709 = !DILocalVariable(name: "fd", arg: 1, scope: !701, file: !702, line: 272, type: !67)
!710 = !DILocalVariable(name: "action", arg: 2, scope: !701, file: !702, line: 272, type: !67)
!711 = !DILocalVariable(name: "arg", scope: !701, file: !702, line: 274, type: !712)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !713, line: 30, baseType: !714)
!713 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !706, line: 274, baseType: !715)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 192, elements: !722)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !706, line: 274, size: 192, elements: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !716, file: !706, line: 274, baseType: !92, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !716, file: !706, line: 274, baseType: !92, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !716, file: !706, line: 274, baseType: !89, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !716, file: !706, line: 274, baseType: !89, size: 64, offset: 128)
!722 = !{!723}
!723 = !DISubrange(count: 1)
!724 = !DILocalVariable(name: "result", scope: !701, file: !702, line: 275, type: !67)
!725 = !DILocalVariable(name: "target", scope: !726, file: !702, line: 322, type: !67)
!726 = distinct !DILexicalBlock(scope: !727, file: !702, line: 321, column: 7)
!727 = distinct !DILexicalBlock(scope: !701, file: !702, line: 278, column: 5)
!728 = !DILocalVariable(name: "flags", scope: !729, file: !702, line: 359, type: !67)
!729 = distinct !DILexicalBlock(scope: !730, file: !702, line: 358, column: 11)
!730 = distinct !DILexicalBlock(scope: !726, file: !702, line: 357, column: 13)
!731 = !DILocalVariable(name: "saved_errno", scope: !732, file: !702, line: 362, type: !67)
!732 = distinct !DILexicalBlock(scope: !733, file: !702, line: 361, column: 15)
!733 = distinct !DILexicalBlock(scope: !729, file: !702, line: 360, column: 17)
!734 = !DILocalVariable(name: "p", scope: !735, file: !702, line: 404, type: !89)
!735 = distinct !DILexicalBlock(scope: !727, file: !702, line: 402, column: 7)
!736 = !DIGlobalVariableExpression(var: !737)
!737 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !738, file: !743, line: 69, type: !744, isLocal: false, isDefinition: true)
!738 = distinct !DICompileUnit(language: DW_LANG_C99, file: !739, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !740, retainedTypes: !741, globals: !742)
!739 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!740 = !{!36}
!741 = !{!89, !299}
!742 = !{!736}
!743 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !745, line: 55, baseType: !746)
!745 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{null}
!749 = !DIGlobalVariableExpression(var: !750)
!750 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !751, file: !1095, line: 120, type: !1096, isLocal: true, isDefinition: true)
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !753, retainedTypes: !1092, globals: !1094)
!752 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!753 = !{!754}
!754 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !755, line: 41, size: 32, elements: !756)
!755 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091}
!757 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!758 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!759 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!760 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!761 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!762 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!763 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!764 = !DIEnumerator(name: "DAY_1", value: 131079)
!765 = !DIEnumerator(name: "DAY_2", value: 131080)
!766 = !DIEnumerator(name: "DAY_3", value: 131081)
!767 = !DIEnumerator(name: "DAY_4", value: 131082)
!768 = !DIEnumerator(name: "DAY_5", value: 131083)
!769 = !DIEnumerator(name: "DAY_6", value: 131084)
!770 = !DIEnumerator(name: "DAY_7", value: 131085)
!771 = !DIEnumerator(name: "ABMON_1", value: 131086)
!772 = !DIEnumerator(name: "ABMON_2", value: 131087)
!773 = !DIEnumerator(name: "ABMON_3", value: 131088)
!774 = !DIEnumerator(name: "ABMON_4", value: 131089)
!775 = !DIEnumerator(name: "ABMON_5", value: 131090)
!776 = !DIEnumerator(name: "ABMON_6", value: 131091)
!777 = !DIEnumerator(name: "ABMON_7", value: 131092)
!778 = !DIEnumerator(name: "ABMON_8", value: 131093)
!779 = !DIEnumerator(name: "ABMON_9", value: 131094)
!780 = !DIEnumerator(name: "ABMON_10", value: 131095)
!781 = !DIEnumerator(name: "ABMON_11", value: 131096)
!782 = !DIEnumerator(name: "ABMON_12", value: 131097)
!783 = !DIEnumerator(name: "MON_1", value: 131098)
!784 = !DIEnumerator(name: "MON_2", value: 131099)
!785 = !DIEnumerator(name: "MON_3", value: 131100)
!786 = !DIEnumerator(name: "MON_4", value: 131101)
!787 = !DIEnumerator(name: "MON_5", value: 131102)
!788 = !DIEnumerator(name: "MON_6", value: 131103)
!789 = !DIEnumerator(name: "MON_7", value: 131104)
!790 = !DIEnumerator(name: "MON_8", value: 131105)
!791 = !DIEnumerator(name: "MON_9", value: 131106)
!792 = !DIEnumerator(name: "MON_10", value: 131107)
!793 = !DIEnumerator(name: "MON_11", value: 131108)
!794 = !DIEnumerator(name: "MON_12", value: 131109)
!795 = !DIEnumerator(name: "AM_STR", value: 131110)
!796 = !DIEnumerator(name: "PM_STR", value: 131111)
!797 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!798 = !DIEnumerator(name: "D_FMT", value: 131113)
!799 = !DIEnumerator(name: "T_FMT", value: 131114)
!800 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!801 = !DIEnumerator(name: "ERA", value: 131116)
!802 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!803 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!804 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!805 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!806 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!807 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!808 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!809 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!810 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!811 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!812 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!813 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!814 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!815 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!816 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!817 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!818 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!819 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!820 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!821 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!822 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!823 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!824 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!825 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!826 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!827 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!828 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!829 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!830 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!831 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!832 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!833 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!834 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!835 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!836 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!837 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!838 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!839 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!840 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!841 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!842 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!843 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!844 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!845 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!846 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!847 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!848 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!849 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!850 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!851 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!852 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!853 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!854 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!855 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!856 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!857 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!858 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!859 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!860 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!861 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!862 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!863 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!864 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!865 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!866 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!867 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!868 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!869 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!870 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!871 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!872 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!873 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!874 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!875 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!876 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!877 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!878 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!879 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!880 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!881 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!882 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!883 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!884 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!885 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!886 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!887 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!888 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!889 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!890 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!891 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!892 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!893 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!894 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!895 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!896 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!897 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!898 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!899 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!900 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!901 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!902 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!903 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!904 = !DIEnumerator(name: "CODESET", value: 14)
!905 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!906 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!907 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!908 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!909 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!910 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!911 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!912 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!913 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!914 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!915 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!916 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!917 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!918 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!919 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!920 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!921 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!922 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!923 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!924 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!925 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!926 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!927 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!928 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!929 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!930 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!931 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!932 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!933 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!934 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!935 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!936 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!937 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!938 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!939 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!940 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!941 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!942 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!943 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!944 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!945 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!946 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!947 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!948 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!949 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!950 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!951 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!952 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!953 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!954 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!955 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!956 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!957 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!958 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!959 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!960 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!961 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!962 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!963 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!964 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!965 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!966 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!967 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!968 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!969 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!970 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!971 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!972 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!973 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!974 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!975 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!976 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!977 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!978 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!979 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!980 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!981 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!982 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!983 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!984 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!985 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!986 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!987 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!988 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!989 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!990 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!991 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!992 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!993 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!994 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!995 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!996 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!997 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!998 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!999 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!1000 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!1001 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!1002 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!1003 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!1004 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!1005 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!1006 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!1007 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!1008 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!1009 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!1010 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!1011 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!1012 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!1013 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!1014 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!1015 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!1016 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!1017 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!1018 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!1019 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!1020 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!1021 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!1022 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!1023 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!1024 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!1025 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!1026 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!1027 = !DIEnumerator(name: "THOUSEP", value: 65537)
!1028 = !DIEnumerator(name: "__GROUPING", value: 65538)
!1029 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!1030 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!1031 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!1032 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!1033 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!1034 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!1035 = !DIEnumerator(name: "__YESSTR", value: 327682)
!1036 = !DIEnumerator(name: "__NOSTR", value: 327683)
!1037 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!1038 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!1039 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!1040 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!1041 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!1042 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!1043 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!1044 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!1045 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!1046 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!1047 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!1048 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!1049 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!1050 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!1051 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!1052 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!1053 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!1054 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!1055 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!1056 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!1057 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!1058 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!1059 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!1060 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!1061 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!1062 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!1063 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!1064 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!1065 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!1066 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!1067 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!1068 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!1069 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!1070 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!1071 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!1072 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!1073 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!1074 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!1075 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!1076 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!1077 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!1078 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!1079 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!1080 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!1081 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!1082 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!1083 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!1084 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!1085 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!1086 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!1087 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!1088 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!1089 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!1090 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!1091 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!1092 = !{!89, !87, !1093}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!1094 = !{!749}
!1095 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1096 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !157)
!1097 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1098, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !308, retainedTypes: !1099)
!1098 = !DIFile(filename: "src/prog-fprintf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1099 = !{!299}
!1100 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1101, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1102, retainedTypes: !1180)
!1101 = !DIFile(filename: "src/extent-scan.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1102 = !{!1103}
!1103 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1104, file: !1101, line: 97, size: 32, elements: !1178)
!1104 = distinct !DISubprogram(name: "extent_scan_read", scope: !1101, file: !1101, line: 87, type: !1105, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !1100, variables: !1125)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!106, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !1109, line: 36, size: 384, elements: !1110)
!1109 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1110 = !{!1111, !1112, !1114, !1115, !1116, !1117, !1118}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1108, file: !1109, line: 39, baseType: !67, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !1108, file: !1109, line: 42, baseType: !1113, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !71, line: 86, baseType: !241)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !1108, file: !1109, line: 45, baseType: !92, size: 32, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !1108, file: !1109, line: 48, baseType: !212, size: 64, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !1108, file: !1109, line: 52, baseType: !106, size: 8, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !1108, file: !1109, line: 55, baseType: !106, size: 8, offset: 264)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !1108, file: !1109, line: 58, baseType: !1119, size: 64, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !1109, line: 23, size: 192, elements: !1121)
!1121 = !{!1122, !1123, !1124}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !1120, file: !1109, line: 26, baseType: !1113, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !1120, file: !1109, line: 29, baseType: !1113, size: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !1120, file: !1109, line: 32, baseType: !92, size: 32, offset: 128)
!1125 = !{!1126, !1127, !1128, !1129, !1163, !1165, !1167, !1169, !1170, !1177}
!1126 = !DILocalVariable(name: "scan", arg: 1, scope: !1104, file: !1101, line: 87, type: !1107)
!1127 = !DILocalVariable(name: "si", scope: !1104, file: !1101, line: 89, type: !92)
!1128 = !DILocalVariable(name: "last_ei", scope: !1104, file: !1101, line: 90, type: !1119)
!1129 = !DILocalVariable(name: "fiemap_buf", scope: !1130, file: !1101, line: 94, type: !1131)
!1130 = distinct !DILexicalBlock(scope: !1104, file: !1101, line: 93, column: 5)
!1131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1104, file: !1101, line: 94, size: 32768, elements: !1132)
!1132 = !{!1133, !1162}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1131, file: !1101, line: 94, baseType: !1134, size: 256)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap", file: !1135, line: 35, size: 256, elements: !1136)
!1135 = !DIFile(filename: "src/fiemap.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1136 = !{!1137, !1141, !1142, !1145, !1146, !1147, !1148}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "fm_start", scope: !1134, file: !1135, line: 38, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1139, line: 27, baseType: !1140)
!1139 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !73, line: 44, baseType: !214)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "fm_length", scope: !1134, file: !1135, line: 41, baseType: !1138, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !1134, file: !1135, line: 44, baseType: !1143, size: 32, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1139, line: 26, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !73, line: 41, baseType: !92)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "fm_mapped_extents", scope: !1134, file: !1135, line: 47, baseType: !1143, size: 32, offset: 160)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extent_count", scope: !1134, file: !1135, line: 50, baseType: !1143, size: 32, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "fm_reserved", scope: !1134, file: !1135, line: 52, baseType: !1143, size: 32, offset: 224)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extents", scope: !1134, file: !1135, line: 59, baseType: !1149, offset: 256)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1150, elements: !1160)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !1135, line: 14, size: 448, elements: !1151)
!1151 = !{!1152, !1153, !1154, !1155, !1157, !1158}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !1150, file: !1135, line: 18, baseType: !1138, size: 64)
