; ModuleID = 'coreutils-8.27/src/join.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.line = type { %struct.linebuffer, i64, i64, %struct.field* }
%struct.linebuffer = type { i64, i64, i8* }
%struct.field = type { i8*, i64 }
%struct.outlist = type { i32, i64, %struct.outlist* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.seq = type { i64, i64, %struct.line** }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [35 x i8] c"Usage: %s [OPTION]... FILE1 FILE2\0A\00", align 1
@.str.2 = private unnamed_addr constant [150 x i8] c"For each pair of input lines with identical join fields, write a line to\0Astandard output.  The default join field is the first, delimited by blanks.\0A\00", align 1

!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 62, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!56 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!57 = !{!58, !59, !60, !61}
!58 = !DILocalVariable(name: "p", arg: 1, scope: !49, file: !48, line: 180, type: !52)
!59 = !DILocalVariable(name: "pn", arg: 2, scope: !49, file: !48, line: 180, type: !53)
!60 = !DILocalVariable(name: "s", arg: 3, scope: !49, file: !48, line: 180, type: !54)
!61 = !DILocalVariable(name: "n", scope: !49, file: !48, line: 182, type: !54)
!62 = !{!63}
!63 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 46, size: 32, elements: !66)
!65 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!67 = !DIEnumerator(name: "_ISupper", value: 256)
!68 = !DIEnumerator(name: "_ISlower", value: 512)
!69 = !DIEnumerator(name: "_ISalpha", value: 1024)
!70 = !DIEnumerator(name: "_ISdigit", value: 2048)
!71 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!72 = !DIEnumerator(name: "_ISspace", value: 8192)
!73 = !DIEnumerator(name: "_ISprint", value: 16384)
!74 = !DIEnumerator(name: "_ISgraph", value: 32768)
!75 = !DIEnumerator(name: "_ISblank", value: 1)
!76 = !DIEnumerator(name: "_IScntrl", value: 2)
!77 = !DIEnumerator(name: "_ISpunct", value: 4)
!78 = !DIEnumerator(name: "_ISalnum", value: 8)
!79 = !{!80, !52, !82, !83, !84}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!85 = !{!86, !0, !91, !94, !96, !98, !100, !103, !107, !109, !111, !113, !115, !135, !156, !170, !172, !174, !182, !184, !186, !188, !190, !192, !194, !196}
!86 = !DIGlobalVariableExpression(var: !87)
!87 = distinct !DIGlobalVariable(name: "g_names", scope: !2, file: !3, line: 97, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIGlobalVariableExpression(var: !92)
!92 = distinct !DIGlobalVariable(name: "print_unpairables_1", scope: !2, file: !3, line: 108, type: !93, isLocal: true, isDefinition: true)
!93 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!94 = !DIGlobalVariableExpression(var: !95)
!95 = distinct !DIGlobalVariable(name: "print_unpairables_2", scope: !2, file: !3, line: 108, type: !93, isLocal: true, isDefinition: true)
!96 = !DIGlobalVariableExpression(var: !97)
!97 = distinct !DIGlobalVariable(name: "print_pairables", scope: !2, file: !3, line: 111, type: !93, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99)
!99 = distinct !DIGlobalVariable(name: "seen_unpairable", scope: !2, file: !3, line: 114, type: !93, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101)
!101 = distinct !DIGlobalVariable(name: "issued_disorder_warning", scope: !2, file: !3, line: 117, type: !102, isLocal: true, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 16, elements: !89)
!103 = !DIGlobalVariableExpression(var: !104)
!104 = distinct !DIGlobalVariable(name: "empty_filler", scope: !2, file: !3, line: 120, type: !105, isLocal: true, isDefinition: true)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!107 = !DIGlobalVariableExpression(var: !108)
!108 = distinct !DIGlobalVariable(name: "autoformat", scope: !2, file: !3, line: 123, type: !93, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110)
!110 = distinct !DIGlobalVariable(name: "check_input_order", scope: !2, file: !3, line: 150, type: !11, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112)
!112 = distinct !DIGlobalVariable(name: "ignore_case", scope: !2, file: !3, line: 176, type: !93, isLocal: true, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114)
!114 = distinct !DIGlobalVariable(name: "join_header_lines", scope: !2, file: !3, line: 180, type: !93, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116)
!116 = distinct !DIGlobalVariable(name: "infomap", scope: !117, file: !118, line: 632, type: !132, isLocal: true, isDefinition: true)
!117 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !118, file: !118, line: 630, type: !119, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !121)
!118 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!119 = !DISubroutineType(types: !120)
!120 = !{null, !105}
!121 = !{!122, !123, !124, !131}
!122 = !DILocalVariable(name: "program", arg: 1, scope: !117, file: !118, line: 630, type: !105)
!123 = !DILocalVariable(name: "node", scope: !117, file: !118, line: 642, type: !105)
!124 = !DILocalVariable(name: "map_prog", scope: !117, file: !118, line: 643, type: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !117, file: !118, line: 632, size: 128, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !127, file: !118, line: 632, baseType: !105, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !127, file: !118, line: 632, baseType: !105, size: 64, offset: 64)
!131 = !DILocalVariable(name: "lc_messages", scope: !117, file: !118, line: 655, type: !105)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 896, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 7)
!135 = !DIGlobalVariableExpression(var: !136)
!136 = distinct !DIGlobalVariable(name: "spareline", scope: !2, file: !3, line: 102, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 128, elements: !89)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !3, line: 73, size: 384, elements: !140)
!140 = !{!141, !148, !149, !150}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !139, file: !3, line: 75, baseType: !142, size: 192)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !143, line: 26, size: 192, elements: !144)
!143 = !DIFile(filename: "./lib/linebuffer.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!144 = !{!145, !146, !147}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !142, file: !143, line: 28, baseType: !54, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !142, file: !143, line: 29, baseType: !54, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !142, file: !143, line: 30, baseType: !80, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nfields", scope: !139, file: !3, line: 76, baseType: !54, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nfields_allocated", scope: !139, file: !3, line: 77, baseType: !54, size: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !139, file: !3, line: 78, baseType: !151, size: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field", file: !3, line: 66, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "beg", scope: !152, file: !3, line: 68, baseType: !80, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !152, file: !3, line: 69, baseType: !54, size: 64, offset: 64)
!156 = !DIGlobalVariableExpression(var: !157)
!157 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 160, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 2048, elements: !168)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !161, line: 50, size: 256, elements: !162)
!161 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!162 = !{!163, !164, !165, !167}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !161, line: 52, baseType: !105, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !160, file: !161, line: 55, baseType: !83, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !161, line: 56, baseType: !166, size: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !160, file: !161, line: 57, baseType: !83, size: 32, offset: 192)
!168 = !{!169}
!169 = !DISubrange(count: 8)
!170 = !DIGlobalVariableExpression(var: !171)
!171 = distinct !DIGlobalVariable(name: "join_field_1", scope: !2, file: !3, line: 130, type: !54, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173)
!173 = distinct !DIGlobalVariable(name: "join_field_2", scope: !2, file: !3, line: 131, type: !54, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175)
!175 = distinct !DIGlobalVariable(name: "outlist_end", scope: !2, file: !3, line: 137, type: !176, isLocal: true, isDefinition: true)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outlist", file: !3, line: 53, size: 192, elements: !178)
!178 = !{!179, !180, !181}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !177, file: !3, line: 57, baseType: !83, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !177, file: !3, line: 60, baseType: !54, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !3, line: 62, baseType: !176, size: 64, offset: 128)
!182 = !DIGlobalVariableExpression(var: !183)
!183 = distinct !DIGlobalVariable(name: "outlist_head", scope: !2, file: !3, line: 134, type: !177, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185)
!185 = distinct !DIGlobalVariable(name: "tab", scope: !2, file: !3, line: 142, type: !83, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187)
!187 = distinct !DIGlobalVariable(name: "eolchar", scope: !2, file: !3, line: 183, type: !81, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189)
!189 = distinct !DIGlobalVariable(name: "autocount_1", scope: !2, file: !3, line: 126, type: !54, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191)
!191 = distinct !DIGlobalVariable(name: "autocount_2", scope: !2, file: !3, line: 127, type: !54, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "uni_blank", scope: !2, file: !3, line: 173, type: !139, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195)
!195 = distinct !DIGlobalVariable(name: "prevline", scope: !2, file: !3, line: 91, type: !137, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "line_no", scope: !2, file: !3, line: 94, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 128, elements: !89)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !200, line: 112, baseType: !201)
!200 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !202, line: 62, baseType: !56)
!202 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!203 = !DIGlobalVariableExpression(var: !204)
!204 = distinct !DIGlobalVariable(name: "Version", scope: !205, file: !206, line: 2, type: !105, isLocal: false, isDefinition: true)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207, globals: !208)
!206 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!207 = !{}
!208 = !{!203}
!209 = !DIGlobalVariableExpression(var: !210)
!210 = distinct !DIGlobalVariable(name: "file_name", scope: !211, file: !216, line: 36, type: !105, isLocal: true, isDefinition: true)
!211 = distinct !DICompileUnit(language: DW_LANG_C99, file: !212, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207, globals: !213)
!212 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!213 = !{!209, !214}
!214 = !DIGlobalVariableExpression(var: !215)
!215 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !211, file: !216, line: 46, type: !93, isLocal: true, isDefinition: true)
!216 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!217 = !DIGlobalVariableExpression(var: !218)
!218 = distinct !DIGlobalVariable(name: "exit_failure", scope: !219, file: !222, line: 24, type: !223, isLocal: false, isDefinition: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207, globals: !221)
!220 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!221 = !{!217}
!222 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!223 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !83)
!224 = !DIGlobalVariableExpression(var: !225)
!225 = distinct !DIGlobalVariable(name: "program_name", scope: !226, file: !230, line: 33, type: !105, isLocal: false, isDefinition: true)
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207, retainedTypes: !228, globals: !229)
!227 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!228 = !{!52, !80}
!229 = !{!224}
!230 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!231 = !DIGlobalVariableExpression(var: !232)
!232 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !233, file: !245, line: 77, type: !279, isLocal: false, isDefinition: true)
!233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !235, retainedTypes: !241, globals: !242)
!234 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!235 = !{!24, !236, !64}
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !25, line: 242, size: 32, elements: !237)
!237 = !{!238, !239, !240}
!238 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!239 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!240 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!241 = !{!83, !84, !54, !80}
!242 = !{!231, !243, !250, !261, !263, !268, !275, !277}
!243 = !DIGlobalVariableExpression(var: !244)
!244 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !233, file: !245, line: 93, type: !246, isLocal: false, isDefinition: true)
!245 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 320, elements: !248)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!248 = !{!249}
!249 = !DISubrange(count: 10)
!250 = !DIGlobalVariableExpression(var: !251)
!251 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !233, file: !245, line: 1043, type: !252, isLocal: false, isDefinition: true)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !245, line: 57, size: 448, elements: !253)
!253 = !{!254, !255, !256, !259, !260}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !252, file: !245, line: 60, baseType: !24, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !252, file: !245, line: 63, baseType: !83, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !252, file: !245, line: 67, baseType: !257, size: 256, offset: 64)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 256, elements: !168)
!258 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !252, file: !245, line: 70, baseType: !105, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !252, file: !245, line: 73, baseType: !105, size: 64, offset: 384)
!261 = !DIGlobalVariableExpression(var: !262)
!262 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !233, file: !245, line: 108, type: !252, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264)
!264 = distinct !DIGlobalVariable(name: "slot0", scope: !233, file: !245, line: 834, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 2048, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 256)
!268 = !DIGlobalVariableExpression(var: !269)
!269 = distinct !DIGlobalVariable(name: "slotvec", scope: !233, file: !245, line: 837, type: !270, isLocal: true, isDefinition: true)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !245, line: 826, size: 128, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !271, file: !245, line: 828, baseType: !54, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !271, file: !245, line: 829, baseType: !80, size: 64, offset: 64)
!275 = !DIGlobalVariableExpression(var: !276)
!276 = distinct !DIGlobalVariable(name: "nslots", scope: !233, file: !245, line: 835, type: !83, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278)
!278 = distinct !DIGlobalVariable(name: "slotvec0", scope: !233, file: !245, line: 836, type: !271, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 704, elements: !281)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!281 = !{!282}
!282 = !DISubrange(count: 11)
!283 = !DIGlobalVariableExpression(var: !284)
!284 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !285, file: !288, line: 26, type: !289, isLocal: false, isDefinition: true)
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207, globals: !287)
!286 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!287 = !{!283}
!288 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 376, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 47)
!292 = !DIGlobalVariableExpression(var: !293)
!293 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !294, file: !295, line: 335, type: !83, isLocal: true, isDefinition: true)
!294 = distinct !DISubprogram(name: "rpl_fcntl", scope: !295, file: !295, line: 272, type: !296, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !298, variables: !301)
!295 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!296 = !DISubroutineType(types: !297)
!297 = !{!83, !83, !83, null}
!298 = distinct !DICompileUnit(language: DW_LANG_C99, file: !299, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207, globals: !300)
!299 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!300 = !{!292}
!301 = !{!302, !303, !304, !317, !318, !321, !324, !327}
!302 = !DILocalVariable(name: "fd", arg: 1, scope: !294, file: !295, line: 272, type: !83)
!303 = !DILocalVariable(name: "action", arg: 2, scope: !294, file: !295, line: 272, type: !83)
!304 = !DILocalVariable(name: "arg", scope: !294, file: !295, line: 274, type: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !306, line: 30, baseType: !307)
!306 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !299, line: 274, baseType: !308)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 192, elements: !315)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !299, line: 274, size: 192, elements: !310)
!310 = !{!311, !312, !313, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !309, file: !299, line: 274, baseType: !258, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !309, file: !299, line: 274, baseType: !258, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !309, file: !299, line: 274, baseType: !52, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !309, file: !299, line: 274, baseType: !52, size: 64, offset: 128)
!315 = !{!316}
!316 = !DISubrange(count: 1)
!317 = !DILocalVariable(name: "result", scope: !294, file: !295, line: 275, type: !83)
!318 = !DILocalVariable(name: "target", scope: !319, file: !295, line: 322, type: !83)
!319 = distinct !DILexicalBlock(scope: !320, file: !295, line: 321, column: 7)
!320 = distinct !DILexicalBlock(scope: !294, file: !295, line: 278, column: 5)
!321 = !DILocalVariable(name: "flags", scope: !322, file: !295, line: 359, type: !83)
!322 = distinct !DILexicalBlock(scope: !323, file: !295, line: 358, column: 11)
!323 = distinct !DILexicalBlock(scope: !319, file: !295, line: 357, column: 13)
!324 = !DILocalVariable(name: "saved_errno", scope: !325, file: !295, line: 362, type: !83)
!325 = distinct !DILexicalBlock(scope: !326, file: !295, line: 361, column: 15)
!326 = distinct !DILexicalBlock(scope: !322, file: !295, line: 360, column: 17)
!327 = !DILocalVariable(name: "p", scope: !328, file: !295, line: 404, type: !52)
!328 = distinct !DILexicalBlock(scope: !320, file: !295, line: 402, column: 7)
!329 = !DIGlobalVariableExpression(var: !330)
!330 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !331, file: !675, line: 120, type: !676, isLocal: true, isDefinition: true)
!331 = distinct !DICompileUnit(language: DW_LANG_C99, file: !332, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !333, retainedTypes: !672, globals: !674)
!332 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!333 = !{!334}
!334 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !335, line: 41, size: 32, elements: !336)
!335 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!337 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!338 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!339 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!340 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!341 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!342 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!343 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!344 = !DIEnumerator(name: "DAY_1", value: 131079)
!345 = !DIEnumerator(name: "DAY_2", value: 131080)
!346 = !DIEnumerator(name: "DAY_3", value: 131081)
!347 = !DIEnumerator(name: "DAY_4", value: 131082)
!348 = !DIEnumerator(name: "DAY_5", value: 131083)
!349 = !DIEnumerator(name: "DAY_6", value: 131084)
!350 = !DIEnumerator(name: "DAY_7", value: 131085)
!351 = !DIEnumerator(name: "ABMON_1", value: 131086)
!352 = !DIEnumerator(name: "ABMON_2", value: 131087)
!353 = !DIEnumerator(name: "ABMON_3", value: 131088)
!354 = !DIEnumerator(name: "ABMON_4", value: 131089)
!355 = !DIEnumerator(name: "ABMON_5", value: 131090)
!356 = !DIEnumerator(name: "ABMON_6", value: 131091)
!357 = !DIEnumerator(name: "ABMON_7", value: 131092)
!358 = !DIEnumerator(name: "ABMON_8", value: 131093)
!359 = !DIEnumerator(name: "ABMON_9", value: 131094)
!360 = !DIEnumerator(name: "ABMON_10", value: 131095)
!361 = !DIEnumerator(name: "ABMON_11", value: 131096)
!362 = !DIEnumerator(name: "ABMON_12", value: 131097)
!363 = !DIEnumerator(name: "MON_1", value: 131098)
!364 = !DIEnumerator(name: "MON_2", value: 131099)
!365 = !DIEnumerator(name: "MON_3", value: 131100)
!366 = !DIEnumerator(name: "MON_4", value: 131101)
!367 = !DIEnumerator(name: "MON_5", value: 131102)
!368 = !DIEnumerator(name: "MON_6", value: 131103)
!369 = !DIEnumerator(name: "MON_7", value: 131104)
!370 = !DIEnumerator(name: "MON_8", value: 131105)
!371 = !DIEnumerator(name: "MON_9", value: 131106)
!372 = !DIEnumerator(name: "MON_10", value: 131107)
!373 = !DIEnumerator(name: "MON_11", value: 131108)
!374 = !DIEnumerator(name: "MON_12", value: 131109)
!375 = !DIEnumerator(name: "AM_STR", value: 131110)
!376 = !DIEnumerator(name: "PM_STR", value: 131111)
!377 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!378 = !DIEnumerator(name: "D_FMT", value: 131113)
!379 = !DIEnumerator(name: "T_FMT", value: 131114)
!380 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!381 = !DIEnumerator(name: "ERA", value: 131116)
!382 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!383 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!384 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!385 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!386 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!387 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!388 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!389 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!390 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!391 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!392 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!393 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!394 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!395 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!396 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!397 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!398 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!399 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!400 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!401 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!402 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!403 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!404 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!405 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!406 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!407 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!408 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!409 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!410 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!411 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!412 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!413 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!414 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!415 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!416 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!417 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!418 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!419 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!420 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!421 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!422 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!423 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!424 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!425 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!426 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!427 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!428 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!429 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!430 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!431 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!432 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!433 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!434 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!435 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!436 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!437 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!438 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!439 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!440 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!441 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!442 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!443 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!444 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!445 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!446 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!447 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!448 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!449 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!450 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!451 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!452 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!453 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!454 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!455 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!456 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!457 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!458 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!459 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!460 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!461 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!462 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!463 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!464 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!465 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!466 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!467 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!468 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!469 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!470 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!471 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!472 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!473 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!474 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!475 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!476 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!477 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!478 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!479 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!480 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!481 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!482 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!483 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!484 = !DIEnumerator(name: "CODESET", value: 14)
!485 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!486 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!487 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!488 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!509 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!510 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!520 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!521 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!529 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!530 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!531 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!532 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!533 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!534 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!535 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!536 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!537 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!538 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!539 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!540 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!541 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!545 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!546 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!547 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!548 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!549 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!550 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!551 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!552 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!553 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!554 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!555 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!556 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!557 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!558 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!559 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!560 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!561 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!562 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!563 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!564 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!565 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!566 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!567 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!568 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!569 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!570 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!571 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!572 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!573 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!574 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!575 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!576 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!577 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!578 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!584 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!585 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!588 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!589 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!590 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!591 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!592 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!593 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!594 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!595 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!596 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!597 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!598 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!599 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!600 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!601 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!602 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!603 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!604 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!605 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!606 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!607 = !DIEnumerator(name: "THOUSEP", value: 65537)
!608 = !DIEnumerator(name: "__GROUPING", value: 65538)
!609 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!610 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!611 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!612 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!613 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!614 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!615 = !DIEnumerator(name: "__YESSTR", value: 327682)
!616 = !DIEnumerator(name: "__NOSTR", value: 327683)
!617 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!618 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!619 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!620 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!621 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!622 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!623 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!624 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!625 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!626 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!627 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!628 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!629 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!630 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!631 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!632 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!633 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!634 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!635 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!636 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!637 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!638 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!639 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!640 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!641 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!642 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!643 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!644 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!645 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!646 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!647 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!648 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!649 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!650 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!651 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!652 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!653 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!659 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!660 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!661 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!662 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!663 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!664 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!665 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!666 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!667 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!668 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!669 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!670 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!671 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!672 = !{!52, !80, !673}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!674 = !{!329}
!675 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!676 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !105)
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !679)
!678 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!679 = !{!38}
!680 = distinct !DICompileUnit(language: DW_LANG_C99, file: !681, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207)
!681 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!682 = distinct !DICompileUnit(language: DW_LANG_C99, file: !683, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207)
!683 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207, retainedTypes: !686)
!685 = !DIFile(filename: "./lib/linebuffer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!686 = !{!673}
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207, retainedTypes: !689)
!688 = !DIFile(filename: "./lib/memcasecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!689 = !{!83}
!690 = distinct !DICompileUnit(language: DW_LANG_C99, file: !691, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207)
!691 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!692 = distinct !DICompileUnit(language: DW_LANG_C99, file: !693, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !694, retainedTypes: !699)
!693 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!694 = !{!695}
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !696, line: 41, size: 32, elements: !697)
!696 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!697 = !{!698}
!698 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!699 = !{!52}
!700 = distinct !DICompileUnit(language: DW_LANG_C99, file: !701, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !702, retainedTypes: !710)
!701 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!702 = !{!703}
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !704, file: !48, line: 192, size: 32, elements: !62)
!704 = distinct !DISubprogram(name: "x2nrealloc", scope: !48, file: !48, line: 180, type: !50, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !700, variables: !705)
!705 = !{!706, !707, !708, !709}
!706 = !DILocalVariable(name: "p", arg: 1, scope: !704, file: !48, line: 180, type: !52)
!707 = !DILocalVariable(name: "pn", arg: 2, scope: !704, file: !48, line: 180, type: !53)
!708 = !DILocalVariable(name: "s", arg: 3, scope: !704, file: !48, line: 180, type: !54)
!709 = !DILocalVariable(name: "n", scope: !704, file: !48, line: 182, type: !54)
!710 = !{!54, !80, !52}
!711 = distinct !DICompileUnit(language: DW_LANG_C99, file: !712, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207)
!712 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!713 = distinct !DICompileUnit(language: DW_LANG_C99, file: !714, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !715)
!714 = !DIFile(filename: "./lib/xmemcoll.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!715 = !{!24}
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !718, retainedTypes: !719)
!717 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!718 = !{!16, !64}
!719 = !{!83, !84}
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207, retainedTypes: !699)
!721 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207)
!723 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207, retainedTypes: !699)
!725 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!726 = distinct !DICompileUnit(language: DW_LANG_C99, file: !727, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207, retainedTypes: !699)
!727 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207, retainedTypes: !730)
!729 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!730 = !{!54}
!731 = distinct !DICompileUnit(language: DW_LANG_C99, file: !732, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207)
!732 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!733 = distinct !DICompileUnit(language: DW_LANG_C99, file: !734, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207)
!734 = !DIFile(filename: "./lib/memcoll.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!735 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!736 = !{i32 2, !"Dwarf Version", i32 4}
!737 = !{i32 2, !"Debug Info Version", i32 3}
!738 = !{i32 1, !"wchar_size", i32 4}
!739 = !{i32 7, !"PIC Level", i32 2}
!740 = !{i32 7, !"PIE Level", i32 2}
!741 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 186, type: !742, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !744)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !83}
!744 = !{!745}
!745 = !DILocalVariable(name: "status", arg: 1, scope: !741, file: !3, line: 186, type: !83)
!746 = !DIExpression()
!747 = !DILocation(line: 186, column: 12, scope: !741)
!748 = !DILocation(line: 188, column: 14, scope: !749)
!749 = distinct !DILexicalBlock(scope: !741, file: !3, line: 188, column: 7)
!750 = !DILocation(line: 188, column: 7, scope: !741)
!751 = !DILocation(line: 189, column: 5, scope: !752)
!752 = distinct !DILexicalBlock(scope: !749, file: !3, line: 189, column: 5)
!753 = !{!754, !754, i64 0}
!754 = !{!"any pointer", !755, i64 0}
!755 = !{!"omnipotent char", !756, i64 0}
!756 = !{!"Simple C/C++ TBAA"}
!757 = !DILocation(line: 192, column: 7, scope: !758)
!758 = distinct !DILexicalBlock(scope: !749, file: !3, line: 191, column: 5)
!759 = !DILocation(line: 196, column: 7, scope: !758)
!760 = !DILocation(line: 201, column: 7, scope: !758)
!761 = !DILocation(line: 205, column: 7, scope: !758)
!762 = !DILocation(line: 211, column: 7, scope: !758)
!763 = !DILocation(line: 217, column: 7, scope: !758)
!764 = !DILocation(line: 227, column: 7, scope: !758)
!765 = !DILocation(line: 230, column: 7, scope: !758)
!766 = !DILocation(line: 231, column: 7, scope: !758)
!767 = !DILocation(line: 232, column: 7, scope: !758)
!768 = !DILocation(line: 642, column: 15, scope: !117, inlinedAt: !769)
!769 = distinct !DILocation(line: 249, column: 7, scope: !758)
!770 = !DILocation(line: 651, column: 3, scope: !117, inlinedAt: !769)
!771 = !DILocation(line: 655, column: 29, scope: !117, inlinedAt: !769)
!772 = !DILocation(line: 655, column: 15, scope: !117, inlinedAt: !769)
!773 = !DILocation(line: 656, column: 7, scope: !774, inlinedAt: !769)
!774 = distinct !DILexicalBlock(scope: !117, file: !118, line: 656, column: 7)
!775 = !DILocation(line: 656, column: 19, scope: !774, inlinedAt: !769)
!776 = !DILocation(line: 656, column: 22, scope: !774, inlinedAt: !769)
!777 = !DILocation(line: 656, column: 7, scope: !117, inlinedAt: !769)
!778 = !DILocation(line: 662, column: 7, scope: !779, inlinedAt: !769)
!779 = distinct !DILexicalBlock(scope: !774, file: !118, line: 657, column: 5)
!780 = !DILocation(line: 664, column: 5, scope: !779, inlinedAt: !769)
!781 = !DILocation(line: 665, column: 3, scope: !117, inlinedAt: !769)
!782 = !DILocation(line: 667, column: 3, scope: !117, inlinedAt: !769)
!783 = !DILocation(line: 251, column: 3, scope: !741)
!784 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1008, type: !785, isLocal: false, isDefinition: true, scopeLine: 1009, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !788)
!785 = !DISubroutineType(types: !786)
!786 = !{!83, !83, !787}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!788 = !{!789, !790, !791, !792, !793, !795, !796, !849, !850, !851, !852, !853, !857, !860}
!789 = !DILocalVariable(name: "argc", arg: 1, scope: !784, file: !3, line: 1008, type: !83)
!790 = !DILocalVariable(name: "argv", arg: 2, scope: !784, file: !3, line: 1008, type: !787)
!791 = !DILocalVariable(name: "optc_status", scope: !784, file: !3, line: 1010, type: !83)
!792 = !DILocalVariable(name: "prev_optc_status", scope: !784, file: !3, line: 1011, type: !83)
!793 = !DILocalVariable(name: "operand_status", scope: !784, file: !3, line: 1012, type: !794)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !89)
!795 = !DILocalVariable(name: "joption_count", scope: !784, file: !3, line: 1013, type: !794)
!796 = !DILocalVariable(name: "fp1", scope: !784, file: !3, line: 1014, type: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !799, line: 7, baseType: !800)
!799 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !801, line: 241, size: 1728, elements: !802)
!801 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!802 = !{!803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !823, !824, !825, !826, !829, !830, !832, !834, !837, !839, !840, !841, !842, !843, !844, !845}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !800, file: !801, line: 242, baseType: !83, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !800, file: !801, line: 247, baseType: !80, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !800, file: !801, line: 248, baseType: !80, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !800, file: !801, line: 249, baseType: !80, size: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !800, file: !801, line: 250, baseType: !80, size: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !800, file: !801, line: 251, baseType: !80, size: 64, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !800, file: !801, line: 252, baseType: !80, size: 64, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !800, file: !801, line: 253, baseType: !80, size: 64, offset: 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !800, file: !801, line: 254, baseType: !80, size: 64, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !800, file: !801, line: 256, baseType: !80, size: 64, offset: 576)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !800, file: !801, line: 257, baseType: !80, size: 64, offset: 640)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !800, file: !801, line: 258, baseType: !80, size: 64, offset: 704)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !800, file: !801, line: 260, baseType: !816, size: 64, offset: 768)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !801, line: 156, size: 192, elements: !818)
!818 = !{!819, !820, !822}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !817, file: !801, line: 157, baseType: !816, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !817, file: !801, line: 158, baseType: !821, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !817, file: !801, line: 162, baseType: !83, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !800, file: !801, line: 262, baseType: !821, size: 64, offset: 832)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !800, file: !801, line: 264, baseType: !83, size: 32, offset: 896)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !800, file: !801, line: 268, baseType: !83, size: 32, offset: 928)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !800, file: !801, line: 270, baseType: !827, size: 64, offset: 960)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !202, line: 140, baseType: !828)
!828 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !800, file: !801, line: 274, baseType: !84, size: 16, offset: 1024)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !800, file: !801, line: 275, baseType: !831, size: 8, offset: 1040)
!831 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !800, file: !801, line: 276, baseType: !833, size: 8, offset: 1048)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 8, elements: !315)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !800, file: !801, line: 280, baseType: !835, size: 64, offset: 1088)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !801, line: 150, baseType: null)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !800, file: !801, line: 289, baseType: !838, size: 64, offset: 1152)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !202, line: 141, baseType: !828)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !800, file: !801, line: 297, baseType: !52, size: 64, offset: 1216)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !800, file: !801, line: 298, baseType: !52, size: 64, offset: 1280)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !800, file: !801, line: 299, baseType: !52, size: 64, offset: 1344)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !800, file: !801, line: 300, baseType: !52, size: 64, offset: 1408)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !800, file: !801, line: 302, baseType: !54, size: 64, offset: 1472)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !800, file: !801, line: 303, baseType: !83, size: 32, offset: 1536)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !800, file: !801, line: 305, baseType: !846, size: 160, offset: 1568)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 160, elements: !847)
!847 = !{!848}
!848 = !DISubrange(count: 20)
!849 = !DILocalVariable(name: "fp2", scope: !784, file: !3, line: 1014, type: !797)
!850 = !DILocalVariable(name: "optc", scope: !784, file: !3, line: 1015, type: !83)
!851 = !DILocalVariable(name: "nfiles", scope: !784, file: !3, line: 1016, type: !83)
!852 = !DILocalVariable(name: "i", scope: !784, file: !3, line: 1017, type: !83)
!853 = !DILocalVariable(name: "val", scope: !854, file: !3, line: 1048, type: !56)
!854 = distinct !DILexicalBlock(scope: !855, file: !3, line: 1047, column: 11)
!855 = distinct !DILexicalBlock(scope: !856, file: !3, line: 1041, column: 9)
!856 = distinct !DILexicalBlock(scope: !784, file: !3, line: 1037, column: 5)
!857 = !DILocalVariable(name: "is_j2", scope: !858, file: !3, line: 1084, type: !93)
!858 = distinct !DILexicalBlock(scope: !859, file: !3, line: 1082, column: 13)
!859 = distinct !DILexicalBlock(scope: !855, file: !3, line: 1080, column: 15)
!860 = !DILocalVariable(name: "newtab", scope: !861, file: !3, line: 1107, type: !82)
!861 = distinct !DILexicalBlock(scope: !855, file: !3, line: 1106, column: 11)
!862 = !DILocation(line: 1008, column: 11, scope: !784)
!863 = !DILocation(line: 1008, column: 24, scope: !784)
!864 = !DILocation(line: 1010, column: 3, scope: !784)
!865 = !DILocation(line: 1011, column: 3, scope: !784)
!866 = !DILocation(line: 1011, column: 7, scope: !784)
!867 = !{!868, !868, i64 0}
!868 = !{!"int", !755, i64 0}
!869 = !DILocation(line: 1012, column: 3, scope: !784)
!870 = !DILocation(line: 1012, column: 7, scope: !784)
!871 = !DILocation(line: 1013, column: 3, scope: !784)
!872 = !DILocation(line: 1013, column: 7, scope: !784)
!873 = !DILocation(line: 1016, column: 3, scope: !784)
!874 = !DILocation(line: 1016, column: 7, scope: !784)
!875 = !DILocation(line: 1020, column: 21, scope: !784)
!876 = !DILocation(line: 1020, column: 3, scope: !784)
!877 = !DILocation(line: 1021, column: 3, scope: !784)
!878 = !DILocation(line: 1022, column: 3, scope: !784)
!879 = !DILocation(line: 1023, column: 3, scope: !784)
!880 = !DILocation(line: 1024, column: 21, scope: !784)
!881 = !DILocation(line: 1024, column: 19, scope: !784)
!882 = !{!883, !883, i64 0}
!883 = !{!"_Bool", !755, i64 0}
!884 = !DILocation(line: 1026, column: 3, scope: !784)
!885 = !DILocation(line: 1027, column: 3, scope: !784)
!886 = !DILocation(line: 1031, column: 59, scope: !784)
!887 = !DILocation(line: 1031, column: 30, scope: !784)
!888 = !DILocation(line: 1032, column: 21, scope: !784)
!889 = !{!755, !755, i64 0}
!890 = !DILocation(line: 1034, column: 18, scope: !784)
!891 = !DILocation(line: 1015, column: 7, scope: !784)
!892 = !DILocation(line: 1036, column: 10, scope: !784)
!893 = !DILocation(line: 1034, column: 3, scope: !784)
!894 = !DILocation(line: 1010, column: 7, scope: !784)
!895 = !DILocation(line: 1038, column: 19, scope: !856)
!896 = !DILocation(line: 1040, column: 7, scope: !856)
!897 = !DILocation(line: 1043, column: 13, scope: !855)
!898 = !DILocation(line: 1048, column: 13, scope: !854)
!899 = !DILocation(line: 1049, column: 27, scope: !900)
!900 = distinct !DILexicalBlock(scope: !854, file: !3, line: 1049, column: 17)
!901 = !DILocation(line: 1048, column: 31, scope: !854)
!902 = !DILocation(line: 1049, column: 17, scope: !900)
!903 = !DILocation(line: 1049, column: 55, scope: !900)
!904 = !DILocation(line: 1050, column: 17, scope: !900)
!905 = !DILocation(line: 1050, column: 21, scope: !900)
!906 = !{!907, !907, i64 0}
!907 = !{!"long", !755, i64 0}
!908 = !DILocation(line: 1050, column: 30, scope: !900)
!909 = !DILocation(line: 1051, column: 15, scope: !900)
!910 = !DILocation(line: 1053, column: 21, scope: !911)
!911 = distinct !DILexicalBlock(scope: !854, file: !3, line: 1053, column: 17)
!912 = !DILocation(line: 1053, column: 17, scope: !854)
!913 = !DILocation(line: 1057, column: 11, scope: !855)
!914 = !DILocation(line: 1058, column: 11, scope: !855)
!915 = !DILocation(line: 1061, column: 15, scope: !916)
!916 = distinct !DILexicalBlock(scope: !855, file: !3, line: 1061, column: 15)
!917 = !DILocation(line: 1061, column: 28, scope: !916)
!918 = !DILocation(line: 1064, column: 26, scope: !855)
!919 = !DILocation(line: 1061, column: 33, scope: !916)
!920 = !DILocation(line: 1061, column: 15, scope: !855)
!921 = !DILocation(line: 1062, column: 13, scope: !916)
!922 = !DILocation(line: 1064, column: 24, scope: !855)
!923 = !DILocation(line: 1065, column: 11, scope: !855)
!924 = !DILocation(line: 1069, column: 11, scope: !855)
!925 = !DILocation(line: 1072, column: 64, scope: !855)
!926 = !DILocalVariable(name: "str", arg: 1, scope: !927, file: !3, line: 844, type: !105)
!927 = distinct !DISubprogram(name: "string_to_join_field", scope: !3, file: !3, line: 844, type: !928, isLocal: true, isDefinition: true, scopeLine: 845, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !930)
!928 = !DISubroutineType(types: !929)
!929 = !{!54, !105}
!930 = !{!926, !931, !932, !933}
!931 = !DILocalVariable(name: "result", scope: !927, file: !3, line: 846, type: !54)
!932 = !DILocalVariable(name: "val", scope: !927, file: !3, line: 847, type: !56)
!933 = !DILocalVariable(name: "s_err", scope: !927, file: !3, line: 850, type: !934)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "strtol_error", file: !17, line: 39, baseType: !16)
!935 = !DILocation(line: 844, column: 35, scope: !927, inlinedAt: !936)
!936 = distinct !DILocation(line: 1072, column: 42, scope: !855)
!937 = !DILocation(line: 847, column: 3, scope: !927, inlinedAt: !936)
!938 = !DILocation(line: 847, column: 21, scope: !927, inlinedAt: !936)
!939 = !DILocation(line: 850, column: 24, scope: !927, inlinedAt: !936)
!940 = !DILocation(line: 850, column: 16, scope: !927, inlinedAt: !936)
!941 = !DILocation(line: 851, column: 13, scope: !942, inlinedAt: !936)
!942 = distinct !DILexicalBlock(scope: !927, file: !3, line: 851, column: 7)
!943 = !DILocation(line: 851, column: 33, scope: !942, inlinedAt: !936)
!944 = !DILocation(line: 852, column: 9, scope: !942, inlinedAt: !936)
!945 = !DILocation(line: 852, column: 5, scope: !942, inlinedAt: !936)
!946 = !DILocation(line: 851, column: 71, scope: !942, inlinedAt: !936)
!947 = !DILocation(line: 853, column: 18, scope: !948, inlinedAt: !936)
!948 = distinct !DILexicalBlock(scope: !942, file: !3, line: 853, column: 12)
!949 = !DILocation(line: 853, column: 39, scope: !948, inlinedAt: !936)
!950 = !DILocation(line: 853, column: 32, scope: !948, inlinedAt: !936)
!951 = !DILocation(line: 854, column: 5, scope: !948, inlinedAt: !936)
!952 = !DILocation(line: 856, column: 12, scope: !927, inlinedAt: !936)
!953 = !DILocation(line: 856, column: 16, scope: !927, inlinedAt: !936)
!954 = !DILocation(line: 846, column: 10, scope: !927, inlinedAt: !936)
!955 = !DILocation(line: 859, column: 1, scope: !927, inlinedAt: !936)
!956 = !DILocalVariable(name: "var", arg: 1, scope: !957, file: !3, line: 928, type: !53)
!957 = distinct !DISubprogram(name: "set_join_field", scope: !3, file: !3, line: 928, type: !958, isLocal: true, isDefinition: true, scopeLine: 929, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !960)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !53, !54}
!960 = !{!956, !961, !962, !965}
!961 = !DILocalVariable(name: "val", arg: 2, scope: !957, file: !3, line: 928, type: !54)
!962 = !DILocalVariable(name: "var1", scope: !963, file: !3, line: 932, type: !56)
!963 = distinct !DILexicalBlock(scope: !964, file: !3, line: 931, column: 5)
!964 = distinct !DILexicalBlock(scope: !957, file: !3, line: 930, column: 7)
!965 = !DILocalVariable(name: "val1", scope: !963, file: !3, line: 933, type: !56)
!966 = !DILocation(line: 928, column: 25, scope: !957, inlinedAt: !967)
!967 = distinct !DILocation(line: 1072, column: 11, scope: !855)
!968 = !DILocation(line: 928, column: 37, scope: !957, inlinedAt: !967)
!969 = !DILocation(line: 930, column: 7, scope: !964, inlinedAt: !967)
!970 = !DILocation(line: 930, column: 12, scope: !964, inlinedAt: !967)
!971 = !DILocation(line: 930, column: 32, scope: !964, inlinedAt: !967)
!972 = !DILocation(line: 930, column: 24, scope: !964, inlinedAt: !967)
!973 = !DILocation(line: 932, column: 37, scope: !963, inlinedAt: !967)
!974 = !DILocation(line: 932, column: 25, scope: !963, inlinedAt: !967)
!975 = !DILocation(line: 933, column: 25, scope: !963, inlinedAt: !967)
!976 = !DILocation(line: 934, column: 7, scope: !963, inlinedAt: !967)
!977 = !DILocation(line: 937, column: 8, scope: !957, inlinedAt: !967)
!978 = !DILocation(line: 1073, column: 11, scope: !855)
!979 = !DILocation(line: 1076, column: 64, scope: !855)
!980 = !DILocation(line: 844, column: 35, scope: !927, inlinedAt: !981)
!981 = distinct !DILocation(line: 1076, column: 42, scope: !855)
!982 = !DILocation(line: 847, column: 3, scope: !927, inlinedAt: !981)
!983 = !DILocation(line: 847, column: 21, scope: !927, inlinedAt: !981)
!984 = !DILocation(line: 850, column: 24, scope: !927, inlinedAt: !981)
!985 = !DILocation(line: 850, column: 16, scope: !927, inlinedAt: !981)
!986 = !DILocation(line: 851, column: 13, scope: !942, inlinedAt: !981)
!987 = !DILocation(line: 851, column: 33, scope: !942, inlinedAt: !981)
!988 = !DILocation(line: 852, column: 9, scope: !942, inlinedAt: !981)
!989 = !DILocation(line: 852, column: 5, scope: !942, inlinedAt: !981)
!990 = !DILocation(line: 851, column: 71, scope: !942, inlinedAt: !981)
!991 = !DILocation(line: 853, column: 18, scope: !948, inlinedAt: !981)
!992 = !DILocation(line: 853, column: 39, scope: !948, inlinedAt: !981)
!993 = !DILocation(line: 853, column: 32, scope: !948, inlinedAt: !981)
!994 = !DILocation(line: 854, column: 5, scope: !948, inlinedAt: !981)
!995 = !DILocation(line: 856, column: 12, scope: !927, inlinedAt: !981)
!996 = !DILocation(line: 856, column: 16, scope: !927, inlinedAt: !981)
!997 = !DILocation(line: 846, column: 10, scope: !927, inlinedAt: !981)
!998 = !DILocation(line: 859, column: 1, scope: !927, inlinedAt: !981)
!999 = !DILocation(line: 928, column: 25, scope: !957, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 1076, column: 11, scope: !855)
!1001 = !DILocation(line: 928, column: 37, scope: !957, inlinedAt: !1000)
!1002 = !DILocation(line: 930, column: 7, scope: !964, inlinedAt: !1000)
!1003 = !DILocation(line: 930, column: 12, scope: !964, inlinedAt: !1000)
!1004 = !DILocation(line: 930, column: 32, scope: !964, inlinedAt: !1000)
!1005 = !DILocation(line: 930, column: 24, scope: !964, inlinedAt: !1000)
!1006 = !DILocation(line: 932, column: 37, scope: !963, inlinedAt: !1000)
!1007 = !DILocation(line: 932, column: 25, scope: !963, inlinedAt: !1000)
!1008 = !DILocation(line: 933, column: 25, scope: !963, inlinedAt: !1000)
!1009 = !DILocation(line: 934, column: 7, scope: !963, inlinedAt: !1000)
!1010 = !DILocation(line: 937, column: 8, scope: !957, inlinedAt: !1000)
!1011 = !DILocation(line: 1077, column: 11, scope: !855)
!1012 = !DILocation(line: 1080, column: 16, scope: !859)
!1013 = !DILocation(line: 1080, column: 33, scope: !859)
!1014 = !DILocation(line: 1080, column: 58, scope: !859)
!1015 = !DILocation(line: 1081, column: 15, scope: !859)
!1016 = !DILocation(line: 1081, column: 33, scope: !859)
!1017 = !DILocation(line: 1081, column: 40, scope: !859)
!1018 = !DILocation(line: 1081, column: 28, scope: !859)
!1019 = !DILocation(line: 1081, column: 45, scope: !859)
!1020 = !DILocation(line: 1081, column: 25, scope: !859)
!1021 = !DILocation(line: 1080, column: 15, scope: !855)
!1022 = !DILocation(line: 1084, column: 39, scope: !858)
!1023 = !DILocation(line: 1085, column: 15, scope: !858)
!1024 = !DILocation(line: 1085, column: 35, scope: !858)
!1025 = !DILocation(line: 1086, column: 45, scope: !858)
!1026 = !DILocation(line: 1086, column: 27, scope: !858)
!1027 = !DILocation(line: 1087, column: 13, scope: !858)
!1028 = !DILocation(line: 844, column: 35, scope: !927, inlinedAt: !1029)
!1029 = distinct !DILocation(line: 1090, column: 46, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !859, file: !3, line: 1089, column: 13)
!1031 = !DILocation(line: 847, column: 3, scope: !927, inlinedAt: !1029)
!1032 = !DILocation(line: 847, column: 21, scope: !927, inlinedAt: !1029)
!1033 = !DILocation(line: 850, column: 24, scope: !927, inlinedAt: !1029)
!1034 = !DILocation(line: 850, column: 16, scope: !927, inlinedAt: !1029)
!1035 = !DILocation(line: 851, column: 13, scope: !942, inlinedAt: !1029)
!1036 = !DILocation(line: 851, column: 33, scope: !942, inlinedAt: !1029)
!1037 = !DILocation(line: 852, column: 9, scope: !942, inlinedAt: !1029)
!1038 = !DILocation(line: 852, column: 5, scope: !942, inlinedAt: !1029)
!1039 = !DILocation(line: 851, column: 71, scope: !942, inlinedAt: !1029)
!1040 = !DILocation(line: 853, column: 18, scope: !948, inlinedAt: !1029)
!1041 = !DILocation(line: 853, column: 39, scope: !948, inlinedAt: !1029)
!1042 = !DILocation(line: 853, column: 32, scope: !948, inlinedAt: !1029)
!1043 = !DILocation(line: 854, column: 5, scope: !948, inlinedAt: !1029)
!1044 = !DILocation(line: 856, column: 12, scope: !927, inlinedAt: !1029)
!1045 = !DILocation(line: 856, column: 16, scope: !927, inlinedAt: !1029)
!1046 = !DILocation(line: 846, column: 10, scope: !927, inlinedAt: !1029)
!1047 = !DILocation(line: 859, column: 1, scope: !927, inlinedAt: !1029)
!1048 = !DILocation(line: 928, column: 25, scope: !957, inlinedAt: !1049)
!1049 = distinct !DILocation(line: 1090, column: 15, scope: !1030)
!1050 = !DILocation(line: 928, column: 37, scope: !957, inlinedAt: !1049)
!1051 = !DILocation(line: 930, column: 7, scope: !964, inlinedAt: !1049)
!1052 = !DILocation(line: 930, column: 12, scope: !964, inlinedAt: !1049)
!1053 = !DILocation(line: 930, column: 32, scope: !964, inlinedAt: !1049)
!1054 = !DILocation(line: 930, column: 24, scope: !964, inlinedAt: !1049)
!1055 = !DILocation(line: 932, column: 37, scope: !963, inlinedAt: !1049)
!1056 = !DILocation(line: 932, column: 25, scope: !963, inlinedAt: !1049)
!1057 = !DILocation(line: 933, column: 25, scope: !963, inlinedAt: !1049)
!1058 = !DILocation(line: 934, column: 7, scope: !963, inlinedAt: !1049)
!1059 = !DILocation(line: 937, column: 8, scope: !957, inlinedAt: !1049)
!1060 = !DILocation(line: 928, column: 25, scope: !957, inlinedAt: !1061)
!1061 = distinct !DILocation(line: 1091, column: 15, scope: !1030)
!1062 = !DILocation(line: 928, column: 37, scope: !957, inlinedAt: !1061)
!1063 = !DILocation(line: 930, column: 7, scope: !964, inlinedAt: !1061)
!1064 = !DILocation(line: 930, column: 12, scope: !964, inlinedAt: !1061)
!1065 = !DILocation(line: 930, column: 32, scope: !964, inlinedAt: !1061)
!1066 = !DILocation(line: 930, column: 24, scope: !964, inlinedAt: !1061)
!1067 = !DILocation(line: 932, column: 37, scope: !963, inlinedAt: !1061)
!1068 = !DILocation(line: 932, column: 25, scope: !963, inlinedAt: !1061)
!1069 = !DILocation(line: 933, column: 25, scope: !963, inlinedAt: !1061)
!1070 = !DILocation(line: 934, column: 7, scope: !963, inlinedAt: !1061)
!1071 = !DILocation(line: 937, column: 8, scope: !957, inlinedAt: !1061)
!1072 = !DILocation(line: 1096, column: 15, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !855, file: !3, line: 1096, column: 15)
!1074 = !DILocation(line: 1096, column: 15, scope: !855)
!1075 = !DILocation(line: 1097, column: 13, scope: !1073)
!1076 = !DILocation(line: 1100, column: 15, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 1099, column: 13)
!1078 = !DILocation(line: 1101, column: 27, scope: !1077)
!1079 = !DILocation(line: 1107, column: 36, scope: !861)
!1080 = !DILocation(line: 1107, column: 27, scope: !861)
!1081 = !DILocation(line: 1108, column: 19, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !861, file: !3, line: 1108, column: 17)
!1083 = !DILocation(line: 1108, column: 17, scope: !861)
!1084 = !DILocation(line: 1110, column: 22, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 1110, column: 22)
!1086 = !DILocation(line: 1110, column: 22, scope: !1082)
!1087 = !DILocation(line: 1112, column: 21, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 1112, column: 21)
!1089 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 1111, column: 15)
!1090 = !DILocation(line: 1112, column: 21, scope: !1089)
!1091 = !DILocation(line: 1115, column: 19, scope: !1088)
!1092 = !DILocation(line: 1118, column: 22, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !861, file: !3, line: 1118, column: 17)
!1094 = !DILocation(line: 1118, column: 19, scope: !1093)
!1095 = !DILocation(line: 1118, column: 36, scope: !1093)
!1096 = !DILocation(line: 1118, column: 33, scope: !1093)
!1097 = !DILocation(line: 1118, column: 26, scope: !1093)
!1098 = !DILocation(line: 1119, column: 15, scope: !1093)
!1099 = !DILocation(line: 1120, column: 17, scope: !861)
!1100 = !DILocation(line: 1122, column: 11, scope: !855)
!1101 = !DILocation(line: 1126, column: 11, scope: !855)
!1102 = !DILocation(line: 1129, column: 29, scope: !855)
!1103 = !DILocation(line: 1130, column: 11, scope: !855)
!1104 = !DILocation(line: 1133, column: 29, scope: !855)
!1105 = !DILocation(line: 1134, column: 11, scope: !855)
!1106 = !DILocation(line: 1137, column: 26, scope: !855)
!1107 = !DILocation(line: 1137, column: 11, scope: !855)
!1108 = !DILocation(line: 1153, column: 26, scope: !856)
!1109 = !DILocation(line: 1139, column: 11, scope: !855)
!1110 = !DILocation(line: 1143, column: 11, scope: !855)
!1111 = !DILocation(line: 1145, column: 9, scope: !855)
!1112 = !DILocation(line: 1147, column: 9, scope: !855)
!1113 = !DILocation(line: 1150, column: 11, scope: !855)
!1114 = !DILocation(line: 1153, column: 24, scope: !856)
!1115 = distinct !{!1115, !893, !1116}
!1116 = !DILocation(line: 1154, column: 5, scope: !784)
!1117 = !DILocation(line: 1157, column: 20, scope: !784)
!1118 = !DILocation(line: 1158, column: 10, scope: !784)
!1119 = !DILocation(line: 1158, column: 17, scope: !784)
!1120 = !DILocation(line: 1158, column: 3, scope: !784)
!1121 = !DILocation(line: 1159, column: 31, scope: !784)
!1122 = !DILocation(line: 1159, column: 20, scope: !784)
!1123 = !DILocation(line: 1159, column: 5, scope: !784)
!1124 = distinct !{!1124, !1120, !1125}
!1125 = !DILocation(line: 1160, column: 60, scope: !784)
!1126 = !DILocation(line: 1162, column: 7, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !784, file: !3, line: 1162, column: 7)
!1128 = !DILocation(line: 1162, column: 7, scope: !784)
!1129 = !DILocation(line: 1165, column: 22, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 1164, column: 11)
!1131 = distinct !DILexicalBlock(scope: !1127, file: !3, line: 1163, column: 5)
!1132 = !DILocation(line: 1165, column: 9, scope: !1130)
!1133 = !DILocation(line: 1167, column: 22, scope: !1130)
!1134 = !DILocation(line: 1167, column: 70, scope: !1130)
!1135 = !DILocation(line: 1167, column: 60, scope: !1130)
!1136 = !DILocation(line: 1167, column: 53, scope: !1130)
!1137 = !DILocation(line: 1167, column: 9, scope: !1130)
!1138 = !DILocation(line: 1168, column: 7, scope: !1131)
!1139 = !DILocation(line: 1017, column: 7, scope: !784)
!1140 = !DILocation(line: 1174, column: 9, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 1174, column: 9)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 1173, column: 3)
!1143 = distinct !DILexicalBlock(scope: !784, file: !3, line: 1173, column: 3)
!1144 = !DILocation(line: 1174, column: 26, scope: !1141)
!1145 = !DILocation(line: 1174, column: 9, scope: !1142)
!1146 = !DILocation(line: 928, column: 25, scope: !957, inlinedAt: !1147)
!1147 = distinct !DILocation(line: 1176, column: 9, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 1175, column: 7)
!1149 = !DILocation(line: 928, column: 37, scope: !957, inlinedAt: !1147)
!1150 = !DILocation(line: 930, column: 7, scope: !964, inlinedAt: !1147)
!1151 = !DILocation(line: 930, column: 24, scope: !964, inlinedAt: !1147)
!1152 = !DILocation(line: 932, column: 37, scope: !963, inlinedAt: !1147)
!1153 = !DILocation(line: 932, column: 25, scope: !963, inlinedAt: !1147)
!1154 = !DILocation(line: 933, column: 25, scope: !963, inlinedAt: !1147)
!1155 = !DILocation(line: 934, column: 7, scope: !963, inlinedAt: !1147)
!1156 = !DILocation(line: 937, column: 8, scope: !957, inlinedAt: !1147)
!1157 = !DILocation(line: 928, column: 25, scope: !957, inlinedAt: !1158)
!1158 = distinct !DILocation(line: 1177, column: 9, scope: !1148)
!1159 = !DILocation(line: 928, column: 37, scope: !957, inlinedAt: !1158)
!1160 = !DILocation(line: 930, column: 7, scope: !964, inlinedAt: !1158)
!1161 = !DILocation(line: 930, column: 24, scope: !964, inlinedAt: !1158)
!1162 = !DILocation(line: 932, column: 37, scope: !963, inlinedAt: !1158)
!1163 = !DILocation(line: 932, column: 25, scope: !963, inlinedAt: !1158)
!1164 = !DILocation(line: 933, column: 25, scope: !963, inlinedAt: !1158)
!1165 = !DILocation(line: 934, column: 7, scope: !963, inlinedAt: !1158)
!1166 = !DILocation(line: 937, column: 8, scope: !957, inlinedAt: !1158)
!1167 = !DILocation(line: 1178, column: 7, scope: !1148)
!1168 = !DILocation(line: 1181, column: 18, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !784, file: !3, line: 1180, column: 7)
!1170 = !DILocation(line: 1181, column: 5, scope: !1169)
!1171 = !DILocation(line: 1182, column: 7, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !784, file: !3, line: 1182, column: 7)
!1173 = !DILocation(line: 1182, column: 20, scope: !1172)
!1174 = !DILocation(line: 1182, column: 7, scope: !784)
!1175 = !DILocation(line: 1185, column: 9, scope: !784)
!1176 = !DILocation(line: 1185, column: 35, scope: !784)
!1177 = !DILocation(line: 1185, column: 43, scope: !784)
!1178 = !DILocation(line: 1014, column: 9, scope: !784)
!1179 = !DILocation(line: 1186, column: 8, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !784, file: !3, line: 1186, column: 7)
!1181 = !DILocation(line: 1186, column: 7, scope: !784)
!1182 = !DILocation(line: 1187, column: 5, scope: !1180)
!1183 = !DILocation(line: 1188, column: 9, scope: !784)
!1184 = !DILocation(line: 1188, column: 35, scope: !784)
!1185 = !DILocation(line: 1188, column: 43, scope: !784)
!1186 = !DILocation(line: 1014, column: 15, scope: !784)
!1187 = !DILocation(line: 1189, column: 8, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !784, file: !3, line: 1189, column: 7)
!1189 = !DILocation(line: 1189, column: 7, scope: !784)
!1190 = !DILocation(line: 1190, column: 5, scope: !1188)
!1191 = !DILocation(line: 1191, column: 11, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !784, file: !3, line: 1191, column: 7)
!1193 = !DILocation(line: 1191, column: 7, scope: !784)
!1194 = !DILocation(line: 1192, column: 5, scope: !1192)
!1195 = !DILocalVariable(name: "fp1", arg: 1, scope: !1196, file: !3, line: 660, type: !797)
!1196 = distinct !DISubprogram(name: "system_join", scope: !3, file: !3, line: 660, type: !1197, isLocal: true, isDefinition: true, scopeLine: 661, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1199)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{null, !797, !797}
!1199 = !{!1195, !1200, !1201, !1208, !1209, !1210, !1211, !1212, !1217, !1218, !1220, !1226, !1230, !1234, !1235}
!1200 = !DILocalVariable(name: "fp2", arg: 2, scope: !1196, file: !3, line: 660, type: !797)
!1201 = !DILocalVariable(name: "seq1", scope: !1196, file: !3, line: 662, type: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq", file: !3, line: 83, size: 192, elements: !1203)
!1203 = !{!1204, !1205, !1206}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1202, file: !3, line: 85, baseType: !54, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1202, file: !3, line: 86, baseType: !54, size: 64, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !1202, file: !3, line: 87, baseType: !1207, size: 64, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!1208 = !DILocalVariable(name: "seq2", scope: !1196, file: !3, line: 662, type: !1202)
!1209 = !DILocalVariable(name: "diff", scope: !1196, file: !3, line: 663, type: !83)
!1210 = !DILocalVariable(name: "eof1", scope: !1196, file: !3, line: 664, type: !93)
!1211 = !DILocalVariable(name: "eof2", scope: !1196, file: !3, line: 664, type: !93)
!1212 = !DILocalVariable(name: "hline1", scope: !1213, file: !3, line: 683, type: !1215)
!1213 = distinct !DILexicalBlock(scope: !1214, file: !3, line: 682, column: 5)
!1214 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 681, column: 7)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!1217 = !DILocalVariable(name: "hline2", scope: !1213, file: !3, line: 684, type: !1215)
!1218 = !DILocalVariable(name: "i", scope: !1219, file: !3, line: 696, type: !54)
!1219 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 695, column: 5)
!1220 = !DILocalVariable(name: "j", scope: !1221, file: !3, line: 746, type: !54)
!1221 = distinct !DILexicalBlock(scope: !1222, file: !3, line: 745, column: 13)
!1222 = distinct !DILexicalBlock(scope: !1223, file: !3, line: 744, column: 11)
!1223 = distinct !DILexicalBlock(scope: !1224, file: !3, line: 744, column: 11)
!1224 = distinct !DILexicalBlock(scope: !1225, file: !3, line: 743, column: 9)
!1225 = distinct !DILexicalBlock(scope: !1219, file: !3, line: 742, column: 11)
!1226 = !DILocalVariable(name: "tmp", scope: !1227, file: !3, line: 754, type: !138)
!1227 = distinct !DILexicalBlock(scope: !1228, file: !3, line: 754, column: 11)
!1228 = distinct !DILexicalBlock(scope: !1229, file: !3, line: 753, column: 9)
!1229 = distinct !DILexicalBlock(scope: !1219, file: !3, line: 752, column: 11)
!1230 = !DILocalVariable(name: "tmp", scope: !1231, file: !3, line: 762, type: !138)
!1231 = distinct !DILexicalBlock(scope: !1232, file: !3, line: 762, column: 11)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !3, line: 761, column: 9)
!1233 = distinct !DILexicalBlock(scope: !1219, file: !3, line: 760, column: 11)
!1234 = !DILocalVariable(name: "line", scope: !1196, file: !3, line: 773, type: !138)
!1235 = !DILocalVariable(name: "checktail", scope: !1196, file: !3, line: 774, type: !93)
!1236 = !DILocation(line: 660, column: 13, scope: !1196, inlinedAt: !1237)
!1237 = distinct !DILocation(line: 1193, column: 3, scope: !784)
!1238 = !DILocation(line: 660, column: 24, scope: !1196, inlinedAt: !1237)
!1239 = !DILocation(line: 666, column: 3, scope: !1196, inlinedAt: !1237)
!1240 = !DILocation(line: 667, column: 3, scope: !1196, inlinedAt: !1237)
!1241 = !DILocation(line: 662, column: 14, scope: !1196, inlinedAt: !1237)
!1242 = !DILocalVariable(name: "fp", arg: 1, scope: !1243, file: !3, line: 506, type: !797)
!1243 = distinct !DISubprogram(name: "getseq", scope: !3, file: !3, line: 506, type: !1244, isLocal: true, isDefinition: true, scopeLine: 507, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1247)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!93, !797, !1246, !83}
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1247 = !{!1242, !1248, !1249, !1250}
!1248 = !DILocalVariable(name: "seq", arg: 2, scope: !1243, file: !3, line: 506, type: !1246)
!1249 = !DILocalVariable(name: "whichfile", arg: 3, scope: !1243, file: !3, line: 506, type: !83)
!1250 = !DILocalVariable(name: "i", scope: !1251, file: !3, line: 510, type: !54)
!1251 = distinct !DILexicalBlock(scope: !1252, file: !3, line: 509, column: 5)
!1252 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 508, column: 7)
!1253 = !DILocation(line: 506, column: 15, scope: !1243, inlinedAt: !1254)
!1254 = distinct !DILocation(line: 671, column: 3, scope: !1196, inlinedAt: !1237)
!1255 = !DILocation(line: 506, column: 31, scope: !1243, inlinedAt: !1254)
!1256 = !DILocation(line: 506, column: 40, scope: !1243, inlinedAt: !1254)
!1257 = !DILocation(line: 180, column: 19, scope: !49, inlinedAt: !1258)
!1258 = distinct !DILocation(line: 511, column: 20, scope: !1251, inlinedAt: !1254)
!1259 = !DILocation(line: 180, column: 30, scope: !49, inlinedAt: !1258)
!1260 = !DILocation(line: 180, column: 41, scope: !49, inlinedAt: !1258)
!1261 = !DILocation(line: 182, column: 10, scope: !49, inlinedAt: !1258)
!1262 = !DILocation(line: 211, column: 10, scope: !49, inlinedAt: !1258)
!1263 = !DILocation(line: 511, column: 18, scope: !1251, inlinedAt: !1254)
!1264 = !DILocation(line: 510, column: 14, scope: !1251, inlinedAt: !1254)
!1265 = !DILocation(line: 513, column: 23, scope: !1266, inlinedAt: !1254)
!1266 = distinct !DILexicalBlock(scope: !1267, file: !3, line: 512, column: 7)
!1267 = distinct !DILexicalBlock(scope: !1251, file: !3, line: 512, column: 7)
!1268 = !DILocation(line: 516, column: 7, scope: !1269, inlinedAt: !1254)
!1269 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 516, column: 7)
!1270 = !DILocation(line: 662, column: 20, scope: !1196, inlinedAt: !1237)
!1271 = !DILocation(line: 506, column: 15, scope: !1243, inlinedAt: !1272)
!1272 = distinct !DILocation(line: 673, column: 3, scope: !1196, inlinedAt: !1237)
!1273 = !DILocation(line: 506, column: 31, scope: !1243, inlinedAt: !1272)
!1274 = !DILocation(line: 506, column: 40, scope: !1243, inlinedAt: !1272)
!1275 = !DILocation(line: 180, column: 19, scope: !49, inlinedAt: !1276)
!1276 = distinct !DILocation(line: 511, column: 20, scope: !1251, inlinedAt: !1272)
!1277 = !DILocation(line: 180, column: 30, scope: !49, inlinedAt: !1276)
!1278 = !DILocation(line: 180, column: 41, scope: !49, inlinedAt: !1276)
!1279 = !DILocation(line: 182, column: 10, scope: !49, inlinedAt: !1276)
!1280 = !DILocation(line: 211, column: 10, scope: !49, inlinedAt: !1276)
!1281 = !DILocation(line: 511, column: 18, scope: !1251, inlinedAt: !1272)
!1282 = !DILocation(line: 510, column: 14, scope: !1251, inlinedAt: !1272)
!1283 = !DILocation(line: 513, column: 23, scope: !1266, inlinedAt: !1272)
!1284 = !DILocation(line: 516, column: 7, scope: !1243, inlinedAt: !1254)
!1285 = !DILocation(line: 516, column: 7, scope: !1269, inlinedAt: !1272)
!1286 = !DILocation(line: 516, column: 7, scope: !1243, inlinedAt: !1272)
!1287 = !DILocation(line: 675, column: 7, scope: !1196, inlinedAt: !1237)
!1288 = !DILocation(line: 677, column: 21, scope: !1289, inlinedAt: !1237)
!1289 = distinct !DILexicalBlock(scope: !1290, file: !3, line: 676, column: 5)
!1290 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 675, column: 7)
!1291 = !DILocation(line: 677, column: 34, scope: !1289, inlinedAt: !1237)
!1292 = !DILocation(line: 677, column: 49, scope: !1289, inlinedAt: !1237)
!1293 = !{!1294, !907, i64 24}
!1294 = !{!"line", !1295, i64 0, !907, i64 24, !907, i64 32, !754, i64 40}
!1295 = !{!"linebuffer", !907, i64 0, !907, i64 8, !754, i64 16}
!1296 = !DILocation(line: 677, column: 19, scope: !1289, inlinedAt: !1237)
!1297 = !DILocation(line: 678, column: 21, scope: !1289, inlinedAt: !1237)
!1298 = !DILocation(line: 678, column: 34, scope: !1289, inlinedAt: !1237)
!1299 = !DILocation(line: 678, column: 49, scope: !1289, inlinedAt: !1237)
!1300 = !DILocation(line: 678, column: 19, scope: !1289, inlinedAt: !1237)
!1301 = !DILocation(line: 679, column: 5, scope: !1289, inlinedAt: !1237)
!1302 = !DILocation(line: 681, column: 25, scope: !1214, inlinedAt: !1237)
!1303 = !DILocation(line: 681, column: 40, scope: !1214, inlinedAt: !1237)
!1304 = !DILocation(line: 681, column: 7, scope: !1196, inlinedAt: !1237)
!1305 = !DILocation(line: 683, column: 48, scope: !1213, inlinedAt: !1237)
!1306 = !DILocation(line: 683, column: 26, scope: !1213, inlinedAt: !1237)
!1307 = !DILocation(line: 684, column: 35, scope: !1213, inlinedAt: !1237)
!1308 = !DILocation(line: 684, column: 26, scope: !1213, inlinedAt: !1237)
!1309 = !DILocation(line: 685, column: 7, scope: !1213, inlinedAt: !1237)
!1310 = !DILocation(line: 687, column: 19, scope: !1213, inlinedAt: !1237)
!1311 = !DILocalVariable(name: "fp", arg: 1, scope: !1312, file: !3, line: 527, type: !797)
