; ModuleID = 'coreutils-8.27/src/ls.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.pending = type { i8*, i8*, i8, %struct.pending* }
%struct.timespec = type { i64, i64 }
%struct.ignore_pattern = type { i8*, %struct.ignore_pattern* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.color_ext_type = type { %struct.bin_str, %struct.bin_str, %struct.color_ext_type* }
%struct.bin_str = type { i64, i8* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }

!32 = !DIEnumerator(name: "C_CAP", value: 21)
!33 = !DIEnumerator(name: "C_MULTIHARDLINK", value: 22)
!34 = !DIEnumerator(name: "C_CLR_TO_EOL", value: 23)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "format", file: !3, line: 409, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "long_format", value: 0)
!38 = !DIEnumerator(name: "one_per_line", value: 1)
!39 = !DIEnumerator(name: "many_per_line", value: 2)
!40 = !DIEnumerator(name: "horizontal", value: 3)
!41 = !DIEnumerator(name: "with_commas", value: 4)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !3, line: 564, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47, !48}
!44 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1)
!45 = !DIEnumerator(name: "DEREF_NEVER", value: 2)
!46 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3)
!47 = !DIEnumerator(name: "DEREF_COMMAND_LINE_SYMLINK_TO_DIR", value: 4)
!48 = !DIEnumerator(name: "DEREF_ALWAYS", value: 5)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "indicator_style", file: !3, line: 524, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIEnumerator(name: "none", value: 0)
!52 = !DIEnumerator(name: "slash", value: 1)
!53 = !DIEnumerator(name: "file_type", value: 2)
!54 = !DIEnumerator(name: "classify", value: 3)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sort_type", file: !3, line: 460, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61, !62, !63}
!57 = !DIEnumerator(name: "sort_none", value: -1)
!58 = !DIEnumerator(name: "sort_name", value: 0)
!59 = !DIEnumerator(name: "sort_extension", value: 1)
!60 = !DIEnumerator(name: "sort_size", value: 2)
!61 = !DIEnumerator(name: "sort_version", value: 3)
!62 = !DIEnumerator(name: "sort_time", value: 4)
!63 = !DIEnumerator(name: "sort_numtypes", value: 5)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "filetype", file: !3, line: 160, size: 32, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!66 = !DIEnumerator(name: "unknown", value: 0)
!67 = !DIEnumerator(name: "fifo", value: 1)
!68 = !DIEnumerator(name: "chardev", value: 2)
!69 = !DIEnumerator(name: "directory", value: 3)
!70 = !DIEnumerator(name: "blockdev", value: 4)
!71 = !DIEnumerator(name: "normal", value: 5)
!72 = !DIEnumerator(name: "symbolic_link", value: 6)
!73 = !DIEnumerator(name: "sock", value: 7)
!74 = !DIEnumerator(name: "whiteout", value: 8)
!75 = !DIEnumerator(name: "arg_directory", value: 9)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 112, size: 32, elements: !78)
!77 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!78 = !{!79}
!79 = !DIEnumerator(name: "NOT_AN_INODE_NUMBER", value: 0)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "acl_type", file: !3, line: 188, size: 32, elements: !81)
!81 = !{!82, !83, !84}
!82 = !DIEnumerator(name: "ACL_T_NONE", value: 0)
!83 = !DIEnumerator(name: "ACL_T_LSM_CONTEXT_ONLY", value: 1)
!84 = !DIEnumerator(name: "ACL_T_YES", value: 2)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !86, file: !3, line: 1357, size: 32, elements: !209)
!86 = distinct !DISubprogram(name: "signal_setup", scope: !3, file: !3, line: 1331, type: !87, isLocal: true, isDefinition: true, scopeLine: 1332, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !90)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89}
!89 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!90 = !{!91, !92, !94}
!91 = !DILocalVariable(name: "init", arg: 1, scope: !86, file: !3, line: 1331, type: !89)
!92 = !DILocalVariable(name: "j", scope: !86, file: !3, line: 1363, type: !93)
!93 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!94 = !DILocalVariable(name: "act", scope: !95, file: !3, line: 1368, type: !97)
!95 = distinct !DILexicalBlock(scope: !96, file: !3, line: 1366, column: 5)
!96 = distinct !DILexicalBlock(scope: !86, file: !3, line: 1365, column: 7)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !98, line: 24, size: 1216, elements: !99)
!98 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!99 = !{!100, !194, !204, !205}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !97, file: !98, line: 35, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !97, file: !98, line: 28, size: 64, elements: !102)
!102 = !{!103, !109}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !101, file: !98, line: 31, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !105, line: 68, baseType: !106)
!105 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !93}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !101, file: !98, line: 33, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !93, !113, !150}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !115, line: 124, baseType: !116)
!115 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 36, size: 1024, elements: !117)
!117 = !{!118, !119, !120, !121, !122}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !116, file: !115, line: 38, baseType: !93, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !116, file: !115, line: 40, baseType: !93, size: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !116, file: !115, line: 42, baseType: !93, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !116, file: !115, line: 48, baseType: !93, size: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !116, file: !115, line: 123, baseType: !123, size: 896, offset: 128)
!123 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !116, file: !115, line: 51, size: 896, elements: !124)
!124 = !{!125, !129, !138, !151, !157, !167, !183, !188}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !123, file: !115, line: 53, baseType: !126, size: 896)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 896, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 28)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !123, file: !115, line: 60, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !115, line: 56, size: 64, elements: !131)
!131 = !{!132, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !130, file: !115, line: 58, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !134, line: 142, baseType: !93)
!134 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!135 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !130, file: !115, line: 59, baseType: !136, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !134, line: 134, baseType: !137)
!137 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !123, file: !115, line: 68, baseType: !139, size: 128)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !115, line: 63, size: 128, elements: !140)
!140 = !{!141, !142, !143}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !139, file: !115, line: 65, baseType: !93, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !139, file: !115, line: 66, baseType: !93, size: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !139, file: !115, line: 67, baseType: !144, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !145, line: 11, baseType: !146)
!145 = !DIFile(filename: "/usr/include/bits/types/sigval_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!146 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !145, line: 5, size: 64, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !146, file: !145, line: 7, baseType: !93, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !146, file: !145, line: 8, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !123, file: !115, line: 76, baseType: !152, size: 128)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !115, line: 71, size: 128, elements: !153)
!153 = !{!154, !155, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !152, file: !115, line: 73, baseType: !133, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !152, file: !115, line: 74, baseType: !136, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !152, file: !115, line: 75, baseType: !144, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !123, file: !115, line: 86, baseType: !158, size: 256)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !115, line: 79, size: 256, elements: !159)
!159 = !{!160, !161, !162, !163, !166}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !158, file: !115, line: 81, baseType: !133, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !158, file: !115, line: 82, baseType: !136, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !158, file: !115, line: 83, baseType: !93, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !158, file: !115, line: 84, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !134, line: 144, baseType: !165)
!165 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !158, file: !115, line: 85, baseType: !164, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !123, file: !115, line: 105, baseType: !168, size: 256)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !115, line: 89, size: 256, elements: !169)
!169 = !{!170, !171, !173}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !168, file: !115, line: 91, baseType: !150, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !168, file: !115, line: 93, baseType: !172, size: 16, offset: 64)
!172 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !168, file: !115, line: 104, baseType: !174, size: 128, offset: 128)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !168, file: !115, line: 94, size: 128, elements: !175)
!175 = !{!176, !181}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !174, file: !115, line: 101, baseType: !177, size: 128)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !174, file: !115, line: 97, size: 128, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !177, file: !115, line: 99, baseType: !150, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !177, file: !115, line: 100, baseType: !150, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !174, file: !115, line: 103, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !134, line: 41, baseType: !137)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !123, file: !115, line: 112, baseType: !184, size: 128)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !115, line: 108, size: 128, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !184, file: !115, line: 110, baseType: !165, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !184, file: !115, line: 111, baseType: !93, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !123, file: !115, line: 121, baseType: !189, size: 128)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !115, line: 116, size: 128, elements: !190)
!190 = !{!191, !192, !193}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !189, file: !115, line: 118, baseType: !150, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !189, file: !115, line: 119, baseType: !93, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !189, file: !115, line: 120, baseType: !137, size: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !97, file: !98, line: 43, baseType: !195, size: 1024, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !196, line: 8, baseType: !197)
!196 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 5, size: 1024, elements: !198)
!198 = !{!199}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !197, file: !196, line: 7, baseType: !200, size: 1024)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 1024, elements: !202)
!201 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!202 = !{!203}
!203 = !DISubrange(count: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !97, file: !98, line: 46, baseType: !93, size: 32, offset: 1088)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !97, file: !98, line: 49, baseType: !206, size: 64, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{null}
!209 = !{!210}
!210 = !DIEnumerator(name: "nsigs", value: 12)
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !212, line: 32, size: 32, elements: !213)
!212 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!214 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!215 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!216 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!217 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!218 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!219 = !DIEnumerator(name: "c_quoting_style", value: 5)
!220 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!221 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!222 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!223 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!224 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_type", file: !3, line: 446, size: 32, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIEnumerator(name: "time_mtime", value: 0)
!228 = !DIEnumerator(name: "time_ctime", value: 1)
!229 = !DIEnumerator(name: "time_atime", value: 2)
!230 = !DIEnumerator(name: "time_numtypes", value: 3)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 660, size: 32, elements: !232)
!232 = !{!233, !234, !235}
!233 = !DIEnumerator(name: "IGNORE_DEFAULT", value: 0)
!234 = !DIEnumerator(name: "IGNORE_DOT_AND_DOTDOT", value: 1)
!235 = !DIEnumerator(name: "IGNORE_MINIMAL", value: 2)
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !237, line: 26, size: 32, elements: !238)
!237 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!238 = !{!239, !240, !241, !242, !243}
!239 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!240 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!241 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!242 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!243 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !245, line: 43, size: 32, elements: !246)
!245 = !DIFile(filename: "./lib/human.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!247 = !DIEnumerator(name: "human_ceiling", value: 0)
!248 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!249 = !DIEnumerator(name: "human_floor", value: 2)
!250 = !DIEnumerator(name: "human_group_digits", value: 4)
!251 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!252 = !DIEnumerator(name: "human_autoscale", value: 16)
!253 = !DIEnumerator(name: "human_base_1024", value: 32)
!254 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!255 = !DIEnumerator(name: "human_SI", value: 128)
!256 = !DIEnumerator(name: "human_B", value: 256)
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "color_type", file: !3, line: 557, size: 32, elements: !258)
!258 = !{!259, !260, !261}
!259 = !DIEnumerator(name: "color_never", value: 0)
!260 = !DIEnumerator(name: "color_always", value: 1)
!261 = !DIEnumerator(name: "color_if_tty", value: 2)
!262 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_style", file: !3, line: 423, size: 32, elements: !263)
!263 = !{!264, !265, !266, !267}
!264 = !DIEnumerator(name: "full_iso_time_style", value: 0)
!265 = !DIEnumerator(name: "long_iso_time_style", value: 1)
!266 = !DIEnumerator(name: "iso_time_style", value: 2)
!267 = !DIEnumerator(name: "locale_time_style", value: 3)
!268 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1084, size: 32, elements: !269)
!269 = !{!270}
!270 = !DIEnumerator(name: "ABFORMAT_SIZE", value: 128)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1081, size: 32, elements: !272)
!272 = !{!273}
!273 = !DIEnumerator(name: "MAX_MON_WIDTH", value: 5)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !275, line: 41, size: 32, elements: !276)
!275 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!276 = !{!277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!277 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!278 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!279 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!280 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!281 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!282 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!283 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!284 = !DIEnumerator(name: "DAY_1", value: 131079)
!285 = !DIEnumerator(name: "DAY_2", value: 131080)
!286 = !DIEnumerator(name: "DAY_3", value: 131081)
!287 = !DIEnumerator(name: "DAY_4", value: 131082)
!288 = !DIEnumerator(name: "DAY_5", value: 131083)
!289 = !DIEnumerator(name: "DAY_6", value: 131084)
!290 = !DIEnumerator(name: "DAY_7", value: 131085)
!291 = !DIEnumerator(name: "ABMON_1", value: 131086)
!292 = !DIEnumerator(name: "ABMON_2", value: 131087)
!293 = !DIEnumerator(name: "ABMON_3", value: 131088)
!294 = !DIEnumerator(name: "ABMON_4", value: 131089)
!295 = !DIEnumerator(name: "ABMON_5", value: 131090)
!296 = !DIEnumerator(name: "ABMON_6", value: 131091)
!297 = !DIEnumerator(name: "ABMON_7", value: 131092)
!298 = !DIEnumerator(name: "ABMON_8", value: 131093)
!299 = !DIEnumerator(name: "ABMON_9", value: 131094)
!300 = !DIEnumerator(name: "ABMON_10", value: 131095)
!301 = !DIEnumerator(name: "ABMON_11", value: 131096)
!302 = !DIEnumerator(name: "ABMON_12", value: 131097)
!303 = !DIEnumerator(name: "MON_1", value: 131098)
!304 = !DIEnumerator(name: "MON_2", value: 131099)
!305 = !DIEnumerator(name: "MON_3", value: 131100)
!306 = !DIEnumerator(name: "MON_4", value: 131101)
!307 = !DIEnumerator(name: "MON_5", value: 131102)
!308 = !DIEnumerator(name: "MON_6", value: 131103)
!309 = !DIEnumerator(name: "MON_7", value: 131104)
!310 = !DIEnumerator(name: "MON_8", value: 131105)
!311 = !DIEnumerator(name: "MON_9", value: 131106)
!312 = !DIEnumerator(name: "MON_10", value: 131107)
!313 = !DIEnumerator(name: "MON_11", value: 131108)
!314 = !DIEnumerator(name: "MON_12", value: 131109)
!315 = !DIEnumerator(name: "AM_STR", value: 131110)
!316 = !DIEnumerator(name: "PM_STR", value: 131111)
!317 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!318 = !DIEnumerator(name: "D_FMT", value: 131113)
!319 = !DIEnumerator(name: "T_FMT", value: 131114)
!320 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!321 = !DIEnumerator(name: "ERA", value: 131116)
!322 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!323 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!324 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!325 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!326 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!327 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!328 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!329 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!330 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!331 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!332 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!333 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!334 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!335 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!336 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!337 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!338 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!339 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!340 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!341 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!342 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!343 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!344 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!345 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!346 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!347 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!348 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!349 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!350 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!351 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!352 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!353 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!354 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!355 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!356 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!357 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!358 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!359 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!360 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!361 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!362 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!363 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!364 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!365 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!366 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!367 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!368 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!369 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!370 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!371 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!372 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!373 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!374 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!375 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!376 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!377 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!378 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!379 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!380 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!381 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!382 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!383 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!384 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!385 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!386 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!387 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!388 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!389 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!390 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!391 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!392 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!393 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!394 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!395 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!396 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!397 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!398 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!399 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!400 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!401 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!402 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!403 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!404 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!405 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!406 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!407 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!408 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!409 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!410 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!411 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!412 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!413 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!414 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!415 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!416 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!417 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!418 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!419 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!420 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!421 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!422 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!423 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!424 = !DIEnumerator(name: "CODESET", value: 14)
!425 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!426 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!427 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!428 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!429 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!430 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!431 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!432 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!433 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!434 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!435 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!436 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!437 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!438 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!439 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!440 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!441 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!442 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!443 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!444 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!445 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!446 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!447 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!448 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!449 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!450 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!451 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!452 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!453 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!454 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!455 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!456 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!457 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!458 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!459 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!460 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!461 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!462 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!463 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!464 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!465 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!466 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!467 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!468 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!469 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!470 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!471 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!472 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!473 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!474 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!475 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!476 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!477 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!478 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!479 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!480 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!481 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!482 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!483 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!484 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!485 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!486 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!487 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!488 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!489 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!490 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!491 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!492 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!493 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!494 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!495 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!496 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!497 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!498 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!499 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!500 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!501 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!502 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!503 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!504 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!505 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!506 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!507 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!508 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!509 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!510 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!511 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!512 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!513 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!514 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!515 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!516 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!517 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!518 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!519 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!520 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!521 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!522 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!523 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!524 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!525 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!526 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!527 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!528 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!529 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!530 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!531 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!532 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!533 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!534 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!535 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!536 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!537 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!538 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!539 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!540 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!541 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!542 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!543 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!544 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!545 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!546 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!547 = !DIEnumerator(name: "THOUSEP", value: 65537)
!548 = !DIEnumerator(name: "__GROUPING", value: 65538)
!549 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!550 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!551 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!552 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!553 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!554 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!555 = !DIEnumerator(name: "__YESSTR", value: 327682)
!556 = !DIEnumerator(name: "__NOSTR", value: 327683)
!557 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!558 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!559 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!560 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!561 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!562 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!563 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!564 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!565 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!566 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!567 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!568 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!569 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!570 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!571 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!572 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!573 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!574 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!575 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!576 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!577 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!578 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!579 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!580 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!581 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!582 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!583 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!584 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!585 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!586 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!587 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!588 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!589 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!590 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!591 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!592 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!593 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!594 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!595 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!596 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!597 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!598 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!599 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!600 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!601 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!602 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!603 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!604 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!605 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!606 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!607 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!608 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!609 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!610 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!611 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !613, line: 19, size: 32, elements: !614)
!613 = !DIFile(filename: "./lib/mbsalign.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!614 = !{!615, !616, !617}
!615 = !DIEnumerator(name: "MBS_ALIGN_LEFT", value: 0)
!616 = !DIEnumerator(name: "MBS_ALIGN_RIGHT", value: 1)
!617 = !DIEnumerator(name: "MBS_ALIGN_CENTER", value: 2)
!618 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parse_state", file: !3, line: 2423, size: 32, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625}
!620 = !DIEnumerator(name: "PS_START", value: 1)
!621 = !DIEnumerator(name: "PS_2", value: 2)
!622 = !DIEnumerator(name: "PS_3", value: 3)
!623 = !DIEnumerator(name: "PS_4", value: 4)
!624 = !DIEnumerator(name: "PS_DONE", value: 5)
!625 = !DIEnumerator(name: "PS_FAIL", value: 6)
!626 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !627, file: !3, line: 2234, size: 32, elements: !649)
!627 = distinct !DISubprogram(name: "get_funky_string", scope: !3, file: !3, line: 2229, type: !628, isLocal: true, isDefinition: true, scopeLine: 2231, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !639)
!628 = !DISubroutineType(types: !629)
!629 = !{!89, !630, !633, !89, !636}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !638, line: 62, baseType: !201)
!638 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648}
!640 = !DILocalVariable(name: "dest", arg: 1, scope: !627, file: !3, line: 2229, type: !630)
!641 = !DILocalVariable(name: "src", arg: 2, scope: !627, file: !3, line: 2229, type: !633)
!642 = !DILocalVariable(name: "equals_end", arg: 3, scope: !627, file: !3, line: 2229, type: !89)
!643 = !DILocalVariable(name: "output_count", arg: 4, scope: !627, file: !3, line: 2230, type: !636)
!644 = !DILocalVariable(name: "num", scope: !627, file: !3, line: 2232, type: !632)
!645 = !DILocalVariable(name: "count", scope: !627, file: !3, line: 2233, type: !637)
!646 = !DILocalVariable(name: "state", scope: !627, file: !3, line: 2236, type: !626)
!647 = !DILocalVariable(name: "p", scope: !627, file: !3, line: 2237, type: !634)
!648 = !DILocalVariable(name: "q", scope: !627, file: !3, line: 2238, type: !631)
!649 = !{!650, !651, !652, !653, !654, !655, !656}
!650 = !DIEnumerator(name: "ST_GND", value: 0)
!651 = !DIEnumerator(name: "ST_BACKSLASH", value: 1)
!652 = !DIEnumerator(name: "ST_OCTAL", value: 2)
!653 = !DIEnumerator(name: "ST_HEX", value: 3)
!654 = !DIEnumerator(name: "ST_CARET", value: 4)
!655 = !DIEnumerator(name: "ST_END", value: 5)
!656 = !DIEnumerator(name: "ST_ERROR", value: 6)
!657 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !658, line: 46, size: 32, elements: !659)
!658 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!660 = !DIEnumerator(name: "_ISupper", value: 256)
!661 = !DIEnumerator(name: "_ISlower", value: 512)
!662 = !DIEnumerator(name: "_ISalpha", value: 1024)
!663 = !DIEnumerator(name: "_ISdigit", value: 2048)
!664 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!665 = !DIEnumerator(name: "_ISspace", value: 8192)
!666 = !DIEnumerator(name: "_ISprint", value: 16384)
!667 = !DIEnumerator(name: "_ISgraph", value: 32768)
!668 = !DIEnumerator(name: "_ISblank", value: 1)
!669 = !DIEnumerator(name: "_IScntrl", value: 2)
!670 = !DIEnumerator(name: "_ISpunct", value: 4)
!671 = !DIEnumerator(name: "_ISalnum", value: 8)
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 739, size: 32, elements: !673)
!673 = !{!674}
!674 = !DIEnumerator(name: "TIME_STAMP_LEN_MAXIMUM", value: 1000)
!675 = !{!676, !150, !679, !637, !682, !104, !636, !631, !201, !634, !93, !683, !684, !685, !688, !691}
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !677, line: 7, baseType: !678)
!677 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !134, line: 148, baseType: !165)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !680, line: 112, baseType: !681)
!680 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !134, line: 62, baseType: !201)
!682 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!683 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !134, line: 133, baseType: !201)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !686, line: 86, baseType: !687)
!686 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !134, line: 140, baseType: !165)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !3, line: 195, size: 1536, elements: !694)
!694 = !{!695, !696, !697, !731, !732, !734, !735, !736, !737, !738, !739}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !693, file: !3, line: 198, baseType: !631, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !693, file: !3, line: 201, baseType: !631, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !693, file: !3, line: 203, baseType: !698, size: 1152, offset: 128)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !699, line: 46, size: 1152, elements: !700)
!699 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!700 = !{!701, !702, !704, !706, !708, !709, !711, !712, !713, !714, !716, !718, !725, !726, !727}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !698, file: !699, line: 48, baseType: !684, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !698, file: !699, line: 53, baseType: !703, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !134, line: 136, baseType: !201)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !698, file: !699, line: 61, baseType: !705, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !134, line: 139, baseType: !201)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !698, file: !699, line: 62, baseType: !707, size: 32, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !134, line: 138, baseType: !137)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !698, file: !699, line: 64, baseType: !136, size: 32, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !698, file: !699, line: 65, baseType: !710, size: 32, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !134, line: 135, baseType: !137)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !698, file: !699, line: 67, baseType: !93, size: 32, offset: 288)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !698, file: !699, line: 69, baseType: !684, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !698, file: !699, line: 74, baseType: !687, size: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !698, file: !699, line: 78, baseType: !715, size: 64, offset: 448)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !134, line: 162, baseType: !165)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !698, file: !699, line: 80, baseType: !717, size: 64, offset: 512)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !134, line: 167, baseType: !165)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !698, file: !699, line: 91, baseType: !719, size: 128, offset: 576)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !720, line: 8, size: 128, elements: !721)
!720 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !719, file: !720, line: 10, baseType: !678, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !719, file: !720, line: 11, baseType: !724, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !134, line: 184, baseType: !165)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !698, file: !699, line: 92, baseType: !719, size: 128, offset: 704)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !698, file: !699, line: 93, baseType: !719, size: 128, offset: 832)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !698, file: !699, line: 106, baseType: !728, size: 192, offset: 960)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 192, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 3)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !693, file: !3, line: 205, baseType: !64, size: 32, offset: 1280)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "linkmode", scope: !693, file: !3, line: 209, baseType: !733, size: 32, offset: 1312)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !686, line: 70, baseType: !707)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "scontext", scope: !693, file: !3, line: 212, baseType: !631, size: 64, offset: 1344)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "stat_ok", scope: !693, file: !3, line: 214, baseType: !89, size: 8, offset: 1408)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "linkok", scope: !693, file: !3, line: 218, baseType: !89, size: 8, offset: 1416)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "acl_type", scope: !693, file: !3, line: 222, baseType: !80, size: 32, offset: 1440)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "has_capability", scope: !693, file: !3, line: 225, baseType: !89, size: 8, offset: 1472)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "quoted", scope: !693, file: !3, line: 228, baseType: !93, size: 32, offset: 1504)
!740 = !{!741, !747, !750, !752, !754, !756, !765, !767, !769, !771, !773, !775, !777, !779, !781, !783, !785, !787, !789, !791, !795, !797, !803, !805, !807, !813, !0, !815, !817, !868, !870, !872, !874, !883, !889, !893, !964, !966, !968, !970, !972, !974, !976, !978, !980, !982, !984, !998, !1000, !1002, !1004, !1006, !1008, !1010, !1012, !1018, !1023, !1027, !1029, !1033, !1038, !1044, !1049, !1055, !1058, !1060, !1062, !1064, !1069, !1071, !1075, !1080, !1082, !1088, !1090, !1098, !1103, !1148, !1150, !1153, !1156, !1158, !1160, !1162, !1164, !1166, !1168, !1170, !1172, !1174, !1176, !1178, !1188, !1198, !1207, !1209, !1224, !1234, !1253, !1271, !1279, !1284, !1315}
!741 = !DIGlobalVariableExpression(var: !742)
!742 = distinct !DIGlobalVariable(name: "active_dir_set", scope: !2, file: !3, line: 311, type: !743, isLocal: true, isDefinition: true)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !745, line: 69, baseType: !746)
!745 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !745, line: 67, flags: DIFlagFwdDecl)
!747 = !DIGlobalVariableExpression(var: !748)
!748 = distinct !DIGlobalVariable(name: "cwd_file", scope: !2, file: !3, line: 322, type: !749, isLocal: true, isDefinition: true)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!750 = !DIGlobalVariableExpression(var: !751)
!751 = distinct !DIGlobalVariable(name: "cwd_n_alloc", scope: !2, file: !3, line: 325, type: !637, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753)
!753 = distinct !DIGlobalVariable(name: "cwd_n_used", scope: !2, file: !3, line: 328, type: !637, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755)
!755 = distinct !DIGlobalVariable(name: "color_symlink_as_referent", scope: !2, file: !3, line: 347, type: !89, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757)
!757 = distinct !DIGlobalVariable(name: "pending_dirs", scope: !2, file: !3, line: 368, type: !758, isLocal: true, isDefinition: true)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pending", file: !3, line: 357, size: 256, elements: !760)
!760 = !{!761, !762, !763, !764}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !759, file: !3, line: 359, baseType: !631, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !759, file: !3, line: 363, baseType: !631, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "command_line_arg", scope: !759, file: !3, line: 364, baseType: !89, size: 8, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !759, file: !3, line: 365, baseType: !758, size: 64, offset: 192)
!765 = !DIGlobalVariableExpression(var: !766)
!766 = distinct !DIGlobalVariable(name: "current_time", scope: !2, file: !3, line: 373, type: !719, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768)
!768 = distinct !DIGlobalVariable(name: "print_scontext", scope: !2, file: !3, line: 375, type: !89, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770)
!770 = distinct !DIGlobalVariable(name: "format", scope: !2, file: !3, line: 418, type: !35, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772)
!772 = distinct !DIGlobalVariable(name: "sort_type", scope: !2, file: !3, line: 471, type: !55, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774)
!774 = distinct !DIGlobalVariable(name: "print_block_size", scope: !2, file: !3, line: 500, type: !89, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776)
!776 = distinct !DIGlobalVariable(name: "dired", scope: !2, file: !3, line: 515, type: !89, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778)
!778 = distinct !DIGlobalVariable(name: "indicator_style", scope: !2, file: !3, line: 532, type: !49, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780)
!780 = distinct !DIGlobalVariable(name: "print_with_color", scope: !2, file: !3, line: 549, type: !89, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782)
!782 = distinct !DIGlobalVariable(name: "check_symlink_color", scope: !2, file: !3, line: 633, type: !89, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784)
!784 = distinct !DIGlobalVariable(name: "dereference", scope: !2, file: !3, line: 642, type: !42, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786)
!786 = distinct !DIGlobalVariable(name: "recursive", scope: !2, file: !3, line: 647, type: !89, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788)
!788 = distinct !DIGlobalVariable(name: "immediate_dirs", scope: !2, file: !3, line: 652, type: !89, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790)
!790 = distinct !DIGlobalVariable(name: "directories_first", scope: !2, file: !3, line: 656, type: !89, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792)
!792 = distinct !DIGlobalVariable(name: "filename_quoting_options", scope: !2, file: !3, line: 703, type: !793, isLocal: true, isDefinition: true)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !212, line: 270, flags: DIFlagFwdDecl)
!795 = !DIGlobalVariableExpression(var: !796)
!796 = distinct !DIGlobalVariable(name: "print_dir_name", scope: !2, file: !3, line: 712, type: !89, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798)
!798 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 721, type: !799, isLocal: true, isDefinition: true)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !800, line: 594, baseType: !801)
!800 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !800, line: 594, flags: DIFlagFwdDecl)
!803 = !DIGlobalVariableExpression(var: !804)
!804 = distinct !DIGlobalVariable(name: "format_needs_stat", scope: !2, file: !3, line: 726, type: !89, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806)
!806 = distinct !DIGlobalVariable(name: "format_needs_type", scope: !2, file: !3, line: 731, type: !89, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808)
!808 = distinct !DIGlobalVariable(name: "interrupt_signal", scope: !2, file: !3, line: 780, type: !809, isLocal: true, isDefinition: true)
!809 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !811, line: 8, baseType: !812)
!811 = !DIFile(filename: "/usr/include/bits/types/sig_atomic_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !134, line: 203, baseType: !93)
!813 = !DIGlobalVariableExpression(var: !814)
!814 = distinct !DIGlobalVariable(name: "stop_signal_count", scope: !2, file: !3, line: 784, type: !809, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816)
!816 = distinct !DIGlobalVariable(name: "dired_pos", scope: !2, file: !3, line: 946, type: !637, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818)
!818 = distinct !DIGlobalVariable(name: "dired_obstack", scope: !2, file: !3, line: 967, type: !819, isLocal: true, isDefinition: true)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !820, line: 174, size: 704, elements: !821)
!820 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!821 = !{!822, !823, !833, !834, !835, !836, !841, !842, !853, !864, !865, !866, !867}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !819, file: !820, line: 176, baseType: !637, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !819, file: !820, line: 177, baseType: !824, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !820, line: 167, size: 128, elements: !826)
!826 = !{!827, !828, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !825, file: !820, line: 169, baseType: !631, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !825, file: !820, line: 170, baseType: !824, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !825, file: !820, line: 171, baseType: !830, offset: 128)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: -1)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !819, file: !820, line: 178, baseType: !631, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !819, file: !820, line: 179, baseType: !631, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !819, file: !820, line: 180, baseType: !631, size: 64, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !819, file: !820, line: 185, baseType: !837, size: 64, offset: 320)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !819, file: !820, line: 181, size: 64, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !837, file: !820, line: 183, baseType: !637, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !837, file: !820, line: 184, baseType: !150, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !819, file: !820, line: 186, baseType: !637, size: 64, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !819, file: !820, line: 193, baseType: !843, size: 64, offset: 448)
!843 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !819, file: !820, line: 189, size: 64, elements: !844)
!844 = !{!845, !849}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !843, file: !820, line: 191, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!150, !637}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !843, file: !820, line: 192, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!150, !150, !637}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !819, file: !820, line: 198, baseType: !854, size: 64, offset: 512)
!854 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !819, file: !820, line: 194, size: 64, elements: !855)
!855 = !{!856, !860}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !854, file: !820, line: 196, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{null, !150}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !854, file: !820, line: 197, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !150, !150}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !819, file: !820, line: 200, baseType: !150, size: 64, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !819, file: !820, line: 201, baseType: !137, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !819, file: !820, line: 202, baseType: !137, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !819, file: !820, line: 206, baseType: !137, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!868 = !DIGlobalVariableExpression(var: !869)
!869 = distinct !DIGlobalVariable(name: "subdired_obstack", scope: !2, file: !3, line: 974, type: !819, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871)
!871 = distinct !DIGlobalVariable(name: "dev_ino_obstack", scope: !2, file: !3, line: 988, type: !819, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873)
!873 = distinct !DIGlobalVariable(name: "used_color", scope: !2, file: !3, line: 555, type: !89, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875)
!875 = distinct !DIGlobalVariable(name: "color_indicator", scope: !2, file: !3, line: 596, type: !876, isLocal: true, isDefinition: true)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !877, size: 3072, elements: !881)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_str", file: !3, line: 237, size: 128, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !877, file: !3, line: 239, baseType: !637, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !877, file: !3, line: 240, baseType: !634, size: 64, offset: 64)
!881 = !{!882}
!882 = !DISubrange(count: 24)
!883 = !DIGlobalVariableExpression(var: !884)
!884 = distinct !DIGlobalVariable(name: "sig", scope: !86, file: !3, line: 1334, type: !885, isLocal: true, isDefinition: true)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !886, size: 384, elements: !887)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!887 = !{!888}
!888 = !DISubrange(count: 12)
!889 = !DIGlobalVariableExpression(var: !890)
!890 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 776, type: !891, isLocal: true, isDefinition: true)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !892, line: 7, baseType: !195)
!892 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!893 = !DIGlobalVariableExpression(var: !894)
!894 = distinct !DIGlobalVariable(name: "posix_prefix", scope: !895, file: !3, line: 2128, type: !961, isLocal: true, isDefinition: true)
!895 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 1651, type: !896, isLocal: true, isDefinition: true, scopeLine: 1652, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !898)
!896 = !DISubroutineType(types: !897)
!897 = !{!93, !93, !630}
!898 = !{!899, !900, !901, !902, !903, !904, !906, !915, !917, !920, !922, !923, !931, !933, !935, !938, !939, !942, !945, !948, !949, !952, !957}
!899 = !DILocalVariable(name: "argc", arg: 1, scope: !895, file: !3, line: 1651, type: !93)
!900 = !DILocalVariable(name: "argv", arg: 2, scope: !895, file: !3, line: 1651, type: !630)
!901 = !DILocalVariable(name: "time_style_option", scope: !895, file: !3, line: 1653, type: !631)
!902 = !DILocalVariable(name: "sort_type_specified", scope: !895, file: !3, line: 1655, type: !89)
!903 = !DILocalVariable(name: "kibibytes_specified", scope: !895, file: !3, line: 1656, type: !89)
!904 = !DILocalVariable(name: "p", scope: !905, file: !3, line: 1715, type: !634)
!905 = distinct !DILexicalBlock(scope: !895, file: !3, line: 1714, column: 3)
!906 = !DILocalVariable(name: "ws", scope: !907, file: !3, line: 1724, type: !908)
!907 = distinct !DILexicalBlock(scope: !895, file: !3, line: 1723, column: 3)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "winsize", file: !909, line: 27, size: 64, elements: !910)
!909 = !DIFile(filename: "/usr/include/bits/ioctl-types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!910 = !{!911, !912, !913, !914}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ws_row", scope: !908, file: !909, line: 29, baseType: !683, size: 16)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ws_col", scope: !908, file: !909, line: 30, baseType: !683, size: 16, offset: 16)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ws_xpixel", scope: !908, file: !909, line: 31, baseType: !683, size: 16, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ws_ypixel", scope: !908, file: !909, line: 32, baseType: !683, size: 16, offset: 48)
!915 = !DILocalVariable(name: "p", scope: !916, file: !3, line: 1733, type: !634)
!916 = distinct !DILexicalBlock(scope: !895, file: !3, line: 1732, column: 3)
!917 = !DILocalVariable(name: "tmp_ulong", scope: !918, file: !3, line: 1737, type: !201)
!918 = distinct !DILexicalBlock(scope: !919, file: !3, line: 1736, column: 7)
!919 = distinct !DILexicalBlock(scope: !916, file: !3, line: 1735, column: 9)
!920 = !DILocalVariable(name: "oi", scope: !921, file: !3, line: 1754, type: !93)
!921 = distinct !DILexicalBlock(scope: !895, file: !3, line: 1753, column: 5)
!922 = !DILocalVariable(name: "c", scope: !921, file: !3, line: 1755, type: !93)
!923 = !DILocalVariable(name: "hide", scope: !924, file: !3, line: 1958, type: !926)
!924 = distinct !DILexicalBlock(scope: !925, file: !3, line: 1957, column: 11)
!925 = distinct !DILexicalBlock(scope: !921, file: !3, line: 1762, column: 9)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ignore_pattern", file: !3, line: 678, size: 128, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !927, file: !3, line: 680, baseType: !634, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !927, file: !3, line: 681, baseType: !926, size: 64, offset: 64)
!931 = !DILocalVariable(name: "i", scope: !932, file: !3, line: 1989, type: !93)
!932 = distinct !DILexicalBlock(scope: !925, file: !3, line: 1988, column: 11)
!933 = !DILocalVariable(name: "e", scope: !934, file: !3, line: 2034, type: !236)
!934 = distinct !DILexicalBlock(scope: !925, file: !3, line: 2033, column: 11)
!935 = !DILocalVariable(name: "ls_block_size", scope: !936, file: !3, line: 2064, type: !634)
!936 = distinct !DILexicalBlock(scope: !937, file: !3, line: 2063, column: 5)
!937 = distinct !DILexicalBlock(scope: !895, file: !3, line: 2062, column: 7)
!938 = !DILocalVariable(name: "qs", scope: !895, file: !3, line: 2085, type: !211)
!939 = !DILocalVariable(name: "p", scope: !940, file: !3, line: 2097, type: !634)
!940 = distinct !DILexicalBlock(scope: !941, file: !3, line: 2096, column: 5)
!941 = distinct !DILexicalBlock(scope: !895, file: !3, line: 2095, column: 7)
!942 = !DILocalVariable(name: "style", scope: !943, file: !3, line: 2127, type: !631)
!943 = distinct !DILexicalBlock(scope: !944, file: !3, line: 2126, column: 5)
!944 = distinct !DILexicalBlock(scope: !895, file: !3, line: 2125, column: 7)
!945 = !DILocalVariable(name: "p0", scope: !946, file: !3, line: 2143, type: !631)
!946 = distinct !DILexicalBlock(scope: !947, file: !3, line: 2142, column: 9)
!947 = distinct !DILexicalBlock(scope: !943, file: !3, line: 2141, column: 11)
!948 = !DILocalVariable(name: "p1", scope: !946, file: !3, line: 2144, type: !631)
!949 = !DILocalVariable(name: "res", scope: !950, file: !3, line: 2159, type: !951)
!950 = distinct !DILexicalBlock(scope: !947, file: !3, line: 2158, column: 9)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !638, line: 51, baseType: !165)
!952 = !DILocalVariable(name: "p", scope: !953, file: !3, line: 2175, type: !955)
!953 = distinct !DILexicalBlock(scope: !954, file: !3, line: 2163, column: 13)
!954 = distinct !DILexicalBlock(scope: !950, file: !3, line: 2162, column: 15)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!957 = !DILocalVariable(name: "i", scope: !958, file: !3, line: 2201, type: !93)
!958 = distinct !DILexicalBlock(scope: !959, file: !3, line: 2200, column: 17)
!959 = distinct !DILexicalBlock(scope: !960, file: !3, line: 2199, column: 19)
!960 = distinct !DILexicalBlock(scope: !950, file: !3, line: 2183, column: 13)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 56, elements: !962)
!962 = !{!963}
!963 = !DISubrange(count: 7)
!964 = !DIGlobalVariableExpression(var: !965)
!965 = distinct !DIGlobalVariable(name: "qmark_funny_chars", scope: !2, file: !3, line: 699, type: !89, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967)
!967 = distinct !DIGlobalVariable(name: "time_type", scope: !2, file: !3, line: 454, type: !225, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969)
!969 = distinct !DIGlobalVariable(name: "sort_reverse", scope: !2, file: !3, line: 479, type: !89, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971)
!971 = distinct !DIGlobalVariable(name: "numeric_ids", scope: !2, file: !3, line: 496, type: !89, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973)
!973 = distinct !DIGlobalVariable(name: "print_inode", scope: !2, file: !3, line: 637, type: !89, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975)
!975 = distinct !DIGlobalVariable(name: "ignore_mode", scope: !2, file: !3, line: 671, type: !231, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977)
!977 = distinct !DIGlobalVariable(name: "ignore_patterns", scope: !2, file: !3, line: 684, type: !926, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979)
!979 = distinct !DIGlobalVariable(name: "hide_patterns", scope: !2, file: !3, line: 688, type: !926, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981)
!981 = distinct !DIGlobalVariable(name: "line_length", scope: !2, file: !3, line: 717, type: !637, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983)
!983 = distinct !DIGlobalVariable(name: "tabsize", scope: !2, file: !3, line: 708, type: !637, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985)
!985 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 826, type: !986, isLocal: true, isDefinition: true)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 11008, elements: !996)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !989, line: 50, size: 256, elements: !990)
!989 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!990 = !{!991, !992, !993, !995}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !988, file: !989, line: 52, baseType: !634, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !988, file: !989, line: 55, baseType: !93, size: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !988, file: !989, line: 56, baseType: !994, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !988, file: !989, line: 57, baseType: !93, size: 32, offset: 192)
!996 = !{!997}
!997 = !DISubrange(count: 43)
!998 = !DIGlobalVariableExpression(var: !999)
!999 = distinct !DIGlobalVariable(name: "print_owner", scope: !2, file: !3, line: 483, type: !89, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001)
!1001 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 503, type: !93, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003)
!1003 = distinct !DIGlobalVariable(name: "file_human_output_opts", scope: !2, file: !3, line: 509, type: !93, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005)
!1005 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 506, type: !679, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007)
!1007 = distinct !DIGlobalVariable(name: "file_output_block_size", scope: !2, file: !3, line: 510, type: !679, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009)
!1009 = distinct !DIGlobalVariable(name: "print_group", scope: !2, file: !3, line: 491, type: !89, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011)
!1011 = distinct !DIGlobalVariable(name: "print_author", scope: !2, file: !3, line: 487, type: !89, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013)
!1013 = distinct !DIGlobalVariable(name: "sort_types", scope: !2, file: !3, line: 891, type: !1014, isLocal: true, isDefinition: true)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 160, elements: !1016)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!1016 = !{!1017}
!1017 = !DISubrange(count: 5)
!1018 = !DIGlobalVariableExpression(var: !1019)
!1019 = distinct !DIGlobalVariable(name: "sort_args", scope: !2, file: !3, line: 887, type: !1020, isLocal: true, isDefinition: true)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 384, elements: !1021)
!1021 = !{!1022}
!1022 = !DISubrange(count: 6)
!1023 = !DIGlobalVariableExpression(var: !1024)
!1024 = distinct !DIGlobalVariable(name: "time_types", scope: !2, file: !3, line: 901, type: !1025, isLocal: true, isDefinition: true)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1026, size: 160, elements: !1016)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!1027 = !DIGlobalVariableExpression(var: !1028)
!1028 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 897, type: !1020, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030)
!1030 = distinct !DIGlobalVariable(name: "format_types", scope: !2, file: !3, line: 880, type: !1031, isLocal: true, isDefinition: true)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1032, size: 224, elements: !962)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!1033 = !DIGlobalVariableExpression(var: !1034)
!1034 = distinct !DIGlobalVariable(name: "format_args", scope: !2, file: !3, line: 875, type: !1035, isLocal: true, isDefinition: true)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 512, elements: !1036)
!1036 = !{!1037}
!1037 = !DISubrange(count: 8)
!1038 = !DIGlobalVariableExpression(var: !1039)
!1039 = distinct !DIGlobalVariable(name: "color_types", scope: !2, file: !3, line: 914, type: !1040, isLocal: true, isDefinition: true)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1041, size: 288, elements: !1042)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!1042 = !{!1043}
!1043 = !DISubrange(count: 9)
!1044 = !DIGlobalVariableExpression(var: !1045)
!1045 = distinct !DIGlobalVariable(name: "color_args", scope: !2, file: !3, line: 907, type: !1046, isLocal: true, isDefinition: true)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 640, elements: !1047)
!1047 = !{!1048}
!1048 = !DISubrange(count: 10)
!1049 = !DIGlobalVariableExpression(var: !1050)
!1050 = distinct !DIGlobalVariable(name: "indicator_style_types", scope: !2, file: !3, line: 539, type: !1051, isLocal: true, isDefinition: true)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 128, elements: !1053)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!1053 = !{!1054}
!1054 = !DISubrange(count: 4)
!1055 = !DIGlobalVariableExpression(var: !1056)
!1056 = distinct !DIGlobalVariable(name: "indicator_style_args", scope: !2, file: !3, line: 535, type: !1057, isLocal: true, isDefinition: true)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 320, elements: !1016)
!1058 = !DIGlobalVariableExpression(var: !1059)
!1059 = distinct !DIGlobalVariable(name: "max_idx", scope: !2, file: !3, line: 934, type: !637, isLocal: true, isDefinition: true)
!1060 = !DIGlobalVariableExpression(var: !1061)
!1061 = distinct !DIGlobalVariable(name: "align_variable_outer_quotes", scope: !2, file: !3, line: 335, type: !89, isLocal: true, isDefinition: true)
!1062 = !DIGlobalVariableExpression(var: !1063)
!1063 = distinct !DIGlobalVariable(name: "dirname_quoting_options", scope: !2, file: !3, line: 704, type: !793, isLocal: true, isDefinition: true)
!1064 = !DIGlobalVariableExpression(var: !1065)
!1065 = distinct !DIGlobalVariable(name: "long_time_format", scope: !2, file: !3, line: 744, type: !1066, isLocal: true, isDefinition: true)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 128, elements: !1067)
!1067 = !{!1068}
!1068 = !DISubrange(count: 2)
!1069 = !DIGlobalVariableExpression(var: !1070)
!1070 = distinct !DIGlobalVariable(name: "time_style_args", scope: !2, file: !3, line: 431, type: !1057, isLocal: true, isDefinition: true)
!1071 = !DIGlobalVariableExpression(var: !1072)
!1072 = distinct !DIGlobalVariable(name: "time_style_types", scope: !2, file: !3, line: 435, type: !1073, isLocal: true, isDefinition: true)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1074, size: 128, elements: !1053)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!1075 = !DIGlobalVariableExpression(var: !1076)
!1076 = distinct !DIGlobalVariable(name: "abformat", scope: !2, file: !3, line: 1085, type: !1077, isLocal: true, isDefinition: true)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 24576, elements: !1078)
!1078 = !{!1068, !888, !1079}
!1079 = !DISubrange(count: 128)
!1080 = !DIGlobalVariableExpression(var: !1081)
!1081 = distinct !DIGlobalVariable(name: "use_abformat", scope: !2, file: !3, line: 1089, type: !89, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083)
!1083 = distinct !DIGlobalVariable(name: "G_line", scope: !2, file: !1084, line: 1, type: !1085, isLocal: true, isDefinition: true)
!1084 = !DIFile(filename: "src/dircolors.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 33384, elements: !1086)
!1086 = !{!1087}
!1087 = !DISubrange(count: 4173)
!1088 = !DIGlobalVariableExpression(var: !1089)
!1089 = distinct !DIGlobalVariable(name: "color_buf", scope: !2, file: !3, line: 628, type: !631, isLocal: true, isDefinition: true)
!1090 = !DIGlobalVariableExpression(var: !1091)
!1091 = distinct !DIGlobalVariable(name: "color_ext_list", scope: !2, file: !3, line: 625, type: !1092, isLocal: true, isDefinition: true)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "color_ext_type", file: !3, line: 589, size: 320, elements: !1094)
!1094 = !{!1095, !1096, !1097}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1093, file: !3, line: 591, baseType: !877, size: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1093, file: !3, line: 592, baseType: !877, size: 128, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1093, file: !3, line: 593, baseType: !1092, size: 64, offset: 256)
!1098 = !DIGlobalVariableExpression(var: !1099)
!1099 = distinct !DIGlobalVariable(name: "indicator_name", scope: !2, file: !3, line: 582, type: !1100, isLocal: true, isDefinition: true)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 1600, elements: !1101)
!1101 = !{!1102}
!1102 = !DISubrange(count: 25)
!1103 = !DIGlobalVariableExpression(var: !1104)
!1104 = distinct !DIGlobalVariable(name: "first", scope: !1105, file: !3, line: 2673, type: !89, isLocal: true, isDefinition: true)
!1105 = distinct !DISubprogram(name: "print_dir", scope: !3, file: !3, line: 2668, type: !1106, isLocal: true, isDefinition: true, scopeLine: 2669, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1108)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{null, !634, !634, !89}
!1108 = !{!1109, !1110, !1111, !1112, !1117, !1130, !1131, !1134, !1135, !1141, !1144}
!1109 = !DILocalVariable(name: "name", arg: 1, scope: !1105, file: !3, line: 2668, type: !634)
!1110 = !DILocalVariable(name: "realname", arg: 2, scope: !1105, file: !3, line: 2668, type: !634)
!1111 = !DILocalVariable(name: "command_line_arg", arg: 3, scope: !1105, file: !3, line: 2668, type: !89)
!1112 = !DILocalVariable(name: "dirp", scope: !1105, file: !3, line: 2670, type: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1115, line: 127, baseType: !1116)
!1115 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1116 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1115, line: 127, flags: DIFlagFwdDecl)
!1117 = !DILocalVariable(name: "next", scope: !1105, file: !3, line: 2671, type: !1118)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !1120, line: 22, size: 2240, elements: !1121)
!1120 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1121 = !{!1122, !1123, !1124, !1125, !1126}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !1119, file: !1120, line: 25, baseType: !703, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !1119, file: !1120, line: 26, baseType: !687, size: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !1119, file: !1120, line: 31, baseType: !683, size: 16, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !1119, file: !1120, line: 32, baseType: !682, size: 8, offset: 144)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !1119, file: !1120, line: 33, baseType: !1127, size: 2048, offset: 152)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 2048, elements: !1128)
!1128 = !{!1129}
!1129 = !DISubrange(count: 256)
!1130 = !DILocalVariable(name: "total_blocks", scope: !1105, file: !3, line: 2672, type: !679)
!1131 = !DILocalVariable(name: "dir_stat", scope: !1132, file: !3, line: 2685, type: !698)
!1132 = distinct !DILexicalBlock(scope: !1133, file: !3, line: 2684, column: 5)
!1133 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 2683, column: 7)
!1134 = !DILocalVariable(name: "fd", scope: !1132, file: !3, line: 2686, type: !93)
!1135 = !DILocalVariable(name: "type", scope: !1136, file: !3, line: 2741, type: !64)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 2740, column: 13)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 2739, column: 15)
!1138 = distinct !DILexicalBlock(scope: !1139, file: !3, line: 2738, column: 9)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 2737, column: 11)
!1140 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 2732, column: 5)
!1141 = !DILocalVariable(name: "p", scope: !1142, file: !3, line: 2810, type: !634)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 2809, column: 5)
!1143 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 2808, column: 7)
!1144 = !DILocalVariable(name: "buf", scope: !1142, file: !3, line: 2811, type: !1145)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 5216, elements: !1146)
!1146 = !{!1147}
!1147 = !DISubrange(count: 652)
!1148 = !DIGlobalVariableExpression(var: !1149)
!1149 = distinct !DIGlobalVariable(name: "cwd_some_quoted", scope: !2, file: !3, line: 331, type: !89, isLocal: true, isDefinition: true)
!1150 = !DIGlobalVariableExpression(var: !1151)
!1151 = distinct !DIGlobalVariable(name: "sorted_file", scope: !2, file: !3, line: 339, type: !1152, isLocal: true, isDefinition: true)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!1153 = !DIGlobalVariableExpression(var: !1154)
!1154 = distinct !DIGlobalVariable(name: "UNKNOWN_SECURITY_CONTEXT", scope: !2, file: !3, line: 376, type: !1155, isLocal: true, isDefinition: true)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 16, elements: !1067)
!1156 = !DIGlobalVariableExpression(var: !1157)
!1157 = distinct !DIGlobalVariable(name: "any_has_acl", scope: !2, file: !3, line: 381, type: !89, isLocal: true, isDefinition: true)
!1158 = !DIGlobalVariableExpression(var: !1159)
!1159 = distinct !DIGlobalVariable(name: "inode_number_width", scope: !2, file: !3, line: 387, type: !93, isLocal: true, isDefinition: true)
!1160 = !DIGlobalVariableExpression(var: !1161)
!1161 = distinct !DIGlobalVariable(name: "block_size_width", scope: !2, file: !3, line: 388, type: !93, isLocal: true, isDefinition: true)
!1162 = !DIGlobalVariableExpression(var: !1163)
!1163 = distinct !DIGlobalVariable(name: "nlink_width", scope: !2, file: !3, line: 389, type: !93, isLocal: true, isDefinition: true)
!1164 = !DIGlobalVariableExpression(var: !1165)
!1165 = distinct !DIGlobalVariable(name: "owner_width", scope: !2, file: !3, line: 391, type: !93, isLocal: true, isDefinition: true)
!1166 = !DIGlobalVariableExpression(var: !1167)
!1167 = distinct !DIGlobalVariable(name: "group_width", scope: !2, file: !3, line: 392, type: !93, isLocal: true, isDefinition: true)
!1168 = !DIGlobalVariableExpression(var: !1169)
!1169 = distinct !DIGlobalVariable(name: "author_width", scope: !2, file: !3, line: 393, type: !93, isLocal: true, isDefinition: true)
!1170 = !DIGlobalVariableExpression(var: !1171)
!1171 = distinct !DIGlobalVariable(name: "scontext_width", scope: !2, file: !3, line: 390, type: !93, isLocal: true, isDefinition: true)
!1172 = !DIGlobalVariableExpression(var: !1173)
!1173 = distinct !DIGlobalVariable(name: "major_device_number_width", scope: !2, file: !3, line: 394, type: !93, isLocal: true, isDefinition: true)
!1174 = !DIGlobalVariableExpression(var: !1175)
!1175 = distinct !DIGlobalVariable(name: "minor_device_number_width", scope: !2, file: !3, line: 395, type: !93, isLocal: true, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177)
!1177 = distinct !DIGlobalVariable(name: "file_size_width", scope: !2, file: !3, line: 396, type: !93, isLocal: true, isDefinition: true)
!1178 = !DIGlobalVariableExpression(var: !1179)
!1179 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !1180, file: !3, line: 3023, type: !1187, isLocal: true, isDefinition: true)
!1180 = distinct !DISubprogram(name: "has_capability_cache", scope: !3, file: !3, line: 3019, type: !1181, isLocal: true, isDefinition: true, scopeLine: 3020, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1183)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!89, !634, !749}
!1183 = !{!1184, !1185, !1186}
!1184 = !DILocalVariable(name: "file", arg: 1, scope: !1180, file: !3, line: 3019, type: !634)
!1185 = !DILocalVariable(name: "f", arg: 2, scope: !1180, file: !3, line: 3019, type: !749)
!1186 = !DILocalVariable(name: "b", scope: !1180, file: !3, line: 3031, type: !89)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !686, line: 60, baseType: !684)
!1188 = !DIGlobalVariableExpression(var: !1189)
!1189 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !1190, file: !3, line: 2968, type: !1187, isLocal: true, isDefinition: true)
!1190 = distinct !DISubprogram(name: "getfilecon_cache", scope: !3, file: !3, line: 2964, type: !1191, isLocal: true, isDefinition: true, scopeLine: 2965, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1193)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!93, !634, !749, !89}
!1193 = !{!1194, !1195, !1196, !1197}
!1194 = !DILocalVariable(name: "file", arg: 1, scope: !1190, file: !3, line: 2964, type: !634)
!1195 = !DILocalVariable(name: "f", arg: 2, scope: !1190, file: !3, line: 2964, type: !749)
!1196 = !DILocalVariable(name: "deref", arg: 3, scope: !1190, file: !3, line: 2964, type: !89)
!1197 = !DILocalVariable(name: "r", scope: !1190, file: !3, line: 2975, type: !93)
!1198 = !DIGlobalVariableExpression(var: !1199)
!1199 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !1200, file: !3, line: 2998, type: !1187, isLocal: true, isDefinition: true)
!1200 = distinct !DISubprogram(name: "file_has_acl_cache", scope: !3, file: !3, line: 2994, type: !1201, isLocal: true, isDefinition: true, scopeLine: 2995, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1203)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!93, !634, !749}
!1203 = !{!1204, !1205, !1206}
!1204 = !DILocalVariable(name: "file", arg: 1, scope: !1200, file: !3, line: 2994, type: !634)
!1205 = !DILocalVariable(name: "f", arg: 2, scope: !1200, file: !3, line: 2994, type: !749)
!1206 = !DILocalVariable(name: "n", scope: !1200, file: !3, line: 3009, type: !93)
!1207 = !DIGlobalVariableExpression(var: !1208)
!1208 = distinct !DIGlobalVariable(name: "sorted_file_alloc", scope: !2, file: !3, line: 340, type: !637, isLocal: true, isDefinition: true)
!1209 = !DIGlobalVariableExpression(var: !1210)
!1210 = distinct !DIGlobalVariable(name: "failed_strcoll", scope: !2, file: !3, line: 3490, type: !1211, isLocal: true, isDefinition: true)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !1212, line: 45, baseType: !1213)
!1212 = !DIFile(filename: "/usr/include/setjmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1214, size: 1600, elements: !1222)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !1212, line: 33, size: 1600, elements: !1215)
!1215 = !{!1216, !1220, !1221}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !1214, file: !1212, line: 39, baseType: !1217, size: 512)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !1218, line: 31, baseType: !1219)
!1218 = !DIFile(filename: "/usr/include/bits/setjmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 512, elements: !1036)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !1214, file: !1212, line: 40, baseType: !93, size: 32, offset: 512)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !1214, file: !1212, line: 41, baseType: !195, size: 1024, offset: 576)
!1222 = !{!1223}
!1223 = !DISubrange(count: 1)
!1224 = !DIGlobalVariableExpression(var: !1225)
!1225 = distinct !DIGlobalVariable(name: "sort_functions", scope: !2, file: !3, line: 3667, type: !1226, isLocal: true, isDefinition: true)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1227, size: 3584, elements: !1233)
!1227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "qsortFunc", file: !3, line: 3511, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!93, !1232, !1232}
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "V", file: !3, line: 3510, baseType: !689)
!1233 = !{!963, !1068, !1068, !1068}
!1234 = !DIGlobalVariableExpression(var: !1235)
