; ModuleID = 'coreutils-8.27/src/mkdir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.mkdir_options = type { i32 (i8*, i8*, i8*)*, i32, i32, i32, i8, i8* }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.savewd = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1
@.str.2 = private unnamed_addr constant [58 x i8] c"Create the DIRECTORY(ies), if they do not already exist.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !74, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !51)
!3 = !DIFile(filename: "src/mkdir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !21, file: !20, line: 39, size: 32, elements: !35)
!20 = !DIFile(filename: "./lib/savewd.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !20, line: 36, size: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !21, file: !20, line: 66, baseType: !19, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !21, file: !20, line: 74, baseType: !25, size: 32, offset: 32)
!25 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !21, file: !20, line: 69, size: 32, elements: !26)
!26 = !{!27, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !25, file: !20, line: 71, baseType: !28, size: 32)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !25, file: !20, line: 72, baseType: !28, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !25, file: !20, line: 73, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !32, line: 98, baseType: !33)
!32 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !34, line: 142, baseType: !28)
!34 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!35 = !{!36, !37, !38, !39, !40, !41}
!36 = !DIEnumerator(name: "INITIAL_STATE", value: 0)
!37 = !DIEnumerator(name: "FD_STATE", value: 1)
!38 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2)
!39 = !DIEnumerator(name: "FORKING_STATE", value: 3)
!40 = !DIEnumerator(name: "ERROR_STATE", value: 4)
!41 = !DIEnumerator(name: "FINAL_STATE", value: 5)
!42 = !{!43, !45, !46, !49}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !32, line: 80, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !34, line: 134, baseType: !48)
!48 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !32, line: 65, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !34, line: 135, baseType: !48)
!51 = !{!52, !0}
!52 = !DIGlobalVariableExpression(var: !53)
!53 = distinct !DIGlobalVariable(name: "infomap", scope: !54, file: !55, line: 632, type: !71, isLocal: true, isDefinition: true)
!54 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !55, file: !55, line: 630, type: !56, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !60)
!55 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!60 = !{!61, !62, !63, !70}
!61 = !DILocalVariable(name: "program", arg: 1, scope: !54, file: !55, line: 630, type: !58)
!62 = !DILocalVariable(name: "node", scope: !54, file: !55, line: 642, type: !58)
!63 = !DILocalVariable(name: "map_prog", scope: !54, file: !55, line: 643, type: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !54, file: !55, line: 632, size: 128, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !66, file: !55, line: 632, baseType: !58, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !66, file: !55, line: 632, baseType: !58, size: 64, offset: 64)
!70 = !DILocalVariable(name: "lc_messages", scope: !54, file: !55, line: 655, type: !58)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 896, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 7)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 1792, elements: !72)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !77, line: 50, size: 256, elements: !78)
!77 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!78 = !{!79, !80, !81, !83}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !76, file: !77, line: 52, baseType: !58, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !76, file: !77, line: 55, baseType: !28, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !76, file: !77, line: 56, baseType: !82, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !76, file: !77, line: 57, baseType: !28, size: 32, offset: 192)
!84 = !DIGlobalVariableExpression(var: !85)
!85 = distinct !DIGlobalVariable(name: "Version", scope: !86, file: !87, line: 2, type: !58, isLocal: false, isDefinition: true)
!86 = distinct !DICompileUnit(language: DW_LANG_C99, file: !87, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, globals: !89)
!87 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!88 = !{}
!89 = !{!84}
!90 = !DIGlobalVariableExpression(var: !91)
!91 = distinct !DIGlobalVariable(name: "file_name", scope: !92, file: !97, line: 36, type: !58, isLocal: true, isDefinition: true)
!92 = distinct !DICompileUnit(language: DW_LANG_C99, file: !93, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, globals: !94)
!93 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!94 = !{!90, !95}
!95 = !DIGlobalVariableExpression(var: !96)
!96 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !92, file: !97, line: 46, type: !98, isLocal: true, isDefinition: true)
!97 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!98 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!99 = !DIGlobalVariableExpression(var: !100)
!100 = distinct !DIGlobalVariable(name: "exit_failure", scope: !101, file: !104, line: 24, type: !105, isLocal: false, isDefinition: true)
!101 = distinct !DICompileUnit(language: DW_LANG_C99, file: !102, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, globals: !103)
!102 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!103 = !{!99}
!104 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!105 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !28)
!106 = !DIGlobalVariableExpression(var: !107)
!107 = distinct !DIGlobalVariable(name: "program_name", scope: !108, file: !112, line: 33, type: !58, isLocal: false, isDefinition: true)
!108 = distinct !DICompileUnit(language: DW_LANG_C99, file: !109, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !110, globals: !111)
!109 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!110 = !{!45, !43}
!111 = !{!106}
!112 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!113 = !DIGlobalVariableExpression(var: !114)
!114 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !115, file: !146, line: 77, type: !181, isLocal: false, isDefinition: true)
!115 = distinct !DICompileUnit(language: DW_LANG_C99, file: !116, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !117, retainedTypes: !138, globals: !143)
!116 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!117 = !{!5, !118, !123}
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !119)
!119 = !{!120, !121, !122}
!120 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!121 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!122 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 46, size: 32, elements: !125)
!124 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137}
!126 = !DIEnumerator(name: "_ISupper", value: 256)
!127 = !DIEnumerator(name: "_ISlower", value: 512)
!128 = !DIEnumerator(name: "_ISalpha", value: 1024)
!129 = !DIEnumerator(name: "_ISdigit", value: 2048)
!130 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!131 = !DIEnumerator(name: "_ISspace", value: 8192)
!132 = !DIEnumerator(name: "_ISprint", value: 16384)
!133 = !DIEnumerator(name: "_ISgraph", value: 32768)
!134 = !DIEnumerator(name: "_ISblank", value: 1)
!135 = !DIEnumerator(name: "_IScntrl", value: 2)
!136 = !DIEnumerator(name: "_ISpunct", value: 4)
!137 = !DIEnumerator(name: "_ISalnum", value: 8)
!138 = !{!28, !139, !140, !43}
!139 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !141, line: 62, baseType: !142)
!141 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!142 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!143 = !{!113, !144, !151, !163, !165, !170, !177, !179}
!144 = !DIGlobalVariableExpression(var: !145)
!145 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !115, file: !146, line: 93, type: !147, isLocal: false, isDefinition: true)
!146 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 320, elements: !149)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!149 = !{!150}
!150 = !DISubrange(count: 10)
!151 = !DIGlobalVariableExpression(var: !152)
!152 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !115, file: !146, line: 1043, type: !153, isLocal: false, isDefinition: true)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !146, line: 57, size: 448, elements: !154)
!154 = !{!155, !156, !157, !161, !162}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !153, file: !146, line: 60, baseType: !5, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !153, file: !146, line: 63, baseType: !28, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !153, file: !146, line: 67, baseType: !158, size: 256, offset: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 256, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 8)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !153, file: !146, line: 70, baseType: !58, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !153, file: !146, line: 73, baseType: !58, size: 64, offset: 384)
!163 = !DIGlobalVariableExpression(var: !164)
!164 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !115, file: !146, line: 108, type: !153, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166)
!166 = distinct !DIGlobalVariable(name: "slot0", scope: !115, file: !146, line: 834, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2048, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 256)
!170 = !DIGlobalVariableExpression(var: !171)
!171 = distinct !DIGlobalVariable(name: "slotvec", scope: !115, file: !146, line: 837, type: !172, isLocal: true, isDefinition: true)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !146, line: 826, size: 128, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !173, file: !146, line: 828, baseType: !140, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !173, file: !146, line: 829, baseType: !43, size: 64, offset: 64)
!177 = !DIGlobalVariableExpression(var: !178)
!178 = distinct !DIGlobalVariable(name: "nslots", scope: !115, file: !146, line: 835, type: !28, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180)
!180 = distinct !DIGlobalVariable(name: "slotvec0", scope: !115, file: !146, line: 836, type: !173, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 704, elements: !183)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!183 = !{!184}
!184 = !DISubrange(count: 11)
!185 = !DIGlobalVariableExpression(var: !186)
!186 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !187, file: !190, line: 26, type: !191, isLocal: false, isDefinition: true)
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, globals: !189)
!188 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!189 = !{!185}
!190 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 376, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 47)
!194 = !DIGlobalVariableExpression(var: !195)
!195 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !196, file: !541, line: 120, type: !542, isLocal: true, isDefinition: true)
!196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !197, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !198, retainedTypes: !537, globals: !540)
!197 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!198 = !{!199}
!199 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !200, line: 41, size: 32, elements: !201)
!200 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!202 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!203 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!204 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!205 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!206 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!207 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!208 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!209 = !DIEnumerator(name: "DAY_1", value: 131079)
!210 = !DIEnumerator(name: "DAY_2", value: 131080)
!211 = !DIEnumerator(name: "DAY_3", value: 131081)
!212 = !DIEnumerator(name: "DAY_4", value: 131082)
!213 = !DIEnumerator(name: "DAY_5", value: 131083)
!214 = !DIEnumerator(name: "DAY_6", value: 131084)
!215 = !DIEnumerator(name: "DAY_7", value: 131085)
!216 = !DIEnumerator(name: "ABMON_1", value: 131086)
!217 = !DIEnumerator(name: "ABMON_2", value: 131087)
!218 = !DIEnumerator(name: "ABMON_3", value: 131088)
!219 = !DIEnumerator(name: "ABMON_4", value: 131089)
!220 = !DIEnumerator(name: "ABMON_5", value: 131090)
!221 = !DIEnumerator(name: "ABMON_6", value: 131091)
!222 = !DIEnumerator(name: "ABMON_7", value: 131092)
!223 = !DIEnumerator(name: "ABMON_8", value: 131093)
!224 = !DIEnumerator(name: "ABMON_9", value: 131094)
!225 = !DIEnumerator(name: "ABMON_10", value: 131095)
!226 = !DIEnumerator(name: "ABMON_11", value: 131096)
!227 = !DIEnumerator(name: "ABMON_12", value: 131097)
!228 = !DIEnumerator(name: "MON_1", value: 131098)
!229 = !DIEnumerator(name: "MON_2", value: 131099)
!230 = !DIEnumerator(name: "MON_3", value: 131100)
!231 = !DIEnumerator(name: "MON_4", value: 131101)
!232 = !DIEnumerator(name: "MON_5", value: 131102)
!233 = !DIEnumerator(name: "MON_6", value: 131103)
!234 = !DIEnumerator(name: "MON_7", value: 131104)
!235 = !DIEnumerator(name: "MON_8", value: 131105)
!236 = !DIEnumerator(name: "MON_9", value: 131106)
!237 = !DIEnumerator(name: "MON_10", value: 131107)
!238 = !DIEnumerator(name: "MON_11", value: 131108)
!239 = !DIEnumerator(name: "MON_12", value: 131109)
!240 = !DIEnumerator(name: "AM_STR", value: 131110)
!241 = !DIEnumerator(name: "PM_STR", value: 131111)
!242 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!243 = !DIEnumerator(name: "D_FMT", value: 131113)
!244 = !DIEnumerator(name: "T_FMT", value: 131114)
!245 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!246 = !DIEnumerator(name: "ERA", value: 131116)
!247 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!248 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!249 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!250 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!251 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!252 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!253 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!254 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!255 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!256 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!257 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!258 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!259 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!260 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!261 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!262 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!263 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!264 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!265 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!266 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!267 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!268 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!269 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!270 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!271 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!272 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!273 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!274 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!275 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!276 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!277 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!278 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!279 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!280 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!281 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!282 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!283 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!284 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!285 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!286 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!287 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!288 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!289 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!290 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!291 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!292 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!293 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!294 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!295 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!296 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!297 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!298 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!299 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!300 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!301 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!302 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!303 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!304 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!305 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!306 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!307 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!308 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!309 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!310 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!311 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!312 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!313 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!314 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!315 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!316 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!317 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!318 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!319 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!320 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!321 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!322 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!323 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!324 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!325 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!326 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!327 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!328 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!329 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!330 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!331 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!332 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!333 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!334 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!335 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!336 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!337 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!338 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!339 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!340 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!341 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!342 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!343 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!344 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!345 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!346 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!347 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!348 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!349 = !DIEnumerator(name: "CODESET", value: 14)
!350 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!351 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!352 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!353 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!354 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!355 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!356 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!357 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!358 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!359 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!360 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!361 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!362 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!363 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!364 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!365 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!366 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!367 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!368 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!369 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!370 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!371 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!372 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!373 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!374 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!375 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!376 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!377 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!378 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!379 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!380 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!381 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!382 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!383 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!384 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!385 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!386 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!387 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!388 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!389 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!390 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!391 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!392 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!393 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!394 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!395 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!396 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!397 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!398 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!399 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!400 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!401 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!402 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!403 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!404 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!405 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!406 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!407 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!408 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!409 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!410 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!411 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!412 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!413 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!414 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!415 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!416 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!417 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!418 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!419 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!420 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!421 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!422 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!423 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!424 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!425 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!426 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!427 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!428 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!429 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!430 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!431 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!432 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!433 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!434 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!435 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!436 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!437 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!438 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!439 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!440 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!441 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!442 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!443 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!444 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!445 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!446 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!447 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!448 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!449 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!450 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!451 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!452 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!453 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!454 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!455 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!456 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!457 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!458 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!459 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!460 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!461 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!462 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!463 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!464 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!465 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!466 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!467 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!468 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!469 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!470 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!471 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!472 = !DIEnumerator(name: "THOUSEP", value: 65537)
!473 = !DIEnumerator(name: "__GROUPING", value: 65538)
!474 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!475 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!476 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!477 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!478 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!479 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!480 = !DIEnumerator(name: "__YESSTR", value: 327682)
!481 = !DIEnumerator(name: "__NOSTR", value: 327683)
!482 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!483 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!484 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!485 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!486 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!487 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!488 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!489 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!490 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!491 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!492 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!493 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!494 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!495 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!496 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!497 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!498 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!499 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!500 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!501 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!502 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!503 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!504 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!505 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!506 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!507 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!508 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!509 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!510 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!511 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!512 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!513 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!514 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!515 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!516 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!517 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!518 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!519 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!520 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!521 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!522 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!523 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!524 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!525 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!526 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!527 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!528 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!529 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!530 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!531 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!532 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!533 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!534 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!535 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!536 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!537 = !{!45, !43, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!540 = !{!194}
!541 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!542 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!543 = !DIGlobalVariableExpression(var: !544)
!544 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !545, file: !546, line: 335, type: !28, isLocal: true, isDefinition: true)
!545 = distinct !DISubprogram(name: "rpl_fcntl", scope: !546, file: !546, line: 272, type: !547, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !549, variables: !552)
!546 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!547 = !DISubroutineType(types: !548)
!548 = !{!28, !28, !28, null}
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, globals: !551)
!550 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!551 = !{!543}
!552 = !{!553, !554, !555, !568, !569, !572, !575, !578}
!553 = !DILocalVariable(name: "fd", arg: 1, scope: !545, file: !546, line: 272, type: !28)
!554 = !DILocalVariable(name: "action", arg: 2, scope: !545, file: !546, line: 272, type: !28)
!555 = !DILocalVariable(name: "arg", scope: !545, file: !546, line: 274, type: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !557, line: 30, baseType: !558)
!557 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !550, line: 274, baseType: !559)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 192, elements: !566)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !550, line: 274, size: 192, elements: !561)
!561 = !{!562, !563, !564, !565}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !560, file: !550, line: 274, baseType: !48, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !560, file: !550, line: 274, baseType: !48, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !560, file: !550, line: 274, baseType: !45, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !560, file: !550, line: 274, baseType: !45, size: 64, offset: 128)
!566 = !{!567}
!567 = !DISubrange(count: 1)
!568 = !DILocalVariable(name: "result", scope: !545, file: !546, line: 275, type: !28)
!569 = !DILocalVariable(name: "target", scope: !570, file: !546, line: 322, type: !28)
!570 = distinct !DILexicalBlock(scope: !571, file: !546, line: 321, column: 7)
!571 = distinct !DILexicalBlock(scope: !545, file: !546, line: 278, column: 5)
!572 = !DILocalVariable(name: "flags", scope: !573, file: !546, line: 359, type: !28)
!573 = distinct !DILexicalBlock(scope: !574, file: !546, line: 358, column: 11)
!574 = distinct !DILexicalBlock(scope: !570, file: !546, line: 357, column: 13)
!575 = !DILocalVariable(name: "saved_errno", scope: !576, file: !546, line: 362, type: !28)
!576 = distinct !DILexicalBlock(scope: !577, file: !546, line: 361, column: 15)
!577 = distinct !DILexicalBlock(scope: !573, file: !546, line: 360, column: 17)
!578 = !DILocalVariable(name: "p", scope: !579, file: !546, line: 404, type: !45)
!579 = distinct !DILexicalBlock(scope: !571, file: !546, line: 402, column: 7)
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !582)
!581 = !DIFile(filename: "src/prog-fprintf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!582 = !{!539}
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88)
!584 = !DIFile(filename: "src/selinux.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!585 = distinct !DICompileUnit(language: DW_LANG_C99, file: !586, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !587, retainedTypes: !602)
!586 = !DIFile(filename: "./lib/mkdir-p.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!587 = !{!588, !598}
!588 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !589, file: !20, line: 39, size: 32, elements: !35)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !20, line: 36, size: 64, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !589, file: !20, line: 66, baseType: !588, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !589, file: !20, line: 74, baseType: !593, size: 32, offset: 32)
!593 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !589, file: !20, line: 69, size: 32, elements: !594)
!594 = !{!595, !596, !597}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !593, file: !20, line: 71, baseType: !28, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !593, file: !20, line: 72, baseType: !28, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !593, file: !20, line: 73, baseType: !31, size: 32)
!598 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 86, size: 32, elements: !599)
!599 = !{!600, !601}
!600 = !DIEnumerator(name: "SAVEWD_CHDIR_NOFOLLOW", value: 1)
!601 = !DIEnumerator(name: "SAVEWD_CHDIR_SKIP_READABLE", value: 2)
!602 = !{!46, !49}
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !604, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !605, retainedTypes: !613)
!604 = !DIFile(filename: "./lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!605 = !{!606}
!606 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !607, line: 78, size: 32, elements: !608)
!607 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!608 = !{!609, !610, !611, !612}
!609 = !DIEnumerator(name: "MODE_DONE", value: 0)
!610 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1)
!611 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2)
!612 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3)
!613 = !{!140}
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !616)
!615 = !DIFile(filename: "./lib/savewd.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!616 = !{!617, !598}
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !618, file: !20, line: 39, size: 32, elements: !35)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !20, line: 36, size: 64, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !618, file: !20, line: 66, baseType: !617, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !618, file: !20, line: 74, baseType: !622, size: 32, offset: 32)
!622 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !618, file: !20, line: 69, size: 32, elements: !623)
!623 = !{!624, !625, !626}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !622, file: !20, line: 71, baseType: !28, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !622, file: !20, line: 72, baseType: !28, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !622, file: !20, line: 73, baseType: !31, size: 32)
!627 = distinct !DICompileUnit(language: DW_LANG_C99, file: !628, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !629, retainedTypes: !634)
!628 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!629 = !{!630}
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !631, line: 41, size: 32, elements: !632)
!631 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!632 = !{!633}
!633 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!634 = !{!45}
!635 = distinct !DICompileUnit(language: DW_LANG_C99, file: !636, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !637, retainedTypes: !651)
!636 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!637 = !{!638}
!638 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !640, file: !639, line: 192, size: 32, elements: !649)
!639 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!640 = distinct !DISubprogram(name: "x2nrealloc", scope: !639, file: !639, line: 180, type: !641, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !635, variables: !644)
!641 = !DISubroutineType(types: !642)
!642 = !{!45, !45, !643, !140}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!644 = !{!645, !646, !647, !648}
!645 = !DILocalVariable(name: "p", arg: 1, scope: !640, file: !639, line: 180, type: !45)
!646 = !DILocalVariable(name: "pn", arg: 2, scope: !640, file: !639, line: 180, type: !643)
!647 = !DILocalVariable(name: "s", arg: 3, scope: !640, file: !639, line: 180, type: !140)
!648 = !DILocalVariable(name: "n", scope: !640, file: !639, line: 182, type: !140)
!649 = !{!650}
!650 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!651 = !{!140, !43, !45}
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88)
!653 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !634)
!655 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!656 = distinct !DICompileUnit(language: DW_LANG_C99, file: !657, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !613)
!657 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!658 = distinct !DICompileUnit(language: DW_LANG_C99, file: !659, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88)
!659 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!660 = distinct !DICompileUnit(language: DW_LANG_C99, file: !661, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88)
!661 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!662 = distinct !DICompileUnit(language: DW_LANG_C99, file: !663, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88)
!663 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !666)
!665 = !DIFile(filename: "./lib/mkancesdirs.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!666 = !{!667, !598}
!667 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !668, file: !20, line: 39, size: 32, elements: !35)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !20, line: 36, size: 64, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !668, file: !20, line: 66, baseType: !667, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !668, file: !20, line: 74, baseType: !672, size: 32, offset: 32)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !668, file: !20, line: 69, size: 32, elements: !673)
!673 = !{!674, !675, !676}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !672, file: !20, line: 71, baseType: !28, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !672, file: !20, line: 72, baseType: !28, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !672, file: !20, line: 73, baseType: !31, size: 32)
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !679)
!678 = !DIFile(filename: "./lib/dirchownmod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!679 = !{!46, !49, !680}
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !32, line: 70, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !34, line: 138, baseType: !48)
!682 = distinct !DICompileUnit(language: DW_LANG_C99, file: !683, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88)
!683 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88)
!685 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !634)
!687 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !634)
!689 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!690 = distinct !DICompileUnit(language: DW_LANG_C99, file: !691, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88)
!691 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!692 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!693 = !{i32 2, !"Dwarf Version", i32 4}
!694 = !{i32 2, !"Debug Info Version", i32 3}
!695 = !{i32 1, !"wchar_size", i32 4}
!696 = !{i32 7, !"PIC Level", i32 2}
!697 = !{i32 7, !"PIE Level", i32 2}
!698 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 53, type: !699, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !701)
!699 = !DISubroutineType(types: !700)
!700 = !{null, !28}
!701 = !{!702}
!702 = !DILocalVariable(name: "status", arg: 1, scope: !698, file: !3, line: 53, type: !28)
!703 = !DIExpression()
!704 = !DILocation(line: 53, column: 12, scope: !698)
!705 = !DILocation(line: 55, column: 14, scope: !706)
!706 = distinct !DILexicalBlock(scope: !698, file: !3, line: 55, column: 7)
!707 = !DILocation(line: 55, column: 7, scope: !698)
!708 = !DILocation(line: 56, column: 5, scope: !709)
!709 = distinct !DILexicalBlock(scope: !706, file: !3, line: 56, column: 5)
!710 = !{!711, !711, i64 0}
!711 = !{!"any pointer", !712, i64 0}
!712 = !{!"omnipotent char", !713, i64 0}
!713 = !{!"Simple C/C++ TBAA"}
!714 = !DILocation(line: 59, column: 7, scope: !715)
!715 = distinct !DILexicalBlock(scope: !706, file: !3, line: 58, column: 5)
!716 = !DILocation(line: 60, column: 7, scope: !715)
!717 = !DILocation(line: 587, column: 3, scope: !718, inlinedAt: !721)
!718 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !55, file: !55, line: 585, type: !719, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !88)
!719 = !DISubroutineType(types: !720)
!720 = !{null}
!721 = distinct !DILocation(line: 64, column: 7, scope: !715)
!722 = !DILocation(line: 66, column: 7, scope: !715)
!723 = !DILocation(line: 71, column: 7, scope: !715)
!724 = !DILocation(line: 77, column: 7, scope: !715)
!725 = !DILocation(line: 78, column: 7, scope: !715)
!726 = !DILocation(line: 642, column: 15, scope: !54, inlinedAt: !727)
!727 = distinct !DILocation(line: 79, column: 7, scope: !715)
!728 = !DILocation(line: 651, column: 3, scope: !54, inlinedAt: !727)
!729 = !DILocation(line: 655, column: 29, scope: !54, inlinedAt: !727)
!730 = !DILocation(line: 655, column: 15, scope: !54, inlinedAt: !727)
!731 = !DILocation(line: 656, column: 7, scope: !732, inlinedAt: !727)
!732 = distinct !DILexicalBlock(scope: !54, file: !55, line: 656, column: 7)
!733 = !DILocation(line: 656, column: 19, scope: !732, inlinedAt: !727)
!734 = !DILocation(line: 656, column: 22, scope: !732, inlinedAt: !727)
!735 = !DILocation(line: 656, column: 7, scope: !54, inlinedAt: !727)
!736 = !DILocation(line: 662, column: 7, scope: !737, inlinedAt: !727)
!737 = distinct !DILexicalBlock(scope: !732, file: !55, line: 657, column: 5)
!738 = !DILocation(line: 664, column: 5, scope: !737, inlinedAt: !727)
!739 = !DILocation(line: 665, column: 3, scope: !54, inlinedAt: !727)
!740 = !DILocation(line: 667, column: 3, scope: !54, inlinedAt: !727)
!741 = !DILocation(line: 81, column: 3, scope: !698)
!742 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 189, type: !743, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !746)
!743 = !DISubroutineType(types: !744)
!744 = !{!28, !28, !745}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!746 = !{!747, !748, !749, !750, !751, !752, !764, !767, !770}
!747 = !DILocalVariable(name: "argc", arg: 1, scope: !742, file: !3, line: 189, type: !28)
!748 = !DILocalVariable(name: "argv", arg: 2, scope: !742, file: !3, line: 189, type: !745)
!749 = !DILocalVariable(name: "specified_mode", scope: !742, file: !3, line: 191, type: !58)
!750 = !DILocalVariable(name: "optc", scope: !742, file: !3, line: 192, type: !28)
!751 = !DILocalVariable(name: "scontext", scope: !742, file: !3, line: 193, type: !58)
!752 = !DILocalVariable(name: "options", scope: !742, file: !3, line: 194, type: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mkdir_options", file: !3, line: 85, size: 256, elements: !754)
!754 = !{!755, !759, !760, !761, !762, !763}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "make_ancestor_function", scope: !753, file: !3, line: 89, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!28, !58, !58, !45}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "umask_value", scope: !753, file: !3, line: 92, baseType: !680, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !753, file: !3, line: 95, baseType: !680, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "mode_bits", scope: !753, file: !3, line: 98, baseType: !680, size: 32, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !753, file: !3, line: 101, baseType: !98, size: 8, offset: 160)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "created_directory_format", scope: !753, file: !3, line: 104, baseType: !58, size: 64, offset: 192)
!764 = !DILocalVariable(name: "ret", scope: !765, file: !3, line: 261, type: !28)
!765 = distinct !DILexicalBlock(scope: !766, file: !3, line: 260, column: 5)
!766 = distinct !DILexicalBlock(scope: !742, file: !3, line: 259, column: 7)
!767 = !DILocalVariable(name: "umask_value", scope: !768, file: !3, line: 276, type: !680)
!768 = distinct !DILexicalBlock(scope: !769, file: !3, line: 275, column: 5)
!769 = distinct !DILexicalBlock(scope: !742, file: !3, line: 274, column: 7)
!770 = !DILocalVariable(name: "change", scope: !771, file: !3, line: 282, type: !773)
!771 = distinct !DILexicalBlock(scope: !772, file: !3, line: 281, column: 9)
!772 = distinct !DILexicalBlock(scope: !768, file: !3, line: 280, column: 11)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !775, line: 25, flags: DIFlagFwdDecl)
!775 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!776 = !DILocation(line: 189, column: 11, scope: !742)
!777 = !DILocation(line: 189, column: 24, scope: !742)
!778 = !DILocation(line: 191, column: 15, scope: !742)
!779 = !DILocation(line: 193, column: 15, scope: !742)
!780 = !DILocation(line: 194, column: 3, scope: !742)
!781 = !DILocation(line: 196, column: 11, scope: !742)
!782 = !DILocation(line: 196, column: 34, scope: !742)
!783 = !{!784, !711, i64 0}
!784 = !{!"mkdir_options", !711, i64 0, !785, i64 8, !785, i64 12, !785, i64 16, !786, i64 20, !711, i64 24}
!785 = !{!"int", !712, i64 0}
!786 = !{!"_Bool", !712, i64 0}
!787 = !DILocation(line: 197, column: 11, scope: !742)
!788 = !DILocation(line: 197, column: 16, scope: !742)
!789 = !{!784, !785, i64 12}
!790 = !DILocation(line: 198, column: 11, scope: !742)
!791 = !DILocation(line: 198, column: 21, scope: !742)
!792 = !{!784, !785, i64 16}
!793 = !DILocation(line: 199, column: 11, scope: !742)
!794 = !DILocation(line: 199, column: 36, scope: !742)
!795 = !{!784, !711, i64 24}
!796 = !DILocation(line: 200, column: 11, scope: !742)
!797 = !DILocation(line: 200, column: 32, scope: !742)
!798 = !{!784, !786, i64 20}
!799 = !DILocation(line: 203, column: 21, scope: !742)
!800 = !DILocation(line: 203, column: 3, scope: !742)
!801 = !DILocation(line: 204, column: 3, scope: !742)
!802 = !DILocation(line: 205, column: 3, scope: !742)
!803 = !DILocation(line: 206, column: 3, scope: !742)
!804 = !DILocation(line: 208, column: 3, scope: !742)
!805 = !DILocation(line: 210, column: 3, scope: !742)
!806 = !DILocation(line: 210, column: 18, scope: !742)
!807 = !DILocation(line: 192, column: 7, scope: !742)
!808 = !DILocation(line: 215, column: 42, scope: !809)
!809 = distinct !DILexicalBlock(scope: !810, file: !3, line: 213, column: 9)
!810 = distinct !DILexicalBlock(scope: !742, file: !3, line: 211, column: 5)
!811 = !DILocation(line: 216, column: 11, scope: !809)
!812 = distinct !{!812, !805, !813}
!813 = !DILocation(line: 248, column: 5, scope: !742)
!814 = !DILocation(line: 218, column: 28, scope: !809)
!815 = !DILocation(line: 219, column: 11, scope: !809)
!816 = !DILocation(line: 221, column: 46, scope: !809)
!817 = !DILocation(line: 221, column: 44, scope: !809)
!818 = !DILocation(line: 222, column: 11, scope: !809)
!819 = !DILocation(line: 236, column: 20, scope: !820)
!820 = distinct !DILexicalBlock(scope: !821, file: !3, line: 236, column: 20)
!821 = distinct !DILexicalBlock(scope: !822, file: !3, line: 229, column: 20)
!822 = distinct !DILexicalBlock(scope: !809, file: !3, line: 224, column: 15)
!823 = !DILocation(line: 236, column: 20, scope: !821)
!824 = !DILocation(line: 239, column: 22, scope: !825)
!825 = distinct !DILexicalBlock(scope: !820, file: !3, line: 237, column: 13)
!826 = !DILocation(line: 238, column: 15, scope: !825)
!827 = !DILocation(line: 241, column: 13, scope: !825)
!828 = !DILocation(line: 243, column: 9, scope: !809)
!829 = !DILocation(line: 244, column: 9, scope: !809)
!830 = !DILocation(line: 246, column: 11, scope: !809)
!831 = !DILocation(line: 250, column: 7, scope: !832)
!832 = distinct !DILexicalBlock(scope: !742, file: !3, line: 250, column: 7)
!833 = !{!785, !785, i64 0}
!834 = !DILocation(line: 250, column: 14, scope: !832)
!835 = !DILocation(line: 250, column: 7, scope: !742)
!836 = !DILocation(line: 252, column: 20, scope: !837)
!837 = distinct !DILexicalBlock(scope: !832, file: !3, line: 251, column: 5)
!838 = !DILocation(line: 252, column: 7, scope: !837)
!839 = !DILocation(line: 253, column: 7, scope: !837)
!840 = !DILocation(line: 274, column: 7, scope: !769)
!841 = !DILocation(line: 274, column: 41, scope: !769)
!842 = !DILocation(line: 274, column: 38, scope: !769)
!843 = !DILocation(line: 276, column: 28, scope: !768)
!844 = !DILocation(line: 276, column: 14, scope: !768)
!845 = !DILocation(line: 277, column: 7, scope: !768)
!846 = !DILocation(line: 278, column: 15, scope: !768)
!847 = !DILocation(line: 278, column: 27, scope: !768)
!848 = !{!784, !785, i64 8}
!849 = !DILocation(line: 280, column: 11, scope: !768)
!850 = !DILocation(line: 282, column: 40, scope: !771)
!851 = !DILocation(line: 282, column: 31, scope: !771)
!852 = !DILocation(line: 283, column: 16, scope: !853)
!853 = distinct !DILexicalBlock(scope: !771, file: !3, line: 283, column: 15)
!854 = !DILocation(line: 283, column: 15, scope: !771)
!855 = !DILocation(line: 284, column: 13, scope: !853)
!856 = !DILocation(line: 286, column: 26, scope: !771)
!857 = !DILocation(line: 286, column: 24, scope: !771)
!858 = !DILocation(line: 288, column: 17, scope: !771)
!859 = !DILocation(line: 288, column: 11, scope: !771)
!860 = !DILocation(line: 289, column: 9, scope: !771)
!861 = !DILocation(line: 291, column: 22, scope: !772)
!862 = !DILocation(line: 294, column: 39, scope: !742)
!863 = !DILocation(line: 294, column: 37, scope: !742)
!864 = !DILocation(line: 294, column: 52, scope: !742)
!865 = !DILocation(line: 294, column: 10, scope: !742)
!866 = !DILocation(line: 296, column: 1, scope: !742)
!867 = !DILocation(line: 294, column: 3, scope: !742)
!868 = distinct !DISubprogram(name: "make_ancestor", scope: !3, file: !3, line: 122, type: !757, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !869)
!869 = !{!870, !871, !872, !873, !876, !877, !878, !879}
!870 = !DILocalVariable(name: "dir", arg: 1, scope: !868, file: !3, line: 122, type: !58)
!871 = !DILocalVariable(name: "component", arg: 2, scope: !868, file: !3, line: 122, type: !58)
!872 = !DILocalVariable(name: "options", arg: 3, scope: !868, file: !3, line: 122, type: !45)
!873 = !DILocalVariable(name: "o", scope: !868, file: !3, line: 124, type: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!876 = !DILocalVariable(name: "user_wx", scope: !868, file: !3, line: 131, type: !680)
!877 = !DILocalVariable(name: "self_denying_umask", scope: !868, file: !3, line: 132, type: !98)
!878 = !DILocalVariable(name: "r", scope: !868, file: !3, line: 135, type: !28)
!879 = !DILocalVariable(name: "mkdir_errno", scope: !880, file: !3, line: 138, type: !28)
!880 = distinct !DILexicalBlock(scope: !881, file: !3, line: 137, column: 5)
!881 = distinct !DILexicalBlock(scope: !868, file: !3, line: 136, column: 7)
!882 = !DILocation(line: 122, column: 28, scope: !868)
!883 = !DILocation(line: 122, column: 45, scope: !868)
!884 = !DILocation(line: 122, column: 62, scope: !868)
!885 = !DILocation(line: 124, column: 31, scope: !868)
!886 = !DILocation(line: 126, column: 10, scope: !887)
!887 = distinct !DILexicalBlock(scope: !868, file: !3, line: 126, column: 7)
!888 = !{i8 0, i8 2}
!889 = !DILocation(line: 126, column: 31, scope: !887)
!890 = !DILocalVariable(name: "path", arg: 1, scope: !891, file: !892, line: 44, type: !58)
!891 = distinct !DISubprogram(name: "defaultcon", scope: !892, file: !892, line: 44, type: !893, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !895)
!892 = !DIFile(filename: "src/selinux.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!893 = !DISubroutineType(types: !894)
!894 = !{!28, !58, !680}
!895 = !{!890, !896}
!896 = !DILocalVariable(name: "mode", arg: 2, scope: !891, file: !892, line: 44, type: !680)
!897 = !DILocation(line: 44, column: 25, scope: !891, inlinedAt: !898)
!898 = distinct !DILocation(line: 126, column: 34, scope: !887)
!899 = !DILocation(line: 44, column: 38, scope: !891, inlinedAt: !898)
!900 = !DILocation(line: 45, column: 3, scope: !891, inlinedAt: !898)
!901 = !DILocation(line: 45, column: 9, scope: !891, inlinedAt: !898)
!902 = !DILocation(line: 126, column: 7, scope: !868)
!903 = !DILocation(line: 131, column: 10, scope: !868)
!904 = !DILocation(line: 132, column: 33, scope: !868)
!905 = !DILocation(line: 132, column: 45, scope: !868)
!906 = !DILocation(line: 132, column: 56, scope: !868)
!907 = !DILocation(line: 133, column: 7, scope: !868)
!908 = !DILocation(line: 135, column: 11, scope: !868)
!909 = !DILocation(line: 135, column: 7, scope: !868)
!910 = !DILocation(line: 134, column: 27, scope: !911)
!911 = distinct !DILexicalBlock(scope: !868, file: !3, line: 133, column: 7)
!912 = !DILocation(line: 134, column: 5, scope: !911)
!913 = !DILocation(line: 138, column: 25, scope: !880)
!914 = !DILocation(line: 138, column: 11, scope: !880)
!915 = !DILocation(line: 139, column: 17, scope: !880)
!916 = !DILocation(line: 139, column: 7, scope: !880)
!917 = !DILocation(line: 140, column: 13, scope: !880)
!918 = !DILocation(line: 141, column: 5, scope: !880)
!919 = !DILocation(line: 142, column: 9, scope: !920)
!920 = distinct !DILexicalBlock(scope: !868, file: !3, line: 142, column: 7)
!921 = !DILocation(line: 142, column: 7, scope: !868)
!922 = !DILocation(line: 144, column: 15, scope: !923)
!923 = distinct !DILexicalBlock(scope: !920, file: !3, line: 143, column: 5)
!924 = !DILocation(line: 144, column: 38, scope: !923)
!925 = !DILocalVariable(name: "dir", arg: 1, scope: !926, file: !3, line: 109, type: !58)
!926 = distinct !DISubprogram(name: "announce_mkdir", scope: !3, file: !3, line: 109, type: !927, isLocal: true, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !929)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !58, !45}
!929 = !{!925, !930, !931}
!930 = !DILocalVariable(name: "options", arg: 2, scope: !926, file: !3, line: 109, type: !45)
!931 = !DILocalVariable(name: "o", scope: !926, file: !3, line: 111, type: !874)
!932 = !DILocation(line: 109, column: 29, scope: !926, inlinedAt: !933)
!933 = distinct !DILocation(line: 145, column: 7, scope: !923)
!934 = !DILocation(line: 109, column: 40, scope: !926, inlinedAt: !933)
!935 = !DILocation(line: 111, column: 31, scope: !926, inlinedAt: !933)
!936 = !DILocation(line: 112, column: 10, scope: !937, inlinedAt: !933)
!937 = distinct !DILexicalBlock(scope: !926, file: !3, line: 112, column: 7)
!938 = !DILocation(line: 112, column: 7, scope: !937, inlinedAt: !933)
!939 = !DILocation(line: 112, column: 7, scope: !926, inlinedAt: !933)
!940 = !DILocation(line: 113, column: 19, scope: !937, inlinedAt: !933)
!941 = !DILocation(line: 113, column: 56, scope: !937, inlinedAt: !933)
!942 = !DILocation(line: 113, column: 5, scope: !937, inlinedAt: !933)
!943 = !DILocation(line: 147, column: 3, scope: !868)
!944 = distinct !DISubprogram(name: "process_dir", scope: !3, file: !3, line: 152, type: !945, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !948)
!945 = !DISubroutineType(types: !946)
!946 = !{!28, !43, !947, !45}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!948 = !{!949, !950, !951, !952, !953}
!949 = !DILocalVariable(name: "dir", arg: 1, scope: !944, file: !3, line: 152, type: !43)
!950 = !DILocalVariable(name: "wd", arg: 2, scope: !944, file: !3, line: 152, type: !947)
!951 = !DILocalVariable(name: "options", arg: 3, scope: !944, file: !3, line: 152, type: !45)
!952 = !DILocalVariable(name: "o", scope: !944, file: !3, line: 154, type: !874)
!953 = !DILocalVariable(name: "ret", scope: !944, file: !3, line: 165, type: !28)
!954 = !DILocation(line: 152, column: 20, scope: !944)
!955 = !DILocation(line: 152, column: 40, scope: !944)
!956 = !DILocation(line: 152, column: 50, scope: !944)
!957 = !DILocation(line: 154, column: 31, scope: !944)
!958 = !DILocation(line: 157, column: 10, scope: !959)
!959 = distinct !DILexicalBlock(scope: !944, file: !3, line: 157, column: 7)
!960 = !DILocation(line: 159, column: 13, scope: !961)
!961 = distinct !DILexicalBlock(scope: !962, file: !3, line: 159, column: 11)
!962 = distinct !DILexicalBlock(scope: !959, file: !3, line: 158, column: 5)
!963 = !DILocation(line: 157, column: 7, scope: !944)
!964 = !DILocation(line: 44, column: 25, scope: !891, inlinedAt: !965)
!965 = distinct !DILocation(line: 159, column: 42, scope: !961)
!966 = !DILocation(line: 44, column: 38, scope: !891, inlinedAt: !965)
!967 = !DILocation(line: 45, column: 3, scope: !891, inlinedAt: !965)
!968 = !DILocation(line: 45, column: 9, scope: !891, inlinedAt: !965)
!969 = !DILocation(line: 159, column: 11, scope: !962)
!970 = !DILocation(line: 165, column: 44, scope: !944)
!971 = !DILocation(line: 166, column: 35, scope: !944)
!972 = !DILocation(line: 167, column: 35, scope: !944)
!973 = !DILocation(line: 165, column: 14, scope: !944)
!974 = !DILocation(line: 165, column: 7, scope: !944)
!975 = !DILocation(line: 176, column: 27, scope: !976)
!976 = distinct !DILexicalBlock(scope: !944, file: !3, line: 176, column: 7)
!977 = !DILocation(line: 176, column: 33, scope: !976)
!978 = !DILocation(line: 177, column: 7, scope: !976)
!979 = !DILocation(line: 177, column: 13, scope: !976)
!980 = !DILocation(line: 177, column: 10, scope: !976)
!981 = !DILocation(line: 176, column: 7, scope: !944)
!982 = !DILocalVariable(name: "path", arg: 1, scope: !983, file: !892, line: 40, type: !58)
!983 = distinct !DISubprogram(name: "restorecon", scope: !892, file: !892, line: 40, type: !984, isLocal: true, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !986)
!984 = !DISubroutineType(types: !985)
!985 = !{!98, !58, !98, !98}
!986 = !{!982, !987, !988}
!987 = !DILocalVariable(name: "recurse", arg: 2, scope: !983, file: !892, line: 40, type: !98)
!988 = !DILocalVariable(name: "preserve", arg: 3, scope: !983, file: !892, line: 40, type: !98)
!989 = !DILocation(line: 40, column: 25, scope: !983, inlinedAt: !990)
!990 = distinct !DILocation(line: 179, column: 13, scope: !991)
!991 = distinct !DILexicalBlock(scope: !992, file: !3, line: 179, column: 11)
!992 = distinct !DILexicalBlock(scope: !976, file: !3, line: 178, column: 5)
!993 = !DILocation(line: 40, column: 36, scope: !983, inlinedAt: !990)
!994 = !DILocation(line: 40, column: 50, scope: !983, inlinedAt: !990)
!995 = !DILocation(line: 41, column: 3, scope: !983, inlinedAt: !990)
!996 = !DILocation(line: 41, column: 9, scope: !983, inlinedAt: !990)
!997 = !DILocation(line: 179, column: 11, scope: !992)
!998 = !DILocation(line: 185, column: 3, scope: !944)
!999 = !DILocation(line: 109, column: 29, scope: !926)
!1000 = !DILocation(line: 109, column: 40, scope: !926)
!1001 = !DILocation(line: 111, column: 31, scope: !926)
!1002 = !DILocation(line: 112, column: 10, scope: !937)
!1003 = !DILocation(line: 112, column: 7, scope: !937)
!1004 = !DILocation(line: 112, column: 7, scope: !926)
!1005 = !DILocation(line: 113, column: 19, scope: !937)
!1006 = !DILocation(line: 113, column: 56, scope: !937)
!1007 = !DILocation(line: 113, column: 5, scope: !937)
!1008 = !DILocation(line: 114, column: 1, scope: !926)
!1009 = distinct !DISubprogram(name: "prog_fprintf", scope: !581, file: !581, line: 28, type: !1010, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, unit: !580, variables: !1064)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !1012, !58, null}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1014, line: 7, baseType: !1015)
!1014 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1016, line: 241, size: 1728, elements: !1017)
!1016 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1038, !1039, !1040, !1041, !1044, !1045, !1047, !1049, !1052, !1054, !1055, !1056, !1057, !1058, !1059, !1060}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1015, file: !1016, line: 242, baseType: !28, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1015, file: !1016, line: 247, baseType: !43, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1015, file: !1016, line: 248, baseType: !43, size: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1015, file: !1016, line: 249, baseType: !43, size: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1015, file: !1016, line: 250, baseType: !43, size: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1015, file: !1016, line: 251, baseType: !43, size: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1015, file: !1016, line: 252, baseType: !43, size: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1015, file: !1016, line: 253, baseType: !43, size: 64, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1015, file: !1016, line: 254, baseType: !43, size: 64, offset: 512)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1015, file: !1016, line: 256, baseType: !43, size: 64, offset: 576)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1015, file: !1016, line: 257, baseType: !43, size: 64, offset: 640)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1015, file: !1016, line: 258, baseType: !43, size: 64, offset: 704)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1015, file: !1016, line: 260, baseType: !1031, size: 64, offset: 768)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1016, line: 156, size: 192, elements: !1033)
!1033 = !{!1034, !1035, !1037}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1032, file: !1016, line: 157, baseType: !1031, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1032, file: !1016, line: 158, baseType: !1036, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1032, file: !1016, line: 162, baseType: !28, size: 32, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1015, file: !1016, line: 262, baseType: !1036, size: 64, offset: 832)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1015, file: !1016, line: 264, baseType: !28, size: 32, offset: 896)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1015, file: !1016, line: 268, baseType: !28, size: 32, offset: 928)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1015, file: !1016, line: 270, baseType: !1042, size: 64, offset: 960)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !34, line: 140, baseType: !1043)
!1043 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1015, file: !1016, line: 274, baseType: !139, size: 16, offset: 1024)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1015, file: !1016, line: 275, baseType: !1046, size: 8, offset: 1040)
!1046 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1015, file: !1016, line: 276, baseType: !1048, size: 8, offset: 1048)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !566)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1015, file: !1016, line: 280, baseType: !1050, size: 64, offset: 1088)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1016, line: 150, baseType: null)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1015, file: !1016, line: 289, baseType: !1053, size: 64, offset: 1152)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !34, line: 141, baseType: !1043)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1015, file: !1016, line: 297, baseType: !45, size: 64, offset: 1216)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1015, file: !1016, line: 298, baseType: !45, size: 64, offset: 1280)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1015, file: !1016, line: 299, baseType: !45, size: 64, offset: 1344)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1015, file: !1016, line: 300, baseType: !45, size: 64, offset: 1408)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1015, file: !1016, line: 302, baseType: !140, size: 64, offset: 1472)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1015, file: !1016, line: 303, baseType: !28, size: 32, offset: 1536)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1015, file: !1016, line: 305, baseType: !1061, size: 160, offset: 1568)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !1062)
!1062 = !{!1063}
!1063 = !DISubrange(count: 20)
!1064 = !{!1065, !1066, !1067}
!1065 = !DILocalVariable(name: "fp", arg: 1, scope: !1009, file: !581, line: 28, type: !1012)
!1066 = !DILocalVariable(name: "fmt", arg: 2, scope: !1009, file: !581, line: 28, type: !58)
!1067 = !DILocalVariable(name: "ap", scope: !1009, file: !581, line: 30, type: !1068)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1069, line: 46, baseType: !1070)
!1069 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !557, line: 48, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !581, line: 30, baseType: !1072)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1073, size: 192, elements: !566)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !581, line: 30, size: 192, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1073, file: !581, line: 30, baseType: !48, size: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1073, file: !581, line: 30, baseType: !48, size: 32, offset: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1073, file: !581, line: 30, baseType: !45, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1073, file: !581, line: 30, baseType: !45, size: 64, offset: 128)
!1079 = !DILocation(line: 28, column: 21, scope: !1009)
!1080 = !DILocation(line: 28, column: 37, scope: !1009)
!1081 = !DILocation(line: 30, column: 3, scope: !1009)
!1082 = !DILocation(line: 30, column: 11, scope: !1009)
!1083 = !DILocation(line: 31, column: 3, scope: !1009)
!1084 = !DILocation(line: 32, column: 3, scope: !1009)
!1085 = !DILocation(line: 33, column: 3, scope: !1009)
!1086 = !DILocalVariable(name: "__stream", arg: 1, scope: !1087, file: !1088, line: 124, type: !1091)
!1087 = distinct !DISubprogram(name: "vfprintf", scope: !1088, file: !1088, line: 124, type: !1089, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !580, variables: !1094)
!1088 = !DIFile(filename: "/usr/include/bits/stdio2.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!28, !1091, !1092, !1093}
!1091 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1012)
!1092 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !58)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1094 = !{!1086, !1095, !1096}
!1095 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1087, file: !1088, line: 125, type: !1092)
!1096 = !DILocalVariable(name: "__ap", arg: 3, scope: !1087, file: !1088, line: 125, type: !1093)
!1097 = !DILocation(line: 124, column: 28, scope: !1087, inlinedAt: !1098)
!1098 = distinct !DILocation(line: 34, column: 3, scope: !1009)
!1099 = !DILocation(line: 125, column: 27, scope: !1087, inlinedAt: !1098)
!1100 = !DILocation(line: 125, column: 45, scope: !1087, inlinedAt: !1098)
!1101 = !DILocation(line: 127, column: 10, scope: !1087, inlinedAt: !1098)
!1102 = !DILocation(line: 35, column: 3, scope: !1009)
!1103 = !DILocalVariable(name: "__c", arg: 1, scope: !1104, file: !1105, line: 88, type: !28)
!1104 = distinct !DISubprogram(name: "fputc_unlocked", scope: !1105, file: !1105, line: 88, type: !1106, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !580, variables: !1108)
!1105 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!28, !28, !1012}
!1108 = !{!1103, !1109}
!1109 = !DILocalVariable(name: "__stream", arg: 2, scope: !1104, file: !1105, line: 88, type: !1012)
!1110 = !DILocation(line: 88, column: 21, scope: !1104, inlinedAt: !1111)
!1111 = distinct !DILocation(line: 36, column: 3, scope: !1009)
!1112 = !DILocation(line: 88, column: 32, scope: !1104, inlinedAt: !1111)
!1113 = !DILocation(line: 90, column: 10, scope: !1104, inlinedAt: !1111)
!1114 = !{!1115, !711, i64 40}
!1115 = !{!"_IO_FILE", !785, i64 0, !711, i64 8, !711, i64 16, !711, i64 24, !711, i64 32, !711, i64 40, !711, i64 48, !711, i64 56, !711, i64 64, !711, i64 72, !711, i64 80, !711, i64 88, !711, i64 96, !711, i64 104, !785, i64 112, !785, i64 116, !1116, i64 120, !1117, i64 128, !712, i64 130, !712, i64 131, !711, i64 136, !1116, i64 144, !711, i64 152, !711, i64 160, !711, i64 168, !711, i64 176, !1116, i64 184, !785, i64 192, !712, i64 196}
!1116 = !{!"long", !712, i64 0}
!1117 = !{!"short", !712, i64 0}
!1118 = !{!1115, !711, i64 48}
!1119 = !{!"branch_weights", i32 2000, i32 1}
!1120 = !{!712, !712, i64 0}
!1121 = !DILocation(line: 37, column: 1, scope: !1009)
!1122 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !97, file: !97, line: 41, type: !56, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !92, variables: !1123)
!1123 = !{!1124}
!1124 = !DILocalVariable(name: "file", arg: 1, scope: !1122, file: !97, line: 41, type: !58)
!1125 = !DILocation(line: 41, column: 41, scope: !1122)
!1126 = !DILocation(line: 43, column: 13, scope: !1122)
!1127 = !DILocation(line: 44, column: 1, scope: !1122)
!1128 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !97, file: !97, line: 78, type: !1129, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !92, variables: !1131)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{null, !98}
!1131 = !{!1132}
!1132 = !DILocalVariable(name: "ignore", arg: 1, scope: !1128, file: !97, line: 78, type: !98)
!1133 = !DILocation(line: 78, column: 37, scope: !1128)
!1134 = !DILocation(line: 80, column: 16, scope: !1128)
!1135 = !{!786, !786, i64 0}
!1136 = !DILocation(line: 81, column: 1, scope: !1128)
!1137 = distinct !DISubprogram(name: "close_stdout", scope: !97, file: !97, line: 107, type: !719, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, unit: !92, variables: !1138)
!1138 = !{!1139}
!1139 = !DILocalVariable(name: "write_error", scope: !1140, file: !97, line: 112, type: !58)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !97, line: 111, column: 5)
!1141 = distinct !DILexicalBlock(scope: !1137, file: !97, line: 109, column: 7)
!1142 = !DILocation(line: 109, column: 21, scope: !1141)
!1143 = !DILocation(line: 109, column: 7, scope: !1141)
!1144 = !DILocation(line: 109, column: 29, scope: !1141)
!1145 = !DILocation(line: 110, column: 7, scope: !1141)
!1146 = !DILocation(line: 110, column: 12, scope: !1141)
!1147 = !DILocation(line: 114, column: 19, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1140, file: !97, line: 113, column: 11)
!1149 = !DILocation(line: 110, column: 25, scope: !1141)
!1150 = !DILocation(line: 110, column: 28, scope: !1141)
!1151 = !DILocation(line: 110, column: 34, scope: !1141)
!1152 = !DILocation(line: 109, column: 7, scope: !1137)
!1153 = !DILocation(line: 112, column: 33, scope: !1140)
!1154 = !DILocation(line: 112, column: 19, scope: !1140)
!1155 = !DILocation(line: 113, column: 11, scope: !1148)
!1156 = !DILocation(line: 113, column: 11, scope: !1140)
!1157 = !DILocation(line: 114, column: 36, scope: !1148)
!1158 = !DILocation(line: 114, column: 9, scope: !1148)
!1159 = !DILocation(line: 117, column: 9, scope: !1148)
!1160 = !DILocation(line: 119, column: 14, scope: !1140)
!1161 = !DILocation(line: 119, column: 7, scope: !1140)
!1162 = !DILocation(line: 122, column: 22, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1137, file: !97, line: 122, column: 8)
!1164 = !DILocation(line: 122, column: 8, scope: !1163)
!1165 = !DILocation(line: 122, column: 30, scope: !1163)
!1166 = !DILocation(line: 122, column: 8, scope: !1137)
!1167 = !DILocation(line: 123, column: 13, scope: !1163)
!1168 = !DILocation(line: 123, column: 6, scope: !1163)
!1169 = !DILocation(line: 124, column: 1, scope: !1137)
!1170 = distinct !DISubprogram(name: "make_dir_parents", scope: !1171, file: !1171, line: 85, type: !1172, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, unit: !585, variables: !1176)
!1171 = !DIFile(filename: "lib/mkdir-p.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!98, !43, !1174, !756, !45, !680, !1175, !680, !46, !49, !98}
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!1176 = !{!1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1192, !1193, !1196, !1197, !1198, !1201, !1237, !1242, !1243, !1246}
!1177 = !DILocalVariable(name: "dir", arg: 1, scope: !1170, file: !1171, line: 85, type: !43)
!1178 = !DILocalVariable(name: "wd", arg: 2, scope: !1170, file: !1171, line: 86, type: !1174)
!1179 = !DILocalVariable(name: "make_ancestor", arg: 3, scope: !1170, file: !1171, line: 87, type: !756)
!1180 = !DILocalVariable(name: "options", arg: 4, scope: !1170, file: !1171, line: 88, type: !45)
!1181 = !DILocalVariable(name: "mode", arg: 5, scope: !1170, file: !1171, line: 89, type: !680)
!1182 = !DILocalVariable(name: "announce", arg: 6, scope: !1170, file: !1171, line: 90, type: !1175)
!1183 = !DILocalVariable(name: "mode_bits", arg: 7, scope: !1170, file: !1171, line: 91, type: !680)
!1184 = !DILocalVariable(name: "owner", arg: 8, scope: !1170, file: !1171, line: 92, type: !46)
!1185 = !DILocalVariable(name: "group", arg: 9, scope: !1170, file: !1171, line: 93, type: !49)
!1186 = !DILocalVariable(name: "preserve_existing", arg: 10, scope: !1170, file: !1171, line: 94, type: !98)
!1187 = !DILocalVariable(name: "mkdir_errno", scope: !1170, file: !1171, line: 96, type: !28)
!1188 = !DILocalVariable(name: "prefix_len", scope: !1189, file: !1171, line: 100, type: !1191)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !1171, line: 99, column: 5)
!1190 = distinct !DILexicalBlock(scope: !1170, file: !1171, line: 98, column: 7)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !141, line: 51, baseType: !1043)
!1192 = !DILocalVariable(name: "savewd_chdir_options", scope: !1189, file: !1171, line: 101, type: !28)
!1193 = !DILocalVariable(name: "keep_owner", scope: !1194, file: !1171, line: 121, type: !98)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !1171, line: 115, column: 9)
!1195 = distinct !DILexicalBlock(scope: !1189, file: !1171, line: 114, column: 11)
!1196 = !DILocalVariable(name: "keep_special_mode_bits", scope: !1194, file: !1171, line: 122, type: !98)
!1197 = !DILocalVariable(name: "mkdir_mode", scope: !1194, file: !1171, line: 124, type: !680)
!1198 = !DILocalVariable(name: "umask_must_be_ok", scope: !1199, file: !1171, line: 134, type: !98)
!1199 = distinct !DILexicalBlock(scope: !1200, file: !1171, line: 131, column: 13)
!1200 = distinct !DILexicalBlock(scope: !1194, file: !1171, line: 130, column: 15)
!1201 = !DILocalVariable(name: "st", scope: !1202, file: !1171, line: 149, type: !1204)
!1202 = distinct !DILexicalBlock(scope: !1203, file: !1171, line: 148, column: 13)
!1203 = distinct !DILexicalBlock(scope: !1194, file: !1171, line: 147, column: 15)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1205, line: 46, size: 1152, elements: !1206)
!1205 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1206 = !{!1207, !1209, !1211, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1221, !1223, !1231, !1232, !1233}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1204, file: !1205, line: 48, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !34, line: 133, baseType: !142)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1204, file: !1205, line: 53, baseType: !1210, size: 64, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !34, line: 136, baseType: !142)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1204, file: !1205, line: 61, baseType: !1212, size: 64, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !34, line: 139, baseType: !142)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1204, file: !1205, line: 62, baseType: !681, size: 32, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1204, file: !1205, line: 64, baseType: !47, size: 32, offset: 224)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1204, file: !1205, line: 65, baseType: !50, size: 32, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1204, file: !1205, line: 67, baseType: !28, size: 32, offset: 288)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1204, file: !1205, line: 69, baseType: !1208, size: 64, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1204, file: !1205, line: 74, baseType: !1042, size: 64, offset: 384)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1204, file: !1205, line: 78, baseType: !1220, size: 64, offset: 448)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !34, line: 162, baseType: !1043)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1204, file: !1205, line: 80, baseType: !1222, size: 64, offset: 512)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !34, line: 167, baseType: !1043)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1204, file: !1205, line: 91, baseType: !1224, size: 128, offset: 576)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1225, line: 8, size: 128, elements: !1226)
