; ModuleID = 'coreutils-8.27/src/mv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, %struct.hash_table*, %struct.hash_table* }
%struct.rm_options = type { i8, i32, i8, i8, i8, %struct.timespec*, i8, i8, i8 }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !62, globals: !66)
!3 = !DIFile(filename: "src/mv.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !12, !19, !25, !31, !36, !50, !56}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 28, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "no_backups", value: 0)
!9 = !DIEnumerator(name: "simple_backups", value: 1)
!10 = !DIEnumerator(name: "numbered_existing_backups", value: 2)
!11 = !DIEnumerator(name: "numbered_backups", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !13, line: 69, size: 32, elements: !14)
!13 = !DIFile(filename: "src/copy.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1)
!16 = !DIEnumerator(name: "DEREF_NEVER", value: 2)
!17 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3)
!18 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !13, line: 60, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1)
!22 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2)
!23 = !DIEnumerator(name: "I_ASK_USER", value: 3)
!24 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !13, line: 26, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0)
!28 = !DIEnumerator(name: "SPARSE_NEVER", value: 1)
!29 = !DIEnumerator(name: "SPARSE_AUTO", value: 2)
!30 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !13, line: 47, size: 32, elements: !32)
!32 = !{!33, !34, !35}
!33 = !DIEnumerator(name: "REFLINK_NEVER", value: 0)
!34 = !DIEnumerator(name: "REFLINK_AUTO", value: 1)
!35 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !37, line: 32, size: 32, elements: !38)
!37 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!39 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!40 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!41 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!42 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!43 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!44 = !DIEnumerator(name: "c_quoting_style", value: 5)
!45 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!46 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!47 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!48 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!49 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !51, line: 23, size: 32, elements: !52)
!51 = !DIFile(filename: "src/remove.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!52 = !{!53, !54, !55}
!53 = !DIEnumerator(name: "RMI_ALWAYS", value: 3)
!54 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4)
!55 = !DIEnumerator(name: "RMI_NEVER", value: 5)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !51, line: 74, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "RM_OK", value: 2)
!59 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3)
!60 = !DIEnumerator(name: "RM_ERROR", value: 4)
!61 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5)
!62 = !{!63, !65}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!66 = !{!67, !70, !0, !92}
!67 = !DIGlobalVariableExpression(var: !68)
!68 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !2, file: !3, line: 53, type: !69, isLocal: true, isDefinition: true)
!69 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!70 = !DIGlobalVariableExpression(var: !71)
!71 = distinct !DIGlobalVariable(name: "infomap", scope: !72, file: !73, line: 632, type: !89, isLocal: true, isDefinition: true)
!72 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !73, file: !73, line: 630, type: !74, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !78)
!73 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!74 = !DISubroutineType(types: !75)
!75 = !{null, !76}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!78 = !{!79, !80, !81, !88}
!79 = !DILocalVariable(name: "program", arg: 1, scope: !72, file: !73, line: 630, type: !76)
!80 = !DILocalVariable(name: "node", scope: !72, file: !73, line: 642, type: !76)
!81 = !DILocalVariable(name: "map_prog", scope: !72, file: !73, line: 643, type: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !72, file: !73, line: 632, size: 128, elements: !85)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !84, file: !73, line: 632, baseType: !76, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !84, file: !73, line: 632, baseType: !76, size: 64, offset: 64)
!88 = !DILocalVariable(name: "lc_messages", scope: !72, file: !73, line: 655, type: !76)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 896, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 7)
!92 = !DIGlobalVariableExpression(var: !93)
!93 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !94, file: !3, line: 95, type: !107, isLocal: true, isDefinition: true)
!94 = distinct !DISubprogram(name: "rm_option_init", scope: !3, file: !3, line: 74, type: !95, isLocal: true, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !122)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !51, line: 32, size: 256, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !119, !120, !121}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !98, file: !51, line: 35, baseType: !69, size: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !98, file: !51, line: 38, baseType: !50, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !98, file: !51, line: 47, baseType: !69, size: 8, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !98, file: !51, line: 50, baseType: !69, size: 8, offset: 72)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !98, file: !51, line: 53, baseType: !69, size: 8, offset: 80)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !98, file: !51, line: 57, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !108, line: 7, size: 128, elements: !109)
!108 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!109 = !{!110, !116}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !107, file: !108, line: 9, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !112, line: 48, baseType: !113)
!112 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !114, line: 136, baseType: !115)
!114 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!115 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !107, file: !108, line: 10, baseType: !117, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !112, line: 60, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !114, line: 133, baseType: !115)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !98, file: !51, line: 60, baseType: !69, size: 8, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !98, file: !51, line: 63, baseType: !69, size: 8, offset: 200)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !98, file: !51, line: 71, baseType: !69, size: 8, offset: 208)
!122 = !{!123}
!123 = !DILocalVariable(name: "x", arg: 1, scope: !94, file: !3, line: 74, type: !97)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 3584, elements: !135)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !127, line: 50, size: 256, elements: !128)
!127 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!128 = !{!129, !130, !132, !134}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !127, line: 52, baseType: !76, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !126, file: !127, line: 55, baseType: !131, size: 32, offset: 64)
!131 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !126, file: !127, line: 56, baseType: !133, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !126, file: !127, line: 57, baseType: !131, size: 32, offset: 192)
!135 = !{!136}
!136 = !DISubrange(count: 14)
!137 = !DIGlobalVariableExpression(var: !138)
!138 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !139, file: !140, line: 146, type: !76, isLocal: true, isDefinition: true)
!139 = distinct !DICompileUnit(language: DW_LANG_C99, file: !140, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !141, retainedTypes: !166, globals: !177)
!140 = !DIFile(filename: "src/copy.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!141 = !{!5, !12, !19, !25, !31, !36, !142, !146, !153, !162}
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 27, size: 32, elements: !144)
!143 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!144 = !{!145}
!145 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !147, line: 26, size: 32, elements: !148)
!147 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!148 = !{!149, !150, !151, !152}
!149 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0)
!150 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1)
!151 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2)
!152 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !154, line: 45, size: 32, elements: !155)
!154 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!155 = !{!156, !157, !158, !159, !160, !161}
!156 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!157 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!158 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!159 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!160 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!161 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!162 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !163, line: 73, size: 32, elements: !164)
!163 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!164 = !{!165}
!165 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072)
!166 = !{!167, !65, !169, !63, !115, !170, !171, !173}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !112, line: 70, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !114, line: 138, baseType: !169)
!169 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!170 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !172, line: 62, baseType: !115)
!172 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !174, line: 57, baseType: !175)
!174 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !114, line: 140, baseType: !176)
!176 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!177 = !{!178, !137, !184, !186, !196, !198}
!178 = !DIGlobalVariableExpression(var: !179)
!179 = distinct !DIGlobalVariable(name: "mask", scope: !180, file: !140, line: 2992, type: !167, isLocal: true, isDefinition: true)
!180 = distinct !DISubprogram(name: "cached_umask", scope: !140, file: !140, line: 2990, type: !181, isLocal: false, isDefinition: true, scopeLine: 2991, flags: DIFlagPrototyped, isOptimized: true, unit: !139, variables: !183)
!181 = !DISubroutineType(types: !182)
!182 = !{!167}
!183 = !{}
!184 = !DIGlobalVariableExpression(var: !185)
!185 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !139, file: !140, line: 147, type: !76, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187)
!187 = distinct !DIGlobalVariable(name: "zeros", scope: !188, file: !140, line: 350, type: !63, isLocal: true, isDefinition: true)
!188 = distinct !DISubprogram(name: "write_zeros", scope: !140, file: !140, line: 348, type: !189, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, unit: !139, variables: !191)
!189 = !DISubroutineType(types: !190)
!190 = !{!69, !131, !173}
!191 = !{!192, !193, !194}
!192 = !DILocalVariable(name: "fd", arg: 1, scope: !188, file: !140, line: 348, type: !131)
!193 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !188, file: !140, line: 348, type: !173)
!194 = !DILocalVariable(name: "n", scope: !195, file: !140, line: 369, type: !171)
!195 = distinct !DILexicalBlock(scope: !188, file: !140, line: 368, column: 5)
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "nz", scope: !188, file: !140, line: 351, type: !171, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199)
!199 = distinct !DIGlobalVariable(name: "fallback", scope: !188, file: !140, line: 358, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8192, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 1024)
!203 = !DIGlobalVariableExpression(var: !204)
!204 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !205, file: !206, line: 45, type: !212, isLocal: true, isDefinition: true)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !207, globals: !211)
!206 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!207 = !{!65, !63, !208}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !209, line: 112, baseType: !210)
!209 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !114, line: 62, baseType: !115)
!211 = !{!203}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !214, line: 69, baseType: !215)
!214 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !214, line: 67, flags: DIFlagFwdDecl)
!216 = !DIGlobalVariableExpression(var: !217)
!217 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !218, file: !219, line: 38, type: !228, isLocal: true, isDefinition: true)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !220, globals: !227)
!219 = !DIFile(filename: "src/force-link.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!220 = !{!221, !224}
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !219, line: 39, size: 32, elements: !222)
!222 = !{!223}
!223 = !DIEnumerator(name: "x_suffix_len", value: 6)
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !219, line: 44, size: 32, elements: !225)
!225 = !{!226}
!226 = !DIEnumerator(name: "smallsize", value: 256)
!227 = !{!216}
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 72, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 9)
!231 = !DIGlobalVariableExpression(var: !232)
!232 = distinct !DIGlobalVariable(name: "Version", scope: !233, file: !234, line: 2, type: !76, isLocal: false, isDefinition: true)
!233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, globals: !235)
!234 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!235 = !{!231}
!236 = !DIGlobalVariableExpression(var: !237)
!237 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !238, file: !242, line: 83, type: !76, isLocal: false, isDefinition: true)
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !240, retainedTypes: !289, globals: !290)
!239 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!240 = !{!5, !241, !260, !265}
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !243, file: !242, line: 285, size: 32, elements: !258)
!242 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!243 = distinct !DISubprogram(name: "find_backup_file_name", scope: !242, file: !242, line: 264, type: !244, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, unit: !238, variables: !246)
!244 = !DISubroutineType(types: !245)
!245 = !{!63, !76, !5}
!246 = !{!247, !248, !249, !250, !251, !252, !253, !256, !257}
!247 = !DILocalVariable(name: "file", arg: 1, scope: !243, file: !242, line: 264, type: !76)
!248 = !DILocalVariable(name: "backup_type", arg: 2, scope: !243, file: !242, line: 264, type: !5)
!249 = !DILocalVariable(name: "filelen", scope: !243, file: !242, line: 266, type: !171)
!250 = !DILocalVariable(name: "s", scope: !243, file: !242, line: 267, type: !63)
!251 = !DILocalVariable(name: "ssize", scope: !243, file: !242, line: 268, type: !171)
!252 = !DILocalVariable(name: "simple", scope: !243, file: !242, line: 269, type: !69)
!253 = !DILocalVariable(name: "env_suffix", scope: !254, file: !242, line: 274, type: !76)
!254 = distinct !DILexicalBlock(scope: !255, file: !242, line: 273, column: 5)
!255 = distinct !DILexicalBlock(scope: !243, file: !242, line: 272, column: 7)
!256 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !243, file: !242, line: 283, type: !171)
!257 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !243, file: !242, line: 284, type: !171)
!258 = !{!259}
!259 = !DIEnumerator(name: "GUESS", value: 9)
!260 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !242, line: 146, size: 32, elements: !261)
!261 = !{!262, !263, !264}
!262 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0)
!263 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1)
!264 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !266, line: 24, size: 32, elements: !267)
!266 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!268 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!269 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!270 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!271 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!272 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!273 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!274 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!275 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!276 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!277 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!278 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!279 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!280 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!281 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!282 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!283 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!284 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!285 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!286 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!287 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!288 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!289 = !{!76, !65, !169, !171}
!290 = !{!236, !291, !297}
!291 = !DIGlobalVariableExpression(var: !292)
!292 = distinct !DIGlobalVariable(name: "backup_types", scope: !238, file: !242, line: 325, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 256, elements: !295)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!295 = !{!296}
!296 = !DISubrange(count: 8)
!297 = !DIGlobalVariableExpression(var: !298)
!298 = distinct !DIGlobalVariable(name: "backup_args", scope: !238, file: !242, line: 314, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 576, elements: !229)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!301 = !DIGlobalVariableExpression(var: !302)
!302 = distinct !DIGlobalVariable(name: "file_name", scope: !303, file: !306, line: 37, type: !76, isLocal: true, isDefinition: true)
!303 = distinct !DICompileUnit(language: DW_LANG_C99, file: !304, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, globals: !305)
!304 = !DIFile(filename: "./lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!305 = !{!301}
!306 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!307 = !DIGlobalVariableExpression(var: !308)
!308 = distinct !DIGlobalVariable(name: "file_name", scope: !309, file: !314, line: 36, type: !76, isLocal: true, isDefinition: true)
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, globals: !311)
!310 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!311 = !{!307, !312}
!312 = !DIGlobalVariableExpression(var: !313)
!313 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !309, file: !314, line: 46, type: !69, isLocal: true, isDefinition: true)
!314 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!315 = !DIGlobalVariableExpression(var: !316)
!316 = distinct !DIGlobalVariable(name: "exit_failure", scope: !317, file: !320, line: 24, type: !321, isLocal: false, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, globals: !319)
!318 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!319 = !{!315}
!320 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!321 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!322 = !DIGlobalVariableExpression(var: !323)
!323 = distinct !DIGlobalVariable(name: "default_tuning", scope: !324, file: !328, line: 130, type: !329, isLocal: true, isDefinition: true)
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !326, globals: !327)
!325 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!326 = !{!115, !65, !171}
!327 = !{!322}
!328 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !214, line: 65, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !214, line: 53, size: 160, elements: !332)
!332 = !{!333, !335, !336, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !331, file: !214, line: 58, baseType: !334, size: 32)
!334 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !331, file: !214, line: 59, baseType: !334, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !331, file: !214, line: 60, baseType: !334, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !331, file: !214, line: 61, baseType: !334, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !331, file: !214, line: 62, baseType: !69, size: 8, offset: 128)
!339 = !DIGlobalVariableExpression(var: !340)
!340 = distinct !DIGlobalVariable(name: "program_name", scope: !341, file: !345, line: 33, type: !76, isLocal: false, isDefinition: true)
!341 = distinct !DICompileUnit(language: DW_LANG_C99, file: !342, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !343, globals: !344)
!342 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!343 = !{!65, !63}
!344 = !{!339}
!345 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!346 = !DIGlobalVariableExpression(var: !347)
!347 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !348, file: !376, line: 77, type: !409, isLocal: false, isDefinition: true)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !350, retainedTypes: !371, globals: !373)
!349 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!350 = !{!36, !351, !356}
!351 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !37, line: 242, size: 32, elements: !352)
!352 = !{!353, !354, !355}
!353 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!354 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!355 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !357, line: 46, size: 32, elements: !358)
!357 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!358 = !{!359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!359 = !DIEnumerator(name: "_ISupper", value: 256)
!360 = !DIEnumerator(name: "_ISlower", value: 512)
!361 = !DIEnumerator(name: "_ISalpha", value: 1024)
!362 = !DIEnumerator(name: "_ISdigit", value: 2048)
!363 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!364 = !DIEnumerator(name: "_ISspace", value: 8192)
!365 = !DIEnumerator(name: "_ISprint", value: 16384)
!366 = !DIEnumerator(name: "_ISgraph", value: 32768)
!367 = !DIEnumerator(name: "_ISblank", value: 1)
!368 = !DIEnumerator(name: "_IScntrl", value: 2)
!369 = !DIEnumerator(name: "_ISpunct", value: 4)
!370 = !DIEnumerator(name: "_ISalnum", value: 8)
!371 = !{!131, !372, !171, !63}
!372 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!373 = !{!346, !374, !381, !391, !393, !398, !405, !407}
!374 = !DIGlobalVariableExpression(var: !375)
!375 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !348, file: !376, line: 93, type: !377, isLocal: false, isDefinition: true)
!376 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 320, elements: !379)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!379 = !{!380}
!380 = !DISubrange(count: 10)
!381 = !DIGlobalVariableExpression(var: !382)
!382 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !348, file: !376, line: 1043, type: !383, isLocal: false, isDefinition: true)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !376, line: 57, size: 448, elements: !384)
!384 = !{!385, !386, !387, !389, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !383, file: !376, line: 60, baseType: !36, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !383, file: !376, line: 63, baseType: !131, size: 32, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !383, file: !376, line: 67, baseType: !388, size: 256, offset: 64)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 256, elements: !295)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !383, file: !376, line: 70, baseType: !76, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !383, file: !376, line: 73, baseType: !76, size: 64, offset: 384)
!391 = !DIGlobalVariableExpression(var: !392)
!392 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !348, file: !376, line: 108, type: !383, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394)
!394 = distinct !DIGlobalVariable(name: "slot0", scope: !348, file: !376, line: 834, type: !395, isLocal: true, isDefinition: true)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 256)
!398 = !DIGlobalVariableExpression(var: !399)
!399 = distinct !DIGlobalVariable(name: "slotvec", scope: !348, file: !376, line: 837, type: !400, isLocal: true, isDefinition: true)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !376, line: 826, size: 128, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !401, file: !376, line: 828, baseType: !171, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !401, file: !376, line: 829, baseType: !63, size: 64, offset: 64)
!405 = !DIGlobalVariableExpression(var: !406)
!406 = distinct !DIGlobalVariable(name: "nslots", scope: !348, file: !376, line: 835, type: !131, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408)
!408 = distinct !DIGlobalVariable(name: "slotvec0", scope: !348, file: !376, line: 836, type: !401, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 704, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 11)
!412 = !DIGlobalVariableExpression(var: !413)
!413 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !414, file: !432, line: 74, type: !433, isLocal: true, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !416, retainedTypes: !430, globals: !431)
!415 = !DIFile(filename: "./lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!416 = !{!146, !417}
!417 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !419, file: !418, line: 192, size: 32, elements: !428)
!418 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!419 = distinct !DISubprogram(name: "x2nrealloc", scope: !418, file: !418, line: 180, type: !420, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !414, variables: !423)
!420 = !DISubroutineType(types: !421)
!421 = !{!65, !65, !422, !171}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!423 = !{!424, !425, !426, !427}
!424 = !DILocalVariable(name: "p", arg: 1, scope: !419, file: !418, line: 180, type: !65)
!425 = !DILocalVariable(name: "pn", arg: 2, scope: !419, file: !418, line: 180, type: !422)
!426 = !DILocalVariable(name: "s", arg: 3, scope: !419, file: !418, line: 180, type: !171)
!427 = !DILocalVariable(name: "n", scope: !419, file: !418, line: 182, type: !171)
!428 = !{!429}
!429 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!430 = !{!65}
!431 = !{!412}
!432 = !DIFile(filename: "lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 192, elements: !441)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !432, line: 72, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!131, !439, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!441 = !{!442}
!442 = !DISubrange(count: 3)
!443 = !DIGlobalVariableExpression(var: !444)
!444 = distinct !DIGlobalVariable(name: "letters", scope: !445, file: !448, line: 185, type: !449, isLocal: true, isDefinition: true)
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, globals: !447)
!446 = !DIFile(filename: "./lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!447 = !{!443}
!448 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 504, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 63)
!452 = !DIGlobalVariableExpression(var: !453)
!453 = distinct !DIGlobalVariable(name: "ht", scope: !454, file: !455, line: 147, type: !212, isLocal: true, isDefinition: true)
!454 = distinct !DISubprogram(name: "utimecmp", scope: !455, file: !455, line: 116, type: !456, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, unit: !491, variables: !506)
!455 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!456 = !DISubroutineType(types: !457)
!457 = !{!131, !76, !458, !458, !131}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !461, line: 46, size: 1152, elements: !462)
!461 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!462 = !{!463, !464, !465, !467, !468, !470, !472, !473, !474, !475, !477, !479, !487, !488, !489}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !460, file: !461, line: 48, baseType: !118, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !460, file: !461, line: 53, baseType: !113, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !460, file: !461, line: 61, baseType: !466, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !114, line: 139, baseType: !115)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !460, file: !461, line: 62, baseType: !168, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !460, file: !461, line: 64, baseType: !469, size: 32, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !114, line: 134, baseType: !169)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !460, file: !461, line: 65, baseType: !471, size: 32, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !114, line: 135, baseType: !169)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !460, file: !461, line: 67, baseType: !131, size: 32, offset: 288)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !460, file: !461, line: 69, baseType: !118, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !460, file: !461, line: 74, baseType: !175, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !460, file: !461, line: 78, baseType: !476, size: 64, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !114, line: 162, baseType: !176)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !460, file: !461, line: 80, baseType: !478, size: 64, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !114, line: 167, baseType: !176)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !460, file: !461, line: 91, baseType: !480, size: 128, offset: 576)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !481, line: 8, size: 128, elements: !482)
!481 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!482 = !{!483, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !480, file: !481, line: 10, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !114, line: 148, baseType: !176)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !480, file: !481, line: 11, baseType: !486, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !114, line: 184, baseType: !176)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !460, file: !461, line: 92, baseType: !480, size: 128, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !460, file: !461, line: 93, baseType: !480, size: 128, offset: 832)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !460, file: !461, line: 106, baseType: !490, size: 192, offset: 960)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 192, elements: !441)
!491 = distinct !DICompileUnit(language: DW_LANG_C99, file: !492, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !493, globals: !497)
!492 = !DIFile(filename: "./lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!493 = !{!142, !494}
!494 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !455, line: 47, size: 32, elements: !495)
!495 = !{!496}
!496 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1)
!497 = !{!452, !498}
!498 = !DIGlobalVariableExpression(var: !499)
!499 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !454, file: !455, line: 150, type: !500, isLocal: true, isDefinition: true)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !455, line: 60, size: 128, elements: !502)
!502 = !{!503, !504, !505}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !501, file: !455, line: 63, baseType: !117, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !501, file: !455, line: 70, baseType: !131, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !501, file: !455, line: 74, baseType: !69, size: 8, offset: 96)
!506 = !{!507, !508, !509, !510, !511, !514, !515, !516, !517, !520, !521, !522, !525, !526, !527, !528, !529, !530, !532, !535, !536, !537, !538, !544, !545, !547, !549, !551}
!507 = !DILocalVariable(name: "dst_name", arg: 1, scope: !454, file: !455, line: 116, type: !76)
!508 = !DILocalVariable(name: "dst_stat", arg: 2, scope: !454, file: !455, line: 117, type: !458)
!509 = !DILocalVariable(name: "src_stat", arg: 3, scope: !454, file: !455, line: 118, type: !458)
!510 = !DILocalVariable(name: "options", arg: 4, scope: !454, file: !455, line: 119, type: !131)
!511 = !DILocalVariable(name: "dst_s", scope: !454, file: !455, line: 137, type: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !513, line: 7, baseType: !484)
!513 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!514 = !DILocalVariable(name: "src_s", scope: !454, file: !455, line: 138, type: !512)
!515 = !DILocalVariable(name: "dst_ns", scope: !454, file: !455, line: 139, type: !131)
!516 = !DILocalVariable(name: "src_ns", scope: !454, file: !455, line: 140, type: !131)
!517 = !DILocalVariable(name: "dst_res", scope: !518, file: !455, line: 151, type: !500)
!518 = distinct !DILexicalBlock(scope: !519, file: !455, line: 143, column: 5)
!519 = distinct !DILexicalBlock(scope: !454, file: !455, line: 142, column: 7)
!520 = !DILocalVariable(name: "tmp_dst_res", scope: !518, file: !455, line: 152, type: !501)
!521 = !DILocalVariable(name: "res", scope: !518, file: !455, line: 155, type: !131)
!522 = !DILocalVariable(name: "dst_a_s", scope: !523, file: !455, line: 229, type: !512)
!523 = distinct !DILexicalBlock(scope: !524, file: !455, line: 225, column: 9)
!524 = distinct !DILexicalBlock(scope: !518, file: !455, line: 224, column: 11)
!525 = !DILocalVariable(name: "dst_c_s", scope: !523, file: !455, line: 230, type: !512)
!526 = !DILocalVariable(name: "dst_m_s", scope: !523, file: !455, line: 231, type: !512)
!527 = !DILocalVariable(name: "dst_a_ns", scope: !523, file: !455, line: 232, type: !131)
!528 = !DILocalVariable(name: "dst_c_ns", scope: !523, file: !455, line: 233, type: !131)
!529 = !DILocalVariable(name: "dst_m_ns", scope: !523, file: !455, line: 234, type: !131)
!530 = !DILocalVariable(name: "odd_second", scope: !531, file: !455, line: 243, type: !69)
!531 = distinct !DILexicalBlock(scope: !523, file: !455, line: 242, column: 11)
!532 = !DILocalVariable(name: "a", scope: !533, file: !455, line: 252, type: !131)
!533 = distinct !DILexicalBlock(scope: !534, file: !455, line: 251, column: 15)
!534 = distinct !DILexicalBlock(scope: !531, file: !455, line: 245, column: 17)
!535 = !DILocalVariable(name: "c", scope: !533, file: !455, line: 253, type: !131)
!536 = !DILocalVariable(name: "m", scope: !533, file: !455, line: 254, type: !131)
!537 = !DILocalVariable(name: "SR10", scope: !533, file: !455, line: 258, type: !131)
!538 = !DILocalVariable(name: "timespec", scope: !539, file: !455, line: 280, type: !541)
!539 = distinct !DILexicalBlock(scope: !540, file: !455, line: 279, column: 13)
!540 = distinct !DILexicalBlock(scope: !523, file: !455, line: 278, column: 15)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 256, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 2)
!544 = !DILocalVariable(name: "dst_status", scope: !539, file: !455, line: 281, type: !460)
!545 = !DILocalVariable(name: "s", scope: !546, file: !455, line: 291, type: !512)
!546 = distinct !DILexicalBlock(scope: !539, file: !455, line: 290, column: 15)
!547 = !DILocalVariable(name: "stat_result", scope: !548, file: !455, line: 320, type: !131)
!548 = distinct !DILexicalBlock(scope: !539, file: !455, line: 319, column: 15)
!549 = !DILocalVariable(name: "old_res", scope: !550, file: !455, line: 345, type: !131)
!550 = distinct !DILexicalBlock(scope: !539, file: !455, line: 344, column: 15)
!551 = !DILocalVariable(name: "a", scope: !550, file: !455, line: 346, type: !131)
!552 = !DIGlobalVariableExpression(var: !553)
!553 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !554, file: !564, line: 73, type: !131, isLocal: true, isDefinition: true)
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !555, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !556, globals: !561)
!555 = !DIFile(filename: "./lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!556 = !{!557}
!557 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !558, line: 35, size: 32, elements: !559)
!558 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!559 = !{!560}
!560 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000)
!561 = !{!552, !562}
!562 = !DIGlobalVariableExpression(var: !563)
!563 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !554, file: !564, line: 74, type: !131, isLocal: true, isDefinition: true)
!564 = !DIFile(filename: "lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!565 = !DIGlobalVariableExpression(var: !566)
!566 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !567, file: !570, line: 26, type: !571, isLocal: false, isDefinition: true)
!567 = distinct !DICompileUnit(language: DW_LANG_C99, file: !568, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, globals: !569)
!568 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!569 = !{!565}
!570 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 376, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 47)
!574 = !DIGlobalVariableExpression(var: !575)
!575 = distinct !DIGlobalVariable(name: "can_write", scope: !576, file: !577, line: 35, type: !69, isLocal: true, isDefinition: true)
!576 = distinct !DISubprogram(name: "can_write_any_file", scope: !577, file: !577, line: 32, type: !578, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !580, variables: !585)
!577 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!578 = !DISubroutineType(types: !579)
!579 = !{!69}
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, globals: !582)
!581 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!582 = !{!583, !574}
!583 = !DIGlobalVariableExpression(var: !584)
!584 = distinct !DIGlobalVariable(name: "initialized", scope: !576, file: !577, line: 34, type: !69, isLocal: true, isDefinition: true)
!585 = !{!586}
!586 = !DILocalVariable(name: "can", scope: !587, file: !577, line: 39, type: !69)
!587 = distinct !DILexicalBlock(scope: !588, file: !577, line: 38, column: 5)
!588 = distinct !DILexicalBlock(scope: !576, file: !577, line: 37, column: 7)
!589 = !DIGlobalVariableExpression(var: !590)
!590 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !591, file: !592, line: 335, type: !131, isLocal: true, isDefinition: true)
!591 = distinct !DISubprogram(name: "rpl_fcntl", scope: !592, file: !592, line: 272, type: !593, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !595, variables: !598)
!592 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!593 = !DISubroutineType(types: !594)
!594 = !{!131, !131, !131, null}
!595 = distinct !DICompileUnit(language: DW_LANG_C99, file: !596, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, globals: !597)
!596 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!597 = !{!589}
!598 = !{!599, !600, !601, !614, !615, !618, !621, !624}
!599 = !DILocalVariable(name: "fd", arg: 1, scope: !591, file: !592, line: 272, type: !131)
!600 = !DILocalVariable(name: "action", arg: 2, scope: !591, file: !592, line: 272, type: !131)
!601 = !DILocalVariable(name: "arg", scope: !591, file: !592, line: 274, type: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !603, line: 30, baseType: !604)
!603 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !596, line: 274, baseType: !605)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 192, elements: !612)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !596, line: 274, size: 192, elements: !607)
!607 = !{!608, !609, !610, !611}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !606, file: !596, line: 274, baseType: !169, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !606, file: !596, line: 274, baseType: !169, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !606, file: !596, line: 274, baseType: !65, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !606, file: !596, line: 274, baseType: !65, size: 64, offset: 128)
!612 = !{!613}
!613 = !DISubrange(count: 1)
!614 = !DILocalVariable(name: "result", scope: !591, file: !592, line: 275, type: !131)
!615 = !DILocalVariable(name: "target", scope: !616, file: !592, line: 322, type: !131)
!616 = distinct !DILexicalBlock(scope: !617, file: !592, line: 321, column: 7)
!617 = distinct !DILexicalBlock(scope: !591, file: !592, line: 278, column: 5)
!618 = !DILocalVariable(name: "flags", scope: !619, file: !592, line: 359, type: !131)
!619 = distinct !DILexicalBlock(scope: !620, file: !592, line: 358, column: 11)
!620 = distinct !DILexicalBlock(scope: !616, file: !592, line: 357, column: 13)
!621 = !DILocalVariable(name: "saved_errno", scope: !622, file: !592, line: 362, type: !131)
!622 = distinct !DILexicalBlock(scope: !623, file: !592, line: 361, column: 15)
!623 = distinct !DILexicalBlock(scope: !619, file: !592, line: 360, column: 17)
!624 = !DILocalVariable(name: "p", scope: !625, file: !592, line: 404, type: !65)
!625 = distinct !DILexicalBlock(scope: !617, file: !592, line: 402, column: 7)
!626 = !DIGlobalVariableExpression(var: !627)
!627 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !628, file: !633, line: 69, type: !634, isLocal: false, isDefinition: true)
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !629, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !630, retainedTypes: !631, globals: !632)
!629 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!630 = !{!36}
!631 = !{!65, !170}
!632 = !{!626}
!633 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !635, line: 55, baseType: !636)
!635 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{null}
!639 = !DIGlobalVariableExpression(var: !640)
!640 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !641, file: !985, line: 120, type: !986, isLocal: true, isDefinition: true)
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !643, retainedTypes: !982, globals: !984)
!642 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!643 = !{!644}
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !645, line: 41, size: 32, elements: !646)
!645 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981}
!647 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!648 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!649 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!650 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!651 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!652 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!653 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!654 = !DIEnumerator(name: "DAY_1", value: 131079)
!655 = !DIEnumerator(name: "DAY_2", value: 131080)
!656 = !DIEnumerator(name: "DAY_3", value: 131081)
!657 = !DIEnumerator(name: "DAY_4", value: 131082)
!658 = !DIEnumerator(name: "DAY_5", value: 131083)
!659 = !DIEnumerator(name: "DAY_6", value: 131084)
!660 = !DIEnumerator(name: "DAY_7", value: 131085)
!661 = !DIEnumerator(name: "ABMON_1", value: 131086)
!662 = !DIEnumerator(name: "ABMON_2", value: 131087)
!663 = !DIEnumerator(name: "ABMON_3", value: 131088)
!664 = !DIEnumerator(name: "ABMON_4", value: 131089)
!665 = !DIEnumerator(name: "ABMON_5", value: 131090)
!666 = !DIEnumerator(name: "ABMON_6", value: 131091)
!667 = !DIEnumerator(name: "ABMON_7", value: 131092)
!668 = !DIEnumerator(name: "ABMON_8", value: 131093)
!669 = !DIEnumerator(name: "ABMON_9", value: 131094)
!670 = !DIEnumerator(name: "ABMON_10", value: 131095)
!671 = !DIEnumerator(name: "ABMON_11", value: 131096)
!672 = !DIEnumerator(name: "ABMON_12", value: 131097)
!673 = !DIEnumerator(name: "MON_1", value: 131098)
!674 = !DIEnumerator(name: "MON_2", value: 131099)
!675 = !DIEnumerator(name: "MON_3", value: 131100)
!676 = !DIEnumerator(name: "MON_4", value: 131101)
!677 = !DIEnumerator(name: "MON_5", value: 131102)
!678 = !DIEnumerator(name: "MON_6", value: 131103)
!679 = !DIEnumerator(name: "MON_7", value: 131104)
!680 = !DIEnumerator(name: "MON_8", value: 131105)
!681 = !DIEnumerator(name: "MON_9", value: 131106)
!682 = !DIEnumerator(name: "MON_10", value: 131107)
!683 = !DIEnumerator(name: "MON_11", value: 131108)
!684 = !DIEnumerator(name: "MON_12", value: 131109)
!685 = !DIEnumerator(name: "AM_STR", value: 131110)
!686 = !DIEnumerator(name: "PM_STR", value: 131111)
!687 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!688 = !DIEnumerator(name: "D_FMT", value: 131113)
!689 = !DIEnumerator(name: "T_FMT", value: 131114)
!690 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!691 = !DIEnumerator(name: "ERA", value: 131116)
!692 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!693 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!694 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!695 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!696 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!697 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!698 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!699 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!700 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!701 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!702 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!703 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!704 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!705 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!706 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!707 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!708 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!709 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!710 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!711 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!712 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!713 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!714 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!715 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!716 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!717 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!718 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!719 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!720 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!721 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!722 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!723 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!724 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!725 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!726 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!727 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!728 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!729 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!730 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!731 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!732 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!733 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!734 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!735 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!736 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!737 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!738 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!739 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!740 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!741 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!742 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!743 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!744 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!745 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!746 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!747 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!748 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!749 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!750 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!751 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!752 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!753 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!754 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!755 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!756 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!757 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!758 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!759 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!760 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!761 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!762 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!763 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!764 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!765 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!766 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!767 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!768 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!769 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!770 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!771 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!772 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!773 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!774 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!775 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!776 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!777 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!778 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!779 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!780 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!781 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!782 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!783 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!784 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!785 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!786 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!787 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!788 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!789 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!790 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!791 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!792 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!793 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!794 = !DIEnumerator(name: "CODESET", value: 14)
!795 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!796 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!797 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!798 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!799 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!800 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!801 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!802 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!803 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!804 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!805 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!806 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!807 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!808 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!809 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!810 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!811 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!812 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!813 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!814 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!815 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!816 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!817 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!818 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!819 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!820 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!821 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!822 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!823 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!824 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!825 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!826 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!827 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!828 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!829 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!830 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!831 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!832 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!833 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!834 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!835 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!836 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!837 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!838 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!839 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!840 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!841 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!842 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!843 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!844 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!845 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!846 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!847 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!848 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!849 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!850 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!851 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!852 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!853 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!854 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!855 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!856 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!857 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!858 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!859 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!860 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!861 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!862 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!863 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!864 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!865 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!866 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!867 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!868 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!869 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!870 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!871 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!872 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!873 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!874 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!875 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!876 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!877 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!878 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!879 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!880 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!881 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!882 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!883 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!884 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!885 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!886 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!887 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!888 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!889 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!890 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!891 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!892 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!893 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!894 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!895 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!896 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!897 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!898 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!899 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!900 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!901 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!902 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!903 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!904 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!905 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!906 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!907 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!908 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!909 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!910 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!911 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!912 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!913 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!914 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!915 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!916 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!917 = !DIEnumerator(name: "THOUSEP", value: 65537)
!918 = !DIEnumerator(name: "__GROUPING", value: 65538)
!919 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!920 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!921 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!922 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!923 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!924 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!925 = !DIEnumerator(name: "__YESSTR", value: 327682)
!926 = !DIEnumerator(name: "__NOSTR", value: 327683)
!927 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!928 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!929 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!930 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!931 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!932 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!933 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!934 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!935 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!936 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!937 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!938 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!939 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!940 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!941 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!942 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!943 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!944 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!945 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!946 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!947 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!948 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!949 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!950 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!951 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!952 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!953 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!954 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!955 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!956 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!957 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!958 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!959 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!960 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!961 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!962 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!963 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!964 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!965 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!966 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!967 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!968 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!969 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!970 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!971 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!972 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!973 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!974 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!975 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!976 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!977 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!978 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!979 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!980 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!981 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!982 = !{!65, !63, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!984 = !{!639}
!985 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!986 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !76)
!987 = distinct !DICompileUnit(language: DW_LANG_C99, file: !988, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !989, retainedTypes: !1011)
!988 = !DIFile(filename: "src/remove.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!989 = !{!56, !50, !36, !990, !995, !999}
!990 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ternary", file: !988, line: 34, size: 32, elements: !991)
!991 = !{!992, !993, !994}
!992 = !DIEnumerator(name: "T_UNKNOWN", value: 2)
!993 = !DIEnumerator(name: "T_NO", value: 3)
!994 = !DIEnumerator(name: "T_YES", value: 4)
!995 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !988, line: 45, size: 32, elements: !996)
!996 = !{!997, !998}
!997 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2)
!998 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3)
!999 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1000, line: 97, size: 32, elements: !1001)
!1000 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010}
!1002 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!1003 = !DIEnumerator(name: "DT_FIFO", value: 1)
!1004 = !DIEnumerator(name: "DT_CHR", value: 2)
!1005 = !DIEnumerator(name: "DT_DIR", value: 4)
!1006 = !DIEnumerator(name: "DT_BLK", value: 6)
!1007 = !DIEnumerator(name: "DT_REG", value: 8)
!1008 = !DIEnumerator(name: "DT_LNK", value: 10)
!1009 = !DIEnumerator(name: "DT_SOCK", value: 12)
!1010 = !DIEnumerator(name: "DT_WHT", value: 14)
!1011 = !{!65, !131}
!1012 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1013, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1014, retainedTypes: !1095)
!1013 = !DIFile(filename: "src/extent-scan.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1014 = !{!1015}
!1015 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1016, file: !1013, line: 97, size: 32, elements: !1093)
!1016 = distinct !DISubprogram(name: "extent_scan_read", scope: !1013, file: !1013, line: 87, type: !1017, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !1012, variables: !1037)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!69, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !1021, line: 36, size: 384, elements: !1022)
!1021 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1022 = !{!1023, !1024, !1026, !1027, !1028, !1029, !1030}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1020, file: !1021, line: 39, baseType: !131, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !1020, file: !1021, line: 42, baseType: !1025, size: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !112, line: 86, baseType: !175)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !1020, file: !1021, line: 45, baseType: !169, size: 32, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !1020, file: !1021, line: 48, baseType: !171, size: 64, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !1020, file: !1021, line: 52, baseType: !69, size: 8, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !1020, file: !1021, line: 55, baseType: !69, size: 8, offset: 264)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !1020, file: !1021, line: 58, baseType: !1031, size: 64, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !1021, line: 23, size: 192, elements: !1033)
!1033 = !{!1034, !1035, !1036}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !1032, file: !1021, line: 26, baseType: !1025, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !1032, file: !1021, line: 29, baseType: !1025, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !1032, file: !1021, line: 32, baseType: !169, size: 32, offset: 128)
!1037 = !{!1038, !1039, !1040, !1041, !1078, !1080, !1082, !1084, !1085, !1092}
!1038 = !DILocalVariable(name: "scan", arg: 1, scope: !1016, file: !1013, line: 87, type: !1019)
!1039 = !DILocalVariable(name: "si", scope: !1016, file: !1013, line: 89, type: !169)
!1040 = !DILocalVariable(name: "last_ei", scope: !1016, file: !1013, line: 90, type: !1031)
!1041 = !DILocalVariable(name: "fiemap_buf", scope: !1042, file: !1013, line: 94, type: !1043)
!1042 = distinct !DILexicalBlock(scope: !1016, file: !1013, line: 93, column: 5)
!1043 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1016, file: !1013, line: 94, size: 32768, elements: !1044)
!1044 = !{!1045, !1074}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1043, file: !1013, line: 94, baseType: !1046, size: 256)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap", file: !1047, line: 35, size: 256, elements: !1048)
!1047 = !DIFile(filename: "src/fiemap.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1048 = !{!1049, !1053, !1054, !1057, !1058, !1059, !1060}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "fm_start", scope: !1046, file: !1047, line: 38, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1051, line: 27, baseType: !1052)
!1051 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !114, line: 44, baseType: !115)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "fm_length", scope: !1046, file: !1047, line: 41, baseType: !1050, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !1046, file: !1047, line: 44, baseType: !1055, size: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1051, line: 26, baseType: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !114, line: 41, baseType: !169)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "fm_mapped_extents", scope: !1046, file: !1047, line: 47, baseType: !1055, size: 32, offset: 160)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extent_count", scope: !1046, file: !1047, line: 50, baseType: !1055, size: 32, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "fm_reserved", scope: !1046, file: !1047, line: 52, baseType: !1055, size: 32, offset: 224)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extents", scope: !1046, file: !1047, line: 59, baseType: !1061, offset: 256)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, elements: !1072)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !1047, line: 14, size: 448, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1069, !1070}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !1062, file: !1047, line: 18, baseType: !1050, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "fe_physical", scope: !1062, file: !1047, line: 22, baseType: !1050, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "fe_length", scope: !1062, file: !1047, line: 25, baseType: !1050, size: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved64", scope: !1062, file: !1047, line: 27, baseType: !1068, size: 128, offset: 192)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 128, elements: !542)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "fe_flags", scope: !1062, file: !1047, line: 30, baseType: !1055, size: 32, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved", scope: !1062, file: !1047, line: 32, baseType: !1071, size: 96, offset: 352)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 96, elements: !441)
!1072 = !{!1073}
!1073 = !DISubrange(count: 0)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1043, file: !1013, line: 94, baseType: !1075, size: 32768)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32768, elements: !1076)
!1076 = !{!1077}
!1077 = !DISubrange(count: 4096)
!1078 = !DILocalVariable(name: "fiemap", scope: !1042, file: !1013, line: 95, type: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1080 = !DILocalVariable(name: "fm_extents", scope: !1042, file: !1013, line: 96, type: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1082 = !DILocalVariable(name: "prev_idx", scope: !1083, file: !1013, line: 131, type: !171)
!1083 = distinct !DILexicalBlock(scope: !1042, file: !1013, line: 128, column: 7)
!1084 = !DILocalVariable(name: "i", scope: !1042, file: !1013, line: 137, type: !169)
!1085 = !DILocalVariable(name: "new_logical", scope: !1086, file: !1013, line: 163, type: !1050)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !1013, line: 158, column: 13)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !1013, line: 155, column: 20)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !1013, line: 145, column: 15)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !1013, line: 139, column: 9)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !1013, line: 138, column: 7)
!1091 = distinct !DILexicalBlock(scope: !1042, file: !1013, line: 138, column: 7)
!1092 = !DILocalVariable(name: "length_adjust", scope: !1086, file: !1013, line: 164, type: !1050)
!1093 = !{!1094}
!1094 = !DIEnumerator(name: "count", value: 72)
!1095 = !{!1025, !171}
!1096 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1097, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1097 = !DIFile(filename: "src/selinux.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1098 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1099, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1099 = !DIFile(filename: "./lib/copy-acl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1100 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1101, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1101 = !DIFile(filename: "./lib/set-acl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1102 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1103, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !430)
!1103 = !DIFile(filename: "./lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1104 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1105, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1105 = !DIFile(filename: "./lib/buffer-lcm.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1106 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1107, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1107 = !DIFile(filename: "./lib/opendir-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1108 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1109, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1109 = !DIFile(filename: "./lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1110 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1111, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1111 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1112 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1113, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !1114)
!1113 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1114 = !{!63}
!1115 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1116, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1116 = !DIFile(filename: "./lib/stripslash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1117 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1118, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1119)
!1118 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1119 = !{!153}
!1120 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1121, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1121 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1122 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1123, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !343)
!1123 = !DIFile(filename: "./lib/file-set.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1125, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1125 = !DIFile(filename: "./lib/file-type.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1126 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1127, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1127 = !DIFile(filename: "./lib/filemode.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1129, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !430)
!1129 = !DIFile(filename: "./lib/filenamecat.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1131, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !430)
!1131 = !DIFile(filename: "./lib/filenamecat-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1132 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1133, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !1134)
!1133 = !DIFile(filename: "./lib/full-write.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1134 = !{!76, !171}
!1135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1136, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1136 = !DIFile(filename: "./lib/hash-triple.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1137 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1138, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1138 = !DIFile(filename: "./lib/qcopy-acl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1139 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1140, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1140 = !DIFile(filename: "./lib/qset-acl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1141 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1142, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!1142 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1144, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1145)
!1144 = !DIFile(filename: "./lib/safe-write.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1145 = !{!1146}
!1146 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1148, file: !1147, line: 62, size: 32, elements: !1161)
!1147 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1148 = distinct !DISubprogram(name: "safe_write", scope: !1147, file: !1147, line: 56, type: !1149, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !1143, variables: !1151)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!171, !131, !439, !171}
!1151 = !{!1152, !1153, !1154, !1155}
