; ModuleID = 'coreutils-8.27/src/nl.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_dfa_t = type opaque
%struct.linebuffer = type { i64, i64, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.re_registers = type { i32, i32*, i32* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [62 x i8] c"Write each FILE to standard output, with line numbers added.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 149, type: !184, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !40)
!3 = !DIFile(filename: "src/nl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19, !28}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 45, size: 32, elements: !21)
!20 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!23 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!24 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!25 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!26 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!27 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "section", file: !3, line: 61, size: 32, elements: !29)
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "Header", value: 0)
!31 = !DIEnumerator(name: "Body", value: 1)
!32 = !DIEnumerator(name: "Footer", value: 2)
!33 = !DIEnumerator(name: "Text", value: 3)
!34 = !{!35, !37, !38, !39}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!41, !45, !72, !74, !76, !81, !83, !85, !87, !89, !91, !99, !106, !109, !0, !129, !131, !133, !135, !137, !139, !141, !143, !145, !148, !153, !155, !158, !160, !162, !167, !169, !171, !173, !175, !178}
!41 = !DIGlobalVariableExpression(var: !42)
!42 = distinct !DIGlobalVariable(name: "current_type", scope: !2, file: !3, line: 76, type: !43, isLocal: true, isDefinition: true)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!45 = !DIGlobalVariableExpression(var: !46)
!46 = distinct !DIGlobalVariable(name: "body_regex", scope: !2, file: !3, line: 79, type: !47, isLocal: true, isDefinition: true)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !48, line: 414, size: 512, elements: !49)
!48 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!49 = !{!50, !53, !55, !56, !58, !59, !61, !64, !66, !67, !68, !69, !70, !71}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !47, file: !48, line: 418, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !48, line: 418, flags: DIFlagFwdDecl)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !47, file: !48, line: 421, baseType: !54, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !48, line: 57, baseType: !38)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !47, file: !48, line: 424, baseType: !54, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !47, file: !48, line: 427, baseType: !57, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !48, line: 73, baseType: !38)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !47, file: !48, line: 432, baseType: !35, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !47, file: !48, line: 438, baseType: !60, size: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !47, file: !48, line: 441, baseType: !62, size: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !63, line: 62, baseType: !38)
!63 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !47, file: !48, line: 447, baseType: !65, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !47, file: !48, line: 458, baseType: !65, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !47, file: !48, line: 462, baseType: !65, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !47, file: !48, line: 466, baseType: !65, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !47, file: !48, line: 470, baseType: !65, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !47, file: !48, line: 473, baseType: !65, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !47, file: !48, line: 476, baseType: !65, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!72 = !DIGlobalVariableExpression(var: !73)
!73 = distinct !DIGlobalVariable(name: "header_regex", scope: !2, file: !3, line: 82, type: !47, isLocal: true, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75)
!75 = distinct !DIGlobalVariable(name: "footer_regex", scope: !2, file: !3, line: 85, type: !47, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77)
!77 = distinct !DIGlobalVariable(name: "body_fastmap", scope: !2, file: !3, line: 88, type: !78, isLocal: true, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 2048, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 256)
!81 = !DIGlobalVariableExpression(var: !82)
!82 = distinct !DIGlobalVariable(name: "header_fastmap", scope: !2, file: !3, line: 89, type: !78, isLocal: true, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84)
!84 = distinct !DIGlobalVariable(name: "footer_fastmap", scope: !2, file: !3, line: 90, type: !78, isLocal: true, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86)
!86 = distinct !DIGlobalVariable(name: "header_del_len", scope: !2, file: !3, line: 105, type: !62, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88)
!88 = distinct !DIGlobalVariable(name: "body_del_len", scope: !2, file: !3, line: 111, type: !62, isLocal: true, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90)
!90 = distinct !DIGlobalVariable(name: "footer_del_len", scope: !2, file: !3, line: 117, type: !62, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92)
!92 = distinct !DIGlobalVariable(name: "line_buf", scope: !2, file: !3, line: 120, type: !93, isLocal: true, isDefinition: true)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !94, line: 26, size: 192, elements: !95)
!94 = !DIFile(filename: "./lib/linebuffer.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!95 = !{!96, !97, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !93, file: !94, line: 28, baseType: !62, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !93, file: !94, line: 29, baseType: !62, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !93, file: !94, line: 30, baseType: !35, size: 64, offset: 128)
!99 = !DIGlobalVariableExpression(var: !100)
!100 = distinct !DIGlobalVariable(name: "line_no", scope: !2, file: !3, line: 144, type: !101, isLocal: true, isDefinition: true)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !102, line: 111, baseType: !103)
!102 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !104, line: 61, baseType: !105)
!104 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIGlobalVariableExpression(var: !107)
!107 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 147, type: !108, isLocal: true, isDefinition: true)
!108 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!109 = !DIGlobalVariableExpression(var: !110)
!110 = distinct !DIGlobalVariable(name: "infomap", scope: !111, file: !112, line: 632, type: !126, isLocal: true, isDefinition: true)
!111 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !112, file: !112, line: 630, type: !113, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !115)
!112 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!113 = !DISubroutineType(types: !114)
!114 = !{null, !43}
!115 = !{!116, !117, !118, !125}
!116 = !DILocalVariable(name: "program", arg: 1, scope: !111, file: !112, line: 630, type: !43)
!117 = !DILocalVariable(name: "node", scope: !111, file: !112, line: 642, type: !43)
!118 = !DILocalVariable(name: "map_prog", scope: !111, file: !112, line: 643, type: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !111, file: !112, line: 632, size: 128, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !121, file: !112, line: 632, baseType: !43, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !121, file: !112, line: 632, baseType: !43, size: 64, offset: 64)
!125 = !DILocalVariable(name: "lc_messages", scope: !111, file: !112, line: 655, type: !43)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 896, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 7)
!129 = !DIGlobalVariableExpression(var: !130)
!130 = distinct !DIGlobalVariable(name: "header_type", scope: !2, file: !3, line: 70, type: !43, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132)
!132 = distinct !DIGlobalVariable(name: "body_type", scope: !2, file: !3, line: 67, type: !43, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134)
!134 = distinct !DIGlobalVariable(name: "footer_type", scope: !2, file: !3, line: 73, type: !43, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136)
!136 = distinct !DIGlobalVariable(name: "starting_line_number", scope: !2, file: !3, line: 126, type: !101, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138)
!138 = distinct !DIGlobalVariable(name: "page_incr", scope: !2, file: !3, line: 129, type: !101, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140)
!140 = distinct !DIGlobalVariable(name: "reset_numbers", scope: !2, file: !3, line: 132, type: !108, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142)
!142 = distinct !DIGlobalVariable(name: "blank_join", scope: !2, file: !3, line: 135, type: !101, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144)
!144 = distinct !DIGlobalVariable(name: "separator_str", scope: !2, file: !3, line: 96, type: !43, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146)
!146 = distinct !DIGlobalVariable(name: "lineno_width", scope: !2, file: !3, line: 138, type: !147, isLocal: true, isDefinition: true)
!147 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!148 = !DIGlobalVariableExpression(var: !149)
!149 = distinct !DIGlobalVariable(name: "FORMAT_LEFT", scope: !2, file: !3, line: 54, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 8)
!153 = !DIGlobalVariableExpression(var: !154)
!154 = distinct !DIGlobalVariable(name: "lineno_format", scope: !2, file: !3, line: 141, type: !43, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156)
!156 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_NOLZ", scope: !2, file: !3, line: 48, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 56, elements: !127)
!158 = !DIGlobalVariableExpression(var: !159)
!159 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_LZ", scope: !2, file: !3, line: 51, type: !150, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161)
!161 = distinct !DIGlobalVariable(name: "section_del", scope: !2, file: !3, line: 99, type: !43, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163)
!163 = distinct !DIGlobalVariable(name: "DEFAULT_SECTION_DELIMITERS", scope: !2, file: !3, line: 57, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 24, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 3)
!167 = !DIGlobalVariableExpression(var: !168)
!168 = distinct !DIGlobalVariable(name: "header_del", scope: !2, file: !3, line: 102, type: !35, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170)
!170 = distinct !DIGlobalVariable(name: "body_del", scope: !2, file: !3, line: 108, type: !35, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172)
!172 = distinct !DIGlobalVariable(name: "footer_del", scope: !2, file: !3, line: 114, type: !35, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174)
!174 = distinct !DIGlobalVariable(name: "print_no_line_fmt", scope: !2, file: !3, line: 123, type: !35, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176)
!176 = distinct !DIGlobalVariable(name: "current_regex", scope: !2, file: !3, line: 93, type: !177, isLocal: true, isDefinition: true)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!178 = !DIGlobalVariableExpression(var: !179)
!179 = distinct !DIGlobalVariable(name: "blank_lines", scope: !180, file: !3, line: 324, type: !101, isLocal: true, isDefinition: true)
!180 = distinct !DISubprogram(name: "proc_text", scope: !3, file: !3, line: 322, type: !181, isLocal: true, isDefinition: true, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !183)
!181 = !DISubroutineType(types: !182)
!182 = !{null}
!183 = !{}
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 3584, elements: !194)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !187, line: 50, size: 256, elements: !188)
!187 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!188 = !{!189, !190, !191, !193}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !187, line: 52, baseType: !43, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !186, file: !187, line: 55, baseType: !147, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !186, file: !187, line: 56, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !186, file: !187, line: 57, baseType: !147, size: 32, offset: 192)
!194 = !{!195}
!195 = !DISubrange(count: 14)
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "Version", scope: !198, file: !199, line: 2, type: !43, isLocal: false, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, globals: !200)
!199 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!200 = !{!196}
!201 = !DIGlobalVariableExpression(var: !202)
!202 = distinct !DIGlobalVariable(name: "file_name", scope: !203, file: !208, line: 36, type: !43, isLocal: true, isDefinition: true)
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, globals: !205)
!204 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!205 = !{!201, !206}
!206 = !DIGlobalVariableExpression(var: !207)
!207 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !203, file: !208, line: 46, type: !108, isLocal: true, isDefinition: true)
!208 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!209 = !DIGlobalVariableExpression(var: !210)
!210 = distinct !DIGlobalVariable(name: "exit_failure", scope: !211, file: !214, line: 24, type: !215, isLocal: false, isDefinition: true)
!211 = distinct !DICompileUnit(language: DW_LANG_C99, file: !212, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, globals: !213)
!212 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!213 = !{!209}
!214 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!215 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !147)
!216 = !DIGlobalVariableExpression(var: !217)
!217 = distinct !DIGlobalVariable(name: "program_name", scope: !218, file: !222, line: 33, type: !43, isLocal: false, isDefinition: true)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !220, globals: !221)
!219 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!220 = !{!37, !35}
!221 = !{!216}
!222 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!223 = !DIGlobalVariableExpression(var: !224)
!224 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !225, file: !253, line: 77, type: !283, isLocal: false, isDefinition: true)
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !227, retainedTypes: !248, globals: !250)
!226 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!227 = !{!5, !228, !233}
!228 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !229)
!229 = !{!230, !231, !232}
!230 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!231 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!232 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !234, line: 46, size: 32, elements: !235)
!234 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247}
!236 = !DIEnumerator(name: "_ISupper", value: 256)
!237 = !DIEnumerator(name: "_ISlower", value: 512)
!238 = !DIEnumerator(name: "_ISalpha", value: 1024)
!239 = !DIEnumerator(name: "_ISdigit", value: 2048)
!240 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!241 = !DIEnumerator(name: "_ISspace", value: 8192)
!242 = !DIEnumerator(name: "_ISprint", value: 16384)
!243 = !DIEnumerator(name: "_ISgraph", value: 32768)
!244 = !DIEnumerator(name: "_ISblank", value: 1)
!245 = !DIEnumerator(name: "_IScntrl", value: 2)
!246 = !DIEnumerator(name: "_ISpunct", value: 4)
!247 = !DIEnumerator(name: "_ISalnum", value: 8)
!248 = !{!147, !249, !62, !35}
!249 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!250 = !{!223, !251, !258, !268, !270, !272, !279, !281}
!251 = !DIGlobalVariableExpression(var: !252)
!252 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !225, file: !253, line: 93, type: !254, isLocal: false, isDefinition: true)
!253 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 320, elements: !256)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!256 = !{!257}
!257 = !DISubrange(count: 10)
!258 = !DIGlobalVariableExpression(var: !259)
!259 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !225, file: !253, line: 1043, type: !260, isLocal: false, isDefinition: true)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !253, line: 57, size: 448, elements: !261)
!261 = !{!262, !263, !264, !266, !267}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !260, file: !253, line: 60, baseType: !5, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !260, file: !253, line: 63, baseType: !147, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !260, file: !253, line: 67, baseType: !265, size: 256, offset: 64)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 256, elements: !151)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !260, file: !253, line: 70, baseType: !43, size: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !260, file: !253, line: 73, baseType: !43, size: 64, offset: 384)
!268 = !DIGlobalVariableExpression(var: !269)
!269 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !225, file: !253, line: 108, type: !260, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271)
!271 = distinct !DIGlobalVariable(name: "slot0", scope: !225, file: !253, line: 834, type: !78, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273)
!273 = distinct !DIGlobalVariable(name: "slotvec", scope: !225, file: !253, line: 837, type: !274, isLocal: true, isDefinition: true)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !253, line: 826, size: 128, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !275, file: !253, line: 828, baseType: !62, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !275, file: !253, line: 829, baseType: !35, size: 64, offset: 64)
!279 = !DIGlobalVariableExpression(var: !280)
!280 = distinct !DIGlobalVariable(name: "nslots", scope: !225, file: !253, line: 835, type: !147, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282)
!282 = distinct !DIGlobalVariable(name: "slotvec0", scope: !225, file: !253, line: 836, type: !275, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 704, elements: !285)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!285 = !{!286}
!286 = !DISubrange(count: 11)
!287 = !DIGlobalVariableExpression(var: !288)
!288 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !289, file: !292, line: 26, type: !293, isLocal: false, isDefinition: true)
!289 = distinct !DICompileUnit(language: DW_LANG_C99, file: !290, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, globals: !291)
!290 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!291 = !{!287}
!292 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 376, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 47)
!296 = !DIGlobalVariableExpression(var: !297)
!297 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !298, file: !641, line: 120, type: !642, isLocal: true, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C99, file: !299, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !300, retainedTypes: !639, globals: !640)
!299 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!300 = !{!301}
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !302, line: 41, size: 32, elements: !303)
!302 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638}
!304 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!305 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!306 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!307 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!308 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!309 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!310 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!311 = !DIEnumerator(name: "DAY_1", value: 131079)
!312 = !DIEnumerator(name: "DAY_2", value: 131080)
!313 = !DIEnumerator(name: "DAY_3", value: 131081)
!314 = !DIEnumerator(name: "DAY_4", value: 131082)
!315 = !DIEnumerator(name: "DAY_5", value: 131083)
!316 = !DIEnumerator(name: "DAY_6", value: 131084)
!317 = !DIEnumerator(name: "DAY_7", value: 131085)
!318 = !DIEnumerator(name: "ABMON_1", value: 131086)
!319 = !DIEnumerator(name: "ABMON_2", value: 131087)
!320 = !DIEnumerator(name: "ABMON_3", value: 131088)
!321 = !DIEnumerator(name: "ABMON_4", value: 131089)
!322 = !DIEnumerator(name: "ABMON_5", value: 131090)
!323 = !DIEnumerator(name: "ABMON_6", value: 131091)
!324 = !DIEnumerator(name: "ABMON_7", value: 131092)
!325 = !DIEnumerator(name: "ABMON_8", value: 131093)
!326 = !DIEnumerator(name: "ABMON_9", value: 131094)
!327 = !DIEnumerator(name: "ABMON_10", value: 131095)
!328 = !DIEnumerator(name: "ABMON_11", value: 131096)
!329 = !DIEnumerator(name: "ABMON_12", value: 131097)
!330 = !DIEnumerator(name: "MON_1", value: 131098)
!331 = !DIEnumerator(name: "MON_2", value: 131099)
!332 = !DIEnumerator(name: "MON_3", value: 131100)
!333 = !DIEnumerator(name: "MON_4", value: 131101)
!334 = !DIEnumerator(name: "MON_5", value: 131102)
!335 = !DIEnumerator(name: "MON_6", value: 131103)
!336 = !DIEnumerator(name: "MON_7", value: 131104)
!337 = !DIEnumerator(name: "MON_8", value: 131105)
!338 = !DIEnumerator(name: "MON_9", value: 131106)
!339 = !DIEnumerator(name: "MON_10", value: 131107)
!340 = !DIEnumerator(name: "MON_11", value: 131108)
!341 = !DIEnumerator(name: "MON_12", value: 131109)
!342 = !DIEnumerator(name: "AM_STR", value: 131110)
!343 = !DIEnumerator(name: "PM_STR", value: 131111)
!344 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!345 = !DIEnumerator(name: "D_FMT", value: 131113)
!346 = !DIEnumerator(name: "T_FMT", value: 131114)
!347 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!348 = !DIEnumerator(name: "ERA", value: 131116)
!349 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!350 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!351 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!352 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!353 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!354 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!355 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!356 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!357 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!358 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!359 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!360 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!361 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!362 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!363 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!364 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!365 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!366 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!367 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!368 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!369 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!370 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!371 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!372 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!373 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!374 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!375 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!376 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!377 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!378 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!379 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!380 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!381 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!382 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!383 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!384 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!385 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!386 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!387 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!388 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!389 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!390 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!391 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!392 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!393 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!394 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!395 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!396 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!397 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!398 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!399 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!400 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!401 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!402 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!403 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!404 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!405 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!406 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!407 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!408 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!409 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!410 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!411 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!412 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!413 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!414 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!415 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!416 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!417 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!418 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!419 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!420 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!421 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!422 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!423 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!424 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!425 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!426 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!427 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!428 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!429 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!430 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!431 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!432 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!433 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!434 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!435 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!436 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!437 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!438 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!439 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!440 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!441 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!442 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!443 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!444 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!445 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!446 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!447 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!448 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!449 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!450 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!451 = !DIEnumerator(name: "CODESET", value: 14)
!452 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!453 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!454 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!455 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!456 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!457 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!458 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!459 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!460 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!461 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!462 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!463 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!464 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!465 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!466 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!467 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!468 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!469 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!470 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!471 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!472 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!473 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!474 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!475 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!476 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!477 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!478 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!479 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!480 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!481 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!482 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!483 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!484 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!485 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!486 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!487 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!488 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!489 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!490 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!491 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!492 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!493 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!494 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!495 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!496 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!497 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!498 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!499 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!500 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!501 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!502 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!503 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!504 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!505 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!506 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!507 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!508 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!509 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!510 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!511 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!512 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!513 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!514 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!515 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!516 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!517 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!518 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!519 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!520 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!521 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!522 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!523 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!524 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!525 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!526 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!527 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!528 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!529 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!530 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!531 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!532 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!533 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!534 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!535 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!536 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!537 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!538 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!539 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!540 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!541 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!542 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!543 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!544 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!545 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!546 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!547 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!548 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!549 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!550 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!551 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!552 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!553 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!554 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!555 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!556 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!557 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!558 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!559 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!560 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!561 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!562 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!563 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!564 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!565 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!566 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!567 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!568 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!569 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!570 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!571 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!572 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!573 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!574 = !DIEnumerator(name: "THOUSEP", value: 65537)
!575 = !DIEnumerator(name: "__GROUPING", value: 65538)
!576 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!577 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!578 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!579 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!580 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!581 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!582 = !DIEnumerator(name: "__YESSTR", value: 327682)
!583 = !DIEnumerator(name: "__NOSTR", value: 327683)
!584 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!585 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!586 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!587 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!588 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!589 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!590 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!591 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!592 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!593 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!594 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!595 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!596 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!597 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!598 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!599 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!600 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!601 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!602 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!603 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!604 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!605 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!606 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!607 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!608 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!609 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!610 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!611 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!612 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!613 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!614 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!615 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!616 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!617 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!618 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!619 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!620 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!621 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!622 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!623 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!624 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!625 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!626 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!627 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!628 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!629 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!630 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!631 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!632 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!633 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!634 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!635 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!636 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!637 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!638 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!639 = !{!37, !35, !60}
!640 = !{!296}
!641 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!642 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !43)
!643 = distinct !DICompileUnit(language: DW_LANG_C99, file: !644, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !645)
!644 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!645 = !{!19}
!646 = distinct !DICompileUnit(language: DW_LANG_C99, file: !647, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !648)
!647 = !DIFile(filename: "./lib/linebuffer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!648 = !{!60}
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !651, retainedTypes: !656)
!650 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!651 = !{!652}
!652 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !653, line: 41, size: 32, elements: !654)
!653 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!654 = !{!655}
!655 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!656 = !{!37}
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !659, retainedTypes: !673)
!658 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!659 = !{!660}
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !662, file: !661, line: 192, size: 32, elements: !671)
!661 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!662 = distinct !DISubprogram(name: "x2nrealloc", scope: !661, file: !661, line: 180, type: !663, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !657, variables: !666)
!663 = !DISubroutineType(types: !664)
!664 = !{!37, !37, !665, !62}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!666 = !{!667, !668, !669, !670}
!667 = !DILocalVariable(name: "p", arg: 1, scope: !662, file: !661, line: 180, type: !37)
!668 = !DILocalVariable(name: "pn", arg: 2, scope: !662, file: !661, line: 180, type: !665)
!669 = !DILocalVariable(name: "s", arg: 3, scope: !662, file: !661, line: 180, type: !62)
!670 = !DILocalVariable(name: "n", scope: !662, file: !661, line: 182, type: !62)
!671 = !{!672}
!672 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!673 = !{!62, !35, !37}
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!675 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !678)
!677 = !DIFile(filename: "./lib/xdectoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!678 = !{!679}
!679 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !680, line: 26, size: 32, elements: !681)
!680 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!681 = !{!682, !683, !684, !685, !686}
!682 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!683 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!684 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!685 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!686 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !678)
!688 = !DIFile(filename: "./lib/xstrtoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !656)
!690 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!692 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !656)
!694 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !656)
!696 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !699)
!698 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!699 = !{!62}
!700 = distinct !DICompileUnit(language: DW_LANG_C99, file: !701, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!701 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183)
!703 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!704 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!705 = !{i32 2, !"Dwarf Version", i32 4}
!706 = !{i32 2, !"Debug Info Version", i32 3}
!707 = !{i32 1, !"wchar_size", i32 4}
!708 = !{i32 7, !"PIC Level", i32 2}
!709 = !{i32 7, !"PIE Level", i32 2}
!710 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 170, type: !711, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !713)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !147}
!713 = !{!714}
!714 = !DILocalVariable(name: "status", arg: 1, scope: !710, file: !3, line: 170, type: !147)
!715 = !DIExpression()
!716 = !DILocation(line: 170, column: 12, scope: !710)
!717 = !DILocation(line: 172, column: 14, scope: !718)
!718 = distinct !DILexicalBlock(scope: !710, file: !3, line: 172, column: 7)
!719 = !DILocation(line: 172, column: 7, scope: !710)
!720 = !DILocation(line: 173, column: 5, scope: !721)
!721 = distinct !DILexicalBlock(scope: !718, file: !3, line: 173, column: 5)
!722 = !{!723, !723, i64 0}
!723 = !{!"any pointer", !724, i64 0}
!724 = !{!"omnipotent char", !725, i64 0}
!725 = !{!"Simple C/C++ TBAA"}
!726 = !DILocation(line: 176, column: 7, scope: !727)
!727 = distinct !DILexicalBlock(scope: !718, file: !3, line: 175, column: 5)
!728 = !DILocation(line: 180, column: 7, scope: !727)
!729 = !DILocation(line: 580, column: 3, scope: !730, inlinedAt: !731)
!730 = distinct !DISubprogram(name: "emit_stdin_note", scope: !112, file: !112, line: 578, type: !181, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !183)
!731 = distinct !DILocation(line: 184, column: 7, scope: !727)
!732 = !DILocation(line: 587, column: 3, scope: !733, inlinedAt: !734)
!733 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !112, file: !112, line: 585, type: !181, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !183)
!734 = distinct !DILocation(line: 185, column: 7, scope: !727)
!735 = !DILocation(line: 187, column: 7, scope: !727)
!736 = !DILocation(line: 192, column: 7, scope: !727)
!737 = !DILocation(line: 200, column: 7, scope: !727)
!738 = !DILocation(line: 204, column: 7, scope: !727)
!739 = !DILocation(line: 205, column: 7, scope: !727)
!740 = !DILocation(line: 206, column: 7, scope: !727)
!741 = !DILocation(line: 212, column: 7, scope: !727)
!742 = !DILocation(line: 642, column: 15, scope: !111, inlinedAt: !743)
!743 = distinct !DILocation(line: 227, column: 7, scope: !727)
!744 = !DILocation(line: 651, column: 3, scope: !111, inlinedAt: !743)
!745 = !DILocation(line: 655, column: 29, scope: !111, inlinedAt: !743)
!746 = !DILocation(line: 655, column: 15, scope: !111, inlinedAt: !743)
!747 = !DILocation(line: 656, column: 7, scope: !748, inlinedAt: !743)
!748 = distinct !DILexicalBlock(scope: !111, file: !112, line: 656, column: 7)
!749 = !DILocation(line: 656, column: 19, scope: !748, inlinedAt: !743)
!750 = !DILocation(line: 656, column: 22, scope: !748, inlinedAt: !743)
!751 = !DILocation(line: 656, column: 7, scope: !111, inlinedAt: !743)
!752 = !DILocation(line: 662, column: 7, scope: !753, inlinedAt: !743)
!753 = distinct !DILexicalBlock(scope: !748, file: !112, line: 657, column: 5)
!754 = !DILocation(line: 664, column: 5, scope: !753, inlinedAt: !743)
!755 = !DILocation(line: 665, column: 3, scope: !111, inlinedAt: !743)
!756 = !DILocation(line: 667, column: 3, scope: !111, inlinedAt: !743)
!757 = !DILocation(line: 229, column: 3, scope: !710)
!758 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 459, type: !759, isLocal: false, isDefinition: true, scopeLine: 460, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !762)
!759 = !DISubroutineType(types: !760)
!760 = !{!147, !147, !761}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!762 = !{!763, !764, !765, !766, !767}
!763 = !DILocalVariable(name: "argc", arg: 1, scope: !758, file: !3, line: 459, type: !147)
!764 = !DILocalVariable(name: "argv", arg: 2, scope: !758, file: !3, line: 459, type: !761)
!765 = !DILocalVariable(name: "c", scope: !758, file: !3, line: 461, type: !147)
!766 = !DILocalVariable(name: "len", scope: !758, file: !3, line: 462, type: !62)
!767 = !DILocalVariable(name: "ok", scope: !758, file: !3, line: 463, type: !108)
!768 = !DILocation(line: 459, column: 11, scope: !758)
!769 = !DILocation(line: 459, column: 24, scope: !758)
!770 = !DILocation(line: 463, column: 8, scope: !758)
!771 = !DILocation(line: 466, column: 21, scope: !758)
!772 = !DILocation(line: 466, column: 3, scope: !758)
!773 = !DILocation(line: 467, column: 3, scope: !758)
!774 = !DILocation(line: 468, column: 3, scope: !758)
!775 = !DILocation(line: 469, column: 3, scope: !758)
!776 = !DILocation(line: 471, column: 3, scope: !758)
!777 = !DILocation(line: 475, column: 3, scope: !758)
!778 = !DILocation(line: 475, column: 15, scope: !758)
!779 = !DILocation(line: 461, column: 7, scope: !758)
!780 = distinct !{!780, !777, !781}
!781 = !DILocation(line: 550, column: 5, scope: !758)
!782 = !DILocation(line: 481, column: 17, scope: !783)
!783 = distinct !DILexicalBlock(scope: !784, file: !3, line: 481, column: 15)
!784 = distinct !DILexicalBlock(scope: !785, file: !3, line: 479, column: 9)
!785 = distinct !DILexicalBlock(scope: !758, file: !3, line: 477, column: 5)
!786 = !DILocation(line: 481, column: 15, scope: !784)
!787 = !DILocation(line: 483, column: 28, scope: !788)
!788 = distinct !DILexicalBlock(scope: !783, file: !3, line: 482, column: 13)
!789 = !DILocation(line: 484, column: 29, scope: !788)
!790 = !DILocation(line: 484, column: 22, scope: !788)
!791 = !DILocation(line: 483, column: 15, scope: !788)
!792 = !DILocation(line: 486, column: 13, scope: !788)
!793 = !DILocation(line: 489, column: 17, scope: !794)
!794 = distinct !DILexicalBlock(scope: !784, file: !3, line: 489, column: 15)
!795 = !DILocation(line: 489, column: 15, scope: !784)
!796 = !DILocation(line: 491, column: 28, scope: !797)
!797 = distinct !DILexicalBlock(scope: !794, file: !3, line: 490, column: 13)
!798 = !DILocation(line: 492, column: 29, scope: !797)
!799 = !DILocation(line: 492, column: 22, scope: !797)
!800 = !DILocation(line: 491, column: 15, scope: !797)
!801 = !DILocation(line: 494, column: 13, scope: !797)
!802 = !DILocation(line: 497, column: 17, scope: !803)
!803 = distinct !DILexicalBlock(scope: !784, file: !3, line: 497, column: 15)
!804 = !DILocation(line: 497, column: 15, scope: !784)
!805 = !DILocation(line: 499, column: 28, scope: !806)
!806 = distinct !DILexicalBlock(scope: !803, file: !3, line: 498, column: 13)
!807 = !DILocation(line: 500, column: 29, scope: !806)
!808 = !DILocation(line: 500, column: 22, scope: !806)
!809 = !DILocation(line: 499, column: 15, scope: !806)
!810 = !DILocation(line: 502, column: 13, scope: !806)
!811 = !DILocation(line: 505, column: 46, scope: !784)
!812 = !DILocation(line: 506, column: 46, scope: !784)
!813 = !DILocation(line: 505, column: 34, scope: !784)
!814 = !DILocation(line: 505, column: 32, scope: !784)
!815 = !{!816, !816, i64 0}
!816 = !{!"long", !724, i64 0}
!817 = !DILocation(line: 508, column: 11, scope: !784)
!818 = !DILocation(line: 510, column: 35, scope: !784)
!819 = !DILocation(line: 511, column: 35, scope: !784)
!820 = !DILocation(line: 510, column: 23, scope: !784)
!821 = !DILocation(line: 510, column: 21, scope: !784)
!822 = !DILocation(line: 512, column: 11, scope: !784)
!823 = !DILocation(line: 515, column: 11, scope: !784)
!824 = !DILocation(line: 517, column: 36, scope: !784)
!825 = !DILocation(line: 518, column: 36, scope: !784)
!826 = !DILocation(line: 517, column: 24, scope: !784)
!827 = !DILocation(line: 517, column: 22, scope: !784)
!828 = !DILocation(line: 519, column: 11, scope: !784)
!829 = !DILocation(line: 521, column: 27, scope: !784)
!830 = !DILocation(line: 521, column: 25, scope: !784)
!831 = !DILocation(line: 522, column: 11, scope: !784)
!832 = !DILocation(line: 524, column: 38, scope: !784)
!833 = !DILocation(line: 525, column: 38, scope: !784)
!834 = !DILocation(line: 524, column: 26, scope: !784)
!835 = !DILocation(line: 524, column: 24, scope: !784)
!836 = !{!837, !837, i64 0}
!837 = !{!"int", !724, i64 0}
!838 = !DILocation(line: 526, column: 11, scope: !784)
!839 = !DILocation(line: 528, column: 15, scope: !840)
!840 = distinct !DILexicalBlock(scope: !784, file: !3, line: 528, column: 15)
!841 = !DILocation(line: 528, column: 15, scope: !784)
!842 = !DILocation(line: 529, column: 27, scope: !840)
!843 = !DILocation(line: 529, column: 13, scope: !840)
!844 = !DILocation(line: 530, column: 20, scope: !845)
!845 = distinct !DILexicalBlock(scope: !840, file: !3, line: 530, column: 20)
!846 = !DILocation(line: 530, column: 20, scope: !840)
!847 = !DILocation(line: 531, column: 27, scope: !845)
!848 = !DILocation(line: 531, column: 13, scope: !845)
!849 = !DILocation(line: 532, column: 20, scope: !850)
!850 = distinct !DILexicalBlock(scope: !845, file: !3, line: 532, column: 20)
!851 = !DILocation(line: 532, column: 20, scope: !845)
!852 = !DILocation(line: 533, column: 27, scope: !850)
!853 = !DILocation(line: 533, column: 13, scope: !850)
!854 = !DILocation(line: 536, column: 28, scope: !855)
!855 = distinct !DILexicalBlock(scope: !850, file: !3, line: 535, column: 13)
!856 = !DILocation(line: 537, column: 29, scope: !855)
!857 = !DILocation(line: 537, column: 22, scope: !855)
!858 = !DILocation(line: 536, column: 15, scope: !855)
!859 = !DILocation(line: 542, column: 25, scope: !784)
!860 = !DILocation(line: 542, column: 23, scope: !784)
!861 = !DILocation(line: 543, column: 11, scope: !784)
!862 = !DILocation(line: 544, column: 9, scope: !784)
!863 = !DILocation(line: 545, column: 9, scope: !784)
!864 = !DILocation(line: 552, column: 8, scope: !865)
!865 = distinct !DILexicalBlock(scope: !758, file: !3, line: 552, column: 7)
!866 = !DILocation(line: 552, column: 7, scope: !758)
!867 = !DILocation(line: 553, column: 5, scope: !865)
!868 = !DILocation(line: 556, column: 17, scope: !758)
!869 = !DILocation(line: 556, column: 9, scope: !758)
!870 = !DILocation(line: 462, column: 10, scope: !758)
!871 = !DILocation(line: 558, column: 24, scope: !758)
!872 = !DILocation(line: 558, column: 18, scope: !758)
!873 = !DILocation(line: 559, column: 40, scope: !758)
!874 = !DILocation(line: 559, column: 16, scope: !758)
!875 = !DILocation(line: 559, column: 14, scope: !758)
!876 = !DILocation(line: 560, column: 39, scope: !758)
!877 = !DILocalVariable(name: "__dest", arg: 1, scope: !878, file: !879, line: 95, type: !882)
!878 = distinct !DISubprogram(name: "stpcpy", scope: !879, file: !879, line: 95, type: !880, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !884)
!879 = !DIFile(filename: "/usr/include/bits/string_fortified.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!880 = !DISubroutineType(types: !881)
!881 = !{!35, !882, !883}
!882 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !35)
!883 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !43)
!884 = !{!877, !885}
!885 = !DILocalVariable(name: "__src", arg: 2, scope: !878, file: !879, line: 95, type: !883)
!886 = !DILocation(line: 95, column: 1, scope: !878, inlinedAt: !887)
!887 = distinct !DILocation(line: 560, column: 19, scope: !758)
!888 = !DILocation(line: 97, column: 49, scope: !878, inlinedAt: !887)
!889 = !DILocation(line: 97, column: 10, scope: !878, inlinedAt: !887)
!890 = !DILocation(line: 560, column: 53, scope: !758)
!891 = !DILocation(line: 95, column: 1, scope: !878, inlinedAt: !892)
!892 = distinct !DILocation(line: 560, column: 11, scope: !758)
!893 = !DILocation(line: 97, column: 49, scope: !878, inlinedAt: !892)
!894 = !DILocation(line: 97, column: 10, scope: !878, inlinedAt: !892)
!895 = !DILocation(line: 560, column: 67, scope: !758)
!896 = !DILocation(line: 95, column: 1, scope: !878, inlinedAt: !897)
!897 = distinct !DILocation(line: 560, column: 3, scope: !758)
!898 = !DILocation(line: 97, column: 49, scope: !878, inlinedAt: !897)
!899 = !DILocation(line: 97, column: 10, scope: !878, inlinedAt: !897)
!900 = !DILocation(line: 562, column: 22, scope: !758)
!901 = !DILocation(line: 562, column: 16, scope: !758)
!902 = !DILocation(line: 563, column: 36, scope: !758)
!903 = !DILocation(line: 563, column: 14, scope: !758)
!904 = !DILocation(line: 563, column: 12, scope: !758)
!905 = !DILocation(line: 564, column: 29, scope: !758)
!906 = !DILocation(line: 95, column: 1, scope: !878, inlinedAt: !907)
!907 = distinct !DILocation(line: 564, column: 11, scope: !758)
!908 = !DILocation(line: 97, column: 49, scope: !878, inlinedAt: !907)
!909 = !DILocation(line: 97, column: 10, scope: !878, inlinedAt: !907)
!910 = !DILocation(line: 564, column: 43, scope: !758)
!911 = !DILocation(line: 95, column: 1, scope: !878, inlinedAt: !912)
!912 = distinct !DILocation(line: 564, column: 3, scope: !758)
!913 = !DILocation(line: 97, column: 49, scope: !878, inlinedAt: !912)
!914 = !DILocation(line: 97, column: 10, scope: !878, inlinedAt: !912)
!915 = !DILocation(line: 566, column: 18, scope: !758)
!916 = !DILocation(line: 567, column: 40, scope: !758)
!917 = !DILocation(line: 567, column: 16, scope: !758)
!918 = !DILocation(line: 567, column: 14, scope: !758)
!919 = !DILocation(line: 568, column: 23, scope: !758)
!920 = !DILocation(line: 95, column: 1, scope: !878, inlinedAt: !921)
!921 = distinct !DILocation(line: 568, column: 3, scope: !758)
!922 = !DILocation(line: 97, column: 49, scope: !878, inlinedAt: !921)
!923 = !DILocation(line: 97, column: 10, scope: !878, inlinedAt: !921)
!924 = !DILocation(line: 571, column: 3, scope: !758)
!925 = !DILocation(line: 574, column: 17, scope: !758)
!926 = !DILocation(line: 574, column: 9, scope: !758)
!927 = !DILocation(line: 575, column: 32, scope: !758)
!928 = !DILocation(line: 575, column: 45, scope: !758)
!929 = !DILocation(line: 575, column: 51, scope: !758)
!930 = !DILocation(line: 575, column: 23, scope: !758)
!931 = !DILocation(line: 575, column: 21, scope: !758)
!932 = !DILocation(line: 576, column: 35, scope: !758)
!933 = !DILocation(line: 576, column: 48, scope: !758)
!934 = !DILocation(line: 576, column: 3, scope: !758)
!935 = !DILocation(line: 577, column: 3, scope: !758)
!936 = !DILocation(line: 577, column: 41, scope: !758)
!937 = !{!724, !724, i64 0}
!938 = !DILocation(line: 579, column: 13, scope: !758)
!939 = !DILocation(line: 579, column: 11, scope: !758)
!940 = !DILocation(line: 580, column: 18, scope: !758)
!941 = !DILocation(line: 580, column: 16, scope: !758)
!942 = !DILocation(line: 581, column: 17, scope: !758)
!943 = !DILocation(line: 585, column: 7, scope: !944)
!944 = distinct !DILexicalBlock(scope: !758, file: !3, line: 585, column: 7)
!945 = !DILocation(line: 585, column: 14, scope: !944)
!946 = !DILocation(line: 585, column: 7, scope: !758)
!947 = !DILocation(line: 586, column: 10, scope: !944)
!948 = !DILocation(line: 586, column: 8, scope: !944)
!949 = !DILocation(line: 586, column: 5, scope: !944)
!950 = !DILocation(line: 588, column: 19, scope: !951)
!951 = distinct !DILexicalBlock(scope: !952, file: !3, line: 588, column: 5)
!952 = distinct !DILexicalBlock(scope: !944, file: !3, line: 588, column: 5)
!953 = !DILocation(line: 588, column: 5, scope: !952)
!954 = !DILocation(line: 589, column: 22, scope: !951)
!955 = !DILocation(line: 589, column: 13, scope: !951)
!956 = !DILocation(line: 589, column: 10, scope: !951)
!957 = !DILocation(line: 588, column: 33, scope: !951)
!958 = distinct !{!958, !953, !959}
!959 = !DILocation(line: 589, column: 34, scope: !952)
!960 = !DILocation(line: 591, column: 23, scope: !961)
!961 = distinct !DILexicalBlock(scope: !758, file: !3, line: 591, column: 7)
!962 = !DILocation(line: 591, column: 34, scope: !961)
!963 = !DILocation(line: 591, column: 26, scope: !961)
!964 = !DILocation(line: 591, column: 41, scope: !961)
!965 = !DILocation(line: 591, column: 7, scope: !758)
!966 = !DILocation(line: 592, column: 5, scope: !961)
!967 = !DILocation(line: 594, column: 10, scope: !758)
!968 = !DILocation(line: 594, column: 3, scope: !758)
!969 = distinct !DISubprogram(name: "build_type_arg", scope: !3, file: !3, line: 236, type: !970, isLocal: true, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !973)
!970 = !DISubroutineType(types: !971)
!971 = !{!108, !972, !177, !35}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!973 = !{!974, !975, !976, !977, !978}
!974 = !DILocalVariable(name: "typep", arg: 1, scope: !969, file: !3, line: 236, type: !972)
!975 = !DILocalVariable(name: "regexp", arg: 2, scope: !969, file: !3, line: 237, type: !177)
!976 = !DILocalVariable(name: "fastmap", arg: 3, scope: !969, file: !3, line: 237, type: !35)
!977 = !DILocalVariable(name: "errmsg", scope: !969, file: !3, line: 239, type: !43)
!978 = !DILocalVariable(name: "rval", scope: !969, file: !3, line: 240, type: !108)
!979 = !DILocation(line: 236, column: 30, scope: !969)
!980 = !DILocation(line: 237, column: 43, scope: !969)
!981 = !DILocation(line: 237, column: 57, scope: !969)
!982 = !DILocation(line: 240, column: 8, scope: !969)
!983 = !DILocation(line: 242, column: 12, scope: !969)
!984 = !DILocation(line: 242, column: 11, scope: !969)
!985 = !DILocation(line: 242, column: 3, scope: !969)
!986 = !DILocation(line: 247, column: 14, scope: !987)
!987 = distinct !DILexicalBlock(scope: !969, file: !3, line: 243, column: 5)
!988 = !DILocation(line: 248, column: 7, scope: !987)
!989 = !DILocation(line: 250, column: 22, scope: !987)
!990 = !DILocation(line: 250, column: 14, scope: !987)
!991 = !DILocation(line: 253, column: 15, scope: !987)
!992 = !DILocation(line: 253, column: 23, scope: !987)
!993 = !DILocation(line: 252, column: 25, scope: !987)
!994 = !{!995, !723, i64 32}
!995 = !{!"re_pattern_buffer", !723, i64 0, !816, i64 8, !816, i64 16, !816, i64 24, !723, i64 32, !723, i64 40, !816, i64 48, !837, i64 56, !837, i64 56, !837, i64 56, !837, i64 56, !837, i64 56, !837, i64 56, !837, i64 56}
!996 = !DILocation(line: 254, column: 15, scope: !987)
!997 = !DILocation(line: 254, column: 25, scope: !987)
!998 = !{!995, !723, i64 40}
!999 = !DILocation(line: 255, column: 25, scope: !987)
!1000 = !DILocation(line: 257, column: 36, scope: !987)
!1001 = !DILocation(line: 257, column: 44, scope: !987)
!1002 = !DILocation(line: 257, column: 16, scope: !987)
!1003 = !DILocation(line: 239, column: 15, scope: !969)
!1004 = !DILocation(line: 258, column: 11, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !987, file: !3, line: 258, column: 11)
!1006 = !DILocation(line: 258, column: 11, scope: !987)
!1007 = !DILocation(line: 259, column: 9, scope: !1005)
!1008 = !DILocation(line: 265, column: 3, scope: !969)
!1009 = distinct !DISubprogram(name: "nl_file", scope: !3, file: !3, line: 420, type: !1010, isLocal: true, isDefinition: true, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1012)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!108, !43}
!1012 = !{!1013, !1014}
!1013 = !DILocalVariable(name: "file", arg: 1, scope: !1009, file: !3, line: 420, type: !43)
!1014 = !DILocalVariable(name: "stream", scope: !1009, file: !3, line: 422, type: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1017, line: 7, baseType: !1018)
!1017 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1019, line: 241, size: 1728, elements: !1020)
!1019 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1041, !1042, !1043, !1044, !1046, !1047, !1049, !1053, !1056, !1058, !1059, !1060, !1061, !1062, !1063, !1064}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1018, file: !1019, line: 242, baseType: !147, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1018, file: !1019, line: 247, baseType: !35, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1018, file: !1019, line: 248, baseType: !35, size: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1018, file: !1019, line: 249, baseType: !35, size: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1018, file: !1019, line: 250, baseType: !35, size: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1018, file: !1019, line: 251, baseType: !35, size: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1018, file: !1019, line: 252, baseType: !35, size: 64, offset: 384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1018, file: !1019, line: 253, baseType: !35, size: 64, offset: 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1018, file: !1019, line: 254, baseType: !35, size: 64, offset: 512)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1018, file: !1019, line: 256, baseType: !35, size: 64, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1018, file: !1019, line: 257, baseType: !35, size: 64, offset: 640)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1018, file: !1019, line: 258, baseType: !35, size: 64, offset: 704)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1018, file: !1019, line: 260, baseType: !1034, size: 64, offset: 768)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1019, line: 156, size: 192, elements: !1036)
!1036 = !{!1037, !1038, !1040}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1035, file: !1019, line: 157, baseType: !1034, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1035, file: !1019, line: 158, baseType: !1039, size: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1035, file: !1019, line: 162, baseType: !147, size: 32, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1018, file: !1019, line: 262, baseType: !1039, size: 64, offset: 832)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1018, file: !1019, line: 264, baseType: !147, size: 32, offset: 896)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1018, file: !1019, line: 268, baseType: !147, size: 32, offset: 928)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1018, file: !1019, line: 270, baseType: !1045, size: 64, offset: 960)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !104, line: 140, baseType: !105)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1018, file: !1019, line: 274, baseType: !249, size: 16, offset: 1024)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1018, file: !1019, line: 275, baseType: !1048, size: 8, offset: 1040)
!1048 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1018, file: !1019, line: 276, baseType: !1050, size: 8, offset: 1048)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, elements: !1051)
!1051 = !{!1052}
!1052 = !DISubrange(count: 1)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1018, file: !1019, line: 280, baseType: !1054, size: 64, offset: 1088)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1019, line: 150, baseType: null)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1018, file: !1019, line: 289, baseType: !1057, size: 64, offset: 1152)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !104, line: 141, baseType: !105)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1018, file: !1019, line: 297, baseType: !37, size: 64, offset: 1216)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1018, file: !1019, line: 298, baseType: !37, size: 64, offset: 1280)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1018, file: !1019, line: 299, baseType: !37, size: 64, offset: 1344)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1018, file: !1019, line: 300, baseType: !37, size: 64, offset: 1408)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1018, file: !1019, line: 302, baseType: !62, size: 64, offset: 1472)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1018, file: !1019, line: 303, baseType: !147, size: 32, offset: 1536)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1018, file: !1019, line: 305, baseType: !1065, size: 160, offset: 1568)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, elements: !1066)
!1066 = !{!1067}
!1067 = !DISubrange(count: 20)
!1068 = !DILocation(line: 420, column: 22, scope: !1009)
!1069 = !DILocation(line: 424, column: 7, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 424, column: 7)
!1071 = !DILocation(line: 424, column: 7, scope: !1009)
!1072 = !DILocation(line: 427, column: 16, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 425, column: 5)
!1074 = !DILocation(line: 422, column: 9, scope: !1009)
!1075 = !DILocation(line: 428, column: 5, scope: !1073)
!1076 = !DILocation(line: 431, column: 16, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 430, column: 5)
!1078 = !DILocation(line: 432, column: 18, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 432, column: 11)
!1080 = !DILocation(line: 432, column: 11, scope: !1077)
!1081 = !DILocation(line: 434, column: 21, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 433, column: 9)
!1083 = !DILocation(line: 434, column: 34, scope: !1082)
!1084 = !DILocation(line: 434, column: 11, scope: !1082)
!1085 = !DILocation(line: 435, column: 11, scope: !1082)
!1086 = !DILocation(line: 439, column: 3, scope: !1009)
!1087 = !DILocalVariable(name: "fp", arg: 1, scope: !1088, file: !3, line: 394, type: !1015)
!1088 = distinct !DISubprogram(name: "process_file", scope: !3, file: !3, line: 394, type: !1089, isLocal: true, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1091)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{null, !1015}
!1091 = !{!1087}
!1092 = !DILocation(line: 394, column: 21, scope: !1088, inlinedAt: !1093)
!1093 = distinct !DILocation(line: 441, column: 3, scope: !1009)
!1094 = !DILocation(line: 396, column: 10, scope: !1088, inlinedAt: !1093)
!1095 = !DILocation(line: 396, column: 3, scope: !1088, inlinedAt: !1093)
!1096 = !DILocation(line: 375, column: 25, scope: !1097, inlinedAt: !1102)
!1097 = distinct !DISubprogram(name: "check_section", scope: !3, file: !3, line: 373, type: !1098, isLocal: true, isDefinition: true, scopeLine: 374, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1100)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!28}
!1100 = !{!1101}
!1101 = !DILocalVariable(name: "len", scope: !1097, file: !3, line: 375, type: !62)
!1102 = distinct !DILocation(line: 398, column: 15, scope: !1103, inlinedAt: !1093)
!1103 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 397, column: 5)
!1104 = !{!1105, !816, i64 8}
!1105 = !{!"linebuffer", !816, i64 0, !816, i64 8, !723, i64 16}
!1106 = !DILocation(line: 375, column: 32, scope: !1097, inlinedAt: !1102)
!1107 = !DILocation(line: 375, column: 10, scope: !1097, inlinedAt: !1102)
!1108 = !DILocation(line: 377, column: 11, scope: !1109, inlinedAt: !1102)
!1109 = distinct !DILexicalBlock(scope: !1097, file: !3, line: 377, column: 7)
!1110 = !DILocation(line: 377, column: 15, scope: !1109, inlinedAt: !1102)
!1111 = !DILocation(line: 377, column: 35, scope: !1109, inlinedAt: !1102)
!1112 = !{!1105, !723, i64 16}
!1113 = !DILocation(line: 377, column: 43, scope: !1109, inlinedAt: !1102)
!1114 = !DILocation(line: 377, column: 18, scope: !1109, inlinedAt: !1102)
!1115 = !DILocation(line: 377, column: 7, scope: !1097, inlinedAt: !1102)
!1116 = !DILocation(line: 379, column: 14, scope: !1117, inlinedAt: !1102)
!1117 = distinct !DILexicalBlock(scope: !1097, file: !3, line: 379, column: 7)
!1118 = !DILocation(line: 379, column: 11, scope: !1117, inlinedAt: !1102)
!1119 = !DILocation(line: 380, column: 7, scope: !1117, inlinedAt: !1102)
!1120 = !DILocation(line: 380, column: 36, scope: !1117, inlinedAt: !1102)
!1121 = !DILocation(line: 380, column: 11, scope: !1117, inlinedAt: !1102)
!1122 = !DILocation(line: 379, column: 7, scope: !1097, inlinedAt: !1102)
!1123 = !DILocation(line: 382, column: 14, scope: !1124, inlinedAt: !1102)
!1124 = distinct !DILexicalBlock(scope: !1097, file: !3, line: 382, column: 7)
!1125 = !DILocation(line: 382, column: 11, scope: !1124, inlinedAt: !1102)
!1126 = !DILocation(line: 383, column: 7, scope: !1124, inlinedAt: !1102)
!1127 = !DILocation(line: 383, column: 36, scope: !1124, inlinedAt: !1102)
!1128 = !DILocation(line: 383, column: 11, scope: !1124, inlinedAt: !1102)
!1129 = !DILocation(line: 382, column: 7, scope: !1097, inlinedAt: !1102)
!1130 = !DILocation(line: 385, column: 14, scope: !1131, inlinedAt: !1102)
!1131 = distinct !DILexicalBlock(scope: !1097, file: !3, line: 385, column: 7)
!1132 = !DILocation(line: 385, column: 11, scope: !1131, inlinedAt: !1102)
!1133 = !DILocation(line: 386, column: 7, scope: !1131, inlinedAt: !1102)
!1134 = !DILocation(line: 386, column: 36, scope: !1131, inlinedAt: !1102)
!1135 = !DILocation(line: 386, column: 11, scope: !1131, inlinedAt: !1102)
!1136 = !DILocation(line: 385, column: 7, scope: !1097, inlinedAt: !1102)
!1137 = !DILocation(line: 288, column: 18, scope: !1138, inlinedAt: !1139)
!1138 = distinct !DISubprogram(name: "proc_header", scope: !3, file: !3, line: 286, type: !181, isLocal: true, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !183)
!1139 = distinct !DILocation(line: 401, column: 11, scope: !1140, inlinedAt: !1093)
!1140 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 399, column: 9)
!1141 = !DILocation(line: 288, column: 16, scope: !1138, inlinedAt: !1139)
!1142 = !DILocation(line: 289, column: 17, scope: !1138, inlinedAt: !1139)
!1143 = !DILocation(line: 290, column: 7, scope: !1138, inlinedAt: !1139)
!1144 = !DILocation(line: 291, column: 15, scope: !1145, inlinedAt: !1139)
!1145 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 290, column: 7)
!1146 = !DILocation(line: 291, column: 13, scope: !1145, inlinedAt: !1139)
!1147 = !DILocation(line: 291, column: 5, scope: !1145, inlinedAt: !1139)
!1148 = !DILocalVariable(name: "__c", arg: 1, scope: !1149, file: !1150, line: 105, type: !147)
!1149 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1150, file: !1150, line: 105, type: !1151, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1153)
!1150 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!147, !147}
!1153 = !{!1148}
!1154 = !DILocation(line: 105, column: 23, scope: !1149, inlinedAt: !1155)
!1155 = distinct !DILocation(line: 292, column: 3, scope: !1138, inlinedAt: !1139)
!1156 = !DILocation(line: 107, column: 10, scope: !1149, inlinedAt: !1155)
!1157 = !{!1158, !723, i64 40}
!1158 = !{!"_IO_FILE", !837, i64 0, !723, i64 8, !723, i64 16, !723, i64 24, !723, i64 32, !723, i64 40, !723, i64 48, !723, i64 56, !723, i64 64, !723, i64 72, !723, i64 80, !723, i64 88, !723, i64 96, !723, i64 104, !837, i64 112, !837, i64 116, !816, i64 120, !1159, i64 128, !724, i64 130, !724, i64 131, !723, i64 136, !816, i64 144, !723, i64 152, !723, i64 160, !723, i64 168, !723, i64 176, !816, i64 184, !837, i64 192, !724, i64 196}
!1159 = !{!"short", !724, i64 0}
!1160 = !{!1158, !723, i64 48}
!1161 = !{!"branch_weights", i32 2000, i32 1}
!1162 = !DILocation(line: 300, column: 18, scope: !1163, inlinedAt: !1164)
!1163 = distinct !DISubprogram(name: "proc_body", scope: !3, file: !3, line: 298, type: !181, isLocal: true, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !183)
!1164 = distinct !DILocation(line: 404, column: 11, scope: !1140, inlinedAt: !1093)
!1165 = !DILocation(line: 300, column: 16, scope: !1163, inlinedAt: !1164)
!1166 = !DILocation(line: 301, column: 17, scope: !1163, inlinedAt: !1164)
!1167 = !DILocation(line: 302, column: 7, scope: !1163, inlinedAt: !1164)
!1168 = !DILocation(line: 303, column: 15, scope: !1169, inlinedAt: !1164)
!1169 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 302, column: 7)
!1170 = !DILocation(line: 303, column: 13, scope: !1169, inlinedAt: !1164)
!1171 = !DILocation(line: 303, column: 5, scope: !1169, inlinedAt: !1164)
!1172 = !DILocation(line: 105, column: 23, scope: !1149, inlinedAt: !1173)
!1173 = distinct !DILocation(line: 304, column: 3, scope: !1163, inlinedAt: !1164)
!1174 = !DILocation(line: 107, column: 10, scope: !1149, inlinedAt: !1173)
!1175 = !DILocation(line: 312, column: 18, scope: !1176, inlinedAt: !1177)
!1176 = distinct !DISubprogram(name: "proc_footer", scope: !3, file: !3, line: 310, type: !181, isLocal: true, isDefinition: true, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !183)
!1177 = distinct !DILocation(line: 407, column: 11, scope: !1140, inlinedAt: !1093)
!1178 = !DILocation(line: 312, column: 16, scope: !1176, inlinedAt: !1177)
!1179 = !DILocation(line: 313, column: 17, scope: !1176, inlinedAt: !1177)
!1180 = !DILocation(line: 314, column: 7, scope: !1176, inlinedAt: !1177)
!1181 = !DILocation(line: 315, column: 15, scope: !1182, inlinedAt: !1177)
!1182 = distinct !DILexicalBlock(scope: !1176, file: !3, line: 314, column: 7)
!1183 = !DILocation(line: 315, column: 13, scope: !1182, inlinedAt: !1177)
!1184 = !DILocation(line: 315, column: 5, scope: !1182, inlinedAt: !1177)
!1185 = !DILocation(line: 105, column: 23, scope: !1149, inlinedAt: !1186)
!1186 = distinct !DILocation(line: 316, column: 3, scope: !1176, inlinedAt: !1177)
!1187 = !DILocation(line: 107, column: 10, scope: !1149, inlinedAt: !1186)
!1188 = !DILocation(line: 326, column: 12, scope: !180, inlinedAt: !1189)
!1189 = distinct !DILocation(line: 410, column: 11, scope: !1140, inlinedAt: !1093)
!1190 = !DILocation(line: 326, column: 11, scope: !180, inlinedAt: !1189)
!1191 = !DILocation(line: 326, column: 3, scope: !180, inlinedAt: !1189)
!1192 = !DILocation(line: 329, column: 11, scope: !1193, inlinedAt: !1189)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 329, column: 11)
!1194 = distinct !DILexicalBlock(scope: !180, file: !3, line: 327, column: 5)
!1195 = !DILocation(line: 329, column: 22, scope: !1193, inlinedAt: !1189)
!1196 = !DILocation(line: 329, column: 11, scope: !1194, inlinedAt: !1189)
!1197 = !DILocation(line: 331, column: 17, scope: !1198, inlinedAt: !1189)
!1198 = distinct !DILexicalBlock(scope: !1199, file: !3, line: 331, column: 15)
!1199 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 330, column: 9)
!1200 = !DILocation(line: 331, column: 35, scope: !1198, inlinedAt: !1189)
!1201 = !DILocation(line: 331, column: 38, scope: !1198, inlinedAt: !1189)
!1202 = !DILocation(line: 331, column: 52, scope: !1198, inlinedAt: !1189)
!1203 = !DILocation(line: 331, column: 15, scope: !1199, inlinedAt: !1189)
!1204 = !DILocation(line: 275, column: 3, scope: !1205, inlinedAt: !1208)
!1205 = distinct !DISubprogram(name: "print_lineno", scope: !3, file: !3, line: 271, type: !181, isLocal: true, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1206)
!1206 = !{!1207}
!1207 = !DILocalVariable(name: "next_line_no", scope: !1205, file: !3, line: 273, type: !101)
!1208 = distinct !DILocation(line: 333, column: 15, scope: !1209, inlinedAt: !1189)
!1209 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 332, column: 13)
!1210 = !DILocation(line: 277, column: 28, scope: !1205, inlinedAt: !1208)
!1211 = !DILocation(line: 278, column: 20, scope: !1212, inlinedAt: !1208)
!1212 = distinct !DILexicalBlock(scope: !1205, file: !3, line: 278, column: 7)
!1213 = !DILocation(line: 278, column: 7, scope: !1205, inlinedAt: !1208)
!1214 = !DILocation(line: 279, column: 5, scope: !1212, inlinedAt: !1208)
!1215 = !DILocation(line: 277, column: 18, scope: !1205, inlinedAt: !1208)
!1216 = !DILocation(line: 277, column: 26, scope: !1205, inlinedAt: !1208)
!1217 = !DILocation(line: 280, column: 11, scope: !1205, inlinedAt: !1208)
!1218 = !DILocation(line: 334, column: 27, scope: !1209, inlinedAt: !1189)
!1219 = !DILocation(line: 335, column: 13, scope: !1209, inlinedAt: !1189)
!1220 = !DILocation(line: 337, column: 13, scope: !1198, inlinedAt: !1189)
!1221 = !DILocation(line: 275, column: 3, scope: !1205, inlinedAt: !1222)
!1222 = distinct !DILocation(line: 340, column: 9, scope: !1193, inlinedAt: !1189)
!1223 = !DILocation(line: 277, column: 28, scope: !1205, inlinedAt: !1222)
!1224 = !DILocation(line: 278, column: 20, scope: !1212, inlinedAt: !1222)
!1225 = !DILocation(line: 278, column: 7, scope: !1205, inlinedAt: !1222)
!1226 = !DILocation(line: 279, column: 5, scope: !1212, inlinedAt: !1222)
!1227 = !DILocation(line: 277, column: 18, scope: !1205, inlinedAt: !1222)
!1228 = !DILocation(line: 277, column: 26, scope: !1205, inlinedAt: !1222)
!1229 = !DILocation(line: 280, column: 11, scope: !1205, inlinedAt: !1222)
!1230 = !DILocation(line: 343, column: 13, scope: !1231, inlinedAt: !1189)
!1231 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 343, column: 11)
!1232 = !DILocation(line: 343, column: 11, scope: !1194, inlinedAt: !1189)
!1233 = !DILocation(line: 275, column: 3, scope: !1205, inlinedAt: !1234)
!1234 = distinct !DILocation(line: 344, column: 9, scope: !1231, inlinedAt: !1189)
!1235 = !DILocation(line: 277, column: 28, scope: !1205, inlinedAt: !1234)
!1236 = !DILocation(line: 278, column: 20, scope: !1212, inlinedAt: !1234)
!1237 = !DILocation(line: 278, column: 7, scope: !1205, inlinedAt: !1234)
!1238 = !DILocation(line: 279, column: 5, scope: !1212, inlinedAt: !1234)
!1239 = !DILocation(line: 277, column: 18, scope: !1205, inlinedAt: !1234)
!1240 = !DILocation(line: 277, column: 26, scope: !1205, inlinedAt: !1234)
!1241 = !DILocation(line: 280, column: 11, scope: !1205, inlinedAt: !1234)
!1242 = !DILocation(line: 344, column: 9, scope: !1231, inlinedAt: !1189)
!1243 = !DILocation(line: 346, column: 9, scope: !1231, inlinedAt: !1189)
!1244 = !DILocation(line: 349, column: 7, scope: !1194, inlinedAt: !1189)
!1245 = !DILocation(line: 350, column: 7, scope: !1194, inlinedAt: !1189)
!1246 = !DILocation(line: 352, column: 26, scope: !1194, inlinedAt: !1189)
!1247 = !DILocation(line: 352, column: 50, scope: !1194, inlinedAt: !1189)
!1248 = !DILocation(line: 352, column: 74, scope: !1194, inlinedAt: !1189)
!1249 = !DILocation(line: 352, column: 58, scope: !1194, inlinedAt: !1189)
!1250 = !DILocation(line: 352, column: 15, scope: !1194, inlinedAt: !1189)
!1251 = !DILocation(line: 352, column: 7, scope: !1194, inlinedAt: !1189)
!1252 = !DILocation(line: 356, column: 11, scope: !1253, inlinedAt: !1189)
!1253 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 354, column: 9)
!1254 = !DILocation(line: 359, column: 11, scope: !1253, inlinedAt: !1189)
!1255 = !DILocation(line: 360, column: 11, scope: !1253, inlinedAt: !1189)
!1256 = !DILocation(line: 275, column: 3, scope: !1205, inlinedAt: !1257)
!1257 = distinct !DILocation(line: 363, column: 11, scope: !1253, inlinedAt: !1189)
!1258 = !DILocation(line: 277, column: 28, scope: !1205, inlinedAt: !1257)
!1259 = !DILocation(line: 278, column: 20, scope: !1212, inlinedAt: !1257)
!1260 = !DILocation(line: 278, column: 7, scope: !1205, inlinedAt: !1257)
!1261 = !DILocation(line: 279, column: 5, scope: !1212, inlinedAt: !1257)
!1262 = !DILocation(line: 277, column: 18, scope: !1205, inlinedAt: !1257)
!1263 = !DILocation(line: 277, column: 26, scope: !1205, inlinedAt: !1257)
