; ModuleID = 'coreutils-8.27/src/od.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tspec = type { i32, i32, void (i64, i64, i8*, i8*, i32, i32)*, [8 x i8], i8, i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%union.anon.2 = type { i16 }
%union.anon.5 = type { i64 }
%union.anon.3 = type { i32 }
%union.anon.6 = type { float }
%union.anon.7 = type { double }
%union.anon.8 = type { x86_fp80 }
%struct.__mbstate_t = type { i32, %union.anon.3 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1

!105 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1566, type: !106, isLocal: false, isDefinition: true, scopeLine: 1567, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !109)
!106 = !DISubroutineType(types: !107)
!107 = !{!95, !95, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !118, !119, !120, !121, !122, !124, !125, !126, !127, !131, !134, !135, !139, !140, !144}
!110 = !DILocalVariable(name: "argc", arg: 1, scope: !105, file: !3, line: 1566, type: !95)
!111 = !DILocalVariable(name: "argv", arg: 2, scope: !105, file: !3, line: 1566, type: !108)
!112 = !DILocalVariable(name: "n_files", scope: !105, file: !3, line: 1568, type: !95)
!113 = !DILocalVariable(name: "i", scope: !105, file: !3, line: 1569, type: !41)
!114 = !DILocalVariable(name: "l_c_m", scope: !105, file: !3, line: 1570, type: !95)
!115 = !DILocalVariable(name: "desired_width", scope: !105, file: !3, line: 1571, type: !41)
!116 = !DILocalVariable(name: "modern", scope: !105, file: !3, line: 1572, type: !117)
!117 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!118 = !DILocalVariable(name: "width_specified", scope: !105, file: !3, line: 1573, type: !117)
!119 = !DILocalVariable(name: "ok", scope: !105, file: !3, line: 1574, type: !117)
!120 = !DILocalVariable(name: "width_per_block", scope: !105, file: !3, line: 1575, type: !41)
!121 = !DILocalVariable(name: "pseudo_start", scope: !105, file: !3, line: 1580, type: !98)
!122 = !DILocalVariable(name: "tmp", scope: !123, file: !3, line: 1624, type: !98)
!123 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1623, column: 5)
!124 = !DILocalVariable(name: "s_err", scope: !123, file: !3, line: 1625, type: !17)
!125 = !DILocalVariable(name: "oi", scope: !123, file: !3, line: 1626, type: !95)
!126 = !DILocalVariable(name: "c", scope: !123, file: !3, line: 1627, type: !95)
!127 = !DILocalVariable(name: "w_tmp", scope: !128, file: !3, line: 1771, type: !98)
!128 = distinct !DILexicalBlock(scope: !129, file: !3, line: 1770, column: 13)
!129 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1765, column: 15)
!130 = distinct !DILexicalBlock(scope: !123, file: !3, line: 1632, column: 9)
!131 = !DILocalVariable(name: "o1", scope: !132, file: !3, line: 1814, type: !98)
!132 = distinct !DILexicalBlock(scope: !133, file: !3, line: 1813, column: 5)
!133 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1812, column: 7)
!134 = !DILocalVariable(name: "o2", scope: !132, file: !3, line: 1815, type: !98)
!135 = !DILocalVariable(name: "fields_per_block", scope: !136, file: !3, line: 1951, type: !95)
!136 = distinct !DILexicalBlock(scope: !137, file: !3, line: 1950, column: 5)
!137 = distinct !DILexicalBlock(scope: !138, file: !3, line: 1949, column: 3)
!138 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1949, column: 3)
!139 = !DILocalVariable(name: "block_width", scope: !136, file: !3, line: 1952, type: !95)
!140 = !DILocalVariable(name: "fields_per_block", scope: !141, file: !3, line: 1958, type: !95)
!141 = distinct !DILexicalBlock(scope: !142, file: !3, line: 1957, column: 5)
!142 = distinct !DILexicalBlock(scope: !143, file: !3, line: 1956, column: 3)
!143 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1956, column: 3)
!144 = !DILocalVariable(name: "block_width", scope: !141, file: !3, line: 1959, type: !95)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 104, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 13)
!148 = !DIGlobalVariableExpression(var: !149)
!149 = distinct !DIGlobalVariable(name: "address_base", scope: !2, file: !3, line: 177, type: !95, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151)
!151 = distinct !DIGlobalVariable(name: "address_pad_len", scope: !2, file: !3, line: 185, type: !95, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153)
!153 = distinct !DIGlobalVariable(name: "string_min", scope: !2, file: !3, line: 188, type: !41, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155)
!155 = distinct !DIGlobalVariable(name: "flag_dump_strings", scope: !2, file: !3, line: 191, type: !117, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157)
!157 = distinct !DIGlobalVariable(name: "traditional", scope: !2, file: !3, line: 196, type: !117, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159)
!159 = distinct !DIGlobalVariable(name: "flag_pseudo_start", scope: !2, file: !3, line: 199, type: !117, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161)
!161 = distinct !DIGlobalVariable(name: "pseudo_offset", scope: !2, file: !3, line: 203, type: !98, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163)
!163 = distinct !DIGlobalVariable(name: "format_address", scope: !2, file: !3, line: 207, type: !164, isLocal: true, isDefinition: true)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !98, !90}
!167 = !DIGlobalVariableExpression(var: !168)
!168 = distinct !DIGlobalVariable(name: "max_bytes_to_format", scope: !2, file: !3, line: 217, type: !98, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170)
!170 = distinct !DIGlobalVariable(name: "end_offset", scope: !2, file: !3, line: 220, type: !98, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172)
!172 = distinct !DIGlobalVariable(name: "spec", scope: !2, file: !3, line: 228, type: !173, isLocal: true, isDefinition: true)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tspec", file: !3, line: 100, size: 320, elements: !175)
!175 = !{!176, !177, !178, !184, !188, !189, !190}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !174, file: !3, line: 102, baseType: !25, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !174, file: !3, line: 103, baseType: !5, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "print_function", scope: !174, file: !3, line: 108, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !41, !41, !182, !88, !95, !95}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fmt_string", scope: !174, file: !3, line: 110, baseType: !185, size: 64, offset: 128)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 64, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 8)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "hexl_mode_trailer", scope: !174, file: !3, line: 111, baseType: !117, size: 8, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "field_width", scope: !174, file: !3, line: 112, baseType: !95, size: 32, offset: 224)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pad_width", scope: !174, file: !3, line: 113, baseType: !95, size: 32, offset: 256)
!191 = !DIGlobalVariableExpression(var: !192)
!192 = distinct !DIGlobalVariable(name: "n_specs", scope: !2, file: !3, line: 231, type: !41, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194)
!194 = distinct !DIGlobalVariable(name: "n_specs_allocated", scope: !2, file: !3, line: 234, type: !41, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196)
!196 = distinct !DIGlobalVariable(name: "bytes_per_block", scope: !2, file: !3, line: 240, type: !41, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198)
!198 = distinct !DIGlobalVariable(name: "file_list", scope: !2, file: !3, line: 247, type: !93, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200)
!200 = distinct !DIGlobalVariable(name: "in_stream", scope: !2, file: !3, line: 254, type: !201, isLocal: true, isDefinition: true)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !203, line: 7, baseType: !204)
!203 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !205, line: 241, size: 1728, elements: !206)
!205 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !227, !228, !229, !230, !233, !234, !236, !240, !243, !245, !246, !247, !248, !249, !250, !251}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !204, file: !205, line: 242, baseType: !95, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !204, file: !205, line: 247, baseType: !91, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !204, file: !205, line: 248, baseType: !91, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !204, file: !205, line: 249, baseType: !91, size: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !204, file: !205, line: 250, baseType: !91, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !204, file: !205, line: 251, baseType: !91, size: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !204, file: !205, line: 252, baseType: !91, size: 64, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !204, file: !205, line: 253, baseType: !91, size: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !204, file: !205, line: 254, baseType: !91, size: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !204, file: !205, line: 256, baseType: !91, size: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !204, file: !205, line: 257, baseType: !91, size: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !204, file: !205, line: 258, baseType: !91, size: 64, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !204, file: !205, line: 260, baseType: !220, size: 64, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !205, line: 156, size: 192, elements: !222)
!222 = !{!223, !224, !226}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !221, file: !205, line: 157, baseType: !220, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !221, file: !205, line: 158, baseType: !225, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !221, file: !205, line: 162, baseType: !95, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !204, file: !205, line: 262, baseType: !225, size: 64, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !204, file: !205, line: 264, baseType: !95, size: 32, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !204, file: !205, line: 268, baseType: !95, size: 32, offset: 928)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !204, file: !205, line: 270, baseType: !231, size: 64, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !101, line: 140, baseType: !232)
!232 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !204, file: !205, line: 274, baseType: !96, size: 16, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !204, file: !205, line: 275, baseType: !235, size: 8, offset: 1040)
!235 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !204, file: !205, line: 276, baseType: !237, size: 8, offset: 1048)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 8, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 1)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !204, file: !205, line: 280, baseType: !241, size: 64, offset: 1088)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !205, line: 150, baseType: null)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !204, file: !205, line: 289, baseType: !244, size: 64, offset: 1152)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !101, line: 141, baseType: !232)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !204, file: !205, line: 297, baseType: !39, size: 64, offset: 1216)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !204, file: !205, line: 298, baseType: !39, size: 64, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !204, file: !205, line: 299, baseType: !39, size: 64, offset: 1344)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !204, file: !205, line: 300, baseType: !39, size: 64, offset: 1408)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !204, file: !205, line: 302, baseType: !41, size: 64, offset: 1472)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !204, file: !205, line: 303, baseType: !95, size: 32, offset: 1536)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !204, file: !205, line: 305, baseType: !252, size: 160, offset: 1568)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 160, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 20)
!255 = !DIGlobalVariableExpression(var: !256)
!256 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 257, type: !117, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258)
!258 = distinct !DIGlobalVariable(name: "fp_type_size", scope: !2, file: !3, line: 263, type: !259, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 544, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 17)
!262 = !DIGlobalVariableExpression(var: !263)
!263 = distinct !DIGlobalVariable(name: "input_swap", scope: !2, file: !3, line: 270, type: !117, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265)
!265 = distinct !DIGlobalVariable(name: "infomap", scope: !266, file: !267, line: 632, type: !281, isLocal: true, isDefinition: true)
!266 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !267, file: !267, line: 630, type: !268, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !270)
!267 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!268 = !DISubroutineType(types: !269)
!269 = !{null, !88}
!270 = !{!271, !272, !273, !280}
!271 = !DILocalVariable(name: "program", arg: 1, scope: !266, file: !267, line: 630, type: !88)
!272 = !DILocalVariable(name: "node", scope: !266, file: !267, line: 642, type: !88)
!273 = !DILocalVariable(name: "map_prog", scope: !266, file: !267, line: 643, type: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !266, file: !267, line: 632, size: 128, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !276, file: !267, line: 632, baseType: !88, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !276, file: !267, line: 632, baseType: !88, size: 64, offset: 64)
!280 = !DILocalVariable(name: "lc_messages", scope: !266, file: !267, line: 655, type: !88)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 896, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 7)
!284 = !DIGlobalVariableExpression(var: !285)
!285 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 272, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 280, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 35)
!289 = !DIGlobalVariableExpression(var: !290)
!290 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 298, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 3072, elements: !301)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !294, line: 50, size: 256, elements: !295)
!294 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!295 = !{!296, !297, !298, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 52, baseType: !88, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !293, file: !294, line: 55, baseType: !95, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !293, file: !294, line: 56, baseType: !299, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !293, file: !294, line: 57, baseType: !95, size: 32, offset: 192)
!301 = !{!302}
!302 = !DISubrange(count: 12)
!303 = !DIGlobalVariableExpression(var: !304)
!304 = distinct !DIGlobalVariable(name: "n_bytes_to_skip", scope: !2, file: !3, line: 210, type: !98, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306)
!306 = distinct !DIGlobalVariable(name: "limit_bytes_to_format", scope: !2, file: !3, line: 214, type: !117, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308)
!308 = distinct !DIGlobalVariable(name: "bytes_to_signed_dec_digits", scope: !2, file: !3, line: 129, type: !309, isLocal: true, isDefinition: true)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 544, elements: !260)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!311 = !DIGlobalVariableExpression(var: !312)
!312 = distinct !DIGlobalVariable(name: "bytes_to_oct_digits", scope: !2, file: !3, line: 126, type: !309, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314)
!314 = distinct !DIGlobalVariable(name: "bytes_to_unsigned_dec_digits", scope: !2, file: !3, line: 132, type: !309, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316)
!316 = distinct !DIGlobalVariable(name: "bytes_to_hex_digits", scope: !2, file: !3, line: 135, type: !309, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318)
!318 = distinct !DIGlobalVariable(name: "charname", scope: !2, file: !3, line: 167, type: !319, isLocal: true, isDefinition: true)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 1056, elements: !320)
!320 = !{!321, !322}
!321 = !DISubrange(count: 33)
!322 = !DISubrange(count: 4)
!323 = !DIGlobalVariableExpression(var: !324)
!324 = distinct !DIGlobalVariable(name: "abbreviate_duplicate_blocks", scope: !2, file: !3, line: 225, type: !117, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326)
!326 = distinct !DIGlobalVariable(name: "endian_types", scope: !2, file: !3, line: 293, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 64, elements: !329)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!329 = !{!330}
!330 = !DISubrange(count: 2)
!331 = !DIGlobalVariableExpression(var: !332)
!332 = distinct !DIGlobalVariable(name: "endian_args", scope: !2, file: !3, line: 288, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 192, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 3)
!336 = !DIGlobalVariableExpression(var: !337)
!337 = distinct !DIGlobalVariable(name: "default_file_list", scope: !2, file: !3, line: 251, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, elements: !329)
!339 = !DIGlobalVariableExpression(var: !340)
!340 = distinct !DIGlobalVariable(name: "input_filename", scope: !2, file: !3, line: 244, type: !88, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342)
!342 = distinct !DIGlobalVariable(name: "width_bytes", scope: !2, file: !3, line: 149, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 288, elements: !345)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!345 = !{!346}
!346 = !DISubrange(count: 9)
!347 = !DIGlobalVariableExpression(var: !348)
!348 = distinct !DIGlobalVariable(name: "first", scope: !349, file: !3, line: 1186, type: !117, isLocal: true, isDefinition: true)
!349 = distinct !DISubprogram(name: "write_block", scope: !3, file: !3, line: 1183, type: !350, isLocal: true, isDefinition: true, scopeLine: 1185, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !352)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !98, !41, !88, !88}
!352 = !{!353, !354, !355, !356, !357, !360, !364, !365, !366, !369}
!353 = !DILocalVariable(name: "current_offset", arg: 1, scope: !349, file: !3, line: 1183, type: !98)
!354 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !349, file: !3, line: 1183, type: !41)
!355 = !DILocalVariable(name: "prev_block", arg: 3, scope: !349, file: !3, line: 1184, type: !88)
!356 = !DILocalVariable(name: "curr_block", arg: 4, scope: !349, file: !3, line: 1184, type: !88)
!357 = !DILocalVariable(name: "i", scope: !358, file: !3, line: 1208, type: !41)
!358 = distinct !DILexicalBlock(scope: !359, file: !3, line: 1207, column: 5)
!359 = distinct !DILexicalBlock(scope: !349, file: !3, line: 1191, column: 7)
!360 = !DILocalVariable(name: "datum_width", scope: !361, file: !3, line: 1213, type: !95)
!361 = distinct !DILexicalBlock(scope: !362, file: !3, line: 1212, column: 9)
!362 = distinct !DILexicalBlock(scope: !363, file: !3, line: 1211, column: 7)
!363 = distinct !DILexicalBlock(scope: !358, file: !3, line: 1211, column: 7)
!364 = !DILocalVariable(name: "fields_per_block", scope: !361, file: !3, line: 1214, type: !95)
!365 = !DILocalVariable(name: "blank_fields", scope: !361, file: !3, line: 1215, type: !95)
!366 = !DILocalVariable(name: "field_width", scope: !367, file: !3, line: 1226, type: !95)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 1224, column: 13)
!368 = distinct !DILexicalBlock(scope: !361, file: !3, line: 1223, column: 15)
!369 = !DILocalVariable(name: "pad_width", scope: !367, file: !3, line: 1227, type: !95)
!370 = !DIGlobalVariableExpression(var: !371)
!371 = distinct !DIGlobalVariable(name: "prev_pair_equal", scope: !349, file: !3, line: 1187, type: !117, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 288, elements: !345)
!373 = !DIGlobalVariableExpression(var: !374)
!374 = distinct !DIGlobalVariable(name: "Version", scope: !375, file: !376, line: 2, type: !88, isLocal: false, isDefinition: true)
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377, globals: !378)
!376 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!377 = !{}
!378 = !{!373}
!379 = !DIGlobalVariableExpression(var: !380)
!380 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !381, file: !386, line: 69, type: !387, isLocal: false, isDefinition: true)
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !382, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !383, retainedTypes: !384, globals: !385)
!382 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!383 = !{!73}
!384 = !{!39, !97}
!385 = !{!379}
!386 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !388, line: 55, baseType: !389)
!388 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{null}
!392 = !DIGlobalVariableExpression(var: !393)
!393 = distinct !DIGlobalVariable(name: "file_name", scope: !394, file: !399, line: 36, type: !88, isLocal: true, isDefinition: true)
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377, globals: !396)
!395 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!396 = !{!392, !397}
!397 = !DIGlobalVariableExpression(var: !398)
!398 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !394, file: !399, line: 46, type: !117, isLocal: true, isDefinition: true)
!399 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!400 = !DIGlobalVariableExpression(var: !401)
!401 = distinct !DIGlobalVariable(name: "exit_failure", scope: !402, file: !405, line: 24, type: !406, isLocal: false, isDefinition: true)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377, globals: !404)
!403 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!404 = !{!400}
!405 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!406 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !95)
!407 = !DIGlobalVariableExpression(var: !408)
!408 = distinct !DIGlobalVariable(name: "program_name", scope: !409, file: !413, line: 33, type: !88, isLocal: false, isDefinition: true)
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377, retainedTypes: !411, globals: !412)
!410 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!411 = !{!39, !91}
!412 = !{!407}
!413 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!414 = !DIGlobalVariableExpression(var: !415)
!415 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !416, file: !428, line: 77, type: !461, isLocal: false, isDefinition: true)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !418, retainedTypes: !424, globals: !425)
!417 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!418 = !{!73, !419, !54}
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !74, line: 242, size: 32, elements: !420)
!420 = !{!421, !422, !423}
!421 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!422 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!423 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!424 = !{!95, !96, !41, !91}
!425 = !{!414, !426, !433, !443, !445, !450, !457, !459}
!426 = !DIGlobalVariableExpression(var: !427)
!427 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !416, file: !428, line: 93, type: !429, isLocal: false, isDefinition: true)
!428 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 320, elements: !431)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!431 = !{!432}
!432 = !DISubrange(count: 10)
!433 = !DIGlobalVariableExpression(var: !434)
!434 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !416, file: !428, line: 1043, type: !435, isLocal: false, isDefinition: true)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !428, line: 57, size: 448, elements: !436)
!436 = !{!437, !438, !439, !441, !442}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !435, file: !428, line: 60, baseType: !73, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !435, file: !428, line: 63, baseType: !95, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !435, file: !428, line: 67, baseType: !440, size: 256, offset: 64)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 256, elements: !186)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !435, file: !428, line: 70, baseType: !88, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !435, file: !428, line: 73, baseType: !88, size: 64, offset: 384)
!443 = !DIGlobalVariableExpression(var: !444)
!444 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !416, file: !428, line: 108, type: !435, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446)
!446 = distinct !DIGlobalVariable(name: "slot0", scope: !416, file: !428, line: 834, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 2048, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 256)
!450 = !DIGlobalVariableExpression(var: !451)
!451 = distinct !DIGlobalVariable(name: "slotvec", scope: !416, file: !428, line: 837, type: !452, isLocal: true, isDefinition: true)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !428, line: 826, size: 128, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !453, file: !428, line: 828, baseType: !41, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !453, file: !428, line: 829, baseType: !91, size: 64, offset: 64)
!457 = !DIGlobalVariableExpression(var: !458)
!458 = distinct !DIGlobalVariable(name: "nslots", scope: !416, file: !428, line: 835, type: !95, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460)
!460 = distinct !DIGlobalVariable(name: "slotvec0", scope: !416, file: !428, line: 836, type: !453, isLocal: true, isDefinition: true)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 704, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 11)
!464 = !DIGlobalVariableExpression(var: !465)
!465 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !466, file: !469, line: 26, type: !470, isLocal: false, isDefinition: true)
!466 = distinct !DICompileUnit(language: DW_LANG_C99, file: !467, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377, globals: !468)
!467 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!468 = !{!464}
!469 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 376, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 47)
!473 = !DIGlobalVariableExpression(var: !474)
!474 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !475, file: !819, line: 120, type: !820, isLocal: true, isDefinition: true)
!475 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !477, retainedTypes: !816, globals: !818)
!476 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!477 = !{!478}
!478 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !479, line: 41, size: 32, elements: !480)
!479 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!480 = !{!481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815}
!481 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!482 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!483 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!484 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!485 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!486 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!487 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!488 = !DIEnumerator(name: "DAY_1", value: 131079)
!489 = !DIEnumerator(name: "DAY_2", value: 131080)
!490 = !DIEnumerator(name: "DAY_3", value: 131081)
!491 = !DIEnumerator(name: "DAY_4", value: 131082)
!492 = !DIEnumerator(name: "DAY_5", value: 131083)
!493 = !DIEnumerator(name: "DAY_6", value: 131084)
!494 = !DIEnumerator(name: "DAY_7", value: 131085)
!495 = !DIEnumerator(name: "ABMON_1", value: 131086)
!496 = !DIEnumerator(name: "ABMON_2", value: 131087)
!497 = !DIEnumerator(name: "ABMON_3", value: 131088)
!498 = !DIEnumerator(name: "ABMON_4", value: 131089)
!499 = !DIEnumerator(name: "ABMON_5", value: 131090)
!500 = !DIEnumerator(name: "ABMON_6", value: 131091)
!501 = !DIEnumerator(name: "ABMON_7", value: 131092)
!502 = !DIEnumerator(name: "ABMON_8", value: 131093)
!503 = !DIEnumerator(name: "ABMON_9", value: 131094)
!504 = !DIEnumerator(name: "ABMON_10", value: 131095)
!505 = !DIEnumerator(name: "ABMON_11", value: 131096)
!506 = !DIEnumerator(name: "ABMON_12", value: 131097)
!507 = !DIEnumerator(name: "MON_1", value: 131098)
!508 = !DIEnumerator(name: "MON_2", value: 131099)
!509 = !DIEnumerator(name: "MON_3", value: 131100)
!510 = !DIEnumerator(name: "MON_4", value: 131101)
!511 = !DIEnumerator(name: "MON_5", value: 131102)
!512 = !DIEnumerator(name: "MON_6", value: 131103)
!513 = !DIEnumerator(name: "MON_7", value: 131104)
!514 = !DIEnumerator(name: "MON_8", value: 131105)
!515 = !DIEnumerator(name: "MON_9", value: 131106)
!516 = !DIEnumerator(name: "MON_10", value: 131107)
!517 = !DIEnumerator(name: "MON_11", value: 131108)
!518 = !DIEnumerator(name: "MON_12", value: 131109)
!519 = !DIEnumerator(name: "AM_STR", value: 131110)
!520 = !DIEnumerator(name: "PM_STR", value: 131111)
!521 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!522 = !DIEnumerator(name: "D_FMT", value: 131113)
!523 = !DIEnumerator(name: "T_FMT", value: 131114)
!524 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!525 = !DIEnumerator(name: "ERA", value: 131116)
!526 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!527 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!528 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!529 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!530 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!531 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!532 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!533 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!534 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!535 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!536 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!537 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!538 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!539 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!540 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!541 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!542 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!543 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!544 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!545 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!546 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!547 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!548 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!549 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!550 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!551 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!552 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!553 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!554 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!555 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!556 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!557 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!558 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!559 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!560 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!561 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!562 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!563 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!564 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!565 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!566 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!567 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!568 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!569 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!570 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!571 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!572 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!573 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!574 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!575 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!576 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!577 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!578 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!579 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!580 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!581 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!582 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!583 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!584 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!585 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!586 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!587 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!588 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!589 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!590 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!591 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!592 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!593 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!594 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!595 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!596 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!597 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!598 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!599 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!600 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!601 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!602 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!603 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!604 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!605 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!606 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!607 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!608 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!609 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!610 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!611 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!612 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!613 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!614 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!615 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!616 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!617 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!618 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!619 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!620 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!621 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!622 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!623 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!624 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!625 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!626 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!627 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!628 = !DIEnumerator(name: "CODESET", value: 14)
!629 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!630 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!631 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!632 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!633 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!634 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!635 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!636 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!637 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!638 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!639 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!640 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!641 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!642 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!643 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!644 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!645 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!646 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!647 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!648 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!649 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!650 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!651 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!652 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!653 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!654 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!655 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!656 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!657 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!658 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!659 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!660 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!661 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!662 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!663 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!664 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!665 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!666 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!667 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!668 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!669 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!670 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!671 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!672 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!673 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!674 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!675 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!676 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!677 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!678 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!679 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!680 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!681 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!682 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!683 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!684 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!685 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!686 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!687 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!688 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!689 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!690 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!691 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!692 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!693 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!694 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!695 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!696 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!697 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!698 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!699 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!700 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!701 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!702 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!703 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!704 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!705 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!706 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!707 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!708 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!709 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!710 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!711 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!712 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!713 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!714 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!715 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!716 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!717 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!718 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!719 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!720 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!721 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!722 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!723 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!724 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!725 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!726 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!727 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!728 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!729 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!730 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!731 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!732 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!733 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!734 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!735 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!736 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!737 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!738 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!739 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!740 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!741 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!742 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!743 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!744 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!745 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!746 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!747 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!748 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!749 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!750 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!751 = !DIEnumerator(name: "THOUSEP", value: 65537)
!752 = !DIEnumerator(name: "__GROUPING", value: 65538)
!753 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!754 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!755 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!756 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!757 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!758 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!759 = !DIEnumerator(name: "__YESSTR", value: 327682)
!760 = !DIEnumerator(name: "__NOSTR", value: 327683)
!761 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!762 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!763 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!764 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!765 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!766 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!767 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!768 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!769 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!770 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!771 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!772 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!773 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!774 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!775 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!776 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!777 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!778 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!779 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!780 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!781 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!782 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!783 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!784 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!785 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!786 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!787 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!788 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!789 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!790 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!791 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!792 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!793 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!794 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!795 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!796 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!797 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!798 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!799 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!800 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!801 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!802 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!803 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!804 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!805 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!806 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!807 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!808 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!809 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!810 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!811 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!812 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!813 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!814 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!815 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!816 = !{!39, !91, !817}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!818 = !{!473}
!819 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!820 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !88)
!821 = distinct !DICompileUnit(language: DW_LANG_C99, file: !822, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !823)
!822 = !DIFile(filename: "./lib/dtoastr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!823 = !{!824}
!824 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !825, line: 52, size: 32, elements: !826)
!825 = !DIFile(filename: "./lib/ftoastr.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!826 = !{!827, !828, !829, !830, !831}
!827 = !DIEnumerator(name: "FTOASTR_LEFT_JUSTIFY", value: 1)
!828 = !DIEnumerator(name: "FTOASTR_ALWAYS_SIGNED", value: 2)
!829 = !DIEnumerator(name: "FTOASTR_SPACE_POSITIVE", value: 4)
!830 = !DIEnumerator(name: "FTOASTR_ZERO_PAD", value: 8)
!831 = !DIEnumerator(name: "FTOASTR_UPPER_E", value: 16)
!832 = distinct !DICompileUnit(language: DW_LANG_C99, file: !833, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !823)
!833 = !DIFile(filename: "./lib/ftoastr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !823)
!835 = !DIFile(filename: "./lib/ldtoastr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!836 = distinct !DICompileUnit(language: DW_LANG_C99, file: !837, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !838, retainedTypes: !843)
!837 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!838 = !{!839}
!839 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !840, line: 41, size: 32, elements: !841)
!840 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!841 = !{!842}
!842 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!843 = !{!39}
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !846, retainedTypes: !854)
!845 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!846 = !{!847}
!847 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !848, file: !35, line: 192, size: 32, elements: !49)
!848 = distinct !DISubprogram(name: "x2nrealloc", scope: !35, file: !35, line: 180, type: !37, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !844, variables: !849)
!849 = !{!850, !851, !852, !853}
!850 = !DILocalVariable(name: "p", arg: 1, scope: !848, file: !35, line: 180, type: !39)
!851 = !DILocalVariable(name: "pn", arg: 2, scope: !848, file: !35, line: 180, type: !40)
!852 = !DILocalVariable(name: "s", arg: 3, scope: !848, file: !35, line: 180, type: !41)
!853 = !DILocalVariable(name: "n", scope: !848, file: !35, line: 182, type: !41)
!854 = !{!41, !91, !39}
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377)
!856 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377)
!858 = !DIFile(filename: "./lib/xprintf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !861)
!860 = !DIFile(filename: "./lib/xstrtol-error.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!861 = !{!17}
!862 = distinct !DICompileUnit(language: DW_LANG_C99, file: !863, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !864, retainedTypes: !865)
!863 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!864 = !{!17, !54}
!865 = !{!95, !96}
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377, retainedTypes: !843)
!867 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!868 = distinct !DICompileUnit(language: DW_LANG_C99, file: !869, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377)
!869 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377, retainedTypes: !843)
!871 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377, retainedTypes: !843)
!873 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377, retainedTypes: !876)
!875 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!876 = !{!41}
!877 = distinct !DICompileUnit(language: DW_LANG_C99, file: !878, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377)
!878 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377)
!880 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!881 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!882 = !{i32 2, !"Dwarf Version", i32 4}
!883 = !{i32 2, !"Debug Info Version", i32 3}
!884 = !{i32 1, !"wchar_size", i32 4}
!885 = !{i32 7, !"PIC Level", i32 2}
!886 = !{i32 7, !"PIE Level", i32 2}
!887 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 316, type: !888, isLocal: false, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !890)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !95}
!890 = !{!891}
!891 = !DILocalVariable(name: "status", arg: 1, scope: !887, file: !3, line: 316, type: !95)
!892 = !DIExpression()
!893 = !DILocation(line: 316, column: 12, scope: !887)
!894 = !DILocation(line: 318, column: 14, scope: !895)
!895 = distinct !DILexicalBlock(scope: !887, file: !3, line: 318, column: 7)
!896 = !DILocation(line: 318, column: 7, scope: !887)
!897 = !DILocation(line: 319, column: 5, scope: !898)
!898 = distinct !DILexicalBlock(scope: !895, file: !3, line: 319, column: 5)
!899 = !{!900, !900, i64 0}
!900 = !{!"any pointer", !901, i64 0}
!901 = !{!"omnipotent char", !902, i64 0}
!902 = !{!"Simple C/C++ TBAA"}
!903 = !DILocation(line: 322, column: 7, scope: !904)
!904 = distinct !DILexicalBlock(scope: !895, file: !3, line: 321, column: 5)
!905 = !DILocation(line: 328, column: 7, scope: !904)
!906 = !DILocation(line: 580, column: 3, scope: !907, inlinedAt: !908)
!907 = distinct !DISubprogram(name: "emit_stdin_note", scope: !267, file: !267, line: 578, type: !390, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !377)
!908 = distinct !DILocation(line: 334, column: 7, scope: !904)
!909 = !DILocation(line: 336, column: 7, scope: !904)
!910 = !DILocation(line: 587, column: 3, scope: !911, inlinedAt: !912)
!911 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !267, file: !267, line: 585, type: !390, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !377)
!912 = distinct !DILocation(line: 346, column: 7, scope: !904)
!913 = !DILocation(line: 348, column: 7, scope: !904)
!914 = !DILocation(line: 354, column: 7, scope: !904)
!915 = !DILocation(line: 365, column: 7, scope: !904)
!916 = !DILocation(line: 366, column: 7, scope: !904)
!917 = !DILocation(line: 367, column: 7, scope: !904)
!918 = !DILocation(line: 376, column: 7, scope: !904)
!919 = !DILocation(line: 384, column: 7, scope: !904)
!920 = !DILocation(line: 391, column: 7, scope: !904)
!921 = !DILocation(line: 398, column: 7, scope: !904)
!922 = !DILocation(line: 405, column: 7, scope: !904)
!923 = !DILocation(line: 410, column: 7, scope: !904)
!924 = !DILocation(line: 642, column: 15, scope: !266, inlinedAt: !925)
!925 = distinct !DILocation(line: 421, column: 7, scope: !904)
!926 = !DILocation(line: 651, column: 3, scope: !266, inlinedAt: !925)
!927 = !DILocation(line: 655, column: 29, scope: !266, inlinedAt: !925)
!928 = !DILocation(line: 655, column: 15, scope: !266, inlinedAt: !925)
!929 = !DILocation(line: 656, column: 7, scope: !930, inlinedAt: !925)
!930 = distinct !DILexicalBlock(scope: !266, file: !267, line: 656, column: 7)
!931 = !DILocation(line: 656, column: 19, scope: !930, inlinedAt: !925)
!932 = !DILocation(line: 656, column: 22, scope: !930, inlinedAt: !925)
!933 = !DILocation(line: 656, column: 7, scope: !266, inlinedAt: !925)
!934 = !DILocation(line: 662, column: 7, scope: !935, inlinedAt: !925)
!935 = distinct !DILexicalBlock(scope: !930, file: !267, line: 657, column: 5)
!936 = !DILocation(line: 664, column: 5, scope: !935, inlinedAt: !925)
!937 = !DILocation(line: 665, column: 3, scope: !266, inlinedAt: !925)
!938 = !DILocation(line: 667, column: 3, scope: !266, inlinedAt: !925)
!939 = !DILocation(line: 423, column: 3, scope: !887)
!940 = !DILocalVariable(name: "block", scope: !941, file: !3, line: 1375, type: !957)
!941 = distinct !DISubprogram(name: "dump", scope: !3, file: !3, line: 1373, type: !942, isLocal: true, isDefinition: true, scopeLine: 1374, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !944)
!942 = !DISubroutineType(types: !943)
!943 = !{!117}
!944 = !{!940, !945, !946, !947, !948, !949, !953, !956}
!945 = !DILocalVariable(name: "current_offset", scope: !941, file: !3, line: 1376, type: !98)
!946 = !DILocalVariable(name: "idx", scope: !941, file: !3, line: 1377, type: !117)
!947 = !DILocalVariable(name: "ok", scope: !941, file: !3, line: 1378, type: !117)
!948 = !DILocalVariable(name: "n_bytes_read", scope: !941, file: !3, line: 1379, type: !41)
!949 = !DILocalVariable(name: "n_needed", scope: !950, file: !3, line: 1390, type: !41)
!950 = distinct !DILexicalBlock(scope: !951, file: !3, line: 1389, column: 9)
!951 = distinct !DILexicalBlock(scope: !952, file: !3, line: 1387, column: 5)
!952 = distinct !DILexicalBlock(scope: !941, file: !3, line: 1386, column: 7)
!953 = !DILocalVariable(name: "l_c_m", scope: !954, file: !3, line: 1425, type: !95)
!954 = distinct !DILexicalBlock(scope: !955, file: !3, line: 1424, column: 5)
!955 = distinct !DILexicalBlock(scope: !941, file: !3, line: 1423, column: 7)
!956 = !DILocalVariable(name: "bytes_to_write", scope: !954, file: !3, line: 1426, type: !41)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 128, elements: !329)
!958 = !DILocation(line: 1375, column: 9, scope: !941, inlinedAt: !959)
!959 = distinct !DILocation(line: 1977, column: 48, scope: !105)
!960 = !DILocalVariable(name: "buf", scope: !961, file: !3, line: 1065, type: !1010)
!961 = distinct !DILexicalBlock(scope: !962, file: !3, line: 1064, column: 13)
!962 = distinct !DILexicalBlock(scope: !963, file: !3, line: 1043, column: 15)
!963 = distinct !DILexicalBlock(scope: !964, file: !3, line: 1035, column: 9)
!964 = distinct !DILexicalBlock(scope: !965, file: !3, line: 1034, column: 11)
!965 = distinct !DILexicalBlock(scope: !966, file: !3, line: 1021, column: 5)
!966 = distinct !DISubprogram(name: "skip", scope: !3, file: !3, line: 1012, type: !967, isLocal: true, isDefinition: true, scopeLine: 1013, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !969)
!967 = !DISubroutineType(types: !968)
!968 = !{!117, !98}
!969 = !{!970, !971, !972, !973, !960, !1008, !1009}
!970 = !DILocalVariable(name: "n_skip", arg: 1, scope: !966, file: !3, line: 1012, type: !98)
!971 = !DILocalVariable(name: "ok", scope: !966, file: !3, line: 1014, type: !117)
!972 = !DILocalVariable(name: "in_errno", scope: !966, file: !3, line: 1015, type: !95)
!973 = !DILocalVariable(name: "file_stats", scope: !965, file: !3, line: 1022, type: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !975, line: 46, size: 1152, elements: !976)
!975 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!976 = !{!977, !979, !981, !983, !985, !987, !989, !990, !991, !992, !994, !996, !1004, !1005, !1006}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !974, file: !975, line: 48, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !101, line: 133, baseType: !43)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !974, file: !975, line: 53, baseType: !980, size: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !101, line: 136, baseType: !43)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !974, file: !975, line: 61, baseType: !982, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !101, line: 139, baseType: !43)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !974, file: !975, line: 62, baseType: !984, size: 32, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !101, line: 138, baseType: !92)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !974, file: !975, line: 64, baseType: !986, size: 32, offset: 224)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !101, line: 134, baseType: !92)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !974, file: !975, line: 65, baseType: !988, size: 32, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !101, line: 135, baseType: !92)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !974, file: !975, line: 67, baseType: !95, size: 32, offset: 288)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !974, file: !975, line: 69, baseType: !978, size: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !974, file: !975, line: 74, baseType: !231, size: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !974, file: !975, line: 78, baseType: !993, size: 64, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !101, line: 162, baseType: !232)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !974, file: !975, line: 80, baseType: !995, size: 64, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !101, line: 167, baseType: !232)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !974, file: !975, line: 91, baseType: !997, size: 128, offset: 576)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !998, line: 8, size: 128, elements: !999)
!998 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!999 = !{!1000, !1002}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !997, file: !998, line: 10, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !101, line: 148, baseType: !232)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !997, file: !998, line: 11, baseType: !1003, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !101, line: 184, baseType: !232)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !974, file: !975, line: 92, baseType: !997, size: 128, offset: 704)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !974, file: !975, line: 93, baseType: !997, size: 128, offset: 832)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !974, file: !975, line: 106, baseType: !1007, size: 192, offset: 960)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1003, size: 192, elements: !334)
!1008 = !DILocalVariable(name: "n_bytes_read", scope: !961, file: !3, line: 1066, type: !41)
!1009 = !DILocalVariable(name: "n_bytes_to_read", scope: !961, file: !3, line: 1066, type: !41)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 65536, elements: !1011)
!1011 = !{!1012}
!1012 = !DISubrange(count: 8192)
!1013 = !DILocation(line: 1065, column: 20, scope: !961, inlinedAt: !1014)
!1014 = distinct !DILocation(line: 1920, column: 9, scope: !105)
!1015 = !DILocation(line: 1566, column: 11, scope: !105)
!1016 = !DILocation(line: 1566, column: 24, scope: !105)
!1017 = !DILocation(line: 1572, column: 8, scope: !105)
!1018 = !DILocation(line: 1573, column: 8, scope: !105)
!1019 = !DILocation(line: 1574, column: 8, scope: !105)
!1020 = !DILocation(line: 1575, column: 10, scope: !105)
!1021 = !DILocation(line: 1583, column: 21, scope: !105)
!1022 = !DILocation(line: 1583, column: 3, scope: !105)
!1023 = !DILocation(line: 1584, column: 3, scope: !105)
!1024 = !DILocation(line: 1585, column: 3, scope: !105)
!1025 = !DILocation(line: 1586, column: 3, scope: !105)
!1026 = !DILocation(line: 1588, column: 3, scope: !105)
!1027 = !DILocation(line: 1569, column: 10, scope: !105)
!1028 = !DILocation(line: 1591, column: 27, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 1590, column: 3)
!1030 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1590, column: 3)
!1031 = !DILocation(line: 1593, column: 37, scope: !105)
!1032 = !{!901, !901, i64 0}
!1033 = !DILocation(line: 1594, column: 42, scope: !105)
!1034 = !DILocation(line: 1595, column: 36, scope: !105)
!1035 = !DILocation(line: 1600, column: 55, scope: !105)
!1036 = !DILocation(line: 1604, column: 21, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 1603, column: 3)
!1038 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1603, column: 3)
!1039 = !DILocation(line: 1606, column: 32, scope: !105)
!1040 = !DILocation(line: 1610, column: 38, scope: !105)
!1041 = !DILocation(line: 1611, column: 33, scope: !105)
!1042 = !DILocation(line: 1613, column: 11, scope: !105)
!1043 = !{!1044, !1044, i64 0}
!1044 = !{!"long", !901, i64 0}
!1045 = !DILocation(line: 1614, column: 21, scope: !105)
!1046 = !DILocation(line: 1615, column: 8, scope: !105)
!1047 = !DILocation(line: 1617, column: 18, scope: !105)
!1048 = !DILocation(line: 1618, column: 16, scope: !105)
!1049 = !{!1050, !1050, i64 0}
!1050 = !{!"int", !901, i64 0}
!1051 = !DILocation(line: 1619, column: 19, scope: !105)
!1052 = !DILocation(line: 1622, column: 3, scope: !105)
!1053 = !DILocation(line: 1571, column: 10, scope: !105)
!1054 = !DILocation(line: 1624, column: 7, scope: !123)
!1055 = !DILocation(line: 1626, column: 7, scope: !123)
!1056 = !DILocation(line: 1626, column: 11, scope: !123)
!1057 = !DILocation(line: 1627, column: 15, scope: !123)
!1058 = !DILocation(line: 1627, column: 11, scope: !123)
!1059 = !DILocation(line: 1628, column: 11, scope: !123)
!1060 = !DILocation(line: 1635, column: 19, scope: !130)
!1061 = !DILocation(line: 1635, column: 11, scope: !130)
!1062 = !DILocation(line: 1638, column: 30, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1636, column: 13)
!1064 = !DILocation(line: 1639, column: 28, scope: !1063)
!1065 = !DILocation(line: 1641, column: 15, scope: !1063)
!1066 = !DILocation(line: 1643, column: 30, scope: !1063)
!1067 = !DILocation(line: 1644, column: 28, scope: !1063)
!1068 = !DILocation(line: 1646, column: 15, scope: !1063)
!1069 = !DILocation(line: 1648, column: 30, scope: !1063)
!1070 = !DILocation(line: 1649, column: 28, scope: !1063)
!1071 = !DILocation(line: 1651, column: 15, scope: !1063)
!1072 = !DILocation(line: 1653, column: 30, scope: !1063)
!1073 = !DILocation(line: 1655, column: 15, scope: !1063)
!1074 = !DILocation(line: 1657, column: 15, scope: !1063)
!1075 = !DILocation(line: 1663, column: 11, scope: !130)
!1076 = !DILocation(line: 1667, column: 31, scope: !130)
!1077 = !DILocation(line: 1667, column: 19, scope: !130)
!1078 = !DILocation(line: 1625, column: 25, scope: !123)
!1079 = !DILocation(line: 1668, column: 21, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1668, column: 15)
!1081 = !DILocation(line: 1668, column: 15, scope: !130)
!1082 = !DILocation(line: 1669, column: 35, scope: !1080)
!1083 = !DILocation(line: 1669, column: 56, scope: !1080)
!1084 = !DILocation(line: 1669, column: 13, scope: !1080)
!1085 = !DILocation(line: 1676, column: 31, scope: !130)
!1086 = !DILocation(line: 1676, column: 19, scope: !130)
!1087 = !DILocation(line: 1678, column: 21, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1678, column: 15)
!1089 = !DILocation(line: 1678, column: 15, scope: !130)
!1090 = !DILocation(line: 1679, column: 35, scope: !1088)
!1091 = !DILocation(line: 1679, column: 56, scope: !1088)
!1092 = !DILocation(line: 1679, column: 13, scope: !1088)
!1093 = !DILocation(line: 1684, column: 15, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1684, column: 15)
!1095 = !DILocation(line: 1684, column: 22, scope: !1094)
!1096 = !DILocation(line: 1684, column: 15, scope: !130)
!1097 = !DILocation(line: 1624, column: 17, scope: !123)
!1098 = !DILocation(line: 1688, column: 23, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1094, file: !3, line: 1687, column: 13)
!1100 = !DILocation(line: 1689, column: 25, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 1689, column: 19)
!1102 = !DILocation(line: 1689, column: 19, scope: !1099)
!1103 = !DILocation(line: 1690, column: 39, scope: !1101)
!1104 = !DILocation(line: 1690, column: 60, scope: !1101)
!1105 = !DILocation(line: 1690, column: 17, scope: !1101)
!1106 = !DILocation(line: 1694, column: 30, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 1694, column: 19)
!1108 = !DILocation(line: 1700, column: 11, scope: !130)
!1109 = !DILocation(line: 1704, column: 39, scope: !130)
!1110 = !DILocation(line: 1704, column: 17, scope: !130)
!1111 = !DILocation(line: 1704, column: 14, scope: !130)
!1112 = !DILocation(line: 1705, column: 11, scope: !130)
!1113 = !DILocation(line: 1710, column: 11, scope: !130)
!1114 = !DILocation(line: 1714, column: 11, scope: !130)
!1115 = !DILocation(line: 1717, column: 19, scope: !130)
!1116 = !DILocation(line: 1717, column: 11, scope: !130)
!1117 = !DILocation(line: 1721, column: 19, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1718, column: 13)
!1119 = !{!1120, !1120, i64 0}
!1120 = !{!"_Bool", !901, i64 0}
!1121 = !DILocation(line: 1726, column: 11, scope: !130)
!1122 = !DILocation(line: 1740, column: 11, scope: !130)
!1123 = !DILocation(line: 1741, column: 11, scope: !130)
!1124 = !DILocation(line: 1742, column: 11, scope: !130)
!1125 = !DILocation(line: 1743, column: 11, scope: !130)
!1126 = !DILocation(line: 1744, column: 11, scope: !130)
!1127 = !DILocation(line: 1746, column: 11, scope: !130)
!1128 = !DILocation(line: 1747, column: 11, scope: !130)
!1129 = !DILocation(line: 1749, column: 11, scope: !130)
!1130 = !DILocation(line: 1750, column: 11, scope: !130)
!1131 = !DILocation(line: 1752, column: 11, scope: !130)
!1132 = !DILocation(line: 1753, column: 11, scope: !130)
!1133 = !DILocation(line: 1755, column: 11, scope: !130)
!1134 = !DILocation(line: 1756, column: 11, scope: !130)
!1135 = !DILocation(line: 1758, column: 11, scope: !130)
!1136 = !DILocation(line: 1765, column: 15, scope: !129)
!1137 = !DILocation(line: 1765, column: 22, scope: !129)
!1138 = !DILocation(line: 1765, column: 15, scope: !130)
!1139 = !DILocation(line: 1771, column: 15, scope: !128)
!1140 = !DILocation(line: 1771, column: 25, scope: !128)
!1141 = !DILocation(line: 1772, column: 23, scope: !128)
!1142 = !DILocation(line: 1773, column: 25, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !128, file: !3, line: 1773, column: 19)
!1144 = !DILocation(line: 1773, column: 19, scope: !128)
!1145 = !DILocation(line: 1774, column: 39, scope: !1143)
!1146 = !DILocation(line: 1774, column: 60, scope: !1143)
!1147 = !DILocation(line: 1774, column: 17, scope: !1143)
!1148 = !DILocation(line: 1775, column: 30, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !128, file: !3, line: 1775, column: 19)
!1150 = !DILocation(line: 1778, column: 13, scope: !129)
!1151 = !DILocation(line: 1781, column: 9, scope: !130)
!1152 = !DILocation(line: 1783, column: 9, scope: !130)
!1153 = !DILocation(line: 1786, column: 11, scope: !130)
!1154 = !DILocation(line: 1789, column: 5, scope: !105)
!1155 = distinct !{!1155, !1052, !1154}
!1156 = !DILocation(line: 1791, column: 8, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1791, column: 7)
!1158 = !DILocation(line: 1791, column: 7, scope: !105)
!1159 = !DILocation(line: 1794, column: 28, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1794, column: 7)
!1161 = !DILocation(line: 1794, column: 36, scope: !1160)
!1162 = !DILocation(line: 1794, column: 25, scope: !1160)
!1163 = !DILocation(line: 1795, column: 5, scope: !1160)
!1164 = !DILocation(line: 1798, column: 20, scope: !105)
!1165 = !DILocation(line: 1798, column: 18, scope: !105)
!1166 = !DILocation(line: 1568, column: 7, scope: !105)
!1167 = !DILocation(line: 1812, column: 8, scope: !133)
!1168 = !DILocation(line: 1812, column: 15, scope: !133)
!1169 = !DILocation(line: 1812, column: 7, scope: !105)
!1170 = !DILocation(line: 1814, column: 7, scope: !132)
!1171 = !DILocation(line: 1815, column: 7, scope: !132)
!1172 = !DILocation(line: 1817, column: 7, scope: !132)
!1173 = !DILocation(line: 1820, column: 28, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 1820, column: 15)
!1175 = distinct !DILexicalBlock(scope: !132, file: !3, line: 1818, column: 9)
!1176 = !DILocation(line: 1820, column: 47, scope: !1174)
!1177 = !DILocation(line: 1821, column: 15, scope: !1174)
!1178 = !DILocation(line: 1814, column: 17, scope: !132)
!1179 = !DILocalVariable(name: "s", arg: 1, scope: !1180, file: !3, line: 1333, type: !88)
!1180 = distinct !DISubprogram(name: "parse_old_offset", scope: !3, file: !3, line: 1333, type: !1181, isLocal: true, isDefinition: true, scopeLine: 1334, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1184)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!117, !88, !1183}
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!1184 = !{!1179, !1185, !1186}
!1185 = !DILocalVariable(name: "offset", arg: 2, scope: !1180, file: !3, line: 1333, type: !1183)
!1186 = !DILocalVariable(name: "radix", scope: !1180, file: !3, line: 1335, type: !95)
!1187 = !DILocation(line: 1333, column: 31, scope: !1180, inlinedAt: !1188)
!1188 = distinct !DILocation(line: 1821, column: 18, scope: !1174)
!1189 = !DILocation(line: 1333, column: 45, scope: !1180, inlinedAt: !1188)
!1190 = !DILocation(line: 1337, column: 7, scope: !1180, inlinedAt: !1188)
!1191 = !DILocation(line: 1342, column: 5, scope: !1192, inlinedAt: !1188)
!1192 = distinct !DILexicalBlock(scope: !1180, file: !3, line: 1341, column: 7)
!1193 = !DILocation(line: 1347, column: 7, scope: !1194, inlinedAt: !1188)
!1194 = distinct !DILexicalBlock(scope: !1180, file: !3, line: 1347, column: 7)
!1195 = !DILocation(line: 1347, column: 23, scope: !1194, inlinedAt: !1188)
!1196 = !DILocation(line: 1347, column: 7, scope: !1180, inlinedAt: !1188)
!1197 = !DILocation(line: 1351, column: 11, scope: !1198, inlinedAt: !1188)
!1198 = distinct !DILexicalBlock(scope: !1199, file: !3, line: 1351, column: 11)
!1199 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 1350, column: 5)
!1200 = !DILocation(line: 1351, column: 16, scope: !1198, inlinedAt: !1188)
!1201 = !DILocation(line: 1351, column: 23, scope: !1198, inlinedAt: !1188)
!1202 = !DILocation(line: 1351, column: 27, scope: !1198, inlinedAt: !1188)
!1203 = !DILocation(line: 1351, column: 39, scope: !1198, inlinedAt: !1188)
!1204 = !DILocation(line: 1335, column: 7, scope: !1180, inlinedAt: !1188)
!1205 = !DILocation(line: 1357, column: 10, scope: !1180, inlinedAt: !1188)
!1206 = !DILocation(line: 1357, column: 52, scope: !1180, inlinedAt: !1188)
!1207 = !DILocation(line: 1820, column: 15, scope: !1175)
!1208 = !DILocation(line: 1823, column: 33, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1174, file: !3, line: 1822, column: 13)
!1210 = !DILocation(line: 1823, column: 31, scope: !1209)
!1211 = !DILocation(line: 1825, column: 15, scope: !1209)
!1212 = !DILocation(line: 1826, column: 13, scope: !1209)
!1213 = !DILocation(line: 1830, column: 28, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 1830, column: 15)
!1215 = !DILocation(line: 1830, column: 31, scope: !1214)
!1216 = !DILocation(line: 1830, column: 51, scope: !1214)
!1217 = !DILocation(line: 1831, column: 16, scope: !1214)
!1218 = !DILocation(line: 1831, column: 19, scope: !1214)
!1219 = !DILocation(line: 1832, column: 15, scope: !1214)
!1220 = !DILocation(line: 1832, column: 36, scope: !1214)
!1221 = !DILocation(line: 1815, column: 17, scope: !132)
!1222 = !DILocation(line: 1333, column: 31, scope: !1180, inlinedAt: !1223)
!1223 = distinct !DILocation(line: 1832, column: 18, scope: !1214)
!1224 = !DILocation(line: 1333, column: 45, scope: !1180, inlinedAt: !1223)
!1225 = !DILocation(line: 1337, column: 7, scope: !1226, inlinedAt: !1223)
!1226 = distinct !DILexicalBlock(scope: !1180, file: !3, line: 1337, column: 7)
!1227 = !DILocation(line: 1337, column: 7, scope: !1180, inlinedAt: !1223)
!1228 = !DILocation(line: 1342, column: 5, scope: !1192, inlinedAt: !1223)
!1229 = !DILocation(line: 1347, column: 7, scope: !1194, inlinedAt: !1223)
!1230 = !DILocation(line: 1347, column: 23, scope: !1194, inlinedAt: !1223)
!1231 = !DILocation(line: 1347, column: 7, scope: !1180, inlinedAt: !1223)
!1232 = !DILocation(line: 1351, column: 11, scope: !1198, inlinedAt: !1223)
!1233 = !DILocation(line: 1351, column: 16, scope: !1198, inlinedAt: !1223)
!1234 = !DILocation(line: 1351, column: 23, scope: !1198, inlinedAt: !1223)
!1235 = !DILocation(line: 1351, column: 27, scope: !1198, inlinedAt: !1223)
!1236 = !DILocation(line: 1351, column: 39, scope: !1198, inlinedAt: !1223)
!1237 = !DILocation(line: 1335, column: 7, scope: !1180, inlinedAt: !1223)
!1238 = !DILocation(line: 1357, column: 10, scope: !1180, inlinedAt: !1223)
!1239 = !DILocation(line: 1357, column: 52, scope: !1180, inlinedAt: !1223)
!1240 = !DILocation(line: 1830, column: 15, scope: !1175)
!1241 = !DILocation(line: 1834, column: 31, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 1834, column: 19)
!1243 = distinct !DILexicalBlock(scope: !1214, file: !3, line: 1833, column: 13)
!1244 = !DILocation(line: 1834, column: 57, scope: !1242)
!1245 = !DILocation(line: 1834, column: 52, scope: !1242)
!1246 = !DILocation(line: 1333, column: 31, scope: !1180, inlinedAt: !1247)
!1247 = distinct !DILocation(line: 1834, column: 34, scope: !1242)
!1248 = !DILocation(line: 1333, column: 45, scope: !1180, inlinedAt: !1247)
!1249 = !DILocation(line: 1337, column: 7, scope: !1226, inlinedAt: !1247)
!1250 = !DILocation(line: 1337, column: 7, scope: !1180, inlinedAt: !1247)
!1251 = !DILocation(line: 1342, column: 5, scope: !1192, inlinedAt: !1247)
!1252 = !DILocation(line: 1347, column: 7, scope: !1194, inlinedAt: !1247)
!1253 = !DILocation(line: 1347, column: 23, scope: !1194, inlinedAt: !1247)
!1254 = !DILocation(line: 1347, column: 7, scope: !1180, inlinedAt: !1247)
!1255 = !DILocation(line: 1351, column: 11, scope: !1198, inlinedAt: !1247)
!1256 = !DILocation(line: 1351, column: 16, scope: !1198, inlinedAt: !1247)
!1257 = !DILocation(line: 1351, column: 23, scope: !1198, inlinedAt: !1247)
!1258 = !DILocation(line: 1351, column: 27, scope: !1198, inlinedAt: !1247)
!1259 = !DILocation(line: 1351, column: 39, scope: !1198, inlinedAt: !1247)
!1260 = !DILocation(line: 1335, column: 7, scope: !1180, inlinedAt: !1247)
!1261 = !DILocation(line: 1357, column: 10, scope: !1180, inlinedAt: !1247)
!1262 = !DILocation(line: 1357, column: 52, scope: !1180, inlinedAt: !1247)
!1263 = !DILocation(line: 1834, column: 19, scope: !1243)
!1264 = !DILocation(line: 1836, column: 37, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1242, file: !3, line: 1835, column: 17)
!1266 = !DILocation(line: 1836, column: 35, scope: !1265)
!1267 = !DILocation(line: 1838, column: 34, scope: !1265)
!1268 = !DILocation(line: 1580, column: 13, scope: !105)
!1269 = !DILocation(line: 1839, column: 24, scope: !1265)
!1270 = !DILocation(line: 1841, column: 17, scope: !1265)
!1271 = !DILocation(line: 1844, column: 37, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1242, file: !3, line: 1843, column: 17)
!1273 = !DILocation(line: 1844, column: 35, scope: !1272)
!1274 = !DILocation(line: 1846, column: 43, scope: !1272)
!1275 = !DILocation(line: 1846, column: 38, scope: !1272)
!1276 = !DILocation(line: 1846, column: 31, scope: !1272)
!1277 = !DILocation(line: 1846, column: 19, scope: !1272)
!1278 = !DILocation(line: 1846, column: 36, scope: !1272)
!1279 = !DILocation(line: 1847, column: 19, scope: !1272)
!1280 = !DILocation(line: 1854, column: 15, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 1853, column: 15)
!1282 = !DILocation(line: 1854, column: 48, scope: !1281)
!1283 = !DILocation(line: 1854, column: 36, scope: !1281)
!1284 = !DILocation(line: 1333, column: 31, scope: !1180, inlinedAt: !1285)
!1285 = distinct !DILocation(line: 1854, column: 18, scope: !1281)
!1286 = !DILocation(line: 1333, column: 45, scope: !1180, inlinedAt: !1285)
!1287 = !DILocation(line: 1337, column: 7, scope: !1226, inlinedAt: !1285)
!1288 = !DILocation(line: 1337, column: 7, scope: !1180, inlinedAt: !1285)
!1289 = !DILocation(line: 1342, column: 5, scope: !1192, inlinedAt: !1285)
!1290 = !DILocation(line: 1347, column: 7, scope: !1194, inlinedAt: !1285)
!1291 = !DILocation(line: 1347, column: 23, scope: !1194, inlinedAt: !1285)
!1292 = !DILocation(line: 1347, column: 7, scope: !1180, inlinedAt: !1285)
!1293 = !DILocation(line: 1351, column: 11, scope: !1198, inlinedAt: !1285)
!1294 = !DILocation(line: 1351, column: 16, scope: !1198, inlinedAt: !1285)
!1295 = !DILocation(line: 1351, column: 23, scope: !1198, inlinedAt: !1285)
!1296 = !DILocation(line: 1351, column: 27, scope: !1198, inlinedAt: !1285)
!1297 = !DILocation(line: 1351, column: 39, scope: !1198, inlinedAt: !1285)
!1298 = !DILocation(line: 1335, column: 7, scope: !1180, inlinedAt: !1285)
!1299 = !DILocation(line: 1357, column: 10, scope: !1180, inlinedAt: !1285)
!1300 = !DILocation(line: 1357, column: 52, scope: !1180, inlinedAt: !1285)
!1301 = !DILocation(line: 1855, column: 15, scope: !1281)
!1302 = !DILocation(line: 1855, column: 41, scope: !1281)
!1303 = !DILocation(line: 1855, column: 48, scope: !1281)
!1304 = !DILocation(line: 1855, column: 36, scope: !1281)
!1305 = !DILocation(line: 1333, column: 31, scope: !1180, inlinedAt: !1306)
!1306 = distinct !DILocation(line: 1855, column: 18, scope: !1281)
!1307 = !DILocation(line: 1333, column: 45, scope: !1180, inlinedAt: !1306)
!1308 = !DILocation(line: 1337, column: 7, scope: !1226, inlinedAt: !1306)
!1309 = !DILocation(line: 1337, column: 7, scope: !1180, inlinedAt: !1306)
!1310 = !DILocation(line: 1342, column: 5, scope: !1192, inlinedAt: !1306)
!1311 = !DILocation(line: 1347, column: 7, scope: !1194, inlinedAt: !1306)
!1312 = !DILocation(line: 1347, column: 23, scope: !1194, inlinedAt: !1306)
!1313 = !DILocation(line: 1347, column: 7, scope: !1180, inlinedAt: !1306)
!1314 = !DILocation(line: 1351, column: 11, scope: !1198, inlinedAt: !1306)
!1315 = !DILocation(line: 1351, column: 16, scope: !1198, inlinedAt: !1306)
!1316 = !DILocation(line: 1351, column: 23, scope: !1198, inlinedAt: !1306)
!1317 = !DILocation(line: 1351, column: 27, scope: !1198, inlinedAt: !1306)
!1318 = !DILocation(line: 1351, column: 39, scope: !1198, inlinedAt: !1306)
!1319 = !DILocation(line: 1335, column: 7, scope: !1180, inlinedAt: !1306)
!1320 = !DILocation(line: 1357, column: 10, scope: !1180, inlinedAt: !1306)
!1321 = !DILocation(line: 1357, column: 52, scope: !1180, inlinedAt: !1306)
!1322 = !DILocation(line: 1853, column: 15, scope: !1175)
!1323 = !DILocation(line: 1857, column: 33, scope: !1324)
!1324 = distinct !DILexicalBlock(scope: !1281, file: !3, line: 1856, column: 13)
!1325 = !DILocation(line: 1857, column: 31, scope: !1324)
!1326 = !DILocation(line: 1859, column: 30, scope: !1324)
!1327 = !DILocation(line: 1860, column: 39, scope: !1324)
!1328 = !DILocation(line: 1860, column: 34, scope: !1324)
!1329 = !DILocation(line: 1860, column: 27, scope: !1324)
!1330 = !DILocation(line: 1860, column: 15, scope: !1324)
!1331 = !DILocation(line: 1860, column: 32, scope: !1324)
!1332 = !DILocation(line: 1861, column: 20, scope: !1324)
!1333 = !DILocation(line: 1863, column: 13, scope: !1324)
!1334 = !DILocation(line: 1867, column: 28, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !132, file: !3, line: 1867, column: 11)
!1336 = !DILocation(line: 1867, column: 23, scope: !1335)
!1337 = !DILocation(line: 1869, column: 24, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1335, file: !3, line: 1868, column: 9)
!1339 = !DILocation(line: 1869, column: 59, scope: !1338)
!1340 = !DILocation(line: 1869, column: 66, scope: !1338)
!1341 = !DILocation(line: 1869, column: 54, scope: !1338)
!1342 = !DILocation(line: 1869, column: 47, scope: !1338)
!1343 = !DILocation(line: 1869, column: 11, scope: !1338)
!1344 = !DILocation(line: 1871, column: 18, scope: !1338)
!1345 = !DILocation(line: 1870, column: 11, scope: !1338)
!1346 = !DILocation(line: 1872, column: 11, scope: !1338)
!1347 = !DILocation(line: 1874, column: 5, scope: !133)
!1348 = !DILocation(line: 1874, column: 5, scope: !132)
!1349 = !DILocation(line: 1876, column: 7, scope: !105)
!1350 = !DILocation(line: 1878, column: 11, scope: !1351)
!1351 = distinct !DILexicalBlock(scope: !1352, file: !3, line: 1878, column: 11)
!1352 = distinct !DILexicalBlock(scope: !1353, file: !3, line: 1877, column: 5)
!1353 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1876, column: 7)
!1354 = !DILocation(line: 1878, column: 26, scope: !1351)
!1355 = !DILocation(line: 1878, column: 11, scope: !1352)
!1356 = !DILocation(line: 1880, column: 24, scope: !1357)
!1357 = distinct !DILexicalBlock(scope: !1351, file: !3, line: 1879, column: 9)
!1358 = !DILocation(line: 1881, column: 27, scope: !1357)
!1359 = !DILocation(line: 1883, column: 9, scope: !1357)
!1360 = !DILocation(line: 1886, column: 5, scope: !1352)
!1361 = !DILocation(line: 1888, column: 7, scope: !105)
!1362 = !DILocation(line: 1890, column: 20, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !1364, file: !3, line: 1889, column: 5)
!1364 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1888, column: 7)
!1365 = !DILocation(line: 1890, column: 38, scope: !1363)
!1366 = !DILocation(line: 1890, column: 36, scope: !1363)
!1367 = !DILocation(line: 1890, column: 18, scope: !1363)
!1368 = !DILocation(line: 1891, column: 22, scope: !1369)
!1369 = distinct !DILexicalBlock(scope: !1363, file: !3, line: 1891, column: 11)
!1370 = !DILocation(line: 1891, column: 11, scope: !1363)
!1371 = !DILocation(line: 1892, column: 9, scope: !1369)
