; ModuleID = 'coreutils-8.27/src/pinky.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 75, type: !184, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !38, globals: !48)
!3 = !DIFile(filename: "src/pinky.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19, !23}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 148, size: 32, elements: !21)
!20 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = !{!22}
!22 = !DIEnumerator(name: "UT_USER_SIZE", value: 32)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 46, size: 32, elements: !25)
!24 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!26 = !DIEnumerator(name: "_ISupper", value: 256)
!27 = !DIEnumerator(name: "_ISlower", value: 512)
!28 = !DIEnumerator(name: "_ISalpha", value: 1024)
!29 = !DIEnumerator(name: "_ISdigit", value: 2048)
!30 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!31 = !DIEnumerator(name: "_ISspace", value: 8192)
!32 = !DIEnumerator(name: "_ISprint", value: 16384)
!33 = !DIEnumerator(name: "_ISgraph", value: 32768)
!34 = !DIEnumerator(name: "_ISblank", value: 1)
!35 = !DIEnumerator(name: "_IScntrl", value: 2)
!36 = !DIEnumerator(name: "_ISpunct", value: 4)
!37 = !DIEnumerator(name: "_ISalnum", value: 8)
!38 = !{!39, !41, !42, !43, !44, !47}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !45, line: 62, baseType: !46)
!45 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!46 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !{!49, !0, !71, !74, !76, !78, !80, !82, !84, !86, !88, !90, !92, !111, !116}
!49 = !DIGlobalVariableExpression(var: !50)
!50 = distinct !DIGlobalVariable(name: "infomap", scope: !51, file: !52, line: 632, type: !68, isLocal: true, isDefinition: true)
!51 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !52, file: !52, line: 630, type: !53, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !57)
!52 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!57 = !{!58, !59, !60, !67}
!58 = !DILocalVariable(name: "program", arg: 1, scope: !51, file: !52, line: 630, type: !55)
!59 = !DILocalVariable(name: "node", scope: !51, file: !52, line: 642, type: !55)
!60 = !DILocalVariable(name: "map_prog", scope: !51, file: !52, line: 643, type: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !51, file: !52, line: 632, size: 128, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !63, file: !52, line: 632, baseType: !55, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !63, file: !52, line: 632, baseType: !55, size: 64, offset: 64)
!67 = !DILocalVariable(name: "lc_messages", scope: !51, file: !52, line: 655, type: !55)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 896, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 7)
!71 = !DIGlobalVariableExpression(var: !72)
!72 = distinct !DIGlobalVariable(name: "do_short_format", scope: !2, file: !3, line: 63, type: !73, isLocal: true, isDefinition: true)
!73 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!74 = !DIGlobalVariableExpression(var: !75)
!75 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 47, type: !73, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77)
!77 = distinct !DIGlobalVariable(name: "include_fullname", scope: !2, file: !3, line: 50, type: !73, isLocal: true, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79)
!79 = distinct !DIGlobalVariable(name: "include_where", scope: !2, file: !3, line: 67, type: !73, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81)
!81 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 44, type: !73, isLocal: true, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83)
!83 = distinct !DIGlobalVariable(name: "include_project", scope: !2, file: !3, line: 53, type: !73, isLocal: true, isDefinition: true)
!84 = !DIGlobalVariableExpression(var: !85)
!85 = distinct !DIGlobalVariable(name: "include_plan", scope: !2, file: !3, line: 56, type: !73, isLocal: true, isDefinition: true)
!86 = !DIGlobalVariableExpression(var: !87)
!87 = distinct !DIGlobalVariable(name: "include_home_and_shell", scope: !2, file: !3, line: 60, type: !73, isLocal: true, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89)
!89 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 72, type: !55, isLocal: true, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91)
!91 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 73, type: !43, isLocal: true, isDefinition: true)
!92 = !DIGlobalVariableExpression(var: !93)
!93 = distinct !DIGlobalVariable(name: "now", scope: !94, file: !3, line: 149, type: !97, isLocal: true, isDefinition: true)
!94 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 147, type: !95, isLocal: true, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !102)
!95 = !DISubroutineType(types: !96)
!96 = !{!55, !97}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !98, line: 7, baseType: !99)
!98 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !100, line: 148, baseType: !101)
!100 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!101 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!102 = !{!103, !104, !105, !108, !109}
!103 = !DILocalVariable(name: "when", arg: 1, scope: !94, file: !3, line: 147, type: !97)
!104 = !DILocalVariable(name: "seconds_idle", scope: !94, file: !3, line: 151, type: !97)
!105 = !DILocalVariable(name: "hours", scope: !106, file: !3, line: 161, type: !43)
!106 = distinct !DILexicalBlock(scope: !107, file: !3, line: 160, column: 5)
!107 = distinct !DILexicalBlock(scope: !94, file: !3, line: 159, column: 7)
!108 = !DILocalVariable(name: "minutes", scope: !106, file: !3, line: 162, type: !43)
!109 = !DILocalVariable(name: "days", scope: !110, file: !3, line: 167, type: !46)
!110 = distinct !DILexicalBlock(scope: !107, file: !3, line: 166, column: 5)
!111 = !DIGlobalVariableExpression(var: !112)
!112 = distinct !DIGlobalVariable(name: "buf", scope: !94, file: !3, line: 150, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 176, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 22)
!116 = !DIGlobalVariableExpression(var: !117)
!117 = distinct !DIGlobalVariable(name: "buf", scope: !118, file: !3, line: 177, type: !181, isLocal: true, isDefinition: true)
!118 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 175, type: !119, isLocal: true, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !162)
!119 = !DISubroutineType(types: !120)
!120 = !{!55, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !20, line: 146, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !125, line: 55, size: 3072, elements: !126)
!125 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!126 = !{!127, !129, !131, !135, !139, !140, !144, !149, !151, !156, !158}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !124, file: !125, line: 57, baseType: !128, size: 16)
!128 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !124, file: !125, line: 58, baseType: !130, size: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !100, line: 142, baseType: !43)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !124, file: !125, line: 59, baseType: !132, size: 256, offset: 64)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !124, file: !125, line: 60, baseType: !136, size: 32, offset: 320)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 32, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 4)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !124, file: !125, line: 61, baseType: !132, size: 256, offset: 352)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !124, file: !125, line: 62, baseType: !141, size: 2048, offset: 608)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !124, file: !125, line: 63, baseType: !145, size: 32, offset: 2656)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !125, line: 42, size: 32, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !145, file: !125, line: 45, baseType: !128, size: 16)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !145, file: !125, line: 46, baseType: !128, size: 16, offset: 16)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !124, file: !125, line: 70, baseType: !150, size: 32, offset: 2688)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !100, line: 40, baseType: !43)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !124, file: !125, line: 75, baseType: !152, size: 64, offset: 2720)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !125, line: 71, size: 64, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !152, file: !125, line: 73, baseType: !150, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !152, file: !125, line: 74, baseType: !150, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !124, file: !125, line: 80, baseType: !157, size: 128, offset: 2784)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !137)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !124, file: !125, line: 81, baseType: !159, size: 160, offset: 2912)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 160, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 20)
!162 = !{!163, !164, !165}
!163 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !118, file: !3, line: 175, type: !121)
!164 = !DILocalVariable(name: "t", scope: !118, file: !3, line: 185, type: !97)
!165 = !DILocalVariable(name: "tmp", scope: !118, file: !3, line: 186, type: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !168, line: 7, size: 448, elements: !169)
!168 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !167, file: !168, line: 9, baseType: !43, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !167, file: !168, line: 10, baseType: !43, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !167, file: !168, line: 11, baseType: !43, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !167, file: !168, line: 12, baseType: !43, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !167, file: !168, line: 13, baseType: !43, size: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !167, file: !168, line: 14, baseType: !43, size: 32, offset: 160)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !167, file: !168, line: 15, baseType: !43, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !167, file: !168, line: 16, baseType: !43, size: 32, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !167, file: !168, line: 17, baseType: !43, size: 32, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !167, file: !168, line: 20, baseType: !101, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !167, file: !168, line: 21, baseType: !55, size: 64, offset: 384)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 264, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 33)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 768, elements: !194)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !187, line: 50, size: 256, elements: !188)
!187 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!188 = !{!189, !190, !191, !193}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !187, line: 52, baseType: !55, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !186, file: !187, line: 55, baseType: !43, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !186, file: !187, line: 56, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !186, file: !187, line: 57, baseType: !43, size: 32, offset: 192)
!194 = !{!195}
!195 = !DISubrange(count: 3)
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "Version", scope: !198, file: !199, line: 2, type: !55, isLocal: false, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, globals: !201)
!199 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!200 = !{}
!201 = !{!196}
!202 = !DIGlobalVariableExpression(var: !203)
!203 = distinct !DIGlobalVariable(name: "last_cherror", scope: !204, file: !210, line: 28, type: !43, isLocal: true, isDefinition: true)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, globals: !206)
!205 = !DIFile(filename: "./lib/canon-host.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!206 = !{!207, !202}
!207 = !DIGlobalVariableExpression(var: !208)
!208 = distinct !DIGlobalVariable(name: "hints", scope: !209, file: !210, line: 63, type: !219, isLocal: true, isDefinition: true)
!209 = distinct !DISubprogram(name: "canon_host_r", scope: !210, file: !210, line: 60, type: !211, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !204, variables: !213)
!210 = !DIFile(filename: "lib/canon-host.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!211 = !DISubroutineType(types: !212)
!212 = !{!39, !55, !192}
!213 = !{!214, !215, !216, !217, !244}
!214 = !DILocalVariable(name: "host", arg: 1, scope: !209, file: !210, line: 60, type: !55)
!215 = !DILocalVariable(name: "cherror", arg: 2, scope: !209, file: !210, line: 60, type: !192)
!216 = !DILocalVariable(name: "retval", scope: !209, file: !210, line: 62, type: !39)
!217 = !DILocalVariable(name: "res", scope: !209, file: !210, line: 64, type: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !220, line: 565, size: 384, elements: !221)
!220 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!221 = !{!222, !223, !224, !225, !226, !231, !242, !243}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !219, file: !220, line: 567, baseType: !43, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !219, file: !220, line: 568, baseType: !43, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !219, file: !220, line: 569, baseType: !43, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !219, file: !220, line: 570, baseType: !43, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !219, file: !220, line: 571, baseType: !227, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !228, line: 33, baseType: !229)
!228 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !100, line: 198, baseType: !230)
!230 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !219, file: !220, line: 572, baseType: !232, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !228, line: 174, size: 128, elements: !234)
!234 = !{!235, !238}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !233, file: !228, line: 176, baseType: !236, size: 16)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !237, line: 28, baseType: !47)
!237 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!238 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !233, file: !228, line: 177, baseType: !239, size: 112, offset: 16)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 112, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 14)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !219, file: !220, line: 573, baseType: !39, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !219, file: !220, line: 574, baseType: !218, size: 64, offset: 320)
!244 = !DILocalVariable(name: "status", scope: !209, file: !210, line: 65, type: !43)
!245 = !DIGlobalVariableExpression(var: !246)
!246 = distinct !DIGlobalVariable(name: "file_name", scope: !247, file: !252, line: 36, type: !55, isLocal: true, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, globals: !249)
!248 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!249 = !{!245, !250}
!250 = !DIGlobalVariableExpression(var: !251)
!251 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !247, file: !252, line: 46, type: !73, isLocal: true, isDefinition: true)
!252 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!253 = !DIGlobalVariableExpression(var: !254)
!254 = distinct !DIGlobalVariable(name: "exit_failure", scope: !255, file: !258, line: 24, type: !259, isLocal: false, isDefinition: true)
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, globals: !257)
!256 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!257 = !{!253}
!258 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!259 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !43)
!260 = !DIGlobalVariableExpression(var: !261)
!261 = distinct !DIGlobalVariable(name: "program_name", scope: !262, file: !266, line: 33, type: !55, isLocal: false, isDefinition: true)
!262 = distinct !DICompileUnit(language: DW_LANG_C99, file: !263, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !264, globals: !265)
!263 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!264 = !{!41, !39}
!265 = !{!260}
!266 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!267 = !DIGlobalVariableExpression(var: !268)
!268 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !269, file: !281, line: 77, type: !313, isLocal: false, isDefinition: true)
!269 = distinct !DICompileUnit(language: DW_LANG_C99, file: !270, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !271, retainedTypes: !277, globals: !278)
!270 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!271 = !{!5, !272, !23}
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !273)
!273 = !{!274, !275, !276}
!274 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!275 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!276 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!277 = !{!43, !47, !44, !39}
!278 = !{!267, !279, !286, !298, !300, !302, !309, !311}
!279 = !DIGlobalVariableExpression(var: !280)
!280 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !269, file: !281, line: 93, type: !282, isLocal: false, isDefinition: true)
!281 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 320, elements: !284)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!284 = !{!285}
!285 = !DISubrange(count: 10)
!286 = !DIGlobalVariableExpression(var: !287)
!287 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !269, file: !281, line: 1043, type: !288, isLocal: false, isDefinition: true)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !281, line: 57, size: 448, elements: !289)
!289 = !{!290, !291, !292, !296, !297}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !288, file: !281, line: 60, baseType: !5, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !288, file: !281, line: 63, baseType: !43, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !288, file: !281, line: 67, baseType: !293, size: 256, offset: 64)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 256, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 8)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !288, file: !281, line: 70, baseType: !55, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !288, file: !281, line: 73, baseType: !55, size: 64, offset: 384)
!298 = !DIGlobalVariableExpression(var: !299)
!299 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !269, file: !281, line: 108, type: !288, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301)
!301 = distinct !DIGlobalVariable(name: "slot0", scope: !269, file: !281, line: 834, type: !141, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303)
!303 = distinct !DIGlobalVariable(name: "slotvec", scope: !269, file: !281, line: 837, type: !304, isLocal: true, isDefinition: true)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !281, line: 826, size: 128, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !305, file: !281, line: 828, baseType: !44, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !305, file: !281, line: 829, baseType: !39, size: 64, offset: 64)
!309 = !DIGlobalVariableExpression(var: !310)
!310 = distinct !DIGlobalVariable(name: "nslots", scope: !269, file: !281, line: 835, type: !43, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312)
!312 = distinct !DIGlobalVariable(name: "slotvec0", scope: !269, file: !281, line: 836, type: !305, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 704, elements: !315)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!315 = !{!316}
!316 = !DISubrange(count: 11)
!317 = !DIGlobalVariableExpression(var: !318)
!318 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !319, file: !322, line: 26, type: !323, isLocal: false, isDefinition: true)
!319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !320, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, globals: !321)
!320 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!321 = !{!317}
!322 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 376, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 47)
!326 = !DIGlobalVariableExpression(var: !327)
!327 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !328, file: !672, line: 120, type: !673, isLocal: true, isDefinition: true)
!328 = distinct !DICompileUnit(language: DW_LANG_C99, file: !329, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !330, retainedTypes: !669, globals: !671)
!329 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!330 = !{!331}
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !332, line: 41, size: 32, elements: !333)
!332 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668}
!334 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!335 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!336 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!337 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!338 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!339 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!340 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!341 = !DIEnumerator(name: "DAY_1", value: 131079)
!342 = !DIEnumerator(name: "DAY_2", value: 131080)
!343 = !DIEnumerator(name: "DAY_3", value: 131081)
!344 = !DIEnumerator(name: "DAY_4", value: 131082)
!345 = !DIEnumerator(name: "DAY_5", value: 131083)
!346 = !DIEnumerator(name: "DAY_6", value: 131084)
!347 = !DIEnumerator(name: "DAY_7", value: 131085)
!348 = !DIEnumerator(name: "ABMON_1", value: 131086)
!349 = !DIEnumerator(name: "ABMON_2", value: 131087)
!350 = !DIEnumerator(name: "ABMON_3", value: 131088)
!351 = !DIEnumerator(name: "ABMON_4", value: 131089)
!352 = !DIEnumerator(name: "ABMON_5", value: 131090)
!353 = !DIEnumerator(name: "ABMON_6", value: 131091)
!354 = !DIEnumerator(name: "ABMON_7", value: 131092)
!355 = !DIEnumerator(name: "ABMON_8", value: 131093)
!356 = !DIEnumerator(name: "ABMON_9", value: 131094)
!357 = !DIEnumerator(name: "ABMON_10", value: 131095)
!358 = !DIEnumerator(name: "ABMON_11", value: 131096)
!359 = !DIEnumerator(name: "ABMON_12", value: 131097)
!360 = !DIEnumerator(name: "MON_1", value: 131098)
!361 = !DIEnumerator(name: "MON_2", value: 131099)
!362 = !DIEnumerator(name: "MON_3", value: 131100)
!363 = !DIEnumerator(name: "MON_4", value: 131101)
!364 = !DIEnumerator(name: "MON_5", value: 131102)
!365 = !DIEnumerator(name: "MON_6", value: 131103)
!366 = !DIEnumerator(name: "MON_7", value: 131104)
!367 = !DIEnumerator(name: "MON_8", value: 131105)
!368 = !DIEnumerator(name: "MON_9", value: 131106)
!369 = !DIEnumerator(name: "MON_10", value: 131107)
!370 = !DIEnumerator(name: "MON_11", value: 131108)
!371 = !DIEnumerator(name: "MON_12", value: 131109)
!372 = !DIEnumerator(name: "AM_STR", value: 131110)
!373 = !DIEnumerator(name: "PM_STR", value: 131111)
!374 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!375 = !DIEnumerator(name: "D_FMT", value: 131113)
!376 = !DIEnumerator(name: "T_FMT", value: 131114)
!377 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!378 = !DIEnumerator(name: "ERA", value: 131116)
!379 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!380 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!381 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!382 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!383 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!384 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!385 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!386 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!387 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!388 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!389 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!390 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!391 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!392 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!393 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!394 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!395 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!396 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!397 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!398 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!399 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!400 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!401 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!402 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!403 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!404 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!405 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!406 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!407 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!408 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!409 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!410 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!411 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!412 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!413 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!414 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!415 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!416 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!417 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!418 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!419 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!420 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!421 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!422 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!423 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!424 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!425 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!426 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!427 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!428 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!429 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!430 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!431 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!432 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!433 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!434 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!435 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!436 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!437 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!438 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!439 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!440 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!441 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!442 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!443 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!444 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!445 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!446 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!447 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!448 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!449 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!450 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!451 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!452 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!453 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!454 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!455 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!456 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!457 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!458 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!459 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!460 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!461 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!462 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!463 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!464 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!465 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!466 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!467 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!468 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!469 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!470 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!471 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!472 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!473 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!474 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!475 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!476 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!477 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!478 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!479 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!480 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!481 = !DIEnumerator(name: "CODESET", value: 14)
!482 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!483 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!484 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!485 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!520 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!521 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!528 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!529 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!530 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!531 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!532 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!533 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!534 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!535 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!536 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!537 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!538 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!539 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!540 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!541 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!545 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!546 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!547 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!548 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!549 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!550 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!551 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!552 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!553 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!554 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!555 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!556 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!557 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!558 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!559 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!560 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!561 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!562 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!563 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!564 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!565 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!566 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!567 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!568 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!569 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!570 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!571 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!572 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!573 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!574 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!575 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!576 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!584 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!585 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!588 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!589 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!590 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!591 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!592 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!593 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!594 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!595 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!596 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!597 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!598 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!599 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!600 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!601 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!602 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!603 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!604 = !DIEnumerator(name: "THOUSEP", value: 65537)
!605 = !DIEnumerator(name: "__GROUPING", value: 65538)
!606 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!607 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!608 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!609 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!610 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!611 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!612 = !DIEnumerator(name: "__YESSTR", value: 327682)
!613 = !DIEnumerator(name: "__NOSTR", value: 327683)
!614 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!615 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!616 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!617 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!618 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!619 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!620 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!621 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!622 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!623 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!624 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!625 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!626 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!627 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!628 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!629 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!630 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!631 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!632 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!633 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!634 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!635 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!636 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!637 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!638 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!639 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!640 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!641 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!642 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!643 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!644 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!645 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!646 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!647 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!648 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!649 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!650 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!651 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!652 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!659 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!660 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!661 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!662 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!663 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!664 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!665 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!666 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!667 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!668 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!669 = !{!41, !39, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!671 = !{!326}
!672 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!673 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !55)
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200)
!675 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !678)
!677 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!678 = !{!679}
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !680, line: 111, baseType: !681)
!680 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !100, line: 61, baseType: !101)
!682 = distinct !DICompileUnit(language: DW_LANG_C99, file: !683, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !684, retainedTypes: !689)
!683 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!684 = !{!685}
!685 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !686, line: 41, size: 32, elements: !687)
!686 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!687 = !{!688}
!688 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!689 = !{!41}
!690 = distinct !DICompileUnit(language: DW_LANG_C99, file: !691, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !692, retainedTypes: !706)
!691 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!692 = !{!693}
!693 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !695, file: !694, line: 192, size: 32, elements: !704)
!694 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!695 = distinct !DISubprogram(name: "x2nrealloc", scope: !694, file: !694, line: 180, type: !696, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !690, variables: !699)
!696 = !DISubroutineType(types: !697)
!697 = !{!41, !41, !698, !44}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!699 = !{!700, !701, !702, !703}
!700 = !DILocalVariable(name: "p", arg: 1, scope: !695, file: !694, line: 180, type: !41)
!701 = !DILocalVariable(name: "pn", arg: 2, scope: !695, file: !694, line: 180, type: !698)
!702 = !DILocalVariable(name: "s", arg: 3, scope: !695, file: !694, line: 180, type: !44)
!703 = !DILocalVariable(name: "n", scope: !695, file: !694, line: 182, type: !44)
!704 = !{!705}
!705 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!706 = !{!44, !39, !41}
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200)
!708 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !689)
!710 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!711 = distinct !DICompileUnit(language: DW_LANG_C99, file: !712, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200)
!712 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!713 = distinct !DICompileUnit(language: DW_LANG_C99, file: !714, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !689)
!714 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !716, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !689)
!716 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !719)
!718 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!719 = !{!44}
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !722, retainedTypes: !734)
!721 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!722 = !{!723, !727}
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 208, size: 32, elements: !724)
!724 = !{!725, !726}
!725 = !DIEnumerator(name: "READ_UTMP_CHECK_PIDS", value: 1)
!726 = !DIEnumerator(name: "READ_UTMP_USER_PROCESS", value: 2)
!727 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !728, file: !694, line: 192, size: 32, elements: !704)
!728 = distinct !DISubprogram(name: "x2nrealloc", scope: !694, file: !694, line: 180, type: !696, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !720, variables: !729)
!729 = !{!730, !731, !732, !733}
!730 = !DILocalVariable(name: "p", arg: 1, scope: !728, file: !694, line: 180, type: !41)
!731 = !DILocalVariable(name: "pn", arg: 2, scope: !728, file: !694, line: 180, type: !698)
!732 = !DILocalVariable(name: "s", arg: 3, scope: !728, file: !694, line: 180, type: !44)
!733 = !DILocalVariable(name: "n", scope: !728, file: !694, line: 182, type: !44)
!734 = !{!39, !41}
!735 = distinct !DICompileUnit(language: DW_LANG_C99, file: !736, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200)
!736 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!737 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!738 = !{i32 2, !"Dwarf Version", i32 4}
!739 = !{i32 2, !"Debug Info Version", i32 3}
!740 = !{i32 1, !"wchar_size", i32 4}
!741 = !{i32 7, !"PIC Level", i32 2}
!742 = !{i32 7, !"PIE Level", i32 2}
!743 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 487, type: !744, isLocal: false, isDefinition: true, scopeLine: 488, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !746)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !43}
!746 = !{!747}
!747 = !DILocalVariable(name: "status", arg: 1, scope: !743, file: !3, line: 487, type: !43)
!748 = !DIExpression()
!749 = !DILocation(line: 487, column: 12, scope: !743)
!750 = !DILocation(line: 489, column: 14, scope: !751)
!751 = distinct !DILexicalBlock(scope: !743, file: !3, line: 489, column: 7)
!752 = !DILocation(line: 489, column: 7, scope: !743)
!753 = !DILocation(line: 490, column: 5, scope: !754)
!754 = distinct !DILexicalBlock(scope: !751, file: !3, line: 490, column: 5)
!755 = !{!756, !756, i64 0}
!756 = !{!"any pointer", !757, i64 0}
!757 = !{!"omnipotent char", !758, i64 0}
!758 = !{!"Simple C/C++ TBAA"}
!759 = !DILocation(line: 493, column: 7, scope: !760)
!760 = distinct !DILexicalBlock(scope: !751, file: !3, line: 492, column: 5)
!761 = !DILocation(line: 494, column: 7, scope: !760)
!762 = !DILocation(line: 502, column: 7, scope: !760)
!763 = !DILocation(line: 509, column: 7, scope: !760)
!764 = !DILocation(line: 510, column: 7, scope: !760)
!765 = !DILocation(line: 511, column: 7, scope: !760)
!766 = !DILocation(line: 642, column: 15, scope: !51, inlinedAt: !767)
!767 = distinct !DILocation(line: 516, column: 7, scope: !760)
!768 = !DILocation(line: 651, column: 3, scope: !51, inlinedAt: !767)
!769 = !DILocation(line: 655, column: 29, scope: !51, inlinedAt: !767)
!770 = !DILocation(line: 655, column: 15, scope: !51, inlinedAt: !767)
!771 = !DILocation(line: 656, column: 7, scope: !772, inlinedAt: !767)
!772 = distinct !DILexicalBlock(scope: !51, file: !52, line: 656, column: 7)
!773 = !DILocation(line: 656, column: 19, scope: !772, inlinedAt: !767)
!774 = !DILocation(line: 656, column: 22, scope: !772, inlinedAt: !767)
!775 = !DILocation(line: 656, column: 7, scope: !51, inlinedAt: !767)
!776 = !DILocation(line: 662, column: 7, scope: !777, inlinedAt: !767)
!777 = distinct !DILexicalBlock(scope: !772, file: !52, line: 657, column: 5)
!778 = !DILocation(line: 664, column: 5, scope: !777, inlinedAt: !767)
!779 = !DILocation(line: 665, column: 3, scope: !51, inlinedAt: !767)
!780 = !DILocation(line: 667, column: 3, scope: !51, inlinedAt: !767)
!781 = !DILocation(line: 518, column: 3, scope: !743)
!782 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 522, type: !783, isLocal: false, isDefinition: true, scopeLine: 523, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !786)
!783 = !DISubroutineType(types: !784)
!784 = !{!43, !43, !785}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!786 = !{!787, !788, !789, !790}
!787 = !DILocalVariable(name: "argc", arg: 1, scope: !782, file: !3, line: 522, type: !43)
!788 = !DILocalVariable(name: "argv", arg: 2, scope: !782, file: !3, line: 522, type: !785)
!789 = !DILocalVariable(name: "optc", scope: !782, file: !3, line: 524, type: !43)
!790 = !DILocalVariable(name: "n_users", scope: !782, file: !3, line: 525, type: !43)
!791 = !DILocalVariable(name: "buf", scope: !792, file: !3, line: 350, type: !876)
!792 = distinct !DILexicalBlock(scope: !793, file: !3, line: 348, column: 5)
!793 = distinct !DILexicalBlock(scope: !794, file: !3, line: 347, column: 7)
!794 = distinct !DISubprogram(name: "print_long_entry", scope: !3, file: !3, line: 307, type: !53, isLocal: true, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !795)
!795 = !{!796, !797, !811, !815, !816, !791, !867, !868, !869, !872, !875, !879, !880, !881}
!796 = !DILocalVariable(name: "name", arg: 1, scope: !794, file: !3, line: 307, type: !55)
!797 = !DILocalVariable(name: "pw", scope: !794, file: !3, line: 309, type: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !800, line: 49, size: 384, elements: !801)
!800 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!801 = !{!802, !803, !804, !806, !808, !809, !810}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !799, file: !800, line: 51, baseType: !39, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !799, file: !800, line: 52, baseType: !39, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !799, file: !800, line: 53, baseType: !805, size: 32, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !100, line: 134, baseType: !230)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !799, file: !800, line: 54, baseType: !807, size: 32, offset: 160)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !100, line: 135, baseType: !230)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !799, file: !800, line: 55, baseType: !39, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !799, file: !800, line: 56, baseType: !39, size: 64, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !799, file: !800, line: 57, baseType: !39, size: 64, offset: 320)
!811 = !DILocalVariable(name: "comma", scope: !812, file: !3, line: 325, type: !814)
!812 = distinct !DILexicalBlock(scope: !813, file: !3, line: 324, column: 5)
!813 = distinct !DILexicalBlock(scope: !794, file: !3, line: 317, column: 7)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!815 = !DILocalVariable(name: "result", scope: !812, file: !3, line: 326, type: !39)
!816 = !DILocalVariable(name: "stream", scope: !792, file: !3, line: 349, type: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !819, line: 7, baseType: !820)
!819 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !821, line: 241, size: 1728, elements: !822)
!821 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !843, !844, !845, !846, !848, !849, !851, !855, !858, !860, !861, !862, !863, !864, !865, !866}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !820, file: !821, line: 242, baseType: !43, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !820, file: !821, line: 247, baseType: !39, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !820, file: !821, line: 248, baseType: !39, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !820, file: !821, line: 249, baseType: !39, size: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !820, file: !821, line: 250, baseType: !39, size: 64, offset: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !820, file: !821, line: 251, baseType: !39, size: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !820, file: !821, line: 252, baseType: !39, size: 64, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !820, file: !821, line: 253, baseType: !39, size: 64, offset: 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !820, file: !821, line: 254, baseType: !39, size: 64, offset: 512)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !820, file: !821, line: 256, baseType: !39, size: 64, offset: 576)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !820, file: !821, line: 257, baseType: !39, size: 64, offset: 640)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !820, file: !821, line: 258, baseType: !39, size: 64, offset: 704)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !820, file: !821, line: 260, baseType: !836, size: 64, offset: 768)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !821, line: 156, size: 192, elements: !838)
!838 = !{!839, !840, !842}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !837, file: !821, line: 157, baseType: !836, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !837, file: !821, line: 158, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !837, file: !821, line: 162, baseType: !43, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !820, file: !821, line: 262, baseType: !841, size: 64, offset: 832)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !820, file: !821, line: 264, baseType: !43, size: 32, offset: 896)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !820, file: !821, line: 268, baseType: !43, size: 32, offset: 928)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !820, file: !821, line: 270, baseType: !847, size: 64, offset: 960)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !100, line: 140, baseType: !101)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !820, file: !821, line: 274, baseType: !47, size: 16, offset: 1024)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !820, file: !821, line: 275, baseType: !850, size: 8, offset: 1040)
!850 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !820, file: !821, line: 276, baseType: !852, size: 8, offset: 1048)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 1)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !820, file: !821, line: 280, baseType: !856, size: 64, offset: 1088)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !821, line: 150, baseType: null)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !820, file: !821, line: 289, baseType: !859, size: 64, offset: 1152)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !100, line: 141, baseType: !101)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !820, file: !821, line: 297, baseType: !41, size: 64, offset: 1216)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !820, file: !821, line: 298, baseType: !41, size: 64, offset: 1280)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !820, file: !821, line: 299, baseType: !41, size: 64, offset: 1344)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !820, file: !821, line: 300, baseType: !41, size: 64, offset: 1408)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !820, file: !821, line: 302, baseType: !44, size: 64, offset: 1472)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !820, file: !821, line: 303, baseType: !43, size: 32, offset: 1536)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !820, file: !821, line: 305, baseType: !159, size: 160, offset: 1568)
!867 = !DILocalVariable(name: "baseproject", scope: !792, file: !3, line: 351, type: !314)
!868 = !DILocalVariable(name: "project", scope: !792, file: !3, line: 352, type: !814)
!869 = !DILocalVariable(name: "bytes", scope: !870, file: !3, line: 359, type: !44)
!870 = distinct !DILexicalBlock(scope: !871, file: !3, line: 358, column: 9)
!871 = distinct !DILexicalBlock(scope: !792, file: !3, line: 357, column: 11)
!872 = !DILocalVariable(name: "stream", scope: !873, file: !3, line: 373, type: !817)
!873 = distinct !DILexicalBlock(scope: !874, file: !3, line: 372, column: 5)
!874 = distinct !DILexicalBlock(scope: !794, file: !3, line: 371, column: 7)
!875 = !DILocalVariable(name: "buf", scope: !873, file: !3, line: 374, type: !876)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8192, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 1024)
!879 = !DILocalVariable(name: "baseplan", scope: !873, file: !3, line: 375, type: !314)
!880 = !DILocalVariable(name: "plan", scope: !873, file: !3, line: 376, type: !814)
!881 = !DILocalVariable(name: "bytes", scope: !882, file: !3, line: 383, type: !44)
!882 = distinct !DILexicalBlock(scope: !883, file: !3, line: 382, column: 9)
!883 = distinct !DILexicalBlock(scope: !873, file: !3, line: 381, column: 11)
!884 = !DILocation(line: 350, column: 12, scope: !792, inlinedAt: !885)
!885 = distinct !DILocation(line: 483, column: 5, scope: !886, inlinedAt: !897)
!886 = distinct !DILexicalBlock(scope: !887, file: !3, line: 482, column: 3)
!887 = distinct !DILexicalBlock(scope: !888, file: !3, line: 482, column: 3)
!888 = distinct !DISubprogram(name: "long_pinky", scope: !3, file: !3, line: 478, type: !889, isLocal: true, isDefinition: true, scopeLine: 479, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !893)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !891, !892}
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!893 = !{!894, !895, !896}
!894 = !DILocalVariable(name: "argc_names", arg: 1, scope: !888, file: !3, line: 478, type: !891)
!895 = !DILocalVariable(name: "argv_names", arg: 2, scope: !888, file: !3, line: 478, type: !892)
!896 = !DILocalVariable(name: "i", scope: !888, file: !3, line: 480, type: !43)
!897 = distinct !DILocation(line: 603, column: 5, scope: !898)
!898 = distinct !DILexicalBlock(scope: !782, file: !3, line: 600, column: 7)
!899 = !DILocation(line: 374, column: 12, scope: !873, inlinedAt: !885)
!900 = !DILocation(line: 522, column: 11, scope: !782)
!901 = !DILocation(line: 522, column: 24, scope: !782)
!902 = !DILocation(line: 528, column: 21, scope: !782)
!903 = !DILocation(line: 528, column: 3, scope: !782)
!904 = !DILocation(line: 529, column: 3, scope: !782)
!905 = !DILocation(line: 530, column: 3, scope: !782)
!906 = !DILocation(line: 531, column: 3, scope: !782)
!907 = !DILocation(line: 533, column: 3, scope: !782)
!908 = !DILocation(line: 535, column: 3, scope: !782)
!909 = !DILocation(line: 535, column: 18, scope: !782)
!910 = !DILocation(line: 524, column: 7, scope: !782)
!911 = !DILocation(line: 541, column: 11, scope: !912)
!912 = distinct !DILexicalBlock(scope: !913, file: !3, line: 538, column: 9)
!913 = distinct !DILexicalBlock(scope: !782, file: !3, line: 536, column: 5)
!914 = !DILocation(line: 545, column: 11, scope: !912)
!915 = !DILocation(line: 549, column: 11, scope: !912)
!916 = !DILocation(line: 553, column: 11, scope: !912)
!917 = !DILocation(line: 560, column: 11, scope: !912)
!918 = !DILocation(line: 568, column: 11, scope: !912)
!919 = !DILocation(line: 572, column: 11, scope: !912)
!920 = !DILocation(line: 576, column: 11, scope: !912)
!921 = !DILocation(line: 580, column: 11, scope: !912)
!922 = distinct !{!922, !908, !923}
!923 = !DILocation(line: 589, column: 5, scope: !782)
!924 = !DILocation(line: 582, column: 9, scope: !912)
!925 = !DILocation(line: 584, column: 9, scope: !912)
!926 = !DILocation(line: 587, column: 11, scope: !912)
!927 = !DILocation(line: 591, column: 20, scope: !782)
!928 = !{!929, !929, i64 0}
!929 = !{!"int", !757, i64 0}
!930 = !DILocation(line: 591, column: 18, scope: !782)
!931 = !DILocation(line: 525, column: 7, scope: !782)
!932 = !DILocation(line: 593, column: 35, scope: !933)
!933 = distinct !DILexicalBlock(scope: !782, file: !3, line: 593, column: 7)
!934 = !DILocation(line: 593, column: 24, scope: !933)
!935 = !DILocation(line: 595, column: 20, scope: !936)
!936 = distinct !DILexicalBlock(scope: !933, file: !3, line: 594, column: 5)
!937 = !DILocation(line: 595, column: 7, scope: !936)
!938 = !DILocation(line: 597, column: 7, scope: !936)
!939 = !DILocation(line: 600, column: 7, scope: !782)
!940 = !DILocation(line: 466, column: 3, scope: !941, inlinedAt: !951)
!941 = distinct !DISubprogram(name: "short_pinky", scope: !3, file: !3, line: 463, type: !942, isLocal: true, isDefinition: true, scopeLine: 465, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !944)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !55, !891, !892}
!944 = !{!945, !946, !947, !948, !949}
!945 = !DILocalVariable(name: "filename", arg: 1, scope: !941, file: !3, line: 463, type: !55)
!946 = !DILocalVariable(name: "argc_names", arg: 2, scope: !941, file: !3, line: 464, type: !891)
!947 = !DILocalVariable(name: "argv_names", arg: 3, scope: !941, file: !3, line: 464, type: !892)
!948 = !DILocalVariable(name: "n_users", scope: !941, file: !3, line: 466, type: !44)
!949 = !DILocalVariable(name: "utmp_buf", scope: !941, file: !3, line: 467, type: !950)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!951 = distinct !DILocation(line: 601, column: 5, scope: !898)
!952 = !DILocation(line: 467, column: 3, scope: !941, inlinedAt: !951)
!953 = !DILocation(line: 467, column: 16, scope: !941, inlinedAt: !951)
!954 = !DILocation(line: 466, column: 10, scope: !941, inlinedAt: !951)
!955 = !DILocation(line: 469, column: 7, scope: !956, inlinedAt: !951)
!956 = distinct !DILexicalBlock(scope: !941, file: !3, line: 469, column: 7)
!957 = !DILocation(line: 469, column: 52, scope: !956, inlinedAt: !951)
!958 = !DILocation(line: 469, column: 7, scope: !941, inlinedAt: !951)
!959 = !DILocation(line: 470, column: 5, scope: !956, inlinedAt: !951)
!960 = !DILocation(line: 472, column: 17, scope: !941, inlinedAt: !951)
!961 = !{!962, !962, i64 0}
!962 = !{!"long", !757, i64 0}
!963 = !DILocation(line: 472, column: 26, scope: !941, inlinedAt: !951)
!964 = !DILocalVariable(name: "n", arg: 1, scope: !965, file: !3, line: 421, type: !44)
!965 = distinct !DISubprogram(name: "scan_entries", scope: !3, file: !3, line: 421, type: !966, isLocal: true, isDefinition: true, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !968)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !44, !121, !891, !892}
!968 = !{!964, !969, !970, !971, !972}
!969 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !965, file: !3, line: 421, type: !121)
!970 = !DILocalVariable(name: "argc_names", arg: 3, scope: !965, file: !3, line: 422, type: !891)
!971 = !DILocalVariable(name: "argv_names", arg: 4, scope: !965, file: !3, line: 422, type: !892)
!972 = !DILocalVariable(name: "i", scope: !973, file: !3, line: 444, type: !43)
!973 = distinct !DILexicalBlock(scope: !974, file: !3, line: 443, column: 13)
!974 = distinct !DILexicalBlock(scope: !975, file: !3, line: 442, column: 15)
!975 = distinct !DILexicalBlock(scope: !976, file: !3, line: 441, column: 9)
!976 = distinct !DILexicalBlock(scope: !977, file: !3, line: 440, column: 11)
!977 = distinct !DILexicalBlock(scope: !965, file: !3, line: 439, column: 5)
!978 = !DILocation(line: 421, column: 22, scope: !965, inlinedAt: !979)
!979 = distinct !DILocation(line: 472, column: 3, scope: !941, inlinedAt: !951)
!980 = !DILocation(line: 421, column: 44, scope: !965, inlinedAt: !979)
!981 = !DILocation(line: 422, column: 25, scope: !965, inlinedAt: !979)
!982 = !DILocation(line: 422, column: 49, scope: !965, inlinedAt: !979)
!983 = !DILocation(line: 424, column: 7, scope: !984, inlinedAt: !979)
!984 = distinct !DILexicalBlock(scope: !965, file: !3, line: 424, column: 7)
!985 = !DILocation(line: 424, column: 7, scope: !965, inlinedAt: !979)
!986 = !DILocation(line: 435, column: 7, scope: !965, inlinedAt: !979)
!987 = !DILocation(line: 404, column: 3, scope: !988, inlinedAt: !991)
!988 = distinct !DISubprogram(name: "print_heading", scope: !3, file: !3, line: 402, type: !989, isLocal: true, isDefinition: true, scopeLine: 403, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !200)
!989 = !DISubroutineType(types: !990)
!990 = !{null}
!991 = distinct !DILocation(line: 436, column: 5, scope: !992, inlinedAt: !979)
!992 = distinct !DILexicalBlock(scope: !965, file: !3, line: 435, column: 7)
!993 = !DILocation(line: 405, column: 7, scope: !988, inlinedAt: !991)
!994 = !DILocation(line: 406, column: 5, scope: !995, inlinedAt: !991)
!995 = distinct !DILexicalBlock(scope: !988, file: !3, line: 405, column: 7)
!996 = !DILocation(line: 407, column: 3, scope: !988, inlinedAt: !991)
!997 = !DILocation(line: 408, column: 7, scope: !988, inlinedAt: !991)
!998 = !DILocation(line: 409, column: 5, scope: !999, inlinedAt: !991)
!999 = distinct !DILexicalBlock(scope: !988, file: !3, line: 408, column: 7)
!1000 = !DILocation(line: 410, column: 3, scope: !988, inlinedAt: !991)
!1001 = !DILocation(line: 412, column: 7, scope: !988, inlinedAt: !991)
!1002 = !DILocation(line: 413, column: 5, scope: !1003, inlinedAt: !991)
!1003 = distinct !DILexicalBlock(scope: !988, file: !3, line: 412, column: 7)
!1004 = !DILocalVariable(name: "__c", arg: 1, scope: !1005, file: !1006, line: 105, type: !43)
!1005 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1006, file: !1006, line: 105, type: !1007, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1009)
!1006 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!43, !43}
!1009 = !{!1004}
!1010 = !DILocation(line: 105, column: 23, scope: !1005, inlinedAt: !1011)
!1011 = distinct !DILocation(line: 415, column: 3, scope: !988, inlinedAt: !991)
!1012 = !DILocation(line: 107, column: 10, scope: !1005, inlinedAt: !1011)
!1013 = !{!1014, !756, i64 40}
!1014 = !{!"_IO_FILE", !929, i64 0, !756, i64 8, !756, i64 16, !756, i64 24, !756, i64 32, !756, i64 40, !756, i64 48, !756, i64 56, !756, i64 64, !756, i64 72, !756, i64 80, !756, i64 88, !756, i64 96, !756, i64 104, !929, i64 112, !929, i64 116, !962, i64 120, !1015, i64 128, !757, i64 130, !757, i64 131, !756, i64 136, !962, i64 144, !756, i64 152, !756, i64 160, !756, i64 168, !756, i64 176, !962, i64 184, !929, i64 192, !757, i64 196}
!1015 = !{!"short", !757, i64 0}
!1016 = !{!1014, !756, i64 48}
!1017 = !{!"branch_weights", i32 2000, i32 1}
!1018 = !{!757, !757, i64 0}
!1019 = !DILocation(line: 438, column: 3, scope: !965, inlinedAt: !979)
!1020 = !DILocation(line: 438, column: 11, scope: !965, inlinedAt: !979)
!1021 = !DILocation(line: 440, column: 11, scope: !976, inlinedAt: !979)
!1022 = !{!1023, !1015, i64 0}
!1023 = !{!"utmpx", !1015, i64 0, !929, i64 4, !757, i64 8, !757, i64 40, !757, i64 44, !757, i64 76, !1024, i64 332, !929, i64 336, !1025, i64 340, !757, i64 348, !757, i64 364}
!1024 = !{!"__exit_status", !1015, i64 0, !1015, i64 2}
!1025 = !{!"", !929, i64 0, !929, i64 4}
!1026 = !DILocation(line: 440, column: 11, scope: !977, inlinedAt: !979)
!1027 = !DILocation(line: 442, column: 15, scope: !975, inlinedAt: !979)
!1028 = !DILocation(line: 444, column: 19, scope: !973, inlinedAt: !979)
!1029 = !DILocation(line: 446, column: 15, scope: !1030, inlinedAt: !979)
!1030 = distinct !DILexicalBlock(scope: !973, file: !3, line: 446, column: 15)
!1031 = !DILocation(line: 447, column: 21, scope: !1032, inlinedAt: !979)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 447, column: 21)
!1033 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 446, column: 15)
!1034 = !DILocation(line: 446, column: 29, scope: !1033, inlinedAt: !979)
!1035 = distinct !{!1035, !1036, !1037}
!1036 = !DILocation(line: 446, column: 15, scope: !1030)
!1037 = !DILocation(line: 451, column: 19, scope: !1030)
!1038 = !DILocation(line: 446, column: 44, scope: !1033, inlinedAt: !979)
!1039 = !DILocation(line: 447, column: 21, scope: !1033, inlinedAt: !979)
!1040 = !DILocation(line: 449, column: 21, scope: !1041, inlinedAt: !979)
!1041 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 448, column: 19)
!1042 = !DILocation(line: 450, column: 21, scope: !1041, inlinedAt: !979)
!1043 = !DILocation(line: 454, column: 13, scope: !974, inlinedAt: !979)
!1044 = !DILocation(line: 456, column: 15, scope: !977, inlinedAt: !979)
!1045 = distinct !{!1045, !1046, !1047}
!1046 = !DILocation(line: 438, column: 3, scope: !965)
!1047 = !DILocation(line: 457, column: 5, scope: !965)
!1048 = !DILocation(line: 475, column: 1, scope: !941, inlinedAt: !951)
!1049 = !DILocation(line: 601, column: 5, scope: !898)
!1050 = !DILocation(line: 478, column: 23, scope: !888, inlinedAt: !897)
!1051 = !DILocation(line: 478, column: 47, scope: !888, inlinedAt: !897)
!1052 = !DILocation(line: 480, column: 7, scope: !888, inlinedAt: !897)
!1053 = !DILocation(line: 482, column: 17, scope: !886, inlinedAt: !897)
!1054 = !DILocation(line: 482, column: 3, scope: !887, inlinedAt: !897)
!1055 = !DILocation(line: 483, column: 23, scope: !886, inlinedAt: !897)
!1056 = !DILocation(line: 307, column: 30, scope: !794, inlinedAt: !885)
!1057 = !DILocation(line: 311, column: 8, scope: !794, inlinedAt: !885)
!1058 = !DILocation(line: 309, column: 18, scope: !794, inlinedAt: !885)
!1059 = !DILocation(line: 313, column: 3, scope: !794, inlinedAt: !885)
!1060 = !DILocation(line: 314, column: 3, scope: !794, inlinedAt: !885)
!1061 = !DILocation(line: 316, column: 3, scope: !794, inlinedAt: !885)
!1062 = !DILocation(line: 317, column: 10, scope: !813, inlinedAt: !885)
!1063 = !DILocation(line: 317, column: 7, scope: !794, inlinedAt: !885)
!1064 = !DILocation(line: 320, column: 7, scope: !1065, inlinedAt: !885)
!1065 = distinct !DILexicalBlock(scope: !813, file: !3, line: 318, column: 5)
!1066 = !DILocation(line: 321, column: 7, scope: !1065, inlinedAt: !885)
!1067 = !DILocation(line: 325, column: 39, scope: !812, inlinedAt: !885)
!1068 = !{!1069, !756, i64 24}
!1069 = !{!"passwd", !756, i64 0, !756, i64 8, !929, i64 16, !929, i64 20, !756, i64 24, !756, i64 32, !756, i64 40}
!1070 = !DILocation(line: 325, column: 27, scope: !812, inlinedAt: !885)
!1071 = !DILocation(line: 325, column: 19, scope: !812, inlinedAt: !885)
!1072 = !DILocation(line: 328, column: 11, scope: !1073, inlinedAt: !885)
!1073 = distinct !DILexicalBlock(scope: !812, file: !3, line: 328, column: 11)
!1074 = !DILocation(line: 328, column: 11, scope: !812, inlinedAt: !885)
!1075 = !DILocation(line: 329, column: 16, scope: !1073, inlinedAt: !885)
!1076 = !DILocation(line: 331, column: 37, scope: !812, inlinedAt: !885)
!1077 = !DILocation(line: 329, column: 9, scope: !1073, inlinedAt: !885)
!1078 = !DILocation(line: 331, column: 51, scope: !812, inlinedAt: !885)
!1079 = !{!1069, !756, i64 0}
!1080 = !DILocation(line: 331, column: 16, scope: !812, inlinedAt: !885)
!1081 = !DILocation(line: 326, column: 13, scope: !812, inlinedAt: !885)
!1082 = !DILocation(line: 332, column: 7, scope: !812, inlinedAt: !885)
!1083 = !DILocation(line: 333, column: 7, scope: !812, inlinedAt: !885)
!1084 = !DILocation(line: 105, column: 23, scope: !1005, inlinedAt: !1085)
!1085 = distinct !DILocation(line: 336, column: 3, scope: !794, inlinedAt: !885)
!1086 = !DILocation(line: 107, column: 10, scope: !1005, inlinedAt: !1085)
!1087 = !DILocation(line: 338, column: 7, scope: !794, inlinedAt: !885)
!1088 = !DILocation(line: 340, column: 7, scope: !1089, inlinedAt: !885)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 339, column: 5)
!1090 = distinct !DILexicalBlock(scope: !794, file: !3, line: 338, column: 7)
!1091 = !DILocation(line: 341, column: 7, scope: !1089, inlinedAt: !885)
!1092 = !{!1069, !756, i64 32}
!1093 = !DILocation(line: 342, column: 7, scope: !1089, inlinedAt: !885)
!1094 = !DILocation(line: 343, column: 7, scope: !1089, inlinedAt: !885)
!1095 = !{!1069, !756, i64 40}
!1096 = !DILocation(line: 105, column: 23, scope: !1005, inlinedAt: !1097)
!1097 = distinct !DILocation(line: 344, column: 7, scope: !1089, inlinedAt: !885)
!1098 = !DILocation(line: 107, column: 10, scope: !1005, inlinedAt: !1097)
!1099 = !DILocation(line: 347, column: 7, scope: !794, inlinedAt: !885)
!1100 = !DILocation(line: 350, column: 7, scope: !792, inlinedAt: !885)
!1101 = !DILocation(line: 353, column: 30, scope: !792, inlinedAt: !885)
!1102 = !DILocation(line: 353, column: 18, scope: !792, inlinedAt: !885)
!1103 = !DILocation(line: 353, column: 61, scope: !792, inlinedAt: !885)
!1104 = !DILocation(line: 353, column: 9, scope: !792, inlinedAt: !885)
!1105 = !DILocation(line: 352, column: 19, scope: !792, inlinedAt: !885)
!1106 = !DILocation(line: 354, column: 36, scope: !792, inlinedAt: !885)
!1107 = !DILocalVariable(name: "__dest", arg: 1, scope: !1108, file: !1109, line: 95, type: !1112)
!1108 = distinct !DISubprogram(name: "stpcpy", scope: !1109, file: !1109, line: 95, type: !1110, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1114)
!1109 = !DIFile(filename: "/usr/include/bits/string_fortified.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!39, !1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !39)
!1113 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !55)
!1114 = !{!1107, !1115}
!1115 = !DILocalVariable(name: "__src", arg: 2, scope: !1108, file: !1109, line: 95, type: !1113)
!1116 = !DILocation(line: 95, column: 1, scope: !1108, inlinedAt: !1117)
!1117 = distinct !DILocation(line: 354, column: 15, scope: !792, inlinedAt: !885)
!1118 = !DILocation(line: 97, column: 49, scope: !1108, inlinedAt: !1117)
!1119 = !DILocation(line: 97, column: 10, scope: !1108, inlinedAt: !1117)
!1120 = !DILocation(line: 354, column: 7, scope: !792, inlinedAt: !885)
!1121 = !DILocation(line: 356, column: 16, scope: !792, inlinedAt: !885)
!1122 = !DILocation(line: 349, column: 13, scope: !792, inlinedAt: !885)
!1123 = !DILocation(line: 357, column: 11, scope: !871, inlinedAt: !885)
!1124 = !DILocation(line: 357, column: 11, scope: !792, inlinedAt: !885)
!1125 = !DILocation(line: 361, column: 11, scope: !870, inlinedAt: !885)
!1126 = !DILocation(line: 363, column: 27, scope: !870, inlinedAt: !885)
!1127 = !DILocation(line: 359, column: 18, scope: !870, inlinedAt: !885)
!1128 = !DILocation(line: 363, column: 65, scope: !870, inlinedAt: !885)
!1129 = !DILocation(line: 363, column: 11, scope: !870, inlinedAt: !885)
!1130 = !DILocation(line: 364, column: 13, scope: !870, inlinedAt: !885)
!1131 = distinct !{!1131, !1132, !1133}
!1132 = !DILocation(line: 363, column: 11, scope: !870)
!1133 = !DILocation(line: 364, column: 13, scope: !870)
!1134 = !DILocation(line: 365, column: 11, scope: !870, inlinedAt: !885)
!1135 = !DILocation(line: 366, column: 9, scope: !870, inlinedAt: !885)
!1136 = !DILocation(line: 368, column: 7, scope: !792, inlinedAt: !885)
!1137 = !DILocation(line: 369, column: 5, scope: !793, inlinedAt: !885)
!1138 = !DILocation(line: 369, column: 5, scope: !792, inlinedAt: !885)
!1139 = !DILocation(line: 371, column: 7, scope: !794, inlinedAt: !885)
!1140 = !DILocation(line: 374, column: 7, scope: !873, inlinedAt: !885)
!1141 = !DILocation(line: 377, column: 30, scope: !873, inlinedAt: !885)
!1142 = !DILocation(line: 377, column: 18, scope: !873, inlinedAt: !885)
!1143 = !DILocation(line: 377, column: 58, scope: !873, inlinedAt: !885)
!1144 = !DILocation(line: 377, column: 9, scope: !873, inlinedAt: !885)
!1145 = !DILocation(line: 376, column: 19, scope: !873, inlinedAt: !885)
!1146 = !DILocation(line: 378, column: 33, scope: !873, inlinedAt: !885)
!1147 = !DILocation(line: 95, column: 1, scope: !1108, inlinedAt: !1148)
!1148 = distinct !DILocation(line: 378, column: 15, scope: !873, inlinedAt: !885)
!1149 = !DILocation(line: 97, column: 49, scope: !1108, inlinedAt: !1148)
!1150 = !DILocation(line: 97, column: 10, scope: !1108, inlinedAt: !1148)
!1151 = !DILocation(line: 378, column: 7, scope: !873, inlinedAt: !885)
!1152 = !DILocation(line: 380, column: 16, scope: !873, inlinedAt: !885)
!1153 = !DILocation(line: 373, column: 13, scope: !873, inlinedAt: !885)
!1154 = !DILocation(line: 381, column: 11, scope: !883, inlinedAt: !885)
!1155 = !DILocation(line: 381, column: 11, scope: !873, inlinedAt: !885)
!1156 = !DILocation(line: 385, column: 11, scope: !882, inlinedAt: !885)
!1157 = !DILocation(line: 387, column: 27, scope: !882, inlinedAt: !885)
!1158 = !DILocation(line: 383, column: 18, scope: !882, inlinedAt: !885)
!1159 = !DILocation(line: 387, column: 65, scope: !882, inlinedAt: !885)
!1160 = !DILocation(line: 387, column: 11, scope: !882, inlinedAt: !885)
!1161 = !DILocation(line: 388, column: 13, scope: !882, inlinedAt: !885)
!1162 = distinct !{!1162, !1163, !1164}
!1163 = !DILocation(line: 387, column: 11, scope: !882)
!1164 = !DILocation(line: 388, column: 13, scope: !882)
!1165 = !DILocation(line: 389, column: 11, scope: !882, inlinedAt: !885)
!1166 = !DILocation(line: 390, column: 9, scope: !882, inlinedAt: !885)
!1167 = !DILocation(line: 392, column: 7, scope: !873, inlinedAt: !885)
!1168 = !DILocation(line: 393, column: 5, scope: !874, inlinedAt: !885)
!1169 = !DILocation(line: 393, column: 5, scope: !873, inlinedAt: !885)
!1170 = !DILocation(line: 105, column: 23, scope: !1005, inlinedAt: !1171)
!1171 = distinct !DILocation(line: 395, column: 3, scope: !794, inlinedAt: !885)
!1172 = !DILocation(line: 107, column: 10, scope: !1005, inlinedAt: !1171)
!1173 = !DILocation(line: 482, column: 32, scope: !886, inlinedAt: !897)
!1174 = distinct !{!1174, !1175, !1176}
!1175 = !DILocation(line: 482, column: 3, scope: !887)
!1176 = !DILocation(line: 483, column: 36, scope: !887)
!1177 = !DILocation(line: 605, column: 3, scope: !782)
!1178 = distinct !DISubprogram(name: "print_entry", scope: !3, file: !3, line: 200, type: !1179, isLocal: true, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1181)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{null, !121}
!1181 = !{!1182, !1183, !1215, !1216, !1217, !1221, !1222, !1225, !1226, !1229, !1230, !1236, !1237}
!1182 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !1178, file: !3, line: 200, type: !121)
!1183 = !DILocalVariable(name: "stats", scope: !1178, file: !3, line: 202, type: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1185, line: 46, size: 1152, elements: !1186)
!1185 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1186 = !{!1187, !1189, !1191, !1193, !1195, !1196, !1197, !1198, !1199, !1200, !1202, !1204, !1211, !1212, !1213}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1184, file: !1185, line: 48, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !100, line: 133, baseType: !46)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1184, file: !1185, line: 53, baseType: !1190, size: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !100, line: 136, baseType: !46)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1184, file: !1185, line: 61, baseType: !1192, size: 64, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !100, line: 139, baseType: !46)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1184, file: !1185, line: 62, baseType: !1194, size: 32, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !100, line: 138, baseType: !230)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1184, file: !1185, line: 64, baseType: !805, size: 32, offset: 224)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1184, file: !1185, line: 65, baseType: !807, size: 32, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1184, file: !1185, line: 67, baseType: !43, size: 32, offset: 288)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1184, file: !1185, line: 69, baseType: !1188, size: 64, offset: 320)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1184, file: !1185, line: 74, baseType: !847, size: 64, offset: 384)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1184, file: !1185, line: 78, baseType: !1201, size: 64, offset: 448)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !100, line: 162, baseType: !101)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1184, file: !1185, line: 80, baseType: !1203, size: 64, offset: 512)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !100, line: 167, baseType: !101)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1184, file: !1185, line: 91, baseType: !1205, size: 128, offset: 576)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1206, line: 8, size: 128, elements: !1207)
!1206 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1207 = !{!1208, !1209}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1205, file: !1206, line: 10, baseType: !99, size: 64)
