; ModuleID = 'coreutils-8.27/src/pr.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.COLUMN = type { %struct._IO_FILE*, i8*, i32, i1 (%struct.COLUMN*)*, void (i8)*, i32, i32, i32, i32, i8, i8 }
%struct.timespec = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.timezone = type { i32, i32 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.1 = private unnamed_addr constant [10 x i8] c"coreutils\00", align 1
@.str.2 = private unnamed_addr constant [24 x i8] c"/usr/local/share/locale\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 740, type: !415, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !149, globals: !156)
!3 = !DIFile(filename: "src/pr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !13, !16, !19, !111, !125, !134}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !6, line: 26, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!9 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!10 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!11 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!12 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 537, size: 32, elements: !14)
!14 = !{!15}
!15 = !DIEnumerator(name: "lines_per_header", value: 5)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 539, size: 32, elements: !17)
!17 = !{!18}
!18 = !DIEnumerator(name: "lines_per_footer", value: 5)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !20, file: !3, line: 388, size: 32, elements: !106)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "COLUMN", file: !3, line: 384, size: 512, elements: !21)
!21 = !{!22, !86, !89, !90, !96, !100, !101, !102, !103, !104, !105}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !20, file: !3, line: 386, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !25, line: 7, baseType: !26)
!25 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !27, line: 241, size: 1728, elements: !28)
!27 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!28 = !{!29, !31, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !52, !53, !54, !55, !59, !61, !63, !67, !70, !72, !74, !75, !76, !77, !81, !82}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !26, file: !27, line: 242, baseType: !30, size: 32)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !26, file: !27, line: 247, baseType: !32, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !26, file: !27, line: 248, baseType: !32, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !26, file: !27, line: 249, baseType: !32, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !26, file: !27, line: 250, baseType: !32, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !26, file: !27, line: 251, baseType: !32, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !26, file: !27, line: 252, baseType: !32, size: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !26, file: !27, line: 253, baseType: !32, size: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !26, file: !27, line: 254, baseType: !32, size: 64, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !26, file: !27, line: 256, baseType: !32, size: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !26, file: !27, line: 257, baseType: !32, size: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !26, file: !27, line: 258, baseType: !32, size: 64, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !26, file: !27, line: 260, baseType: !45, size: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !27, line: 156, size: 192, elements: !47)
!47 = !{!48, !49, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !46, file: !27, line: 157, baseType: !45, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !46, file: !27, line: 158, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !46, file: !27, line: 162, baseType: !30, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !26, file: !27, line: 262, baseType: !50, size: 64, offset: 832)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !26, file: !27, line: 264, baseType: !30, size: 32, offset: 896)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !26, file: !27, line: 268, baseType: !30, size: 32, offset: 928)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !26, file: !27, line: 270, baseType: !56, size: 64, offset: 960)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !57, line: 140, baseType: !58)
!57 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!58 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !26, file: !27, line: 274, baseType: !60, size: 16, offset: 1024)
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !26, file: !27, line: 275, baseType: !62, size: 8, offset: 1040)
!62 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !26, file: !27, line: 276, baseType: !64, size: 8, offset: 1048)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 1)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !26, file: !27, line: 280, baseType: !68, size: 64, offset: 1088)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !27, line: 150, baseType: null)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !26, file: !27, line: 289, baseType: !71, size: 64, offset: 1152)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !57, line: 141, baseType: !58)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !26, file: !27, line: 297, baseType: !73, size: 64, offset: 1216)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !26, file: !27, line: 298, baseType: !73, size: 64, offset: 1280)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !26, file: !27, line: 299, baseType: !73, size: 64, offset: 1344)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !26, file: !27, line: 300, baseType: !73, size: 64, offset: 1408)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !26, file: !27, line: 302, baseType: !78, size: 64, offset: 1472)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 62, baseType: !80)
!79 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!80 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !26, file: !27, line: 303, baseType: !30, size: 32, offset: 1536)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !26, file: !27, line: 305, baseType: !83, size: 160, offset: 1568)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 20)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !20, file: !3, line: 387, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !20, file: !3, line: 396, baseType: !19, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "print_func", scope: !20, file: !3, line: 399, baseType: !91, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !95}
!94 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "char_func", scope: !20, file: !3, line: 402, baseType: !97, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !33}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "current_line", scope: !20, file: !3, line: 404, baseType: !30, size: 32, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "lines_stored", scope: !20, file: !3, line: 405, baseType: !30, size: 32, offset: 352)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "lines_to_print", scope: !20, file: !3, line: 406, baseType: !30, size: 32, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "start_position", scope: !20, file: !3, line: 407, baseType: !30, size: 32, offset: 416)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "numbered", scope: !20, file: !3, line: 408, baseType: !94, size: 8, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "full_page_printed", scope: !20, file: !3, line: 409, baseType: !94, size: 8, offset: 456)
!106 = !{!107, !108, !109, !110}
!107 = !DIEnumerator(name: "OPEN", value: 0)
!108 = !DIEnumerator(name: "FF_FOUND", value: 1)
!109 = !DIEnumerator(name: "ON_HOLD", value: 2)
!110 = !DIEnumerator(name: "CLOSED", value: 3)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !112, line: 32, size: 32, elements: !113)
!112 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!114 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!115 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!116 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!117 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!118 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!119 = !DIEnumerator(name: "c_quoting_style", value: 5)
!120 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!121 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!122 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!123 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!124 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !126, line: 45, size: 32, elements: !127)
!126 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!127 = !{!128, !129, !130, !131, !132, !133}
!128 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!129 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!130 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!131 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!132 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!133 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !135, line: 46, size: 32, elements: !136)
!135 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!137 = !DIEnumerator(name: "_ISupper", value: 256)
!138 = !DIEnumerator(name: "_ISlower", value: 512)
!139 = !DIEnumerator(name: "_ISalpha", value: 1024)
!140 = !DIEnumerator(name: "_ISdigit", value: 2048)
!141 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!142 = !DIEnumerator(name: "_ISspace", value: 8192)
!143 = !DIEnumerator(name: "_ISprint", value: 16384)
!144 = !DIEnumerator(name: "_ISgraph", value: 32768)
!145 = !DIEnumerator(name: "_ISblank", value: 1)
!146 = !DIEnumerator(name: "_IScntrl", value: 2)
!147 = !DIEnumerator(name: "_ISpunct", value: 4)
!148 = !DIEnumerator(name: "_ISalnum", value: 8)
!149 = !{!73, !150, !32, !78, !62, !151, !152, !60, !30, !58, !80, !153, !154, !155}
!150 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!151 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!154 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!156 = !{!157, !159, !161, !0, !167, !181, !186, !188, !190, !192, !194, !196, !198, !200, !202, !204, !206, !208, !210, !212, !214, !216, !218, !220, !222, !224, !226, !228, !230, !232, !234, !236, !238, !240, !242, !244, !246, !248, !250, !252, !254, !256, !258, !260, !262, !264, !266, !268, !270, !272, !276, !347, !349, !351, !353, !355, !357, !359, !361, !363, !365, !367, !369, !371, !373, !375, !377, !379, !381, !383, !385, !387, !389, !391, !393, !395}
!157 = !DIGlobalVariableExpression(var: !158)
!158 = distinct !DIGlobalVariable(name: "custom_header", scope: !2, file: !3, line: 709, type: !32, isLocal: true, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160)
!160 = distinct !DIGlobalVariable(name: "date_format", scope: !2, file: !3, line: 712, type: !87, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162)
!162 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 715, type: !163, isLocal: true, isDefinition: true)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !164, line: 594, baseType: !165)
!164 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !164, line: 594, flags: DIFlagFwdDecl)
!167 = !DIGlobalVariableExpression(var: !168)
!168 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 743, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 6912, elements: !179)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !172, line: 50, size: 256, elements: !173)
!172 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!173 = !{!174, !175, !176, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !172, line: 52, baseType: !87, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !171, file: !172, line: 55, baseType: !30, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !172, line: 56, baseType: !177, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !171, file: !172, line: 57, baseType: !30, size: 32, offset: 192)
!179 = !{!180}
!180 = !DISubrange(count: 27)
!181 = !DIGlobalVariableExpression(var: !182)
!182 = distinct !DIGlobalVariable(name: "first_page_number", scope: !2, file: !3, line: 612, type: !183, isLocal: true, isDefinition: true)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !184, line: 112, baseType: !185)
!184 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !57, line: 62, baseType: !80)
!186 = !DIGlobalVariableExpression(var: !187)
!187 = distinct !DIGlobalVariable(name: "last_page_number", scope: !2, file: !3, line: 613, type: !183, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189)
!189 = distinct !DIGlobalVariable(name: "columns", scope: !2, file: !3, line: 608, type: !30, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191)
!191 = distinct !DIGlobalVariable(name: "print_across_flag", scope: !2, file: !3, line: 521, type: !94, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "storing_columns", scope: !2, file: !3, line: 524, type: !94, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195)
!195 = distinct !DIGlobalVariable(name: "balance_columns", scope: !2, file: !3, line: 530, type: !94, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "use_cntrl_prefix", scope: !2, file: !3, line: 672, type: !94, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199)
!199 = distinct !DIGlobalVariable(name: "double_space", scope: !2, file: !3, line: 675, type: !94, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201)
!201 = distinct !DIGlobalVariable(name: "input_tab_char", scope: !2, file: !3, line: 560, type: !33, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203)
!203 = distinct !DIGlobalVariable(name: "chars_per_input_tab", scope: !2, file: !3, line: 564, type: !30, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205)
!205 = distinct !DIGlobalVariable(name: "untabify_input", scope: !2, file: !3, line: 557, type: !94, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207)
!207 = distinct !DIGlobalVariable(name: "use_form_feed", scope: !2, file: !3, line: 515, type: !94, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209)
!209 = distinct !DIGlobalVariable(name: "output_tab_char", scope: !2, file: !3, line: 570, type: !33, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "chars_per_output_tab", scope: !2, file: !3, line: 573, type: !30, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213)
!213 = distinct !DIGlobalVariable(name: "tabify_output", scope: !2, file: !3, line: 567, type: !94, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215)
!215 = distinct !DIGlobalVariable(name: "join_lines", scope: !2, file: !3, line: 550, type: !94, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217)
!217 = distinct !DIGlobalVariable(name: "lines_per_page", scope: !2, file: !3, line: 533, type: !30, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219)
!219 = distinct !DIGlobalVariable(name: "parallel_files", scope: !2, file: !3, line: 480, type: !94, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221)
!221 = distinct !DIGlobalVariable(name: "numbered_lines", scope: !2, file: !3, line: 637, type: !94, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223)
!223 = distinct !DIGlobalVariable(name: "number_separator", scope: !2, file: !3, line: 640, type: !33, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225)
!225 = distinct !DIGlobalVariable(name: "chars_per_number", scope: !2, file: !3, line: 656, type: !30, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227)
!227 = distinct !DIGlobalVariable(name: "skip_count", scope: !2, file: !3, line: 649, type: !94, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229)
!229 = distinct !DIGlobalVariable(name: "start_line_num", scope: !2, file: !3, line: 653, type: !30, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231)
!231 = distinct !DIGlobalVariable(name: "chars_per_margin", scope: !2, file: !3, line: 581, type: !30, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233)
!233 = distinct !DIGlobalVariable(name: "ignore_failed_opens", scope: !2, file: !3, line: 682, type: !94, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235)
!235 = distinct !DIGlobalVariable(name: "use_col_separator", scope: !2, file: !3, line: 686, type: !94, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237)
!237 = distinct !DIGlobalVariable(name: "col_sep_string", scope: !2, file: !3, line: 691, type: !87, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239)
!239 = distinct !DIGlobalVariable(name: "col_sep_length", scope: !2, file: !3, line: 692, type: !30, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241)
!241 = distinct !DIGlobalVariable(name: "extremities", scope: !2, file: !3, line: 503, type: !94, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243)
!243 = distinct !DIGlobalVariable(name: "keep_FF", scope: !2, file: !3, line: 507, type: !94, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245)
!245 = distinct !DIGlobalVariable(name: "use_esc_sequence", scope: !2, file: !3, line: 668, type: !94, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247)
!247 = distinct !DIGlobalVariable(name: "truncate_lines", scope: !2, file: !3, line: 546, type: !94, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249)
!249 = distinct !DIGlobalVariable(name: "chars_per_line", scope: !2, file: !3, line: 543, type: !30, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251)
!251 = distinct !DIGlobalVariable(name: "explicit_columns", scope: !2, file: !3, line: 500, type: !94, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253)
!253 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 518, type: !94, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255)
!255 = distinct !DIGlobalVariable(name: "failed_opens", scope: !2, file: !3, line: 597, type: !94, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257)
!257 = distinct !DIGlobalVariable(name: "lines_per_body", scope: !2, file: !3, line: 538, type: !30, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259)
!259 = distinct !DIGlobalVariable(name: "line_separator", scope: !2, file: !3, line: 694, type: !32, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261)
!261 = distinct !DIGlobalVariable(name: "column_separator", scope: !2, file: !3, line: 693, type: !32, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263)
!263 = distinct !DIGlobalVariable(name: "number_width", scope: !2, file: !3, line: 661, type: !30, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265)
!265 = distinct !DIGlobalVariable(name: "chars_per_column", scope: !2, file: !3, line: 554, type: !30, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267)
!267 = distinct !DIGlobalVariable(name: "number_buff", scope: !2, file: !3, line: 664, type: !32, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269)
!269 = distinct !DIGlobalVariable(name: "clump_buff", scope: !2, file: !3, line: 724, type: !32, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271)
!271 = distinct !DIGlobalVariable(name: "total_files", scope: !2, file: !3, line: 679, type: !30, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273)
!273 = distinct !DIGlobalVariable(name: "column_vector", scope: !2, file: !3, line: 450, type: !274, isLocal: true, isDefinition: true)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLUMN", file: !3, line: 417, baseType: !20)
!276 = !DIGlobalVariableExpression(var: !277)
!277 = distinct !DIGlobalVariable(name: "timespec", scope: !278, file: !3, line: 1642, type: !309, isLocal: true, isDefinition: true)
!278 = distinct !DISubprogram(name: "init_header", scope: !3, file: !3, line: 1627, type: !279, isLocal: true, isDefinition: true, scopeLine: 1628, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !281)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !87, !30}
!281 = !{!282, !283, !284, !285, !322, !323, !324, !339, !342}
!282 = !DILocalVariable(name: "filename", arg: 1, scope: !278, file: !3, line: 1627, type: !87)
!283 = !DILocalVariable(name: "desc", arg: 2, scope: !278, file: !3, line: 1627, type: !30)
!284 = !DILocalVariable(name: "buf", scope: !278, file: !3, line: 1629, type: !32)
!285 = !DILocalVariable(name: "st", scope: !278, file: !3, line: 1630, type: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !287, line: 46, size: 1152, elements: !288)
!287 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!288 = !{!289, !291, !293, !295, !297, !299, !301, !302, !303, !304, !306, !308, !316, !317, !318}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !286, file: !287, line: 48, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !57, line: 133, baseType: !80)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !286, file: !287, line: 53, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !57, line: 136, baseType: !80)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !286, file: !287, line: 61, baseType: !294, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !57, line: 139, baseType: !80)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !286, file: !287, line: 62, baseType: !296, size: 32, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !57, line: 138, baseType: !150)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !286, file: !287, line: 64, baseType: !298, size: 32, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !57, line: 134, baseType: !150)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !286, file: !287, line: 65, baseType: !300, size: 32, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !57, line: 135, baseType: !150)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !286, file: !287, line: 67, baseType: !30, size: 32, offset: 288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !286, file: !287, line: 69, baseType: !290, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !286, file: !287, line: 74, baseType: !56, size: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !286, file: !287, line: 78, baseType: !305, size: 64, offset: 448)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !57, line: 162, baseType: !58)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !286, file: !287, line: 80, baseType: !307, size: 64, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !57, line: 167, baseType: !58)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !286, file: !287, line: 91, baseType: !309, size: 128, offset: 576)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !310, line: 8, size: 128, elements: !311)
!310 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!311 = !{!312, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !309, file: !310, line: 10, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !57, line: 148, baseType: !58)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !309, file: !310, line: 11, baseType: !315, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !57, line: 184, baseType: !58)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !286, file: !287, line: 92, baseType: !309, size: 128, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !286, file: !287, line: 93, baseType: !309, size: 128, offset: 832)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !286, file: !287, line: 106, baseType: !319, size: 192, offset: 960)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 192, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 3)
!322 = !DILocalVariable(name: "t", scope: !278, file: !3, line: 1631, type: !309)
!323 = !DILocalVariable(name: "ns", scope: !278, file: !3, line: 1632, type: !30)
!324 = !DILocalVariable(name: "tm", scope: !278, file: !3, line: 1633, type: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !326, line: 7, size: 448, elements: !327)
!326 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !325, file: !326, line: 9, baseType: !30, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !325, file: !326, line: 10, baseType: !30, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !325, file: !326, line: 11, baseType: !30, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !325, file: !326, line: 12, baseType: !30, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !325, file: !326, line: 13, baseType: !30, size: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !325, file: !326, line: 14, baseType: !30, size: 32, offset: 160)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !325, file: !326, line: 15, baseType: !30, size: 32, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !325, file: !326, line: 16, baseType: !30, size: 32, offset: 224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !325, file: !326, line: 17, baseType: !30, size: 32, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !325, file: !326, line: 20, baseType: !58, size: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !325, file: !326, line: 21, baseType: !87, size: 64, offset: 384)
!339 = !DILocalVariable(name: "bufsize", scope: !340, file: !3, line: 1651, type: !78)
!340 = distinct !DILexicalBlock(scope: !341, file: !3, line: 1650, column: 5)
!341 = distinct !DILexicalBlock(scope: !278, file: !3, line: 1649, column: 7)
!342 = !DILocalVariable(name: "secbuf", scope: !343, file: !3, line: 1658, type: !344)
!343 = distinct !DILexicalBlock(scope: !341, file: !3, line: 1657, column: 5)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 168, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 21)
!347 = !DIGlobalVariableExpression(var: !348)
!348 = distinct !DIGlobalVariable(name: "date_text", scope: !2, file: !3, line: 718, type: !32, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350)
!350 = distinct !DIGlobalVariable(name: "file_text", scope: !2, file: !3, line: 719, type: !87, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352)
!352 = distinct !DIGlobalVariable(name: "header_width_available", scope: !2, file: !3, line: 722, type: !30, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354)
!354 = distinct !DIGlobalVariable(name: "files_ready_to_read", scope: !2, file: !3, line: 616, type: !30, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356)
!356 = distinct !DIGlobalVariable(name: "line_vector", scope: !2, file: !3, line: 470, type: !177, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358)
!358 = distinct !DIGlobalVariable(name: "end_vector", scope: !2, file: !3, line: 477, type: !177, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360)
!360 = distinct !DIGlobalVariable(name: "buff", scope: !2, file: !3, line: 456, type: !32, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362)
!362 = distinct !DIGlobalVariable(name: "buff_allocated", scope: !2, file: !3, line: 464, type: !78, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364)
!364 = distinct !DIGlobalVariable(name: "last_line", scope: !2, file: !3, line: 730, type: !94, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366)
!366 = distinct !DIGlobalVariable(name: "page_number", scope: !2, file: !3, line: 619, type: !183, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368)
!368 = distinct !DIGlobalVariable(name: "buff_current", scope: !2, file: !3, line: 460, type: !150, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370)
!370 = distinct !DIGlobalVariable(name: "pad_vertically", scope: !2, file: !3, line: 706, type: !94, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372)
!372 = distinct !DIGlobalVariable(name: "print_a_header", scope: !2, file: !3, line: 512, type: !94, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374)
!374 = distinct !DIGlobalVariable(name: "padding_not_printed", scope: !2, file: !3, line: 702, type: !30, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376)
!376 = distinct !DIGlobalVariable(name: "separators_not_printed", scope: !2, file: !3, line: 698, type: !30, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378)
!378 = distinct !DIGlobalVariable(name: "spaces_not_printed", scope: !2, file: !3, line: 578, type: !30, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380)
!380 = distinct !DIGlobalVariable(name: "output_position", scope: !2, file: !3, line: 587, type: !30, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382)
!382 = distinct !DIGlobalVariable(name: "input_position", scope: !2, file: !3, line: 593, type: !30, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384)
!384 = distinct !DIGlobalVariable(name: "FF_only", scope: !2, file: !3, line: 495, type: !94, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386)
!386 = distinct !DIGlobalVariable(name: "print_a_FF", scope: !2, file: !3, line: 508, type: !94, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388)
!388 = distinct !DIGlobalVariable(name: "align_empty_cols", scope: !2, file: !3, line: 484, type: !94, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390)
!390 = distinct !DIGlobalVariable(name: "empty_line", scope: !2, file: !3, line: 488, type: !94, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392)
!392 = distinct !DIGlobalVariable(name: "line_count", scope: !2, file: !3, line: 644, type: !30, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394)
!394 = distinct !DIGlobalVariable(name: "line_number", scope: !2, file: !3, line: 634, type: !30, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396)
!396 = distinct !DIGlobalVariable(name: "infomap", scope: !397, file: !398, line: 632, type: !412, isLocal: true, isDefinition: true)
!397 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !398, file: !398, line: 630, type: !399, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !401)
!398 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!399 = !DISubroutineType(types: !400)
!400 = !{null, !87}
!401 = !{!402, !403, !404, !411}
!402 = !DILocalVariable(name: "program", arg: 1, scope: !397, file: !398, line: 630, type: !87)
!403 = !DILocalVariable(name: "node", scope: !397, file: !398, line: 642, type: !87)
!404 = !DILocalVariable(name: "map_prog", scope: !397, file: !398, line: 643, type: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !397, file: !398, line: 632, size: 128, elements: !408)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !407, file: !398, line: 632, baseType: !87, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !407, file: !398, line: 632, baseType: !87, size: 64, offset: 64)
!411 = !DILocalVariable(name: "lc_messages", scope: !397, file: !398, line: 655, type: !87)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 896, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 7)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 424, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 53)
!418 = !DIGlobalVariableExpression(var: !419)
!419 = distinct !DIGlobalVariable(name: "Version", scope: !420, file: !421, line: 2, type: !87, isLocal: false, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, globals: !423)
!421 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!422 = !{}
!423 = !{!418}
!424 = !DIGlobalVariableExpression(var: !425)
!425 = distinct !DIGlobalVariable(name: "file_name", scope: !426, file: !431, line: 36, type: !87, isLocal: true, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, globals: !428)
!427 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!428 = !{!424, !429}
!429 = !DIGlobalVariableExpression(var: !430)
!430 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !426, file: !431, line: 46, type: !94, isLocal: true, isDefinition: true)
!431 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!432 = !DIGlobalVariableExpression(var: !433)
!433 = distinct !DIGlobalVariable(name: "exit_failure", scope: !434, file: !437, line: 24, type: !438, isLocal: false, isDefinition: true)
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, globals: !436)
!435 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!436 = !{!432}
!437 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!438 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!439 = !DIGlobalVariableExpression(var: !440)
!440 = distinct !DIGlobalVariable(name: "program_name", scope: !441, file: !445, line: 33, type: !87, isLocal: false, isDefinition: true)
!441 = distinct !DICompileUnit(language: DW_LANG_C99, file: !442, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !443, globals: !444)
!442 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!443 = !{!73, !32}
!444 = !{!439}
!445 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!446 = !DIGlobalVariableExpression(var: !447)
!447 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !448, file: !460, line: 77, type: !495, isLocal: false, isDefinition: true)
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !450, retainedTypes: !456, globals: !457)
!449 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!450 = !{!111, !451, !134}
!451 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !112, line: 242, size: 32, elements: !452)
!452 = !{!453, !454, !455}
!453 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!454 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!455 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!456 = !{!30, !60, !78, !32}
!457 = !{!446, !458, !465, !477, !479, !484, !491, !493}
!458 = !DIGlobalVariableExpression(var: !459)
!459 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !448, file: !460, line: 93, type: !461, isLocal: false, isDefinition: true)
!460 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 320, elements: !463)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!463 = !{!464}
!464 = !DISubrange(count: 10)
!465 = !DIGlobalVariableExpression(var: !466)
!466 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !448, file: !460, line: 1043, type: !467, isLocal: false, isDefinition: true)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !460, line: 57, size: 448, elements: !468)
!468 = !{!469, !470, !471, !475, !476}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !467, file: !460, line: 60, baseType: !111, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !467, file: !460, line: 63, baseType: !30, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !467, file: !460, line: 67, baseType: !472, size: 256, offset: 64)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 8)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !467, file: !460, line: 70, baseType: !87, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !467, file: !460, line: 73, baseType: !87, size: 64, offset: 384)
!477 = !DIGlobalVariableExpression(var: !478)
!478 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !448, file: !460, line: 108, type: !467, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480)
!480 = distinct !DIGlobalVariable(name: "slot0", scope: !448, file: !460, line: 834, type: !481, isLocal: true, isDefinition: true)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 256)
!484 = !DIGlobalVariableExpression(var: !485)
!485 = distinct !DIGlobalVariable(name: "slotvec", scope: !448, file: !460, line: 837, type: !486, isLocal: true, isDefinition: true)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !460, line: 826, size: 128, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !487, file: !460, line: 828, baseType: !78, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !487, file: !460, line: 829, baseType: !32, size: 64, offset: 64)
!491 = !DIGlobalVariableExpression(var: !492)
!492 = distinct !DIGlobalVariable(name: "nslots", scope: !448, file: !460, line: 835, type: !30, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494)
!494 = distinct !DIGlobalVariable(name: "slotvec0", scope: !448, file: !460, line: 836, type: !487, isLocal: true, isDefinition: true)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 704, elements: !497)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!497 = !{!498}
!498 = !DISubrange(count: 11)
!499 = !DIGlobalVariableExpression(var: !500)
!500 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !501, file: !504, line: 26, type: !505, isLocal: false, isDefinition: true)
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, globals: !503)
!502 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!503 = !{!499}
!504 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 376, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 47)
!508 = !DIGlobalVariableExpression(var: !509)
!509 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !510, file: !511, line: 335, type: !30, isLocal: true, isDefinition: true)
!510 = distinct !DISubprogram(name: "rpl_fcntl", scope: !511, file: !511, line: 272, type: !512, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !514, variables: !517)
!511 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!512 = !DISubroutineType(types: !513)
!513 = !{!30, !30, !30, null}
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, globals: !516)
!515 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!516 = !{!508}
!517 = !{!518, !519, !520, !531, !532, !535, !538, !541}
!518 = !DILocalVariable(name: "fd", arg: 1, scope: !510, file: !511, line: 272, type: !30)
!519 = !DILocalVariable(name: "action", arg: 2, scope: !510, file: !511, line: 272, type: !30)
!520 = !DILocalVariable(name: "arg", scope: !510, file: !511, line: 274, type: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !522, line: 30, baseType: !523)
!522 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !515, line: 274, baseType: !524)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 192, elements: !65)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !515, line: 274, size: 192, elements: !526)
!526 = !{!527, !528, !529, !530}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !525, file: !515, line: 274, baseType: !150, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !525, file: !515, line: 274, baseType: !150, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !525, file: !515, line: 274, baseType: !73, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !525, file: !515, line: 274, baseType: !73, size: 64, offset: 128)
!531 = !DILocalVariable(name: "result", scope: !510, file: !511, line: 275, type: !30)
!532 = !DILocalVariable(name: "target", scope: !533, file: !511, line: 322, type: !30)
!533 = distinct !DILexicalBlock(scope: !534, file: !511, line: 321, column: 7)
!534 = distinct !DILexicalBlock(scope: !510, file: !511, line: 278, column: 5)
!535 = !DILocalVariable(name: "flags", scope: !536, file: !511, line: 359, type: !30)
!536 = distinct !DILexicalBlock(scope: !537, file: !511, line: 358, column: 11)
!537 = distinct !DILexicalBlock(scope: !533, file: !511, line: 357, column: 13)
!538 = !DILocalVariable(name: "saved_errno", scope: !539, file: !511, line: 362, type: !30)
!539 = distinct !DILexicalBlock(scope: !540, file: !511, line: 361, column: 15)
!540 = distinct !DILexicalBlock(scope: !536, file: !511, line: 360, column: 17)
!541 = !DILocalVariable(name: "p", scope: !542, file: !511, line: 404, type: !73)
!542 = distinct !DILexicalBlock(scope: !534, file: !511, line: 402, column: 7)
!543 = !DIGlobalVariableExpression(var: !544)
!544 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !545, file: !888, line: 120, type: !889, isLocal: true, isDefinition: true)
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !547, retainedTypes: !886, globals: !887)
!546 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!547 = !{!548}
!548 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !549, line: 41, size: 32, elements: !550)
!549 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885}
!551 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!552 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!553 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!554 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!555 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!556 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!557 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!558 = !DIEnumerator(name: "DAY_1", value: 131079)
!559 = !DIEnumerator(name: "DAY_2", value: 131080)
!560 = !DIEnumerator(name: "DAY_3", value: 131081)
!561 = !DIEnumerator(name: "DAY_4", value: 131082)
!562 = !DIEnumerator(name: "DAY_5", value: 131083)
!563 = !DIEnumerator(name: "DAY_6", value: 131084)
!564 = !DIEnumerator(name: "DAY_7", value: 131085)
!565 = !DIEnumerator(name: "ABMON_1", value: 131086)
!566 = !DIEnumerator(name: "ABMON_2", value: 131087)
!567 = !DIEnumerator(name: "ABMON_3", value: 131088)
!568 = !DIEnumerator(name: "ABMON_4", value: 131089)
!569 = !DIEnumerator(name: "ABMON_5", value: 131090)
!570 = !DIEnumerator(name: "ABMON_6", value: 131091)
!571 = !DIEnumerator(name: "ABMON_7", value: 131092)
!572 = !DIEnumerator(name: "ABMON_8", value: 131093)
!573 = !DIEnumerator(name: "ABMON_9", value: 131094)
!574 = !DIEnumerator(name: "ABMON_10", value: 131095)
!575 = !DIEnumerator(name: "ABMON_11", value: 131096)
!576 = !DIEnumerator(name: "ABMON_12", value: 131097)
!577 = !DIEnumerator(name: "MON_1", value: 131098)
!578 = !DIEnumerator(name: "MON_2", value: 131099)
!579 = !DIEnumerator(name: "MON_3", value: 131100)
!580 = !DIEnumerator(name: "MON_4", value: 131101)
!581 = !DIEnumerator(name: "MON_5", value: 131102)
!582 = !DIEnumerator(name: "MON_6", value: 131103)
!583 = !DIEnumerator(name: "MON_7", value: 131104)
!584 = !DIEnumerator(name: "MON_8", value: 131105)
!585 = !DIEnumerator(name: "MON_9", value: 131106)
!586 = !DIEnumerator(name: "MON_10", value: 131107)
!587 = !DIEnumerator(name: "MON_11", value: 131108)
!588 = !DIEnumerator(name: "MON_12", value: 131109)
!589 = !DIEnumerator(name: "AM_STR", value: 131110)
!590 = !DIEnumerator(name: "PM_STR", value: 131111)
!591 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!592 = !DIEnumerator(name: "D_FMT", value: 131113)
!593 = !DIEnumerator(name: "T_FMT", value: 131114)
!594 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!595 = !DIEnumerator(name: "ERA", value: 131116)
!596 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!597 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!598 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!599 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!600 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!601 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!602 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!603 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!604 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!605 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!606 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!607 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!608 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!609 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!610 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!611 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!612 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!613 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!614 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!615 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!616 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!617 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!618 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!619 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!620 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!621 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!622 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!623 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!624 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!625 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!626 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!627 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!628 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!629 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!630 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!631 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!632 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!633 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!634 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!635 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!636 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!637 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!638 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!639 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!640 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!641 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!642 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!643 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!644 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!645 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!646 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!647 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!648 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!649 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!650 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!651 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!652 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!653 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!654 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!655 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!656 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!657 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!658 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!659 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!660 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!661 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!662 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!663 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!664 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!665 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!666 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!667 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!668 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!669 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!670 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!671 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!672 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!673 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!674 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!675 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!676 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!677 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!678 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!679 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!680 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!681 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!682 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!683 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!684 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!685 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!686 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!687 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!688 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!689 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!690 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!691 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!692 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!693 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!694 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!695 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!696 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!697 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!698 = !DIEnumerator(name: "CODESET", value: 14)
!699 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!700 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!701 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!702 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!703 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!704 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!705 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!706 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!707 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!708 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!709 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!710 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!711 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!712 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!713 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!714 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!715 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!716 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!717 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!718 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!719 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!720 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!721 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!722 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!723 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!724 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!725 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!726 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!727 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!728 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!729 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!730 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!731 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!732 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!733 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!734 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!735 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!736 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!737 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!738 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!739 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!740 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!741 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!742 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!743 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!744 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!745 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!746 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!747 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!748 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!749 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!750 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!751 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!752 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!753 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!754 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!755 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!756 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!757 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!758 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!759 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!760 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!761 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!762 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!763 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!764 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!765 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!766 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!767 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!768 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!769 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!770 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!771 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!772 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!773 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!774 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!775 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!776 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!777 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!778 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!779 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!780 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!781 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!782 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!783 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!784 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!785 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!786 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!787 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!788 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!789 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!790 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!791 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!792 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!793 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!794 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!795 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!796 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!797 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!798 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!799 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!800 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!801 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!802 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!803 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!804 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!805 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!806 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!807 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!808 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!809 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!810 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!811 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!812 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!813 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!814 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!815 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!816 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!817 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!818 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!819 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!820 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!821 = !DIEnumerator(name: "THOUSEP", value: 65537)
!822 = !DIEnumerator(name: "__GROUPING", value: 65538)
!823 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!824 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!825 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!826 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!827 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!828 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!829 = !DIEnumerator(name: "__YESSTR", value: 327682)
!830 = !DIEnumerator(name: "__NOSTR", value: 327683)
!831 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!832 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!833 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!834 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!835 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!836 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!837 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!838 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!839 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!840 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!841 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!842 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!843 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!844 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!845 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!846 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!847 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!848 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!849 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!850 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!851 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!852 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!853 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!854 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!855 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!856 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!857 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!858 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!859 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!860 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!861 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!862 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!863 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!864 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!865 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!866 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!867 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!868 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!869 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!870 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!871 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!872 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!873 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!874 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!875 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!876 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!877 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!878 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!879 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!880 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!881 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!882 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!883 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!884 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!885 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!886 = !{!73, !32, !155}
!887 = !{!543}
!888 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!889 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !87)
!890 = !DIGlobalVariableExpression(var: !891)
!891 = distinct !DIGlobalVariable(name: "__mon_yday", scope: !892, file: !898, line: 124, type: !911, isLocal: true, isDefinition: true)
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !894, globals: !895)
!893 = !DIFile(filename: "./lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!894 = !{!150, !30, !62, !151, !152, !60, !58, !80, !153, !154}
!895 = !{!896, !902, !905, !890}
!896 = !DIGlobalVariableExpression(var: !897, expr: !901)
!897 = distinct !DIGlobalVariable(name: "mktime_min", scope: !892, file: !898, line: 95, type: !899, isLocal: true, isDefinition: true)
!898 = !DIFile(filename: "lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_int", file: !898, line: 68, baseType: !58)
!901 = !DIExpression(DW_OP_constu, 9223372036854775808, DW_OP_stack_value)
!902 = !DIGlobalVariableExpression(var: !903, expr: !904)
!903 = distinct !DIGlobalVariable(name: "mktime_max", scope: !892, file: !898, line: 98, type: !899, isLocal: true, isDefinition: true)
!904 = !DIExpression(DW_OP_constu, 9223372036854775807, DW_OP_stack_value)
!905 = !DIGlobalVariableExpression(var: !906)
!906 = distinct !DIGlobalVariable(name: "localtime_offset", scope: !892, file: !898, line: 462, type: !907, isLocal: true, isDefinition: true)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "mktime_offset_t", file: !908, line: 30, baseType: !909)
!908 = !DIFile(filename: "./lib/mktime-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !910, line: 7, baseType: !313)
!910 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 416, elements: !913)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!913 = !{!914, !915}
!914 = !DISubrange(count: 2)
!915 = !DISubrange(count: 13)
!916 = distinct !DICompileUnit(language: DW_LANG_C99, file: !917, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !918)
!917 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!918 = !{!125}
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422)
!920 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422)
!922 = !DIFile(filename: "./lib/gettime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422)
!924 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !927)
!926 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!927 = !{!928}
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !184, line: 111, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !57, line: 61, baseType: !58)
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !932, retainedTypes: !933)
!931 = !DIFile(filename: "./lib/mbswidth.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!932 = !{!134}
!933 = !{!78, !151, !30, !60}
!934 = distinct !DICompileUnit(language: DW_LANG_C99, file: !935, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !936)
!935 = !DIFile(filename: "./lib/strftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!936 = !{!87, !150, !78, !73, !937, !30, !151}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!939 = distinct !DICompileUnit(language: DW_LANG_C99, file: !940, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422)
!940 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !943, retainedTypes: !948)
!942 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!943 = !{!944}
!944 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !945, line: 41, size: 32, elements: !946)
!945 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!946 = !{!947}
!947 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!948 = !{!73}
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !951, retainedTypes: !965)
!950 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!951 = !{!952}
!952 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !954, file: !953, line: 192, size: 32, elements: !963)
!953 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!954 = distinct !DISubprogram(name: "x2nrealloc", scope: !953, file: !953, line: 180, type: !955, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !949, variables: !958)
!955 = !DISubroutineType(types: !956)
!956 = !{!73, !73, !957, !78}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!958 = !{!959, !960, !961, !962}
!959 = !DILocalVariable(name: "p", arg: 1, scope: !954, file: !953, line: 180, type: !73)
!960 = !DILocalVariable(name: "pn", arg: 2, scope: !954, file: !953, line: 180, type: !957)
!961 = !DILocalVariable(name: "s", arg: 3, scope: !954, file: !953, line: 180, type: !78)
!962 = !DILocalVariable(name: "n", scope: !954, file: !953, line: 182, type: !78)
!963 = !{!964}
!964 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!965 = !{!78, !32, !73}
!966 = distinct !DICompileUnit(language: DW_LANG_C99, file: !967, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422)
!967 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!968 = distinct !DICompileUnit(language: DW_LANG_C99, file: !969, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !970)
!969 = !DIFile(filename: "./lib/xdectoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!970 = !{!5}
!971 = distinct !DICompileUnit(language: DW_LANG_C99, file: !972, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !970)
!972 = !DIFile(filename: "./lib/xstrtoimax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!973 = distinct !DICompileUnit(language: DW_LANG_C99, file: !974, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !970)
!974 = !DIFile(filename: "./lib/xstrtol.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!975 = distinct !DICompileUnit(language: DW_LANG_C99, file: !976, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !970)
!976 = !DIFile(filename: "./lib/xstrtol-error.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!977 = distinct !DICompileUnit(language: DW_LANG_C99, file: !978, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !979, retainedTypes: !980)
!978 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!979 = !{!5, !134}
!980 = !{!30, !60}
!981 = distinct !DICompileUnit(language: DW_LANG_C99, file: !982, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !948)
!982 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!983 = distinct !DICompileUnit(language: DW_LANG_C99, file: !984, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422)
!984 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!985 = distinct !DICompileUnit(language: DW_LANG_C99, file: !986, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !948)
!986 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!987 = distinct !DICompileUnit(language: DW_LANG_C99, file: !988, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !948)
!988 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!989 = distinct !DICompileUnit(language: DW_LANG_C99, file: !990, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !991)
!990 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!991 = !{!78}
!992 = distinct !DICompileUnit(language: DW_LANG_C99, file: !993, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !994, retainedTypes: !999, globals: !1000)
!993 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!994 = !{!995}
!995 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !996, line: 49, size: 32, elements: !997)
!996 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!997 = !{!998}
!998 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119)
!999 = !{!32}
!1000 = !{!1001}
!1001 = !DIGlobalVariableExpression(var: !1002)
!1002 = distinct !DIGlobalVariable(name: "local_tz", scope: !992, file: !996, line: 54, type: !1003, isLocal: true, isDefinition: true)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !164, line: 594, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !1007, line: 21, size: 128, elements: !1008)
!1007 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1006, file: !1007, line: 25, baseType: !1005, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !1006, file: !1007, line: 36, baseType: !33, size: 8, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !1006, file: !1007, line: 48, baseType: !1012, offset: 72)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: -1)
!1015 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1016, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422)
!1016 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1017 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!1018 = !{i32 2, !"Dwarf Version", i32 4}
!1019 = !{i32 2, !"Debug Info Version", i32 3}
!1020 = !{i32 1, !"wchar_size", i32 4}
!1021 = !{i32 7, !"PIC Level", i32 2}
!1022 = !{i32 7, !"PIE Level", i32 2}
!1023 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 857, type: !1024, isLocal: false, isDefinition: true, scopeLine: 858, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1027)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!30, !30, !1026}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1040, !1041, !1044}
!1028 = !DILocalVariable(name: "argc", arg: 1, scope: !1023, file: !3, line: 857, type: !30)
!1029 = !DILocalVariable(name: "argv", arg: 2, scope: !1023, file: !3, line: 857, type: !1026)
!1030 = !DILocalVariable(name: "n_files", scope: !1023, file: !3, line: 859, type: !150)
!1031 = !DILocalVariable(name: "old_options", scope: !1023, file: !3, line: 860, type: !94)
!1032 = !DILocalVariable(name: "old_w", scope: !1023, file: !3, line: 861, type: !94)
!1033 = !DILocalVariable(name: "old_s", scope: !1023, file: !3, line: 862, type: !94)
!1034 = !DILocalVariable(name: "file_names", scope: !1023, file: !3, line: 863, type: !1026)
!1035 = !DILocalVariable(name: "column_count_string", scope: !1023, file: !3, line: 866, type: !32)
!1036 = !DILocalVariable(name: "n_digits", scope: !1023, file: !3, line: 867, type: !78)
!1037 = !DILocalVariable(name: "n_alloc", scope: !1023, file: !3, line: 868, type: !78)
!1038 = !DILocalVariable(name: "oi", scope: !1039, file: !3, line: 885, type: !30)
!1039 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 884, column: 5)
!1040 = !DILocalVariable(name: "c", scope: !1039, file: !3, line: 886, type: !30)
!1041 = !DILocalVariable(name: "tmp_cpl", scope: !1042, file: !3, line: 1032, type: !30)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 1031, column: 11)
!1043 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 904, column: 9)
!1044 = !DILocalVariable(name: "i", scope: !1045, file: !3, line: 1139, type: !150)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 1138, column: 9)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 1135, column: 11)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 1134, column: 5)
!1048 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 1128, column: 7)
!1049 = !DIExpression()
!1050 = !DILocation(line: 857, column: 11, scope: !1023)
!1051 = !DILocation(line: 857, column: 24, scope: !1023)
!1052 = !DILocation(line: 860, column: 8, scope: !1023)
!1053 = !DILocation(line: 861, column: 8, scope: !1023)
!1054 = !DILocation(line: 862, column: 8, scope: !1023)
!1055 = !DILocation(line: 866, column: 9, scope: !1023)
!1056 = !DILocation(line: 867, column: 10, scope: !1023)
!1057 = !DILocation(line: 868, column: 3, scope: !1023)
!1058 = !DILocation(line: 868, column: 10, scope: !1023)
!1059 = !{!1060, !1060, i64 0}
!1060 = !{!"long", !1061, i64 0}
!1061 = !{!"omnipotent char", !1062, i64 0}
!1062 = !{!"Simple C/C++ TBAA"}
!1063 = !DILocation(line: 871, column: 21, scope: !1023)
!1064 = !{!1065, !1065, i64 0}
!1065 = !{!"any pointer", !1061, i64 0}
!1066 = !DILocation(line: 871, column: 3, scope: !1023)
!1067 = !DILocation(line: 872, column: 3, scope: !1023)
!1068 = !DILocation(line: 873, column: 3, scope: !1023)
!1069 = !DILocation(line: 874, column: 3, scope: !1023)
!1070 = !DILocation(line: 876, column: 3, scope: !1023)
!1071 = !DILocation(line: 859, column: 16, scope: !1023)
!1072 = !DILocation(line: 879, column: 22, scope: !1023)
!1073 = !DILocation(line: 879, column: 17, scope: !1023)
!1074 = !DILocalVariable(name: "n", arg: 1, scope: !1075, file: !953, line: 105, type: !78)
!1075 = distinct !DISubprogram(name: "xnmalloc", scope: !953, file: !953, line: 105, type: !1076, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1078)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!73, !78, !78}
!1078 = !{!1074, !1079}
!1079 = !DILocalVariable(name: "s", arg: 2, scope: !1075, file: !953, line: 105, type: !78)
!1080 = !DILocation(line: 105, column: 18, scope: !1075, inlinedAt: !1081)
!1081 = distinct !DILocation(line: 880, column: 19, scope: !1023)
!1082 = !DILocation(line: 105, column: 28, scope: !1075, inlinedAt: !1081)
!1083 = !DILocation(line: 880, column: 34, scope: !1023)
!1084 = !DILocation(line: 880, column: 29, scope: !1023)
!1085 = !DILocation(line: 109, column: 21, scope: !1075, inlinedAt: !1081)
!1086 = !DILocation(line: 109, column: 10, scope: !1075, inlinedAt: !1081)
!1087 = !DILocation(line: 879, column: 16, scope: !1023)
!1088 = !DILocation(line: 863, column: 10, scope: !1023)
!1089 = !DILocation(line: 885, column: 7, scope: !1039)
!1090 = !DILocation(line: 885, column: 11, scope: !1039)
!1091 = !{!1092, !1092, i64 0}
!1092 = !{!"int", !1061, i64 0}
!1093 = !DILocation(line: 886, column: 15, scope: !1039)
!1094 = !DILocation(line: 886, column: 11, scope: !1039)
!1095 = !DILocation(line: 887, column: 13, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 887, column: 11)
!1097 = !DILocation(line: 887, column: 11, scope: !1039)
!1098 = !DILocation(line: 1051, column: 5, scope: !1023)
!1099 = !DILocation(line: 1053, column: 7, scope: !1023)
!1100 = !DILocation(line: 890, column: 11, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 890, column: 11)
!1102 = !DILocation(line: 890, column: 11, scope: !1039)
!1103 = !DILocation(line: 893, column: 24, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 893, column: 15)
!1105 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 891, column: 9)
!1106 = !DILocation(line: 893, column: 31, scope: !1104)
!1107 = !DILocation(line: 893, column: 28, scope: !1104)
!1108 = !DILocation(line: 893, column: 15, scope: !1105)
!1109 = !DILocation(line: 895, column: 17, scope: !1104)
!1110 = !DILocation(line: 894, column: 13, scope: !1104)
!1111 = !DILocation(line: 903, column: 7, scope: !1039)
!1112 = !DILocation(line: 907, column: 18, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 907, column: 15)
!1114 = !DILocation(line: 907, column: 36, scope: !1113)
!1115 = !DILocation(line: 908, column: 18, scope: !1113)
!1116 = !DILocation(line: 908, column: 22, scope: !1113)
!1117 = !DILocation(line: 908, column: 21, scope: !1113)
!1118 = !{!1061, !1061, i64 0}
!1119 = !DILocation(line: 908, column: 29, scope: !1113)
!1120 = !DILocation(line: 908, column: 36, scope: !1113)
!1121 = !DILocation(line: 908, column: 72, scope: !1113)
!1122 = !DILocation(line: 908, column: 39, scope: !1113)
!1123 = !DILocation(line: 907, column: 15, scope: !1043)
!1124 = !DILocation(line: 909, column: 37, scope: !1113)
!1125 = !DILocation(line: 909, column: 31, scope: !1113)
!1126 = !DILocation(line: 909, column: 13, scope: !1113)
!1127 = !DILocation(line: 909, column: 35, scope: !1113)
!1128 = !DILocation(line: 914, column: 19, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 914, column: 17)
!1130 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 913, column: 11)
!1131 = !DILocation(line: 914, column: 17, scope: !1130)
!1132 = !DILocation(line: 915, column: 15, scope: !1129)
!1133 = !DILocation(line: 917, column: 41, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1129, file: !3, line: 917, column: 22)
!1135 = !DILocation(line: 917, column: 24, scope: !1134)
!1136 = !DILocation(line: 917, column: 22, scope: !1129)
!1137 = !DILocation(line: 918, column: 15, scope: !1134)
!1138 = !DILocation(line: 925, column: 33, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 924, column: 11)
!1140 = !DILocalVariable(name: "s", arg: 1, scope: !1141, file: !3, line: 838, type: !87)
!1141 = distinct !DISubprogram(name: "parse_column_count", scope: !3, file: !3, line: 838, type: !399, isLocal: true, isDefinition: true, scopeLine: 839, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1142)
!1142 = !{!1140}
!1143 = !DILocation(line: 838, column: 33, scope: !1141, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 925, column: 13, scope: !1139)
!1145 = !DILocation(line: 840, column: 30, scope: !1141, inlinedAt: !1144)
!1146 = !DILocalVariable(name: "n_str", arg: 1, scope: !1147, file: !3, line: 1156, type: !87)
!1147 = distinct !DISubprogram(name: "getoptnum", scope: !3, file: !3, line: 1156, type: !1148, isLocal: true, isDefinition: true, scopeLine: 1157, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1150)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{null, !87, !30, !177, !87}
!1150 = !{!1146, !1151, !1152, !1153, !1154}
!1151 = !DILocalVariable(name: "min", arg: 2, scope: !1147, file: !3, line: 1156, type: !30)
!1152 = !DILocalVariable(name: "num", arg: 3, scope: !1147, file: !3, line: 1156, type: !177)
!1153 = !DILocalVariable(name: "err", arg: 4, scope: !1147, file: !3, line: 1156, type: !87)
!1154 = !DILocalVariable(name: "tnum", scope: !1147, file: !3, line: 1158, type: !928)
!1155 = !DILocation(line: 1156, column: 24, scope: !1147, inlinedAt: !1156)
!1156 = distinct !DILocation(line: 840, column: 3, scope: !1141, inlinedAt: !1144)
!1157 = !DILocation(line: 1156, column: 35, scope: !1147, inlinedAt: !1156)
!1158 = !DILocation(line: 1156, column: 45, scope: !1147, inlinedAt: !1156)
!1159 = !DILocation(line: 1156, column: 62, scope: !1147, inlinedAt: !1156)
!1160 = !DILocation(line: 1158, column: 19, scope: !1147, inlinedAt: !1156)
!1161 = !DILocation(line: 1158, column: 12, scope: !1147, inlinedAt: !1156)
!1162 = !DILocation(line: 1159, column: 10, scope: !1147, inlinedAt: !1156)
!1163 = !DILocation(line: 1159, column: 8, scope: !1147, inlinedAt: !1156)
!1164 = !DILocation(line: 930, column: 13, scope: !1139)
!1165 = !DILocation(line: 932, column: 21, scope: !1139)
