; ModuleID = 'coreutils-8.27/src/rm.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.rm_options = type { i8, i32, i8, i8, i8, %struct.timespec*, i8, i8, i8 }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.__dirstream = type opaque

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_opts", scope: !2, file: !3, line: 63, type: !130, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !50, globals: !56)
!3 = !DIFile(filename: "src/rm.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !11, !16, !30, !36}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !6, line: 23, size: 32, elements: !7)
!6 = !DIFile(filename: "src/remove.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "RMI_ALWAYS", value: 3)
!9 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4)
!10 = !DIEnumerator(name: "RMI_NEVER", value: 5)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "interactive_type", file: !3, line: 56, size: 32, elements: !12)
!12 = !{!13, !14, !15}
!13 = !DIEnumerator(name: "interactive_never", value: 0)
!14 = !DIEnumerator(name: "interactive_once", value: 1)
!15 = !DIEnumerator(name: "interactive_always", value: 2)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !17, line: 32, size: 32, elements: !18)
!17 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!19 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!20 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!21 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!22 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!23 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!24 = !DIEnumerator(name: "c_quoting_style", value: 5)
!25 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!26 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!27 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!28 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!29 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !6, line: 74, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "RM_OK", value: 2)
!33 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3)
!34 = !DIEnumerator(name: "RM_ERROR", value: 4)
!35 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !38, file: !37, line: 187, size: 32, elements: !48)
!37 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!38 = distinct !DISubprogram(name: "select_plural", scope: !37, file: !37, line: 183, type: !39, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !46)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !42}
!41 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !43, line: 112, baseType: !44)
!43 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !45, line: 62, baseType: !41)
!45 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!46 = !{!47}
!47 = !DILocalVariable(name: "n", arg: 1, scope: !38, file: !37, line: 183, type: !42)
!48 = !{!49}
!49 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000)
!50 = !{!51, !54, !55}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!56 = !{!57, !101, !0, !120, !126}
!57 = !DIGlobalVariableExpression(var: !58)
!58 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !59, file: !3, line: 330, type: !79, isLocal: true, isDefinition: true)
!59 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 205, type: !60, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !62, !63}
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!64 = !{!65, !66, !67, !69, !92, !93, !94, !98, !99, !100}
!65 = !DILocalVariable(name: "argc", arg: 1, scope: !59, file: !3, line: 205, type: !62)
!66 = !DILocalVariable(name: "argv", arg: 2, scope: !59, file: !3, line: 205, type: !63)
!67 = !DILocalVariable(name: "preserve_root", scope: !59, file: !3, line: 207, type: !68)
!68 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!69 = !DILocalVariable(name: "x", scope: !59, file: !3, line: 208, type: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !6, line: 32, size: 256, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !89, !90, !91}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !70, file: !6, line: 35, baseType: !68, size: 8)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !70, file: !6, line: 38, baseType: !5, size: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !70, file: !6, line: 47, baseType: !68, size: 8, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !70, file: !6, line: 50, baseType: !68, size: 8, offset: 72)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !70, file: !6, line: 53, baseType: !68, size: 8, offset: 80)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !70, file: !6, line: 57, baseType: !78, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !80, line: 7, size: 128, elements: !81)
!80 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!81 = !{!82, !86}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !79, file: !80, line: 9, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !84, line: 48, baseType: !85)
!84 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !45, line: 136, baseType: !41)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !79, file: !80, line: 10, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !84, line: 60, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !45, line: 133, baseType: !41)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !70, file: !6, line: 60, baseType: !68, size: 8, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !70, file: !6, line: 63, baseType: !68, size: 8, offset: 200)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !70, file: !6, line: 71, baseType: !68, size: 8, offset: 208)
!92 = !DILocalVariable(name: "prompt_once", scope: !59, file: !3, line: 209, type: !68)
!93 = !DILocalVariable(name: "c", scope: !59, file: !3, line: 210, type: !62)
!94 = !DILocalVariable(name: "i", scope: !95, file: !3, line: 258, type: !62)
!95 = distinct !DILexicalBlock(scope: !96, file: !3, line: 257, column: 11)
!96 = distinct !DILexicalBlock(scope: !97, file: !3, line: 228, column: 9)
!97 = distinct !DILexicalBlock(scope: !59, file: !3, line: 226, column: 5)
!98 = !DILocalVariable(name: "n_files", scope: !59, file: !3, line: 337, type: !42)
!99 = !DILocalVariable(name: "file", scope: !59, file: !3, line: 338, type: !63)
!100 = !DILocalVariable(name: "status", scope: !59, file: !3, line: 355, type: !30)
!101 = !DIGlobalVariableExpression(var: !102)
!102 = distinct !DIGlobalVariable(name: "infomap", scope: !103, file: !37, line: 632, type: !117, isLocal: true, isDefinition: true)
!103 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !37, file: !37, line: 630, type: !104, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !106)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !51}
!106 = !{!107, !108, !109, !116}
!107 = !DILocalVariable(name: "program", arg: 1, scope: !103, file: !37, line: 630, type: !51)
!108 = !DILocalVariable(name: "node", scope: !103, file: !37, line: 642, type: !51)
!109 = !DILocalVariable(name: "map_prog", scope: !103, file: !37, line: 643, type: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !103, file: !37, line: 632, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !112, file: !37, line: 632, baseType: !51, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !112, file: !37, line: 632, baseType: !51, size: 64, offset: 64)
!116 = !DILocalVariable(name: "lc_messages", scope: !103, file: !37, line: 655, type: !51)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 896, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 7)
!120 = !DIGlobalVariableExpression(var: !121)
!121 = distinct !DIGlobalVariable(name: "interactive_types", scope: !2, file: !3, line: 92, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 192, elements: !124)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!124 = !{!125}
!125 = !DISubrange(count: 6)
!126 = !DIGlobalVariableExpression(var: !127)
!127 = distinct !DIGlobalVariable(name: "interactive_args", scope: !2, file: !3, line: 86, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 448, elements: !118)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 3072, elements: !140)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !133, line: 50, size: 256, elements: !134)
!133 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!134 = !{!135, !136, !137, !139}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !132, file: !133, line: 52, baseType: !51, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !132, file: !133, line: 55, baseType: !62, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !132, file: !133, line: 56, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !132, file: !133, line: 57, baseType: !62, size: 32, offset: 192)
!140 = !{!141}
!141 = !DISubrange(count: 12)
!142 = !DIGlobalVariableExpression(var: !143)
!143 = distinct !DIGlobalVariable(name: "Version", scope: !144, file: !145, line: 2, type: !51, isLocal: false, isDefinition: true)
!144 = distinct !DICompileUnit(language: DW_LANG_C99, file: !145, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, globals: !147)
!145 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!146 = !{}
!147 = !{!142}
!148 = !DIGlobalVariableExpression(var: !149)
!149 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !150, file: !156, line: 69, type: !157, isLocal: false, isDefinition: true)
!150 = distinct !DICompileUnit(language: DW_LANG_C99, file: !151, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !153, globals: !155)
!151 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!152 = !{!16}
!153 = !{!55, !154}
!154 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!155 = !{!148}
!156 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !158, line: 55, baseType: !159)
!158 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{null}
!162 = !DIGlobalVariableExpression(var: !163)
!163 = distinct !DIGlobalVariable(name: "file_name", scope: !164, file: !167, line: 37, type: !51, isLocal: true, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, globals: !166)
!165 = !DIFile(filename: "./lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!166 = !{!162}
!167 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!168 = !DIGlobalVariableExpression(var: !169)
!169 = distinct !DIGlobalVariable(name: "file_name", scope: !170, file: !175, line: 36, type: !51, isLocal: true, isDefinition: true)
!170 = distinct !DICompileUnit(language: DW_LANG_C99, file: !171, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, globals: !172)
!171 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!172 = !{!168, !173}
!173 = !DIGlobalVariableExpression(var: !174)
!174 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !170, file: !175, line: 46, type: !68, isLocal: true, isDefinition: true)
!175 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!176 = !DIGlobalVariableExpression(var: !177)
!177 = distinct !DIGlobalVariable(name: "exit_failure", scope: !178, file: !181, line: 24, type: !182, isLocal: false, isDefinition: true)
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, globals: !180)
!179 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!180 = !{!176}
!181 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!182 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !62)
!183 = !DIGlobalVariableExpression(var: !184)
!184 = distinct !DIGlobalVariable(name: "program_name", scope: !185, file: !189, line: 33, type: !51, isLocal: false, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, retainedTypes: !187, globals: !188)
!186 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!187 = !{!55, !54}
!188 = !{!183}
!189 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!190 = !DIGlobalVariableExpression(var: !191)
!191 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !192, file: !222, line: 77, type: !258, isLocal: false, isDefinition: true)
!192 = distinct !DICompileUnit(language: DW_LANG_C99, file: !193, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !194, retainedTypes: !215, globals: !219)
!193 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!194 = !{!16, !195, !200}
!195 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !17, line: 242, size: 32, elements: !196)
!196 = !{!197, !198, !199}
!197 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!198 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!199 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!200 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !201, line: 46, size: 32, elements: !202)
!201 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214}
!203 = !DIEnumerator(name: "_ISupper", value: 256)
!204 = !DIEnumerator(name: "_ISlower", value: 512)
!205 = !DIEnumerator(name: "_ISalpha", value: 1024)
!206 = !DIEnumerator(name: "_ISdigit", value: 2048)
!207 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!208 = !DIEnumerator(name: "_ISspace", value: 8192)
!209 = !DIEnumerator(name: "_ISprint", value: 16384)
!210 = !DIEnumerator(name: "_ISgraph", value: 32768)
!211 = !DIEnumerator(name: "_ISblank", value: 1)
!212 = !DIEnumerator(name: "_IScntrl", value: 2)
!213 = !DIEnumerator(name: "_ISpunct", value: 4)
!214 = !DIEnumerator(name: "_ISalnum", value: 8)
!215 = !{!62, !216, !217, !54}
!216 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !218, line: 62, baseType: !41)
!218 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!219 = !{!190, !220, !227, !240, !242, !247, !254, !256}
!220 = !DIGlobalVariableExpression(var: !221)
!221 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !192, file: !222, line: 93, type: !223, isLocal: false, isDefinition: true)
!222 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 320, elements: !225)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!225 = !{!226}
!226 = !DISubrange(count: 10)
!227 = !DIGlobalVariableExpression(var: !228)
!228 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !192, file: !222, line: 1043, type: !229, isLocal: false, isDefinition: true)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !222, line: 57, size: 448, elements: !230)
!230 = !{!231, !232, !233, !238, !239}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !229, file: !222, line: 60, baseType: !16, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !229, file: !222, line: 63, baseType: !62, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !229, file: !222, line: 67, baseType: !234, size: 256, offset: 64)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 256, elements: !236)
!235 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!236 = !{!237}
!237 = !DISubrange(count: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !229, file: !222, line: 70, baseType: !51, size: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !229, file: !222, line: 73, baseType: !51, size: 64, offset: 384)
!240 = !DIGlobalVariableExpression(var: !241)
!241 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !192, file: !222, line: 108, type: !229, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243)
!243 = distinct !DIGlobalVariable(name: "slot0", scope: !192, file: !222, line: 834, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 2048, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 256)
!247 = !DIGlobalVariableExpression(var: !248)
!248 = distinct !DIGlobalVariable(name: "slotvec", scope: !192, file: !222, line: 837, type: !249, isLocal: true, isDefinition: true)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !222, line: 826, size: 128, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !250, file: !222, line: 828, baseType: !217, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !250, file: !222, line: 829, baseType: !54, size: 64, offset: 64)
!254 = !DIGlobalVariableExpression(var: !255)
!255 = distinct !DIGlobalVariable(name: "nslots", scope: !192, file: !222, line: 835, type: !62, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257)
!257 = distinct !DIGlobalVariable(name: "slotvec0", scope: !192, file: !222, line: 836, type: !250, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 704, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 11)
!261 = !DIGlobalVariableExpression(var: !262)
!262 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !263, file: !266, line: 26, type: !267, isLocal: false, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, globals: !265)
!264 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!265 = !{!261}
!266 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 376, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 47)
!270 = !DIGlobalVariableExpression(var: !271)
!271 = distinct !DIGlobalVariable(name: "can_write", scope: !272, file: !273, line: 35, type: !68, isLocal: true, isDefinition: true)
!272 = distinct !DISubprogram(name: "can_write_any_file", scope: !273, file: !273, line: 32, type: !274, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !276, variables: !281)
!273 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!274 = !DISubroutineType(types: !275)
!275 = !{!68}
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, globals: !278)
!277 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!278 = !{!279, !270}
!279 = !DIGlobalVariableExpression(var: !280)
!280 = distinct !DIGlobalVariable(name: "initialized", scope: !272, file: !273, line: 34, type: !68, isLocal: true, isDefinition: true)
!281 = !{!282}
!282 = !DILocalVariable(name: "can", scope: !283, file: !273, line: 39, type: !68)
!283 = distinct !DILexicalBlock(scope: !284, file: !273, line: 38, column: 5)
!284 = distinct !DILexicalBlock(scope: !272, file: !273, line: 37, column: 7)
!285 = !DIGlobalVariableExpression(var: !286)
!286 = distinct !DIGlobalVariable(name: "default_tuning", scope: !287, file: !291, line: 130, type: !292, isLocal: true, isDefinition: true)
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !288, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, retainedTypes: !289, globals: !290)
!288 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!289 = !{!41, !55, !217}
!290 = !{!285}
!291 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !294, line: 65, baseType: !295)
!294 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !294, line: 53, size: 160, elements: !296)
!296 = !{!297, !299, !300, !301, !302}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !295, file: !294, line: 58, baseType: !298, size: 32)
!298 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !295, file: !294, line: 59, baseType: !298, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !295, file: !294, line: 60, baseType: !298, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !295, file: !294, line: 61, baseType: !298, size: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !295, file: !294, line: 62, baseType: !68, size: 8, offset: 128)
!303 = !DIGlobalVariableExpression(var: !304)
!304 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !305, file: !649, line: 120, type: !650, isLocal: true, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !307, retainedTypes: !646, globals: !648)
!306 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!307 = !{!308}
!308 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !309, line: 41, size: 32, elements: !310)
!309 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!311 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!312 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!313 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!314 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!315 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!316 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!317 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!318 = !DIEnumerator(name: "DAY_1", value: 131079)
!319 = !DIEnumerator(name: "DAY_2", value: 131080)
!320 = !DIEnumerator(name: "DAY_3", value: 131081)
!321 = !DIEnumerator(name: "DAY_4", value: 131082)
!322 = !DIEnumerator(name: "DAY_5", value: 131083)
!323 = !DIEnumerator(name: "DAY_6", value: 131084)
!324 = !DIEnumerator(name: "DAY_7", value: 131085)
!325 = !DIEnumerator(name: "ABMON_1", value: 131086)
!326 = !DIEnumerator(name: "ABMON_2", value: 131087)
!327 = !DIEnumerator(name: "ABMON_3", value: 131088)
!328 = !DIEnumerator(name: "ABMON_4", value: 131089)
!329 = !DIEnumerator(name: "ABMON_5", value: 131090)
!330 = !DIEnumerator(name: "ABMON_6", value: 131091)
!331 = !DIEnumerator(name: "ABMON_7", value: 131092)
!332 = !DIEnumerator(name: "ABMON_8", value: 131093)
!333 = !DIEnumerator(name: "ABMON_9", value: 131094)
!334 = !DIEnumerator(name: "ABMON_10", value: 131095)
!335 = !DIEnumerator(name: "ABMON_11", value: 131096)
!336 = !DIEnumerator(name: "ABMON_12", value: 131097)
!337 = !DIEnumerator(name: "MON_1", value: 131098)
!338 = !DIEnumerator(name: "MON_2", value: 131099)
!339 = !DIEnumerator(name: "MON_3", value: 131100)
!340 = !DIEnumerator(name: "MON_4", value: 131101)
!341 = !DIEnumerator(name: "MON_5", value: 131102)
!342 = !DIEnumerator(name: "MON_6", value: 131103)
!343 = !DIEnumerator(name: "MON_7", value: 131104)
!344 = !DIEnumerator(name: "MON_8", value: 131105)
!345 = !DIEnumerator(name: "MON_9", value: 131106)
!346 = !DIEnumerator(name: "MON_10", value: 131107)
!347 = !DIEnumerator(name: "MON_11", value: 131108)
!348 = !DIEnumerator(name: "MON_12", value: 131109)
!349 = !DIEnumerator(name: "AM_STR", value: 131110)
!350 = !DIEnumerator(name: "PM_STR", value: 131111)
!351 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!352 = !DIEnumerator(name: "D_FMT", value: 131113)
!353 = !DIEnumerator(name: "T_FMT", value: 131114)
!354 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!355 = !DIEnumerator(name: "ERA", value: 131116)
!356 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!357 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!358 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!359 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!360 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!361 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!362 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!363 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!364 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!365 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!366 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!367 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!368 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!369 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!370 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!371 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!372 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!373 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!374 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!375 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!376 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!377 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!378 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!379 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!380 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!381 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!382 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!383 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!384 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!385 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!386 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!387 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!388 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!389 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!390 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!391 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!392 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!393 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!394 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!395 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!396 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!397 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!398 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!399 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!400 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!401 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!402 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!403 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!404 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!405 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!406 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!407 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!408 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!409 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!410 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!411 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!412 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!413 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!414 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!415 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!416 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!417 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!418 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!419 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!420 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!421 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!422 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!423 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!424 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!425 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!426 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!427 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!428 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!429 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!430 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!431 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!432 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!433 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!434 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!435 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!436 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!437 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!438 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!439 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!440 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!441 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!442 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!443 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!444 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!445 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!446 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!447 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!448 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!449 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!450 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!451 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!452 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!453 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!454 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!455 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!456 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!457 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!458 = !DIEnumerator(name: "CODESET", value: 14)
!459 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!460 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!461 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!462 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!463 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!464 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!465 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!466 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!467 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!468 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!469 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!470 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!471 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!472 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!473 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!474 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!475 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!476 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!477 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!478 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!479 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!480 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!481 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!482 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!483 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!485 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!486 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!487 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!488 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!489 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!490 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!491 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!492 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!493 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!494 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!495 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!496 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!497 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!498 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!499 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!500 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!501 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!502 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!503 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!504 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!505 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!506 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!507 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!508 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!509 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!510 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!511 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!512 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!513 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!514 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!515 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!516 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!517 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!518 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!519 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!520 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!521 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!522 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!523 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!524 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!525 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!526 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!527 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!528 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!529 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!530 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!531 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!532 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!533 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!534 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!535 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!536 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!537 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!538 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!539 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!540 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!541 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!542 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!543 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!544 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!545 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!546 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!547 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!548 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!549 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!550 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!551 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!552 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!553 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!554 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!555 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!556 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!557 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!558 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!559 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!560 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!561 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!562 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!563 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!564 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!565 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!566 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!567 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!568 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!569 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!570 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!571 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!572 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!573 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!574 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!575 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!576 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!577 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!578 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!579 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!580 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!581 = !DIEnumerator(name: "THOUSEP", value: 65537)
!582 = !DIEnumerator(name: "__GROUPING", value: 65538)
!583 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!584 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!585 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!586 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!587 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!588 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!589 = !DIEnumerator(name: "__YESSTR", value: 327682)
!590 = !DIEnumerator(name: "__NOSTR", value: 327683)
!591 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!592 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!593 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!594 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!595 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!596 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!597 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!598 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!599 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!600 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!601 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!602 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!603 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!604 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!605 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!606 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!607 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!608 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!609 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!610 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!611 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!612 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!613 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!614 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!615 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!616 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!617 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!618 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!619 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!620 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!621 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!622 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!623 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!624 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!625 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!626 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!627 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!628 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!629 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!630 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!631 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!632 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!633 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!634 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!635 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!636 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!637 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!638 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!639 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!640 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!641 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!642 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!643 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!644 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!645 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!646 = !{!55, !54, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!648 = !{!303}
!649 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!650 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !51)
!651 = !DIGlobalVariableExpression(var: !652)
!652 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !653, file: !654, line: 335, type: !62, isLocal: true, isDefinition: true)
!653 = distinct !DISubprogram(name: "rpl_fcntl", scope: !654, file: !654, line: 272, type: !655, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !657, variables: !660)
!654 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!655 = !DISubroutineType(types: !656)
!656 = !{!62, !62, !62, null}
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, globals: !659)
!658 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!659 = !{!651}
!660 = !{!661, !662, !663, !676, !677, !680, !683, !686}
!661 = !DILocalVariable(name: "fd", arg: 1, scope: !653, file: !654, line: 272, type: !62)
!662 = !DILocalVariable(name: "action", arg: 2, scope: !653, file: !654, line: 272, type: !62)
!663 = !DILocalVariable(name: "arg", scope: !653, file: !654, line: 274, type: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !665, line: 30, baseType: !666)
!665 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !658, line: 274, baseType: !667)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 192, elements: !674)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !658, line: 274, size: 192, elements: !669)
!669 = !{!670, !671, !672, !673}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !668, file: !658, line: 274, baseType: !235, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !668, file: !658, line: 274, baseType: !235, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !668, file: !658, line: 274, baseType: !55, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !668, file: !658, line: 274, baseType: !55, size: 64, offset: 128)
!674 = !{!675}
!675 = !DISubrange(count: 1)
!676 = !DILocalVariable(name: "result", scope: !653, file: !654, line: 275, type: !62)
!677 = !DILocalVariable(name: "target", scope: !678, file: !654, line: 322, type: !62)
!678 = distinct !DILexicalBlock(scope: !679, file: !654, line: 321, column: 7)
!679 = distinct !DILexicalBlock(scope: !653, file: !654, line: 278, column: 5)
!680 = !DILocalVariable(name: "flags", scope: !681, file: !654, line: 359, type: !62)
!681 = distinct !DILexicalBlock(scope: !682, file: !654, line: 358, column: 11)
!682 = distinct !DILexicalBlock(scope: !678, file: !654, line: 357, column: 13)
!683 = !DILocalVariable(name: "saved_errno", scope: !684, file: !654, line: 362, type: !62)
!684 = distinct !DILexicalBlock(scope: !685, file: !654, line: 361, column: 15)
!685 = distinct !DILexicalBlock(scope: !681, file: !654, line: 360, column: 17)
!686 = !DILocalVariable(name: "p", scope: !687, file: !654, line: 404, type: !55)
!687 = distinct !DILexicalBlock(scope: !679, file: !654, line: 402, column: 7)
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !690, retainedTypes: !712)
!689 = !DIFile(filename: "src/remove.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!690 = !{!30, !5, !16, !691, !696, !700}
!691 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ternary", file: !689, line: 34, size: 32, elements: !692)
!692 = !{!693, !694, !695}
!693 = !DIEnumerator(name: "T_UNKNOWN", value: 2)
!694 = !DIEnumerator(name: "T_NO", value: 3)
!695 = !DIEnumerator(name: "T_YES", value: 4)
!696 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !689, line: 45, size: 32, elements: !697)
!697 = !{!698, !699}
!698 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2)
!699 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3)
!700 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !701, line: 97, size: 32, elements: !702)
!701 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711}
!703 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!704 = !DIEnumerator(name: "DT_FIFO", value: 1)
!705 = !DIEnumerator(name: "DT_CHR", value: 2)
!706 = !DIEnumerator(name: "DT_DIR", value: 4)
!707 = !DIEnumerator(name: "DT_BLK", value: 6)
!708 = !DIEnumerator(name: "DT_REG", value: 8)
!709 = !DIEnumerator(name: "DT_LNK", value: 10)
!710 = !DIEnumerator(name: "DT_SOCK", value: 12)
!711 = !DIEnumerator(name: "DT_WHT", value: 14)
!712 = !{!55, !62}
!713 = distinct !DICompileUnit(language: DW_LANG_C99, file: !714, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, retainedTypes: !715)
!714 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!715 = !{!54}
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!717 = !DIFile(filename: "./lib/file-type.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!718 = distinct !DICompileUnit(language: DW_LANG_C99, file: !719, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!719 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !722, retainedTypes: !727)
!721 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!722 = !{!723}
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !724, line: 41, size: 32, elements: !725)
!724 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!725 = !{!726}
!726 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!727 = !{!55}
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !730, retainedTypes: !744)
!729 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!730 = !{!731}
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !733, file: !732, line: 192, size: 32, elements: !742)
!732 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!733 = distinct !DISubprogram(name: "x2nrealloc", scope: !732, file: !732, line: 180, type: !734, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !728, variables: !737)
!734 = !DISubroutineType(types: !735)
!735 = !{!55, !55, !736, !217}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!737 = !{!738, !739, !740, !741}
!738 = !DILocalVariable(name: "p", arg: 1, scope: !733, file: !732, line: 180, type: !55)
!739 = !DILocalVariable(name: "pn", arg: 2, scope: !733, file: !732, line: 180, type: !736)
!740 = !DILocalVariable(name: "s", arg: 3, scope: !733, file: !732, line: 180, type: !217)
!741 = !DILocalVariable(name: "n", scope: !733, file: !732, line: 182, type: !217)
!742 = !{!743}
!743 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!744 = !{!217, !54, !55}
!745 = distinct !DICompileUnit(language: DW_LANG_C99, file: !746, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!746 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!747 = distinct !DICompileUnit(language: DW_LANG_C99, file: !748, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, retainedTypes: !727)
!748 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!750 = !DIFile(filename: "./lib/yesno.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, retainedTypes: !727)
!752 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !754, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, retainedTypes: !727)
!754 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!755 = distinct !DICompileUnit(language: DW_LANG_C99, file: !756, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!756 = !DIFile(filename: "./lib/freadahead.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!757 = distinct !DICompileUnit(language: DW_LANG_C99, file: !758, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, retainedTypes: !727)
!758 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !761, retainedTypes: !905)
!760 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!761 = !{!762, !767, !899, !700, !902}
!762 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !763, line: 160, size: 32, elements: !764)
!763 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!764 = !{!765, !766}
!765 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!766 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!767 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !769, file: !768, line: 54, size: 32, elements: !897)
!768 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!769 = distinct !DISubprogram(name: "setup_dir", scope: !768, file: !768, line: 50, type: !770, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !759, variables: !895)
!770 = !DISubroutineType(types: !771)
!771 = !{!68, !772}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !774, line: 199, baseType: !775)
!774 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !774, line: 80, size: 1024, elements: !776)
!776 = !{!777, !846, !847, !849, !850, !851, !852, !853, !854, !855, !862, !863, !866, !882}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !775, file: !774, line: 81, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !774, line: 201, size: 2112, elements: !780)
!780 = !{!781, !782, !783, !784, !788, !790, !791, !792, !793, !794, !795, !796, !797, !799, !800, !803, !804, !805, !806, !842}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !779, file: !774, line: 202, baseType: !778, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !779, file: !774, line: 203, baseType: !778, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !779, file: !774, line: 204, baseType: !778, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !779, file: !774, line: 205, baseType: !785, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !701, line: 127, baseType: !787)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !701, line: 127, flags: DIFlagFwdDecl)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !779, file: !774, line: 208, baseType: !789, size: 64, offset: 256)
!789 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !779, file: !774, line: 209, baseType: !55, size: 64, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !779, file: !774, line: 210, baseType: !54, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !779, file: !774, line: 211, baseType: !54, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !779, file: !774, line: 212, baseType: !62, size: 32, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !779, file: !774, line: 213, baseType: !62, size: 32, offset: 544)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !779, file: !774, line: 214, baseType: !217, size: 64, offset: 576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !779, file: !774, line: 216, baseType: !772, size: 64, offset: 640)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !779, file: !774, line: 220, baseType: !798, size: 64, offset: 704)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !218, line: 51, baseType: !789)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !779, file: !774, line: 222, baseType: !217, size: 64, offset: 768)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !779, file: !774, line: 223, baseType: !801, size: 64, offset: 832)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !84, line: 75, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !45, line: 139, baseType: !41)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !779, file: !774, line: 239, baseType: !216, size: 16, offset: 896)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !779, file: !774, line: 243, baseType: !216, size: 16, offset: 912)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !779, file: !774, line: 249, baseType: !216, size: 16, offset: 928)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !779, file: !774, line: 251, baseType: !807, size: 1152, offset: 960)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 1152, elements: !674)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !809, line: 46, size: 1152, elements: !810)
!809 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!810 = !{!811, !812, !813, !814, !816, !818, !820, !821, !822, !824, !826, !828, !836, !837, !838}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !808, file: !809, line: 48, baseType: !88, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !808, file: !809, line: 53, baseType: !85, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !808, file: !809, line: 61, baseType: !802, size: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !808, file: !809, line: 62, baseType: !815, size: 32, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !45, line: 138, baseType: !235)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !808, file: !809, line: 64, baseType: !817, size: 32, offset: 224)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !45, line: 134, baseType: !235)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !808, file: !809, line: 65, baseType: !819, size: 32, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !45, line: 135, baseType: !235)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !808, file: !809, line: 67, baseType: !62, size: 32, offset: 288)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !808, file: !809, line: 69, baseType: !88, size: 64, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !808, file: !809, line: 74, baseType: !823, size: 64, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !45, line: 140, baseType: !789)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !808, file: !809, line: 78, baseType: !825, size: 64, offset: 448)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !45, line: 162, baseType: !789)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !808, file: !809, line: 80, baseType: !827, size: 64, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !45, line: 167, baseType: !789)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !808, file: !809, line: 91, baseType: !829, size: 128, offset: 576)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !830, line: 8, size: 128, elements: !831)
!830 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!831 = !{!832, !834}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !829, file: !830, line: 10, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !45, line: 148, baseType: !789)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !829, file: !830, line: 11, baseType: !835, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !45, line: 184, baseType: !789)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !808, file: !809, line: 92, baseType: !829, size: 128, offset: 704)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !808, file: !809, line: 93, baseType: !829, size: 128, offset: 832)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !808, file: !809, line: 106, baseType: !839, size: 192, offset: 960)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !835, size: 192, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 3)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !779, file: !774, line: 252, baseType: !843, offset: 2112)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: -1)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !775, file: !774, line: 82, baseType: !778, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !775, file: !774, line: 83, baseType: !848, size: 64, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !775, file: !774, line: 84, baseType: !87, size: 64, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !775, file: !774, line: 85, baseType: !54, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !775, file: !774, line: 86, baseType: !62, size: 32, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !775, file: !774, line: 87, baseType: !62, size: 32, offset: 352)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !775, file: !774, line: 89, baseType: !217, size: 64, offset: 384)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !775, file: !774, line: 90, baseType: !217, size: 64, offset: 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !775, file: !774, line: 91, baseType: !856, size: 64, offset: 512)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!62, !859, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !775, file: !774, line: 162, baseType: !62, size: 32, offset: 576)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !775, file: !774, line: 171, baseType: !864, size: 64, offset: 640)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !774, line: 171, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !775, file: !774, line: 193, baseType: !867, size: 64, offset: 704)
!867 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !774, line: 173, size: 64, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !867, file: !774, line: 186, baseType: !864, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !867, file: !774, line: 192, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !873, line: 28, size: 256, elements: !874)
!873 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!874 = !{!875, !880, !881}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !872, file: !873, line: 30, baseType: !876, size: 128)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !80, line: 7, size: 128, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !876, file: !80, line: 9, baseType: !83, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !876, file: !80, line: 10, baseType: !87, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !872, file: !873, line: 31, baseType: !42, size: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !872, file: !873, line: 32, baseType: !62, size: 32, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !775, file: !774, line: 198, baseType: !883, size: 256, offset: 768)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !884, line: 39, baseType: !885)
!884 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !884, line: 31, size: 256, elements: !886)
!886 = !{!887, !891, !892, !893, !894}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !885, file: !884, line: 33, baseType: !888, size: 128)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 128, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 4)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !885, file: !884, line: 34, baseType: !62, size: 32, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !885, file: !884, line: 35, baseType: !235, size: 32, offset: 160)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !885, file: !884, line: 36, baseType: !235, size: 32, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !885, file: !884, line: 37, baseType: !68, size: 8, offset: 224)
!895 = !{!896}
!896 = !DILocalVariable(name: "fts", arg: 1, scope: !769, file: !768, line: 50, type: !772)
!897 = !{!898}
!898 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!899 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !763, line: 763, size: 32, elements: !900)
!900 = !{!901}
!901 = !DIEnumerator(name: "LCO_HT_INITIAL_SIZE", value: 13)
!902 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !763, line: 155, size: 32, elements: !903)
!903 = !{!904}
!904 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!905 = !{!55, !42, !54, !789, !906, !911}
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!62, !909, !909}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !774, line: 253, baseType: !779)
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, retainedTypes: !917)
!916 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!917 = !{!217}
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!919 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!921 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!922 = distinct !DICompileUnit(language: DW_LANG_C99, file: !923, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!923 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!924 = distinct !DICompileUnit(language: DW_LANG_C99, file: !925, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!925 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!926 = distinct !DICompileUnit(language: DW_LANG_C99, file: !927, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!927 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!928 = distinct !DICompileUnit(language: DW_LANG_C99, file: !929, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !930)
!929 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!930 = !{!931}
!931 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !884, line: 20, size: 32, elements: !932)
!932 = !{!933}
!933 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!934 = distinct !DICompileUnit(language: DW_LANG_C99, file: !935, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!935 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!936 = distinct !DICompileUnit(language: DW_LANG_C99, file: !937, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!937 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!938 = distinct !DICompileUnit(language: DW_LANG_C99, file: !939, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!939 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!940 = distinct !DICompileUnit(language: DW_LANG_C99, file: !941, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146)
!941 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!942 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!943 = !{i32 2, !"Dwarf Version", i32 4}
!944 = !{i32 2, !"Debug Info Version", i32 3}
!945 = !{i32 1, !"wchar_size", i32 4}
!946 = !{i32 7, !"PIC Level", i32 2}
!947 = !{i32 7, !"PIE Level", i32 2}
!948 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 128, type: !949, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !951)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !62}
!951 = !{!952}
!952 = !DILocalVariable(name: "status", arg: 1, scope: !948, file: !3, line: 128, type: !62)
!953 = !DIExpression()
!954 = !DILocation(line: 128, column: 12, scope: !948)
!955 = !DILocation(line: 130, column: 14, scope: !956)
!956 = distinct !DILexicalBlock(scope: !948, file: !3, line: 130, column: 7)
!957 = !DILocation(line: 130, column: 7, scope: !948)
!958 = !DILocation(line: 131, column: 5, scope: !959)
!959 = distinct !DILexicalBlock(scope: !956, file: !3, line: 131, column: 5)
!960 = !{!961, !961, i64 0}
!961 = !{!"any pointer", !962, i64 0}
!962 = !{!"omnipotent char", !963, i64 0}
!963 = !{!"Simple C/C++ TBAA"}
!964 = !DILocation(line: 134, column: 7, scope: !965)
!965 = distinct !DILexicalBlock(scope: !956, file: !3, line: 133, column: 5)
!966 = !DILocation(line: 135, column: 7, scope: !965)
!967 = !DILocation(line: 141, column: 7, scope: !965)
!968 = !DILocation(line: 148, column: 7, scope: !965)
!969 = !DILocation(line: 153, column: 7, scope: !965)
!970 = !DILocation(line: 160, column: 7, scope: !965)
!971 = !DILocation(line: 161, column: 7, scope: !965)
!972 = !DILocation(line: 162, column: 7, scope: !965)
!973 = !DILocation(line: 167, column: 7, scope: !965)
!974 = !DILocation(line: 176, column: 7, scope: !965)
!975 = !DILocation(line: 642, column: 15, scope: !103, inlinedAt: !976)
!976 = distinct !DILocation(line: 182, column: 7, scope: !965)
!977 = !DILocation(line: 651, column: 3, scope: !103, inlinedAt: !976)
!978 = !DILocation(line: 655, column: 29, scope: !103, inlinedAt: !976)
!979 = !DILocation(line: 655, column: 15, scope: !103, inlinedAt: !976)
!980 = !DILocation(line: 656, column: 7, scope: !981, inlinedAt: !976)
!981 = distinct !DILexicalBlock(scope: !103, file: !37, line: 656, column: 7)
!982 = !DILocation(line: 656, column: 19, scope: !981, inlinedAt: !976)
!983 = !DILocation(line: 656, column: 22, scope: !981, inlinedAt: !976)
!984 = !DILocation(line: 656, column: 7, scope: !103, inlinedAt: !976)
!985 = !DILocation(line: 662, column: 7, scope: !986, inlinedAt: !976)
!986 = distinct !DILexicalBlock(scope: !981, file: !37, line: 657, column: 5)
!987 = !DILocation(line: 664, column: 5, scope: !986, inlinedAt: !976)
!988 = !DILocation(line: 665, column: 3, scope: !103, inlinedAt: !976)
!989 = !DILocation(line: 667, column: 3, scope: !103, inlinedAt: !976)
!990 = !DILocation(line: 184, column: 3, scope: !948)
!991 = !DILocation(line: 205, column: 11, scope: !59)
!992 = !DILocation(line: 205, column: 24, scope: !59)
!993 = !DILocation(line: 207, column: 8, scope: !59)
!994 = !DILocation(line: 208, column: 3, scope: !59)
!995 = !DILocation(line: 209, column: 8, scope: !59)
!996 = !DILocation(line: 213, column: 21, scope: !59)
!997 = !DILocation(line: 213, column: 3, scope: !59)
!998 = !DILocation(line: 214, column: 3, scope: !59)
!999 = !DILocation(line: 215, column: 3, scope: !59)
!1000 = !DILocation(line: 216, column: 3, scope: !59)
!1001 = !DILocation(line: 218, column: 3, scope: !59)
!1002 = !DILocation(line: 208, column: 21, scope: !59)
!1003 = !DILocalVariable(name: "x", arg: 1, scope: !1004, file: !3, line: 188, type: !1007)
!1004 = distinct !DISubprogram(name: "rm_option_init", scope: !3, file: !3, line: 188, type: !1005, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1008)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{null, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!1008 = !{!1003}
!1009 = !DILocation(line: 188, column: 36, scope: !1004, inlinedAt: !1010)
!1010 = distinct !DILocation(line: 220, column: 3, scope: !59)
!1011 = !DILocation(line: 190, column: 27, scope: !1004, inlinedAt: !1010)
!1012 = !{!1013, !1014, i64 0}
!1013 = !{!"rm_options", !1014, i64 0, !962, i64 4, !1014, i64 8, !1014, i64 9, !1014, i64 10, !961, i64 16, !1014, i64 24, !1014, i64 25, !1014, i64 26}
!1014 = !{!"_Bool", !962, i64 0}
!1015 = !DILocation(line: 191, column: 6, scope: !1004, inlinedAt: !1010)
!1016 = !DILocation(line: 191, column: 18, scope: !1004, inlinedAt: !1010)
!1017 = !{!1013, !962, i64 4}
!1018 = !DILocation(line: 192, column: 6, scope: !1004, inlinedAt: !1010)
!1019 = !DILocation(line: 192, column: 22, scope: !1004, inlinedAt: !1010)
!1020 = !{!1013, !1014, i64 8}
!1021 = !DILocation(line: 193, column: 6, scope: !1004, inlinedAt: !1010)
!1022 = !DILocation(line: 193, column: 31, scope: !1004, inlinedAt: !1010)
!1023 = !{!1013, !1014, i64 10}
!1024 = !DILocation(line: 194, column: 6, scope: !1004, inlinedAt: !1010)
!1025 = !DILocation(line: 194, column: 16, scope: !1004, inlinedAt: !1010)
!1026 = !{!1013, !1014, i64 9}
!1027 = !DILocation(line: 195, column: 6, scope: !1004, inlinedAt: !1010)
!1028 = !DILocation(line: 195, column: 19, scope: !1004, inlinedAt: !1010)
!1029 = !{!1013, !961, i64 16}
!1030 = !DILocation(line: 196, column: 18, scope: !1004, inlinedAt: !1010)
!1031 = !DILocation(line: 196, column: 6, scope: !1004, inlinedAt: !1010)
!1032 = !DILocation(line: 196, column: 16, scope: !1004, inlinedAt: !1010)
!1033 = !{!1013, !1014, i64 24}
!1034 = !DILocation(line: 197, column: 6, scope: !1004, inlinedAt: !1010)
!1035 = !DILocation(line: 197, column: 14, scope: !1004, inlinedAt: !1010)
!1036 = !{!1013, !1014, i64 25}
!1037 = !DILocation(line: 201, column: 6, scope: !1004, inlinedAt: !1010)
!1038 = !DILocation(line: 201, column: 26, scope: !1004, inlinedAt: !1010)
!1039 = !{!1013, !1014, i64 26}
!1040 = !DILocation(line: 225, column: 3, scope: !59)
!1041 = !DILocation(line: 225, column: 15, scope: !59)
!1042 = !DILocation(line: 210, column: 7, scope: !59)
!1043 = distinct !{!1043, !1040, !1044}
!1044 = !DILocation(line: 315, column: 5, scope: !59)
!1045 = !DILocation(line: 230, column: 38, scope: !96)
!1046 = !DILocation(line: 231, column: 11, scope: !96)
!1047 = !DILocation(line: 234, column: 25, scope: !96)
!1048 = !DILocation(line: 235, column: 34, scope: !96)
!1049 = !DILocation(line: 237, column: 11, scope: !96)
!1050 = !DILocation(line: 240, column: 25, scope: !96)
!1051 = !DILocation(line: 241, column: 34, scope: !96)
!1052 = !DILocation(line: 243, column: 11, scope: !96)
!1053 = !DILocation(line: 246, column: 25, scope: !96)
!1054 = !DILocation(line: 247, column: 34, scope: !96)
!1055 = !DILocation(line: 249, column: 11, scope: !96)
!1056 = !DILocation(line: 253, column: 23, scope: !96)
!1057 = !DILocation(line: 254, column: 11, scope: !96)
!1058 = !DILocation(line: 259, column: 17, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !95, file: !3, line: 259, column: 17)
!1060 = !DILocation(line: 259, column: 17, scope: !95)
!1061 = !DILocation(line: 260, column: 19, scope: !1059)
!1062 = !{!962, !962, i64 0}
!1063 = !DILocation(line: 258, column: 17, scope: !95)
!1064 = !DILocation(line: 264, column: 13, scope: !95)
!1065 = !DILocation(line: 267, column: 31, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !95, file: !3, line: 265, column: 15)
!1067 = !DILocation(line: 269, column: 17, scope: !1066)
!1068 = !DILocation(line: 272, column: 31, scope: !1066)
!1069 = !DILocation(line: 273, column: 40, scope: !1066)
!1070 = !DILocation(line: 275, column: 17, scope: !1066)
!1071 = !DILocation(line: 278, column: 31, scope: !1066)
!1072 = !DILocation(line: 279, column: 40, scope: !1066)
!1073 = !DILocation(line: 281, column: 17, scope: !1066)
!1074 = !DILocation(line: 287, column: 29, scope: !96)
!1075 = !DILocation(line: 288, column: 11, scope: !96)
!1076 = !DILocation(line: 291, column: 17, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !96, file: !3, line: 291, column: 15)
!1078 = !{!1079, !1079, i64 0}
!1079 = !{!"int", !962, i64 0}
!1080 = !DILocation(line: 291, column: 15, scope: !96)
!1081 = !DILocation(line: 292, column: 13, scope: !1077)
!1082 = !DILocation(line: 302, column: 23, scope: !96)
!1083 = !DILocation(line: 303, column: 11, scope: !96)
!1084 = !DILocation(line: 306, column: 21, scope: !96)
!1085 = !DILocation(line: 307, column: 11, scope: !96)
!1086 = !DILocation(line: 309, column: 9, scope: !96)
!1087 = !DILocation(line: 310, column: 9, scope: !96)
!1088 = !DILocalVariable(name: "argc", arg: 1, scope: !1089, file: !3, line: 104, type: !62)
!1089 = distinct !DISubprogram(name: "diagnose_leading_hyphen", scope: !3, file: !3, line: 104, type: !1090, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1092)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{null, !62, !63}
!1092 = !{!1088, !1093, !1094, !1095, !1099}
!1093 = !DILocalVariable(name: "argv", arg: 2, scope: !1089, file: !3, line: 104, type: !63)
!1094 = !DILocalVariable(name: "i", scope: !1089, file: !3, line: 108, type: !62)
!1095 = !DILocalVariable(name: "arg", scope: !1096, file: !3, line: 112, type: !51)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !3, line: 111, column: 5)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !3, line: 110, column: 3)
!1098 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 110, column: 3)
!1099 = !DILocalVariable(name: "st", scope: !1096, file: !3, line: 113, type: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !809, line: 46, size: 1152, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1118, !1119, !1120}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1100, file: !809, line: 48, baseType: !88, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1100, file: !809, line: 53, baseType: !85, size: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1100, file: !809, line: 61, baseType: !802, size: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1100, file: !809, line: 62, baseType: !815, size: 32, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1100, file: !809, line: 64, baseType: !817, size: 32, offset: 224)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1100, file: !809, line: 65, baseType: !819, size: 32, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1100, file: !809, line: 67, baseType: !62, size: 32, offset: 288)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1100, file: !809, line: 69, baseType: !88, size: 64, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1100, file: !809, line: 74, baseType: !823, size: 64, offset: 384)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1100, file: !809, line: 78, baseType: !825, size: 64, offset: 448)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1100, file: !809, line: 80, baseType: !827, size: 64, offset: 512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1100, file: !809, line: 91, baseType: !1114, size: 128, offset: 576)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !830, line: 8, size: 128, elements: !1115)
!1115 = !{!1116, !1117}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1114, file: !830, line: 10, baseType: !833, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1114, file: !830, line: 11, baseType: !835, size: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1100, file: !809, line: 92, baseType: !1114, size: 128, offset: 704)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1100, file: !809, line: 93, baseType: !1114, size: 128, offset: 832)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1100, file: !809, line: 106, baseType: !839, size: 192, offset: 960)
!1121 = !DILocation(line: 104, column: 30, scope: !1089, inlinedAt: !1122)
!1122 = distinct !DILocation(line: 312, column: 11, scope: !96)
!1123 = !DILocation(line: 104, column: 43, scope: !1089, inlinedAt: !1122)
!1124 = !DILocation(line: 108, column: 7, scope: !1089, inlinedAt: !1122)
!1125 = !DILocation(line: 110, column: 17, scope: !1097, inlinedAt: !1122)
!1126 = !DILocation(line: 110, column: 3, scope: !1098, inlinedAt: !1122)
!1127 = !DILocation(line: 112, column: 25, scope: !1096, inlinedAt: !1122)
!1128 = !DILocation(line: 112, column: 19, scope: !1096, inlinedAt: !1122)
!1129 = !DILocation(line: 113, column: 7, scope: !1096, inlinedAt: !1122)
!1130 = !DILocation(line: 115, column: 11, scope: !1131, inlinedAt: !1122)
!1131 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 115, column: 11)
!1132 = !DILocation(line: 115, column: 18, scope: !1131, inlinedAt: !1122)
!1133 = !DILocation(line: 115, column: 25, scope: !1131, inlinedAt: !1122)
!1134 = !DILocation(line: 115, column: 28, scope: !1131, inlinedAt: !1122)
!1135 = !DILocation(line: 115, column: 35, scope: !1131, inlinedAt: !1122)
!1136 = !DILocation(line: 113, column: 19, scope: !1096, inlinedAt: !1122)
!1137 = !DILocalVariable(name: "__path", arg: 1, scope: !1138, file: !1139, line: 456, type: !51)
!1138 = distinct !DISubprogram(name: "lstat", scope: !1139, file: !1139, line: 456, type: !1140, isLocal: false, isDefinition: true, scopeLine: 457, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1143)
!1139 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!62, !51, !1142}
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1143 = !{!1137, !1144}
!1144 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1138, file: !1139, line: 456, type: !1142)
!1145 = !DILocation(line: 456, column: 1, scope: !1138, inlinedAt: !1146)
!1146 = distinct !DILocation(line: 115, column: 38, scope: !1131, inlinedAt: !1122)
!1147 = !DILocation(line: 458, column: 10, scope: !1138, inlinedAt: !1146)
!1148 = !DILocation(line: 115, column: 55, scope: !1131, inlinedAt: !1122)
!1149 = !DILocation(line: 115, column: 11, scope: !1096, inlinedAt: !1122)
!1150 = !DILocation(line: 117, column: 11, scope: !1151, inlinedAt: !1122)
!1151 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 116, column: 9)
!1152 = !DILocation(line: 124, column: 5, scope: !1097, inlinedAt: !1122)
!1153 = !DILocation(line: 110, column: 26, scope: !1097, inlinedAt: !1122)
!1154 = distinct !{!1154, !1155, !1156}
!1155 = !DILocation(line: 110, column: 3, scope: !1098)
!1156 = !DILocation(line: 124, column: 5, scope: !1098)
!1157 = !DILocation(line: 313, column: 11, scope: !96)
!1158 = !DILocation(line: 317, column: 15, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !59, file: !3, line: 317, column: 7)
!1160 = !DILocation(line: 317, column: 12, scope: !1159)
!1161 = !DILocation(line: 317, column: 7, scope: !59)
!1162 = !DILocation(line: 319, column: 13, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 319, column: 11)
!1164 = distinct !DILexicalBlock(scope: !1159, file: !3, line: 318, column: 5)
!1165 = !DILocation(line: 319, column: 11, scope: !1164)
!1166 = !DILocation(line: 323, column: 24, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 322, column: 9)
!1168 = !DILocation(line: 323, column: 11, scope: !1167)
!1169 = !DILocation(line: 324, column: 11, scope: !1167)
!1170 = !DILocation(line: 328, column: 9, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !59, file: !3, line: 328, column: 7)
!1172 = !DILocation(line: 328, column: 22, scope: !1171)
!1173 = !DILocation(line: 328, column: 19, scope: !1171)
!1174 = !DILocation(line: 331, column: 24, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1171, file: !3, line: 329, column: 5)
!1176 = !DILocation(line: 331, column: 22, scope: !1175)
!1177 = !DILocation(line: 332, column: 26, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 332, column: 11)
!1179 = !DILocation(line: 332, column: 11, scope: !1175)
!1180 = !DILocation(line: 337, column: 30, scope: !59)
!1181 = !DILocation(line: 333, column: 9, scope: !1178)
!1182 = !DILocation(line: 337, column: 28, scope: !59)
!1183 = !DILocation(line: 337, column: 23, scope: !59)
!1184 = !DILocation(line: 337, column: 13, scope: !59)
!1185 = !DILocation(line: 338, column: 23, scope: !59)
!1186 = !DILocation(line: 338, column: 10, scope: !59)
!1187 = !DILocation(line: 340, column: 7, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !59, file: !3, line: 340, column: 7)
!1189 = !DILocation(line: 340, column: 19, scope: !1188)
!1190 = !DILocation(line: 340, column: 25, scope: !1188)
!1191 = !DILocation(line: 340, column: 40, scope: !1188)
!1192 = !DILocation(line: 340, column: 35, scope: !1188)
