; ModuleID = 'coreutils-8.27/src/shuf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.linebuffer = type { i64, i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.randint_source = type { %struct.randread_source*, i64, i64 }
%struct.randread_source = type { %struct._IO_FILE*, void (i8*)*, i8*, %union.anon.15 }
%union.anon.15 = type { %struct.isaac }
%struct.isaac = type { i64, %struct.isaac_state, %union.anon.0 }
%struct.isaac_state = type { [256 x i64], i64, i64, i64 }
%union.anon.0 = type { [256 x i64] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_opts", scope: !2, file: !3, line: 101, type: !77, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !54)
!3 = !DIFile(filename: "src/shuf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !13, !27, !36, !39}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !6, line: 26, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!9 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!10 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!11 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!12 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !14, line: 32, size: 32, elements: !15)
!14 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!16 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!17 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!18 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!19 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!20 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!21 = !DIEnumerator(name: "c_quoting_style", value: 5)
!22 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!23 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!24 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!25 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!26 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 45, size: 32, elements: !29)
!28 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!29 = !{!30, !31, !32, !33, !34, !35}
!30 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!31 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!32 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!33 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!34 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!35 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 52, size: 32, elements: !37)
!37 = !{!38}
!38 = !DIEnumerator(name: "RESERVOIR_MIN_INPUT", value: 8388608)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 44, size: 32, elements: !40)
!40 = !{!41}
!41 = !DIEnumerator(name: "RESERVOIR_LINES_INCREMENT", value: 1024)
!42 = !{!43, !45, !46, !51}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !47, line: 86, baseType: !48)
!47 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !49, line: 140, baseType: !50)
!49 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!50 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !52, line: 62, baseType: !53)
!52 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!53 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!54 = !{!55, !0}
!55 = !DIGlobalVariableExpression(var: !56)
!56 = distinct !DIGlobalVariable(name: "infomap", scope: !57, file: !58, line: 632, type: !74, isLocal: true, isDefinition: true)
!57 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !58, file: !58, line: 630, type: !59, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !63)
!58 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!59 = !DISubroutineType(types: !60)
!60 = !{null, !61}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!63 = !{!64, !65, !66, !73}
!64 = !DILocalVariable(name: "program", arg: 1, scope: !57, file: !58, line: 630, type: !61)
!65 = !DILocalVariable(name: "node", scope: !57, file: !58, line: 642, type: !61)
!66 = !DILocalVariable(name: "map_prog", scope: !57, file: !58, line: 643, type: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !57, file: !58, line: 632, size: 128, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !69, file: !58, line: 632, baseType: !61, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !69, file: !58, line: 632, baseType: !61, size: 64, offset: 64)
!73 = !DILocalVariable(name: "lc_messages", scope: !57, file: !58, line: 655, type: !61)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 896, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 7)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 2560, elements: !88)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !80, line: 50, size: 256, elements: !81)
!80 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!81 = !{!82, !83, !85, !87}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !79, file: !80, line: 52, baseType: !61, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !79, file: !80, line: 55, baseType: !84, size: 32, offset: 64)
!84 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !79, file: !80, line: 56, baseType: !86, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !79, file: !80, line: 57, baseType: !84, size: 32, offset: 192)
!88 = !{!89}
!89 = !DISubrange(count: 10)
!90 = !DIGlobalVariableExpression(var: !91)
!91 = distinct !DIGlobalVariable(name: "Version", scope: !92, file: !93, line: 2, type: !61, isLocal: false, isDefinition: true)
!92 = distinct !DICompileUnit(language: DW_LANG_C99, file: !93, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, globals: !95)
!93 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!94 = !{}
!95 = !{!90}
!96 = !DIGlobalVariableExpression(var: !97)
!97 = distinct !DIGlobalVariable(name: "file_name", scope: !98, file: !103, line: 36, type: !61, isLocal: true, isDefinition: true)
!98 = distinct !DICompileUnit(language: DW_LANG_C99, file: !99, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, globals: !100)
!99 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!100 = !{!96, !101}
!101 = !DIGlobalVariableExpression(var: !102)
!102 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !98, file: !103, line: 46, type: !104, isLocal: true, isDefinition: true)
!103 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!104 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!105 = !DIGlobalVariableExpression(var: !106)
!106 = distinct !DIGlobalVariable(name: "exit_failure", scope: !107, file: !110, line: 24, type: !111, isLocal: false, isDefinition: true)
!107 = distinct !DICompileUnit(language: DW_LANG_C99, file: !108, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, globals: !109)
!108 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!109 = !{!105}
!110 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!111 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !84)
!112 = !DIGlobalVariableExpression(var: !113)
!113 = distinct !DIGlobalVariable(name: "program_name", scope: !114, file: !118, line: 33, type: !61, isLocal: false, isDefinition: true)
!114 = distinct !DICompileUnit(language: DW_LANG_C99, file: !115, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, retainedTypes: !116, globals: !117)
!115 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!116 = !{!45, !43}
!117 = !{!112}
!118 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!119 = !DIGlobalVariableExpression(var: !120)
!120 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !121, file: !149, line: 77, type: !183, isLocal: false, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !123, retainedTypes: !144, globals: !146)
!122 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!123 = !{!13, !124, !129}
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !14, line: 242, size: 32, elements: !125)
!125 = !{!126, !127, !128}
!126 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!127 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!128 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !130, line: 46, size: 32, elements: !131)
!130 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143}
!132 = !DIEnumerator(name: "_ISupper", value: 256)
!133 = !DIEnumerator(name: "_ISlower", value: 512)
!134 = !DIEnumerator(name: "_ISalpha", value: 1024)
!135 = !DIEnumerator(name: "_ISdigit", value: 2048)
!136 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!137 = !DIEnumerator(name: "_ISspace", value: 8192)
!138 = !DIEnumerator(name: "_ISprint", value: 16384)
!139 = !DIEnumerator(name: "_ISgraph", value: 32768)
!140 = !DIEnumerator(name: "_ISblank", value: 1)
!141 = !DIEnumerator(name: "_IScntrl", value: 2)
!142 = !DIEnumerator(name: "_ISpunct", value: 4)
!143 = !DIEnumerator(name: "_ISalnum", value: 8)
!144 = !{!84, !145, !51, !43}
!145 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!146 = !{!119, !147, !152, !165, !167, !172, !179, !181}
!147 = !DIGlobalVariableExpression(var: !148)
!148 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !121, file: !149, line: 93, type: !150, isLocal: false, isDefinition: true)
!149 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 320, elements: !88)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!152 = !DIGlobalVariableExpression(var: !153)
!153 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !121, file: !149, line: 1043, type: !154, isLocal: false, isDefinition: true)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !149, line: 57, size: 448, elements: !155)
!155 = !{!156, !157, !158, !163, !164}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !154, file: !149, line: 60, baseType: !13, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !154, file: !149, line: 63, baseType: !84, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !154, file: !149, line: 67, baseType: !159, size: 256, offset: 64)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 256, elements: !161)
!160 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!161 = !{!162}
!162 = !DISubrange(count: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !154, file: !149, line: 70, baseType: !61, size: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !154, file: !149, line: 73, baseType: !61, size: 64, offset: 384)
!165 = !DIGlobalVariableExpression(var: !166)
!166 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !121, file: !149, line: 108, type: !154, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168)
!168 = distinct !DIGlobalVariable(name: "slot0", scope: !121, file: !149, line: 834, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2048, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 256)
!172 = !DIGlobalVariableExpression(var: !173)
!173 = distinct !DIGlobalVariable(name: "slotvec", scope: !121, file: !149, line: 837, type: !174, isLocal: true, isDefinition: true)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !149, line: 826, size: 128, elements: !176)
!176 = !{!177, !178}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !175, file: !149, line: 828, baseType: !51, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !175, file: !149, line: 829, baseType: !43, size: 64, offset: 64)
!179 = !DIGlobalVariableExpression(var: !180)
!180 = distinct !DIGlobalVariable(name: "nslots", scope: !121, file: !149, line: 835, type: !84, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182)
!182 = distinct !DIGlobalVariable(name: "slotvec0", scope: !121, file: !149, line: 836, type: !175, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 704, elements: !185)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!185 = !{!186}
!186 = !DISubrange(count: 11)
!187 = !DIGlobalVariableExpression(var: !188)
!188 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !189, file: !192, line: 26, type: !193, isLocal: false, isDefinition: true)
!189 = distinct !DICompileUnit(language: DW_LANG_C99, file: !190, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, globals: !191)
!190 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!191 = !{!187}
!192 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 376, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 47)
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "default_tuning", scope: !198, file: !202, line: 130, type: !203, isLocal: true, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, retainedTypes: !200, globals: !201)
!199 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!200 = !{!53, !45, !51}
!201 = !{!196}
!202 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !205, line: 65, baseType: !206)
!205 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !205, line: 53, size: 160, elements: !207)
!207 = !{!208, !210, !211, !212, !213}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !206, file: !205, line: 58, baseType: !209, size: 32)
!209 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !206, file: !205, line: 59, baseType: !209, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !206, file: !205, line: 60, baseType: !209, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !206, file: !205, line: 61, baseType: !209, size: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !206, file: !205, line: 62, baseType: !104, size: 8, offset: 128)
!214 = !DIGlobalVariableExpression(var: !215)
!215 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !216, file: !561, line: 120, type: !562, isLocal: true, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !218, retainedTypes: !557, globals: !560)
!217 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!218 = !{!219}
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !220, line: 41, size: 32, elements: !221)
!220 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556}
!222 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!223 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!224 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!225 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!226 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!227 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!228 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!229 = !DIEnumerator(name: "DAY_1", value: 131079)
!230 = !DIEnumerator(name: "DAY_2", value: 131080)
!231 = !DIEnumerator(name: "DAY_3", value: 131081)
!232 = !DIEnumerator(name: "DAY_4", value: 131082)
!233 = !DIEnumerator(name: "DAY_5", value: 131083)
!234 = !DIEnumerator(name: "DAY_6", value: 131084)
!235 = !DIEnumerator(name: "DAY_7", value: 131085)
!236 = !DIEnumerator(name: "ABMON_1", value: 131086)
!237 = !DIEnumerator(name: "ABMON_2", value: 131087)
!238 = !DIEnumerator(name: "ABMON_3", value: 131088)
!239 = !DIEnumerator(name: "ABMON_4", value: 131089)
!240 = !DIEnumerator(name: "ABMON_5", value: 131090)
!241 = !DIEnumerator(name: "ABMON_6", value: 131091)
!242 = !DIEnumerator(name: "ABMON_7", value: 131092)
!243 = !DIEnumerator(name: "ABMON_8", value: 131093)
!244 = !DIEnumerator(name: "ABMON_9", value: 131094)
!245 = !DIEnumerator(name: "ABMON_10", value: 131095)
!246 = !DIEnumerator(name: "ABMON_11", value: 131096)
!247 = !DIEnumerator(name: "ABMON_12", value: 131097)
!248 = !DIEnumerator(name: "MON_1", value: 131098)
!249 = !DIEnumerator(name: "MON_2", value: 131099)
!250 = !DIEnumerator(name: "MON_3", value: 131100)
!251 = !DIEnumerator(name: "MON_4", value: 131101)
!252 = !DIEnumerator(name: "MON_5", value: 131102)
!253 = !DIEnumerator(name: "MON_6", value: 131103)
!254 = !DIEnumerator(name: "MON_7", value: 131104)
!255 = !DIEnumerator(name: "MON_8", value: 131105)
!256 = !DIEnumerator(name: "MON_9", value: 131106)
!257 = !DIEnumerator(name: "MON_10", value: 131107)
!258 = !DIEnumerator(name: "MON_11", value: 131108)
!259 = !DIEnumerator(name: "MON_12", value: 131109)
!260 = !DIEnumerator(name: "AM_STR", value: 131110)
!261 = !DIEnumerator(name: "PM_STR", value: 131111)
!262 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!263 = !DIEnumerator(name: "D_FMT", value: 131113)
!264 = !DIEnumerator(name: "T_FMT", value: 131114)
!265 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!266 = !DIEnumerator(name: "ERA", value: 131116)
!267 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!268 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!269 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!270 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!271 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!272 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!273 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!274 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!275 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!276 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!277 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!278 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!279 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!280 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!281 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!282 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!283 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!284 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!285 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!286 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!287 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!288 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!289 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!290 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!291 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!292 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!293 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!294 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!295 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!296 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!297 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!298 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!299 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!300 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!301 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!302 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!303 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!304 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!305 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!306 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!307 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!308 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!309 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!310 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!311 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!312 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!313 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!314 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!315 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!316 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!317 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!318 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!319 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!320 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!321 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!322 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!323 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!324 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!325 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!326 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!327 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!328 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!329 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!330 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!331 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!332 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!333 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!334 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!335 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!336 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!337 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!338 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!339 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!340 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!341 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!342 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!343 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!344 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!345 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!346 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!347 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!348 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!349 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!350 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!351 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!352 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!353 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!354 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!355 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!356 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!357 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!358 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!359 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!360 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!361 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!362 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!363 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!364 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!365 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!366 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!367 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!368 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!369 = !DIEnumerator(name: "CODESET", value: 14)
!370 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!371 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!372 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!373 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!374 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!375 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!376 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!377 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!378 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!379 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!380 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!381 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!382 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!383 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!384 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!385 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!386 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!387 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!388 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!389 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!390 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!391 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!392 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!393 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!394 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!395 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!396 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!397 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!398 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!399 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!400 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!401 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!402 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!403 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!404 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!405 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!406 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!407 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!408 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!409 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!410 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!411 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!412 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!413 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!414 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!415 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!416 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!417 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!418 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!419 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!420 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!421 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!422 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!423 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!424 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!425 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!426 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!427 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!428 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!429 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!430 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!431 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!432 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!433 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!434 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!435 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!436 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!437 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!438 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!439 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!440 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!441 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!442 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!443 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!444 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!445 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!446 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!447 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!448 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!449 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!450 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!451 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!452 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!453 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!454 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!455 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!456 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!457 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!458 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!459 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!460 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!461 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!462 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!463 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!464 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!465 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!466 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!467 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!468 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!469 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!470 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!471 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!472 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!473 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!474 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!475 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!476 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!477 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!478 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!479 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!480 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!481 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!482 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!483 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!484 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!485 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!486 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!487 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!488 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!489 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!490 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!491 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!492 = !DIEnumerator(name: "THOUSEP", value: 65537)
!493 = !DIEnumerator(name: "__GROUPING", value: 65538)
!494 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!495 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!496 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!497 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!498 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!499 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!500 = !DIEnumerator(name: "__YESSTR", value: 327682)
!501 = !DIEnumerator(name: "__NOSTR", value: 327683)
!502 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!503 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!504 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!505 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!506 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!507 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!508 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!509 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!510 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!511 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!512 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!513 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!514 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!515 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!516 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!517 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!518 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!519 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!520 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!521 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!522 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!523 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!524 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!525 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!526 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!527 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!528 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!529 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!530 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!531 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!532 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!533 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!534 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!535 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!536 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!537 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!538 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!539 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!540 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!541 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!542 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!543 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!544 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!545 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!546 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!547 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!548 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!549 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!550 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!551 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!552 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!553 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!554 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!555 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!556 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!557 = !{!45, !43, !558}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!560 = !{!214}
!561 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!562 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!563 = !DIGlobalVariableExpression(var: !564)
!564 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !565, file: !566, line: 335, type: !84, isLocal: true, isDefinition: true)
!565 = distinct !DISubprogram(name: "rpl_fcntl", scope: !566, file: !566, line: 272, type: !567, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !569, variables: !572)
!566 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!567 = !DISubroutineType(types: !568)
!568 = !{!84, !84, !84, null}
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, globals: !571)
!570 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!571 = !{!563}
!572 = !{!573, !574, !575, !588, !589, !592, !595, !598}
!573 = !DILocalVariable(name: "fd", arg: 1, scope: !565, file: !566, line: 272, type: !84)
!574 = !DILocalVariable(name: "action", arg: 2, scope: !565, file: !566, line: 272, type: !84)
!575 = !DILocalVariable(name: "arg", scope: !565, file: !566, line: 274, type: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !577, line: 30, baseType: !578)
!577 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !570, line: 274, baseType: !579)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 192, elements: !586)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !570, line: 274, size: 192, elements: !581)
!581 = !{!582, !583, !584, !585}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !580, file: !570, line: 274, baseType: !160, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !580, file: !570, line: 274, baseType: !160, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !580, file: !570, line: 274, baseType: !45, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !580, file: !570, line: 274, baseType: !45, size: 64, offset: 128)
!586 = !{!587}
!587 = !DISubrange(count: 1)
!588 = !DILocalVariable(name: "result", scope: !565, file: !566, line: 275, type: !84)
!589 = !DILocalVariable(name: "target", scope: !590, file: !566, line: 322, type: !84)
!590 = distinct !DILexicalBlock(scope: !591, file: !566, line: 321, column: 7)
!591 = distinct !DILexicalBlock(scope: !565, file: !566, line: 278, column: 5)
!592 = !DILocalVariable(name: "flags", scope: !593, file: !566, line: 359, type: !84)
!593 = distinct !DILexicalBlock(scope: !594, file: !566, line: 358, column: 11)
!594 = distinct !DILexicalBlock(scope: !590, file: !566, line: 357, column: 13)
!595 = !DILocalVariable(name: "saved_errno", scope: !596, file: !566, line: 362, type: !84)
!596 = distinct !DILexicalBlock(scope: !597, file: !566, line: 361, column: 15)
!597 = distinct !DILexicalBlock(scope: !593, file: !566, line: 360, column: 17)
!598 = !DILocalVariable(name: "p", scope: !599, file: !566, line: 404, type: !45)
!599 = distinct !DILexicalBlock(scope: !591, file: !566, line: 402, column: 7)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !602)
!601 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!602 = !{!27}
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !604, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94)
!604 = !DIFile(filename: "./lib/freopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, retainedTypes: !607)
!606 = !DIFile(filename: "./lib/linebuffer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!607 = !{!558}
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94)
!609 = !DIFile(filename: "./lib/randint.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, retainedTypes: !612)
!611 = !DIFile(filename: "./lib/randperm.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!612 = !{!45, !51}
!613 = distinct !DICompileUnit(language: DW_LANG_C99, file: !614, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, retainedTypes: !615)
!614 = !DIFile(filename: "./lib/randread.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!615 = !{!51}
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !618, retainedTypes: !672)
!617 = !DIFile(filename: "./lib/rand-isaac.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!618 = !{!619}
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !621, file: !620, line: 107, size: 32, elements: !670)
!620 = !DIFile(filename: "lib/rand-isaac.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!621 = distinct !DISubprogram(name: "isaac_refill", scope: !620, file: !620, line: 97, type: !622, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, unit: !616, variables: !637)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !624, !636}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isaac_state", file: !626, line: 56, size: 16576, elements: !627)
!626 = !DIFile(filename: "./lib/rand-isaac.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!627 = !{!628, !633, !634, !635}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !625, file: !626, line: 58, baseType: !629, size: 16384)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 16384, elements: !170)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "isaac_word", file: !626, line: 44, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !632, line: 58, baseType: !53)
!632 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!633 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !625, file: !626, line: 59, baseType: !630, size: 64, offset: 16384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !625, file: !626, line: 59, baseType: !630, size: 64, offset: 16448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !625, file: !626, line: 59, baseType: !630, size: 64, offset: 16512)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !647, !648, !650, !651, !653, !654, !656, !657, !660, !661, !663, !664, !666, !667, !669}
!638 = !DILocalVariable(name: "s", arg: 1, scope: !621, file: !620, line: 97, type: !624)
!639 = !DILocalVariable(name: "result", arg: 2, scope: !621, file: !620, line: 97, type: !636)
!640 = !DILocalVariable(name: "a", scope: !621, file: !620, line: 100, type: !630)
!641 = !DILocalVariable(name: "b", scope: !621, file: !620, line: 101, type: !630)
!642 = !DILocalVariable(name: "m", scope: !621, file: !620, line: 104, type: !636)
!643 = !DILocalVariable(name: "r", scope: !621, file: !620, line: 105, type: !636)
!644 = !DILocalVariable(name: "x", scope: !645, file: !620, line: 125, type: !630)
!645 = distinct !DILexicalBlock(scope: !646, file: !620, line: 125, column: 7)
!646 = distinct !DILexicalBlock(scope: !621, file: !620, line: 124, column: 5)
!647 = !DILocalVariable(name: "y", scope: !645, file: !620, line: 125, type: !630)
!648 = !DILocalVariable(name: "x", scope: !649, file: !620, line: 126, type: !630)
!649 = distinct !DILexicalBlock(scope: !646, file: !620, line: 126, column: 7)
!650 = !DILocalVariable(name: "y", scope: !649, file: !620, line: 126, type: !630)
!651 = !DILocalVariable(name: "x", scope: !652, file: !620, line: 127, type: !630)
!652 = distinct !DILexicalBlock(scope: !646, file: !620, line: 127, column: 7)
!653 = !DILocalVariable(name: "y", scope: !652, file: !620, line: 127, type: !630)
!654 = !DILocalVariable(name: "x", scope: !655, file: !620, line: 128, type: !630)
!655 = distinct !DILexicalBlock(scope: !646, file: !620, line: 128, column: 7)
!656 = !DILocalVariable(name: "y", scope: !655, file: !620, line: 128, type: !630)
!657 = !DILocalVariable(name: "x", scope: !658, file: !620, line: 135, type: !630)
!658 = distinct !DILexicalBlock(scope: !659, file: !620, line: 135, column: 7)
!659 = distinct !DILexicalBlock(scope: !621, file: !620, line: 134, column: 5)
!660 = !DILocalVariable(name: "y", scope: !658, file: !620, line: 135, type: !630)
!661 = !DILocalVariable(name: "x", scope: !662, file: !620, line: 136, type: !630)
!662 = distinct !DILexicalBlock(scope: !659, file: !620, line: 136, column: 7)
!663 = !DILocalVariable(name: "y", scope: !662, file: !620, line: 136, type: !630)
!664 = !DILocalVariable(name: "x", scope: !665, file: !620, line: 137, type: !630)
!665 = distinct !DILexicalBlock(scope: !659, file: !620, line: 137, column: 7)
!666 = !DILocalVariable(name: "y", scope: !665, file: !620, line: 137, type: !630)
!667 = !DILocalVariable(name: "x", scope: !668, file: !620, line: 138, type: !630)
!668 = distinct !DILexicalBlock(scope: !659, file: !620, line: 138, column: 7)
!669 = !DILocalVariable(name: "y", scope: !668, file: !620, line: 138, type: !630)
!670 = !{!671}
!671 = !DIEnumerator(name: "HALF", value: 128)
!672 = !{!630}
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !674, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, retainedTypes: !675)
!674 = !DIFile(filename: "./lib/read-file.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!675 = !{!45}
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !678, retainedTypes: !675)
!677 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!678 = !{!679}
!679 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !680, line: 41, size: 32, elements: !681)
!680 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!681 = !{!682}
!682 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !685, retainedTypes: !699)
!684 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!685 = !{!686}
!686 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !688, file: !687, line: 192, size: 32, elements: !697)
!687 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!688 = distinct !DISubprogram(name: "x2nrealloc", scope: !687, file: !687, line: 180, type: !689, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !683, variables: !692)
!689 = !DISubroutineType(types: !690)
!690 = !{!45, !45, !691, !51}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!692 = !{!693, !694, !695, !696}
!693 = !DILocalVariable(name: "p", arg: 1, scope: !688, file: !687, line: 180, type: !45)
!694 = !DILocalVariable(name: "pn", arg: 2, scope: !688, file: !687, line: 180, type: !691)
!695 = !DILocalVariable(name: "s", arg: 3, scope: !688, file: !687, line: 180, type: !51)
!696 = !DILocalVariable(name: "n", scope: !688, file: !687, line: 182, type: !51)
!697 = !{!698}
!698 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!699 = !{!51, !43, !45}
!700 = distinct !DICompileUnit(language: DW_LANG_C99, file: !701, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94)
!701 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !704)
!703 = !DIFile(filename: "./lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!704 = !{!5}
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !707, retainedTypes: !708)
!706 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!707 = !{!5, !129}
!708 = !{!84, !145}
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !707, retainedTypes: !708)
!710 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!711 = distinct !DICompileUnit(language: DW_LANG_C99, file: !712, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, retainedTypes: !675)
!712 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!713 = distinct !DICompileUnit(language: DW_LANG_C99, file: !714, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94)
!714 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !716, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, retainedTypes: !675)
!716 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, retainedTypes: !675)
!718 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!719 = distinct !DICompileUnit(language: DW_LANG_C99, file: !720, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, retainedTypes: !615)
!720 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94)
!722 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!723 = distinct !DICompileUnit(language: DW_LANG_C99, file: !724, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94)
!724 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!725 = distinct !DICompileUnit(language: DW_LANG_C99, file: !726, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94)
!726 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!727 = distinct !DICompileUnit(language: DW_LANG_C99, file: !728, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94)
!728 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!729 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!730 = !{i32 2, !"Dwarf Version", i32 4}
!731 = !{i32 2, !"Debug Info Version", i32 3}
!732 = !{i32 1, !"wchar_size", i32 4}
!733 = !{i32 7, !"PIC Level", i32 2}
!734 = !{i32 7, !"PIE Level", i32 2}
!735 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 56, type: !736, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !738)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !84}
!738 = !{!739}
!739 = !DILocalVariable(name: "status", arg: 1, scope: !735, file: !3, line: 56, type: !84)
!740 = !DIExpression()
!741 = !DILocation(line: 56, column: 12, scope: !735)
!742 = !DILocation(line: 58, column: 14, scope: !743)
!743 = distinct !DILexicalBlock(scope: !735, file: !3, line: 58, column: 7)
!744 = !DILocation(line: 58, column: 7, scope: !735)
!745 = !DILocation(line: 59, column: 5, scope: !746)
!746 = distinct !DILexicalBlock(scope: !743, file: !3, line: 59, column: 5)
!747 = !{!748, !748, i64 0}
!748 = !{!"any pointer", !749, i64 0}
!749 = !{!"omnipotent char", !750, i64 0}
!750 = !{!"Simple C/C++ TBAA"}
!751 = !DILocation(line: 62, column: 7, scope: !752)
!752 = distinct !DILexicalBlock(scope: !743, file: !3, line: 61, column: 5)
!753 = !DILocation(line: 68, column: 7, scope: !752)
!754 = !DILocation(line: 580, column: 3, scope: !755, inlinedAt: !758)
!755 = distinct !DISubprogram(name: "emit_stdin_note", scope: !58, file: !58, line: 578, type: !756, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !94)
!756 = !DISubroutineType(types: !757)
!757 = !{null}
!758 = distinct !DILocation(line: 72, column: 7, scope: !752)
!759 = !DILocation(line: 587, column: 3, scope: !760, inlinedAt: !761)
!760 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !58, file: !58, line: 585, type: !756, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !94)
!761 = distinct !DILocation(line: 73, column: 7, scope: !752)
!762 = !DILocation(line: 75, column: 7, scope: !752)
!763 = !DILocation(line: 83, column: 7, scope: !752)
!764 = !DILocation(line: 86, column: 7, scope: !752)
!765 = !DILocation(line: 87, column: 7, scope: !752)
!766 = !DILocation(line: 642, column: 15, scope: !57, inlinedAt: !767)
!767 = distinct !DILocation(line: 88, column: 7, scope: !752)
!768 = !DILocation(line: 651, column: 3, scope: !57, inlinedAt: !767)
!769 = !DILocation(line: 655, column: 29, scope: !57, inlinedAt: !767)
!770 = !DILocation(line: 655, column: 15, scope: !57, inlinedAt: !767)
!771 = !DILocation(line: 656, column: 7, scope: !772, inlinedAt: !767)
!772 = distinct !DILexicalBlock(scope: !57, file: !58, line: 656, column: 7)
!773 = !DILocation(line: 656, column: 19, scope: !772, inlinedAt: !767)
!774 = !DILocation(line: 656, column: 22, scope: !772, inlinedAt: !767)
!775 = !DILocation(line: 656, column: 7, scope: !57, inlinedAt: !767)
!776 = !DILocation(line: 662, column: 7, scope: !777, inlinedAt: !767)
!777 = distinct !DILexicalBlock(scope: !772, file: !58, line: 657, column: 5)
!778 = !DILocation(line: 664, column: 5, scope: !777, inlinedAt: !767)
!779 = !DILocation(line: 665, column: 3, scope: !57, inlinedAt: !767)
!780 = !DILocation(line: 667, column: 3, scope: !57, inlinedAt: !767)
!781 = !DILocation(line: 91, column: 3, scope: !735)
!782 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 382, type: !783, isLocal: false, isDefinition: true, scopeLine: 383, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !786)
!783 = !DISubroutineType(types: !784)
!784 = !{!84, !84, !785}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !813, !817, !818, !819, !822, !823, !824, !826}
!787 = !DILocalVariable(name: "argc", arg: 1, scope: !782, file: !3, line: 382, type: !84)
!788 = !DILocalVariable(name: "argv", arg: 2, scope: !782, file: !3, line: 382, type: !785)
!789 = !DILocalVariable(name: "echo", scope: !782, file: !3, line: 384, type: !104)
!790 = !DILocalVariable(name: "input_range", scope: !782, file: !3, line: 385, type: !104)
!791 = !DILocalVariable(name: "lo_input", scope: !782, file: !3, line: 386, type: !51)
!792 = !DILocalVariable(name: "hi_input", scope: !782, file: !3, line: 387, type: !51)
!793 = !DILocalVariable(name: "head_lines", scope: !782, file: !3, line: 388, type: !51)
!794 = !DILocalVariable(name: "outfile", scope: !782, file: !3, line: 389, type: !61)
!795 = !DILocalVariable(name: "random_source", scope: !782, file: !3, line: 390, type: !43)
!796 = !DILocalVariable(name: "eolbyte", scope: !782, file: !3, line: 391, type: !44)
!797 = !DILocalVariable(name: "input_lines", scope: !782, file: !3, line: 392, type: !785)
!798 = !DILocalVariable(name: "use_reservoir_sampling", scope: !782, file: !3, line: 393, type: !104)
!799 = !DILocalVariable(name: "repeat", scope: !782, file: !3, line: 394, type: !104)
!800 = !DILocalVariable(name: "optc", scope: !782, file: !3, line: 396, type: !84)
!801 = !DILocalVariable(name: "n_operands", scope: !782, file: !3, line: 397, type: !84)
!802 = !DILocalVariable(name: "operand", scope: !782, file: !3, line: 398, type: !785)
!803 = !DILocalVariable(name: "n_lines", scope: !782, file: !3, line: 399, type: !51)
!804 = !DILocalVariable(name: "line", scope: !782, file: !3, line: 400, type: !785)
!805 = !DILocalVariable(name: "reservoir", scope: !782, file: !3, line: 401, type: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !808, line: 26, size: 192, elements: !809)
!808 = !DIFile(filename: "./lib/linebuffer.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !807, file: !808, line: 28, baseType: !51, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !807, file: !808, line: 29, baseType: !51, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !807, file: !808, line: 30, baseType: !43, size: 64, offset: 128)
!813 = !DILocalVariable(name: "randint_source", scope: !782, file: !3, line: 402, type: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "randint_source", file: !816, line: 33, flags: DIFlagFwdDecl)
!816 = !DIFile(filename: "./lib/randint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!817 = !DILocalVariable(name: "permutation", scope: !782, file: !3, line: 403, type: !691)
!818 = !DILocalVariable(name: "i", scope: !782, file: !3, line: 404, type: !84)
!819 = !DILocalVariable(name: "p", scope: !820, file: !3, line: 423, type: !43)
!820 = distinct !DILexicalBlock(scope: !821, file: !3, line: 422, column: 9)
!821 = distinct !DILexicalBlock(scope: !782, file: !3, line: 416, column: 7)
!822 = !DILocalVariable(name: "hi_optarg", scope: !820, file: !3, line: 424, type: !61)
!823 = !DILocalVariable(name: "invalid", scope: !820, file: !3, line: 425, type: !104)
!824 = !DILocalVariable(name: "argval", scope: !825, file: !3, line: 453, type: !53)
!825 = distinct !DILexicalBlock(scope: !821, file: !3, line: 452, column: 9)
!826 = !DILocalVariable(name: "e", scope: !825, file: !3, line: 454, type: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "strtol_error", file: !6, line: 39, baseType: !5)
!828 = !DILocation(line: 382, column: 11, scope: !782)
!829 = !DILocation(line: 382, column: 24, scope: !782)
!830 = !DILocation(line: 384, column: 8, scope: !782)
!831 = !DILocation(line: 385, column: 8, scope: !782)
!832 = !DILocation(line: 386, column: 10, scope: !782)
!833 = !DILocation(line: 387, column: 10, scope: !782)
!834 = !DILocation(line: 388, column: 10, scope: !782)
!835 = !DILocation(line: 389, column: 15, scope: !782)
!836 = !DILocation(line: 390, column: 9, scope: !782)
!837 = !DILocation(line: 391, column: 8, scope: !782)
!838 = !DILocation(line: 392, column: 10, scope: !782)
!839 = !DILocation(line: 393, column: 8, scope: !782)
!840 = !DILocation(line: 394, column: 8, scope: !782)
!841 = !DILocation(line: 400, column: 10, scope: !782)
!842 = !DILocation(line: 401, column: 22, scope: !782)
!843 = !DILocation(line: 403, column: 11, scope: !782)
!844 = !DILocation(line: 407, column: 21, scope: !782)
!845 = !DILocation(line: 407, column: 3, scope: !782)
!846 = !DILocation(line: 408, column: 3, scope: !782)
!847 = !DILocation(line: 409, column: 3, scope: !782)
!848 = !DILocation(line: 410, column: 3, scope: !782)
!849 = !DILocation(line: 412, column: 3, scope: !782)
!850 = !DILocation(line: 414, column: 3, scope: !782)
!851 = !DILocation(line: 414, column: 18, scope: !782)
!852 = !DILocation(line: 396, column: 7, scope: !782)
!853 = !DILocation(line: 423, column: 29, scope: !820)
!854 = !DILocation(line: 423, column: 21, scope: !820)
!855 = !DILocation(line: 423, column: 17, scope: !820)
!856 = !DILocation(line: 424, column: 23, scope: !820)
!857 = !DILocation(line: 425, column: 26, scope: !820)
!858 = !DILocation(line: 427, column: 15, scope: !859)
!859 = distinct !DILexicalBlock(scope: !820, file: !3, line: 427, column: 15)
!860 = !DILocation(line: 427, column: 15, scope: !820)
!861 = !DILocation(line: 428, column: 13, scope: !859)
!862 = !DILocation(line: 431, column: 15, scope: !820)
!863 = !DILocation(line: 433, column: 18, scope: !864)
!864 = distinct !DILexicalBlock(scope: !865, file: !3, line: 432, column: 13)
!865 = distinct !DILexicalBlock(scope: !820, file: !3, line: 431, column: 15)
!866 = !{!749, !749, i64 0}
!867 = !DILocation(line: 434, column: 38, scope: !864)
!868 = !DILocation(line: 435, column: 38, scope: !864)
!869 = !DILocation(line: 434, column: 26, scope: !864)
!870 = !DILocation(line: 436, column: 18, scope: !864)
!871 = !DILocation(line: 437, column: 29, scope: !864)
!872 = !DILocation(line: 438, column: 13, scope: !864)
!873 = !DILocation(line: 441, column: 34, scope: !820)
!874 = !DILocation(line: 440, column: 22, scope: !820)
!875 = !DILocation(line: 443, column: 30, scope: !820)
!876 = !DILocation(line: 444, column: 33, scope: !820)
!877 = !DILocation(line: 444, column: 58, scope: !820)
!878 = !DILocation(line: 444, column: 46, scope: !820)
!879 = !DILocation(line: 444, column: 19, scope: !820)
!880 = !DILocation(line: 445, column: 15, scope: !820)
!881 = !DILocation(line: 446, column: 13, scope: !882)
!882 = distinct !DILexicalBlock(scope: !820, file: !3, line: 445, column: 15)
!883 = !{!884, !884, i64 0}
!884 = !{!"int", !749, i64 0}
!885 = !DILocation(line: 453, column: 11, scope: !825)
!886 = !DILocation(line: 454, column: 38, scope: !825)
!887 = !DILocation(line: 453, column: 29, scope: !825)
!888 = !DILocation(line: 454, column: 28, scope: !825)
!889 = !DILocation(line: 454, column: 24, scope: !825)
!890 = !DILocation(line: 456, column: 15, scope: !825)
!891 = !DILocation(line: 457, column: 26, scope: !892)
!892 = distinct !DILexicalBlock(scope: !825, file: !3, line: 456, column: 15)
!893 = !{!894, !894, i64 0}
!894 = !{!"long", !749, i64 0}
!895 = !DILocation(line: 457, column: 13, scope: !892)
!896 = !DILocation(line: 459, column: 13, scope: !897)
!897 = distinct !DILexicalBlock(scope: !892, file: !3, line: 458, column: 20)
!898 = !DILocation(line: 461, column: 9, scope: !821)
!899 = !DILocation(line: 462, column: 9, scope: !821)
!900 = !DILocation(line: 465, column: 13, scope: !901)
!901 = distinct !DILexicalBlock(scope: !821, file: !3, line: 465, column: 13)
!902 = !DILocation(line: 465, column: 21, scope: !901)
!903 = !DILocation(line: 465, column: 25, scope: !901)
!904 = !DILocation(line: 465, column: 13, scope: !821)
!905 = !DILocation(line: 466, column: 11, scope: !901)
!906 = !DILocation(line: 471, column: 13, scope: !907)
!907 = distinct !DILexicalBlock(scope: !821, file: !3, line: 471, column: 13)
!908 = !DILocation(line: 471, column: 27, scope: !907)
!909 = distinct !{!909, !850, !910}
!910 = !DILocation(line: 488, column: 7, scope: !782)
!911 = !DILocation(line: 471, column: 31, scope: !907)
!912 = !DILocation(line: 471, column: 13, scope: !821)
!913 = !DILocation(line: 472, column: 11, scope: !907)
!914 = !DILocation(line: 478, column: 9, scope: !821)
!915 = !DILocation(line: 482, column: 9, scope: !821)
!916 = !DILocation(line: 484, column: 7, scope: !821)
!917 = !DILocation(line: 485, column: 7, scope: !821)
!918 = !DILocation(line: 487, column: 9, scope: !821)
!919 = !DILocation(line: 490, column: 23, scope: !782)
!920 = !DILocation(line: 490, column: 21, scope: !782)
!921 = !DILocation(line: 397, column: 7, scope: !782)
!922 = !DILocation(line: 491, column: 18, scope: !782)
!923 = !DILocation(line: 398, column: 10, scope: !782)
!924 = !DILocation(line: 494, column: 7, scope: !925)
!925 = distinct !DILexicalBlock(scope: !782, file: !3, line: 494, column: 7)
!926 = !DILocation(line: 494, column: 12, scope: !925)
!927 = !DILocation(line: 494, column: 15, scope: !925)
!928 = !DILocation(line: 496, column: 20, scope: !929)
!929 = distinct !DILexicalBlock(scope: !925, file: !3, line: 495, column: 5)
!930 = !DILocation(line: 496, column: 7, scope: !929)
!931 = !DILocation(line: 497, column: 7, scope: !929)
!932 = !DILocation(line: 499, column: 7, scope: !933)
!933 = distinct !DILexicalBlock(scope: !782, file: !3, line: 499, column: 7)
!934 = !DILocation(line: 499, column: 7, scope: !782)
!935 = !DILocation(line: 499, column: 23, scope: !933)
!936 = !DILocation(line: 499, column: 49, scope: !933)
!937 = !DILocation(line: 499, column: 44, scope: !933)
!938 = !DILocation(line: 501, column: 20, scope: !939)
!939 = distinct !DILexicalBlock(scope: !933, file: !3, line: 500, column: 5)
!940 = !DILocation(line: 501, column: 58, scope: !939)
!941 = !DILocation(line: 501, column: 50, scope: !939)
!942 = !DILocation(line: 501, column: 43, scope: !939)
!943 = !DILocation(line: 501, column: 7, scope: !939)
!944 = !DILocation(line: 502, column: 7, scope: !939)
!945 = !DILocation(line: 506, column: 7, scope: !782)
!946 = !DILocalVariable(name: "operand", arg: 1, scope: !947, file: !3, line: 116, type: !785)
!947 = distinct !DISubprogram(name: "input_from_argv", scope: !3, file: !3, line: 116, type: !948, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !950)
!948 = !DISubroutineType(types: !949)
!949 = !{null, !785, !84, !44}
!950 = !{!946, !951, !952, !953, !954, !955, !956}
!951 = !DILocalVariable(name: "n_operands", arg: 2, scope: !947, file: !3, line: 116, type: !84)
!952 = !DILocalVariable(name: "eolbyte", arg: 3, scope: !947, file: !3, line: 116, type: !44)
!953 = !DILocalVariable(name: "p", scope: !947, file: !3, line: 118, type: !43)
!954 = !DILocalVariable(name: "size", scope: !947, file: !3, line: 119, type: !51)
!955 = !DILocalVariable(name: "i", scope: !947, file: !3, line: 120, type: !84)
!956 = !DILocalVariable(name: "p1", scope: !957, file: !3, line: 128, type: !43)
!957 = distinct !DILexicalBlock(scope: !958, file: !3, line: 127, column: 5)
!958 = distinct !DILexicalBlock(scope: !959, file: !3, line: 126, column: 3)
!959 = distinct !DILexicalBlock(scope: !947, file: !3, line: 126, column: 3)
!960 = !DILocation(line: 116, column: 25, scope: !947, inlinedAt: !961)
!961 = distinct !DILocation(line: 508, column: 7, scope: !962)
!962 = distinct !DILexicalBlock(scope: !963, file: !3, line: 507, column: 5)
!963 = distinct !DILexicalBlock(scope: !782, file: !3, line: 506, column: 7)
!964 = !DILocation(line: 116, column: 38, scope: !947, inlinedAt: !961)
!965 = !DILocation(line: 116, column: 55, scope: !947, inlinedAt: !961)
!966 = !DILocation(line: 119, column: 17, scope: !947, inlinedAt: !961)
!967 = !DILocation(line: 119, column: 10, scope: !947, inlinedAt: !961)
!968 = !DILocation(line: 120, column: 7, scope: !947, inlinedAt: !961)
!969 = !DILocation(line: 122, column: 17, scope: !970, inlinedAt: !961)
!970 = distinct !DILexicalBlock(scope: !971, file: !3, line: 122, column: 3)
!971 = distinct !DILexicalBlock(scope: !947, file: !3, line: 122, column: 3)
!972 = !DILocation(line: 122, column: 3, scope: !971, inlinedAt: !961)
!973 = !DILocation(line: 124, column: 7, scope: !947, inlinedAt: !961)
!974 = !DILocation(line: 126, column: 3, scope: !959, inlinedAt: !961)
!975 = !DILocation(line: 123, column: 21, scope: !970, inlinedAt: !961)
!976 = !DILocation(line: 123, column: 13, scope: !970, inlinedAt: !961)
!977 = !DILocation(line: 123, column: 10, scope: !970, inlinedAt: !961)
!978 = !DILocation(line: 122, column: 32, scope: !970, inlinedAt: !961)
!979 = distinct !{!979, !980, !981}
!980 = !DILocation(line: 122, column: 3, scope: !971)
!981 = !DILocation(line: 123, column: 31, scope: !971)
!982 = !DILocation(line: 118, column: 9, scope: !947, inlinedAt: !961)
!983 = !DILocation(line: 128, column: 29, scope: !957, inlinedAt: !961)
!984 = !DILocalVariable(name: "__dest", arg: 1, scope: !985, file: !986, line: 95, type: !989)
!985 = distinct !DISubprogram(name: "stpcpy", scope: !986, file: !986, line: 95, type: !987, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !991)
!986 = !DIFile(filename: "/usr/include/bits/string_fortified.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!987 = !DISubroutineType(types: !988)
!988 = !{!43, !989, !990}
!989 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !43)
!990 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!991 = !{!984, !992}
!992 = !DILocalVariable(name: "__src", arg: 2, scope: !985, file: !986, line: 95, type: !990)
!993 = !DILocation(line: 95, column: 1, scope: !985, inlinedAt: !994)
!994 = distinct !DILocation(line: 128, column: 18, scope: !957, inlinedAt: !961)
!995 = !DILocation(line: 97, column: 49, scope: !985, inlinedAt: !994)
!996 = !DILocation(line: 97, column: 10, scope: !985, inlinedAt: !994)
!997 = !DILocation(line: 128, column: 13, scope: !957, inlinedAt: !961)
!998 = !DILocation(line: 129, column: 18, scope: !957, inlinedAt: !961)
!999 = !DILocation(line: 131, column: 9, scope: !957, inlinedAt: !961)
!1000 = !DILocation(line: 131, column: 12, scope: !957, inlinedAt: !961)
!1001 = !DILocation(line: 126, column: 32, scope: !958, inlinedAt: !961)
!1002 = !DILocation(line: 126, column: 17, scope: !958, inlinedAt: !961)
!1003 = distinct !{!1003, !1004, !1005}
!1004 = !DILocation(line: 126, column: 3, scope: !959)
!1005 = !DILocation(line: 132, column: 5, scope: !959)
!1006 = !DILocation(line: 134, column: 3, scope: !947, inlinedAt: !961)
!1007 = !DILocation(line: 134, column: 23, scope: !947, inlinedAt: !961)
!1008 = !DILocation(line: 399, column: 10, scope: !782)
!1009 = !DILocation(line: 511, column: 5, scope: !962)
!1010 = !DILocation(line: 512, column: 12, scope: !963)
!1011 = !DILocation(line: 514, column: 26, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 513, column: 5)
!1013 = distinct !DILexicalBlock(scope: !963, file: !3, line: 512, column: 12)
!1014 = !DILocation(line: 514, column: 37, scope: !1012)
!1015 = !DILocation(line: 516, column: 5, scope: !1012)
!1016 = !DILocation(line: 520, column: 22, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 520, column: 11)
!1018 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 518, column: 5)
!1019 = !DILocation(line: 520, column: 11, scope: !1018)
!1020 = !DILocation(line: 521, column: 16, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 521, column: 13)
!1022 = !DILocation(line: 521, column: 45, scope: !1021)
!1023 = !DILocation(line: 521, column: 40, scope: !1021)
!1024 = !DILocation(line: 522, column: 45, scope: !1021)
!1025 = !DILocation(line: 522, column: 19, scope: !1021)
!1026 = !DILocation(line: 521, column: 13, scope: !1017)
!1027 = !DILocation(line: 523, column: 11, scope: !1021)
!1028 = !DILocation(line: 525, column: 16, scope: !1018)
!1029 = !DILocation(line: 525, column: 7, scope: !1018)
!1030 = !DILocation(line: 527, column: 13, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 527, column: 11)
!1032 = !DILocation(line: 527, column: 34, scope: !1031)
!1033 = !DILocation(line: 527, column: 20, scope: !1031)
!1034 = !DILocation(line: 528, column: 17, scope: !1031)
!1035 = !DILocation(line: 528, column: 28, scope: !1031)
!1036 = !DILocation(line: 154, column: 3, scope: !1037, inlinedAt: !1080)
!1037 = distinct !DISubprogram(name: "input_size", scope: !3, file: !3, line: 150, type: !1038, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1040)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!46}
!1040 = !{!1041, !1042, !1079}
!1041 = !DILocalVariable(name: "file_size", scope: !1037, file: !3, line: 152, type: !46)
!1042 = !DILocalVariable(name: "stat_buf", scope: !1037, file: !3, line: 154, type: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1044, line: 46, size: 1152, elements: !1045)
!1044 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1045 = !{!1046, !1048, !1050, !1052, !1054, !1056, !1058, !1059, !1060, !1061, !1063, !1065, !1073, !1074, !1075}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1043, file: !1044, line: 48, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !49, line: 133, baseType: !53)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1043, file: !1044, line: 53, baseType: !1049, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !49, line: 136, baseType: !53)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1043, file: !1044, line: 61, baseType: !1051, size: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !49, line: 139, baseType: !53)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1043, file: !1044, line: 62, baseType: !1053, size: 32, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !49, line: 138, baseType: !160)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1043, file: !1044, line: 64, baseType: !1055, size: 32, offset: 224)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !49, line: 134, baseType: !160)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1043, file: !1044, line: 65, baseType: !1057, size: 32, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !49, line: 135, baseType: !160)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1043, file: !1044, line: 67, baseType: !84, size: 32, offset: 288)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1043, file: !1044, line: 69, baseType: !1047, size: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1043, file: !1044, line: 74, baseType: !48, size: 64, offset: 384)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1043, file: !1044, line: 78, baseType: !1062, size: 64, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !49, line: 162, baseType: !50)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1043, file: !1044, line: 80, baseType: !1064, size: 64, offset: 512)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !49, line: 167, baseType: !50)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1043, file: !1044, line: 91, baseType: !1066, size: 128, offset: 576)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1067, line: 8, size: 128, elements: !1068)
!1067 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1068 = !{!1069, !1071}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1066, file: !1067, line: 10, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !49, line: 148, baseType: !50)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1066, file: !1067, line: 11, baseType: !1072, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !49, line: 184, baseType: !50)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1043, file: !1044, line: 92, baseType: !1066, size: 128, offset: 704)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1043, file: !1044, line: 93, baseType: !1066, size: 128, offset: 832)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1043, file: !1044, line: 106, baseType: !1076, size: 192, offset: 960)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 192, elements: !1077)
!1077 = !{!1078}
!1078 = !DISubrange(count: 3)
!1079 = !DILocalVariable(name: "input_offset", scope: !1037, file: !3, line: 162, type: !46)
!1080 = distinct !DILocation(line: 528, column: 31, scope: !1031)
!1081 = !DILocation(line: 154, column: 15, scope: !1037, inlinedAt: !1080)
!1082 = !DILocalVariable(name: "__fd", arg: 1, scope: !1083, file: !1084, line: 463, type: !84)
!1083 = distinct !DISubprogram(name: "fstat", scope: !1084, file: !1084, line: 463, type: !1085, isLocal: false, isDefinition: true, scopeLine: 464, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1088)
!1084 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!84, !84, !1087}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1088 = !{!1082, !1089}
!1089 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1083, file: !1084, line: 463, type: !1087)
!1090 = !DILocation(line: 463, column: 1, scope: !1083, inlinedAt: !1091)
!1091 = distinct !DILocation(line: 155, column: 7, scope: !1092, inlinedAt: !1080)
!1092 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 155, column: 7)
!1093 = !DILocation(line: 465, column: 10, scope: !1083, inlinedAt: !1091)
!1094 = !DILocation(line: 155, column: 39, scope: !1092, inlinedAt: !1080)
!1095 = !DILocation(line: 155, column: 7, scope: !1037, inlinedAt: !1080)
!1096 = !DILocalVariable(name: "sb", arg: 1, scope: !1097, file: !58, line: 701, type: !1100)
!1097 = distinct !DISubprogram(name: "usable_st_size", scope: !58, file: !58, line: 701, type: !1098, isLocal: true, isDefinition: true, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1102)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!104, !1100}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1102 = !{!1096}
!1103 = !DILocation(line: 701, column: 36, scope: !1097, inlinedAt: !1104)
!1104 = distinct !DILocation(line: 157, column: 7, scope: !1105, inlinedAt: !1080)
!1105 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 157, column: 7)
!1106 = !DILocation(line: 703, column: 11, scope: !1097, inlinedAt: !1104)
!1107 = !{!1108, !884, i64 24}
!1108 = !{!"stat", !894, i64 0, !894, i64 8, !894, i64 16, !884, i64 24, !884, i64 28, !884, i64 32, !884, i64 36, !894, i64 40, !894, i64 48, !894, i64 56, !894, i64 64, !1109, i64 72, !1109, i64 88, !1109, i64 104, !749, i64 120}
!1109 = !{!"timespec", !894, i64 0, !894, i64 8}
!1110 = !DILocation(line: 703, column: 33, scope: !1097, inlinedAt: !1104)
!1111 = !DILocation(line: 158, column: 26, scope: !1105, inlinedAt: !1080)
!1112 = !{!1108, !894, i64 48}
!1113 = !DILocation(line: 152, column: 9, scope: !1037, inlinedAt: !1080)
!1114 = !DILocation(line: 162, column: 24, scope: !1037, inlinedAt: !1080)
!1115 = !DILocation(line: 162, column: 9, scope: !1037, inlinedAt: !1080)
!1116 = !DILocation(line: 163, column: 20, scope: !1117, inlinedAt: !1080)
!1117 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 163, column: 7)
!1118 = !DILocation(line: 169, column: 1, scope: !1037, inlinedAt: !1080)
!1119 = !DILocation(line: 527, column: 11, scope: !1018)
!1120 = !DILocation(line: 166, column: 13, scope: !1037, inlinedAt: !1080)
!1121 = !DILocation(line: 528, column: 45, scope: !1031)
!1122 = !DILocation(line: 535, column: 33, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 534, column: 9)
!1124 = !DILocalVariable(name: "in", arg: 1, scope: !1125, file: !3, line: 262, type: !1128)
!1125 = distinct !DISubprogram(name: "read_input", scope: !3, file: !3, line: 262, type: !1126, isLocal: true, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1179)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!51, !1128, !44, !1178}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1130, line: 7, baseType: !1131)
!1130 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1132, line: 241, size: 1728, elements: !1133)
!1132 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1154, !1155, !1156, !1157, !1158, !1159, !1161, !1163, !1166, !1168, !1169, !1170, !1171, !1172, !1173, !1174}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1131, file: !1132, line: 242, baseType: !84, size: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1131, file: !1132, line: 247, baseType: !43, size: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1131, file: !1132, line: 248, baseType: !43, size: 64, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1131, file: !1132, line: 249, baseType: !43, size: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1131, file: !1132, line: 250, baseType: !43, size: 64, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1131, file: !1132, line: 251, baseType: !43, size: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1131, file: !1132, line: 252, baseType: !43, size: 64, offset: 384)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1131, file: !1132, line: 253, baseType: !43, size: 64, offset: 448)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1131, file: !1132, line: 254, baseType: !43, size: 64, offset: 512)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1131, file: !1132, line: 256, baseType: !43, size: 64, offset: 576)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1131, file: !1132, line: 257, baseType: !43, size: 64, offset: 640)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1131, file: !1132, line: 258, baseType: !43, size: 64, offset: 704)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1131, file: !1132, line: 260, baseType: !1147, size: 64, offset: 768)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1132, line: 156, size: 192, elements: !1149)
!1149 = !{!1150, !1151, !1153}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1148, file: !1132, line: 157, baseType: !1147, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1148, file: !1132, line: 158, baseType: !1152, size: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1148, file: !1132, line: 162, baseType: !84, size: 32, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1131, file: !1132, line: 262, baseType: !1152, size: 64, offset: 832)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1131, file: !1132, line: 264, baseType: !84, size: 32, offset: 896)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1131, file: !1132, line: 268, baseType: !84, size: 32, offset: 928)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1131, file: !1132, line: 270, baseType: !48, size: 64, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1131, file: !1132, line: 274, baseType: !145, size: 16, offset: 1024)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1131, file: !1132, line: 275, baseType: !1160, size: 8, offset: 1040)
!1160 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1131, file: !1132, line: 276, baseType: !1162, size: 8, offset: 1048)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !586)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1131, file: !1132, line: 280, baseType: !1164, size: 64, offset: 1088)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1132, line: 150, baseType: null)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1131, file: !1132, line: 289, baseType: !1167, size: 64, offset: 1152)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !49, line: 141, baseType: !50)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1131, file: !1132, line: 297, baseType: !45, size: 64, offset: 1216)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1131, file: !1132, line: 298, baseType: !45, size: 64, offset: 1280)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1131, file: !1132, line: 299, baseType: !45, size: 64, offset: 1344)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1131, file: !1132, line: 300, baseType: !45, size: 64, offset: 1408)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1131, file: !1132, line: 302, baseType: !51, size: 64, offset: 1472)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1131, file: !1132, line: 303, baseType: !84, size: 32, offset: 1536)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1131, file: !1132, line: 305, baseType: !1175, size: 160, offset: 1568)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !1176)
!1176 = !{!1177}
!1177 = !DISubrange(count: 20)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!1179 = !{!1124, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188}
!1180 = !DILocalVariable(name: "eolbyte", arg: 2, scope: !1125, file: !3, line: 262, type: !44)
!1181 = !DILocalVariable(name: "pline", arg: 3, scope: !1125, file: !3, line: 262, type: !1178)
!1182 = !DILocalVariable(name: "p", scope: !1125, file: !3, line: 264, type: !43)
!1183 = !DILocalVariable(name: "buf", scope: !1125, file: !3, line: 265, type: !43)
!1184 = !DILocalVariable(name: "used", scope: !1125, file: !3, line: 266, type: !51)
!1185 = !DILocalVariable(name: "lim", scope: !1125, file: !3, line: 267, type: !43)
!1186 = !DILocalVariable(name: "line", scope: !1125, file: !3, line: 268, type: !785)
!1187 = !DILocalVariable(name: "i", scope: !1125, file: !3, line: 269, type: !51)
!1188 = !DILocalVariable(name: "n_lines", scope: !1125, file: !3, line: 270, type: !51)
!1189 = !DILocation(line: 262, column: 19, scope: !1125, inlinedAt: !1190)
!1190 = distinct !DILocation(line: 535, column: 21, scope: !1123)
!1191 = !DILocation(line: 262, column: 28, scope: !1125, inlinedAt: !1190)
!1192 = !DILocation(line: 265, column: 9, scope: !1125, inlinedAt: !1190)
!1193 = !DILocation(line: 266, column: 3, scope: !1125, inlinedAt: !1190)
!1194 = !DILocation(line: 266, column: 10, scope: !1125, inlinedAt: !1190)
!1195 = !DILocation(line: 281, column: 15, scope: !1196, inlinedAt: !1190)
!1196 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 281, column: 7)
!1197 = !DILocation(line: 281, column: 13, scope: !1196, inlinedAt: !1190)
!1198 = !DILocation(line: 281, column: 7, scope: !1125, inlinedAt: !1190)
!1199 = !DILocation(line: 282, column: 5, scope: !1196, inlinedAt: !1190)
!1200 = !DILocation(line: 284, column: 7, scope: !1201, inlinedAt: !1190)
!1201 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 284, column: 7)
!1202 = !DILocation(line: 284, column: 12, scope: !1201, inlinedAt: !1190)
!1203 = !DILocation(line: 284, column: 24, scope: !1201, inlinedAt: !1190)
!1204 = !DILocation(line: 284, column: 15, scope: !1201, inlinedAt: !1190)
!1205 = !DILocation(line: 284, column: 29, scope: !1201, inlinedAt: !1190)
!1206 = !DILocation(line: 284, column: 7, scope: !1125, inlinedAt: !1190)
!1207 = !DILocation(line: 285, column: 13, scope: !1201, inlinedAt: !1190)
!1208 = !DILocation(line: 285, column: 5, scope: !1201, inlinedAt: !1190)
!1209 = !DILocation(line: 285, column: 17, scope: !1201, inlinedAt: !1190)
!1210 = !DILocation(line: 287, column: 15, scope: !1125, inlinedAt: !1190)
!1211 = !DILocation(line: 287, column: 13, scope: !1125, inlinedAt: !1190)
!1212 = !DILocation(line: 267, column: 9, scope: !1125, inlinedAt: !1190)
!1213 = !DILocation(line: 270, column: 10, scope: !1125, inlinedAt: !1190)
!1214 = !DILocation(line: 264, column: 9, scope: !1125, inlinedAt: !1190)
!1215 = !DILocation(line: 290, column: 19, scope: !1216, inlinedAt: !1190)
