; ModuleID = 'coreutils-8.27/src/sort.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.month = type { i8*, i32 }
%struct.__sigset_t = type { [16 x i64] }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.keyfield = type { i64, i64, i64, i64, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, %struct.keyfield* }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.line = type { i8*, i64, i8*, i8* }
%struct.tempnode = type { %struct.tempnode*, i32, i8, [0 x i8] }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.buffer = type { i8*, i64, i64, i64, i64, i64, i8 }
%struct.rlimit = type { i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "hard_LC_COLLATE", scope: !2, file: !3, line: 169, type: !34, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !858, globals: !860)
!3 = !DIFile(filename: "src/sort.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !9, !392, !397, !400, !414, !420, !423, !438, !776, !784, !806, !818, !830, !839, !844, !848, !851, !855}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 128, size: 32, elements: !6)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "SORT_OUT_OF_ORDER", value: 1)
!8 = !DIEnumerator(name: "SORT_FAILURE", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !10, file: !3, line: 4267, size: 32, elements: !390)
!10 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 4189, type: !11, isLocal: false, isDefinition: true, scopeLine: 4190, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !17)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !13, !14}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !{!18, !19, !20, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !127, !128, !129, !160, !162, !272, !274, !279, !286, !291, !293, !296, !353, !356, !363, !366, !384, !385, !389}
!18 = !DILocalVariable(name: "argc", arg: 1, scope: !10, file: !3, line: 4189, type: !13)
!19 = !DILocalVariable(name: "argv", arg: 2, scope: !10, file: !3, line: 4189, type: !14)
!20 = !DILocalVariable(name: "key", scope: !10, file: !3, line: 4191, type: !21)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "keyfield", file: !3, line: 208, size: 576, elements: !23)
!23 = !{!24, !28, !29, !30, !31, !35, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "sword", scope: !22, file: !3, line: 210, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 62, baseType: !27)
!26 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!27 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "schar", scope: !22, file: !3, line: 211, baseType: !25, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "eword", scope: !22, file: !3, line: 212, baseType: !25, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "echar", scope: !22, file: !3, line: 213, baseType: !25, size: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !22, file: !3, line: 214, baseType: !32, size: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !22, file: !3, line: 215, baseType: !36, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "skipsblanks", scope: !22, file: !3, line: 216, baseType: !34, size: 8, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "skipeblanks", scope: !22, file: !3, line: 217, baseType: !34, size: 8, offset: 392)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !22, file: !3, line: 218, baseType: !34, size: 8, offset: 400)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "random", scope: !22, file: !3, line: 221, baseType: !34, size: 8, offset: 408)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "general_numeric", scope: !22, file: !3, line: 222, baseType: !34, size: 8, offset: 416)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "human_numeric", scope: !22, file: !3, line: 224, baseType: !34, size: 8, offset: 424)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !22, file: !3, line: 226, baseType: !34, size: 8, offset: 432)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "reverse", scope: !22, file: !3, line: 227, baseType: !34, size: 8, offset: 440)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !22, file: !3, line: 228, baseType: !34, size: 8, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "traditional_used", scope: !22, file: !3, line: 229, baseType: !34, size: 8, offset: 456)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !22, file: !3, line: 230, baseType: !21, size: 64, offset: 512)
!49 = !DILocalVariable(name: "key_buf", scope: !10, file: !3, line: 4192, type: !22)
!50 = !DILocalVariable(name: "gkey", scope: !10, file: !3, line: 4193, type: !22)
!51 = !DILocalVariable(name: "gkey_only", scope: !10, file: !3, line: 4194, type: !34)
!52 = !DILocalVariable(name: "s", scope: !10, file: !3, line: 4195, type: !36)
!53 = !DILocalVariable(name: "c", scope: !10, file: !3, line: 4196, type: !13)
!54 = !DILocalVariable(name: "checkonly", scope: !10, file: !3, line: 4197, type: !16)
!55 = !DILocalVariable(name: "mergeonly", scope: !10, file: !3, line: 4198, type: !34)
!56 = !DILocalVariable(name: "random_source", scope: !10, file: !3, line: 4199, type: !15)
!57 = !DILocalVariable(name: "need_random", scope: !10, file: !3, line: 4200, type: !34)
!58 = !DILocalVariable(name: "nthreads", scope: !10, file: !3, line: 4201, type: !25)
!59 = !DILocalVariable(name: "nfiles", scope: !10, file: !3, line: 4202, type: !25)
!60 = !DILocalVariable(name: "posixly_correct", scope: !10, file: !3, line: 4203, type: !34)
!61 = !DILocalVariable(name: "posix_ver", scope: !10, file: !3, line: 4204, type: !13)
!62 = !DILocalVariable(name: "traditional_usage", scope: !10, file: !3, line: 4205, type: !34)
!63 = !DILocalVariable(name: "files", scope: !10, file: !3, line: 4206, type: !14)
!64 = !DILocalVariable(name: "files_from", scope: !10, file: !3, line: 4207, type: !15)
!65 = !DILocalVariable(name: "tok", scope: !10, file: !3, line: 4208, type: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !67, line: 28, size: 2304, elements: !68)
!67 = !DIFile(filename: "./lib/readtokens0.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!68 = !{!69, !70, !71, !73, !125, !126}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !66, file: !67, line: 30, baseType: !25, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !66, file: !67, line: 31, baseType: !14, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !66, file: !67, line: 32, baseType: !72, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !66, file: !67, line: 33, baseType: !74, size: 704, offset: 192)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !75, line: 174, size: 704, elements: !76)
!75 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!76 = !{!77, !78, !88, !89, !90, !91, !97, !98, !109, !120, !121, !123, !124}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !74, file: !75, line: 176, baseType: !25, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !74, file: !75, line: 177, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !75, line: 167, size: 128, elements: !81)
!81 = !{!82, !83, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !80, file: !75, line: 169, baseType: !15, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !80, file: !75, line: 170, baseType: !79, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !80, file: !75, line: 171, baseType: !85, offset: 128)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: -1)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !74, file: !75, line: 178, baseType: !15, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !74, file: !75, line: 179, baseType: !15, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !74, file: !75, line: 180, baseType: !15, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !74, file: !75, line: 185, baseType: !92, size: 64, offset: 320)
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !74, file: !75, line: 181, size: 64, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !92, file: !75, line: 183, baseType: !25, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !92, file: !75, line: 184, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !74, file: !75, line: 186, baseType: !25, size: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !74, file: !75, line: 193, baseType: !99, size: 64, offset: 448)
!99 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !74, file: !75, line: 189, size: 64, elements: !100)
!100 = !{!101, !105}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !99, file: !75, line: 191, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!96, !25}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !99, file: !75, line: 192, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!96, !96, !25}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !74, file: !75, line: 198, baseType: !110, size: 64, offset: 512)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !74, file: !75, line: 194, size: 64, elements: !111)
!111 = !{!112, !116}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !110, file: !75, line: 196, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !96}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !110, file: !75, line: 197, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !96, !96}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !74, file: !75, line: 200, baseType: !96, size: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !74, file: !75, line: 201, baseType: !122, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!122 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !74, file: !75, line: 202, baseType: !122, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !74, file: !75, line: 206, baseType: !122, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !66, file: !67, line: 34, baseType: !74, size: 704, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !66, file: !67, line: 35, baseType: !74, size: 704, offset: 1600)
!127 = !DILocalVariable(name: "outfile", scope: !10, file: !3, line: 4209, type: !36)
!128 = !DILocalVariable(name: "locale_ok", scope: !10, file: !3, line: 4210, type: !34)
!129 = !DILocalVariable(name: "locale", scope: !130, file: !3, line: 4227, type: !131)
!130 = distinct !DILexicalBlock(scope: !10, file: !3, line: 4226, column: 3)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !134, line: 51, size: 768, elements: !135)
!134 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !133, file: !134, line: 55, baseType: !15, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !133, file: !134, line: 56, baseType: !15, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !133, file: !134, line: 62, baseType: !15, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !133, file: !134, line: 68, baseType: !15, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !133, file: !134, line: 69, baseType: !15, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !133, file: !134, line: 70, baseType: !15, size: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !133, file: !134, line: 71, baseType: !15, size: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !133, file: !134, line: 72, baseType: !15, size: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !133, file: !134, line: 73, baseType: !15, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !133, file: !134, line: 74, baseType: !15, size: 64, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !133, file: !134, line: 75, baseType: !16, size: 8, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !133, file: !134, line: 76, baseType: !16, size: 8, offset: 648)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !133, file: !134, line: 78, baseType: !16, size: 8, offset: 656)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !133, file: !134, line: 80, baseType: !16, size: 8, offset: 664)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !133, file: !134, line: 82, baseType: !16, size: 8, offset: 672)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !133, file: !134, line: 84, baseType: !16, size: 8, offset: 680)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !133, file: !134, line: 91, baseType: !16, size: 8, offset: 688)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !133, file: !134, line: 92, baseType: !16, size: 8, offset: 696)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !133, file: !134, line: 95, baseType: !16, size: 8, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !133, file: !134, line: 97, baseType: !16, size: 8, offset: 712)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !133, file: !134, line: 99, baseType: !16, size: 8, offset: 720)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !133, file: !134, line: 101, baseType: !16, size: 8, offset: 728)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !133, file: !134, line: 108, baseType: !16, size: 8, offset: 736)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !133, file: !134, line: 109, baseType: !16, size: 8, offset: 744)
!160 = !DILocalVariable(name: "i", scope: !161, file: !3, line: 4246, type: !25)
!161 = distinct !DILexicalBlock(scope: !10, file: !3, line: 4245, column: 3)
!162 = !DILocalVariable(name: "act", scope: !161, file: !3, line: 4270, type: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !164, line: 24, size: 1216, elements: !165)
!164 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!165 = !{!166, !258, !267, !268}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !163, file: !164, line: 35, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !163, file: !164, line: 28, size: 64, elements: !168)
!168 = !{!169, !175}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !167, file: !164, line: 31, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !171, line: 68, baseType: !172)
!171 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !13}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !167, file: !164, line: 33, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !13, !179, !96}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !181, line: 124, baseType: !182)
!181 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 36, size: 1024, elements: !183)
!183 = !{!184, !185, !186, !187, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !182, file: !181, line: 38, baseType: !13, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !182, file: !181, line: 40, baseType: !13, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !182, file: !181, line: 42, baseType: !13, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !182, file: !181, line: 48, baseType: !13, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !182, file: !181, line: 123, baseType: !189, size: 896, offset: 128)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !182, file: !181, line: 51, size: 896, elements: !190)
!190 = !{!191, !195, !203, !215, !221, !231, !247, !252}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !189, file: !181, line: 53, baseType: !192, size: 896)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 896, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 28)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !189, file: !181, line: 60, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 56, size: 64, elements: !197)
!197 = !{!198, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !196, file: !181, line: 58, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !200, line: 142, baseType: !13)
!200 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!201 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !196, file: !181, line: 59, baseType: !202, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !200, line: 134, baseType: !122)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !189, file: !181, line: 68, baseType: !204, size: 128)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 63, size: 128, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !204, file: !181, line: 65, baseType: !13, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !204, file: !181, line: 66, baseType: !13, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !204, file: !181, line: 67, baseType: !209, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !210, line: 11, baseType: !211)
!210 = !DIFile(filename: "/usr/include/bits/types/sigval_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!211 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !210, line: 5, size: 64, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !211, file: !210, line: 7, baseType: !13, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !211, file: !210, line: 8, baseType: !96, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !189, file: !181, line: 76, baseType: !216, size: 128)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 71, size: 128, elements: !217)
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !216, file: !181, line: 73, baseType: !199, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !216, file: !181, line: 74, baseType: !202, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !216, file: !181, line: 75, baseType: !209, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !189, file: !181, line: 86, baseType: !222, size: 256)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 79, size: 256, elements: !223)
!223 = !{!224, !225, !226, !227, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !222, file: !181, line: 81, baseType: !199, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !222, file: !181, line: 82, baseType: !202, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !222, file: !181, line: 83, baseType: !13, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !222, file: !181, line: 84, baseType: !228, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !200, line: 144, baseType: !229)
!229 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !222, file: !181, line: 85, baseType: !228, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !189, file: !181, line: 105, baseType: !232, size: 256)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 89, size: 256, elements: !233)
!233 = !{!234, !235, !237}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !232, file: !181, line: 91, baseType: !96, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !232, file: !181, line: 93, baseType: !236, size: 16, offset: 64)
!236 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !232, file: !181, line: 104, baseType: !238, size: 128, offset: 128)
!238 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !181, line: 94, size: 128, elements: !239)
!239 = !{!240, !245}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !238, file: !181, line: 101, baseType: !241, size: 128)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !238, file: !181, line: 97, size: 128, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !241, file: !181, line: 99, baseType: !96, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !241, file: !181, line: 100, baseType: !96, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !238, file: !181, line: 103, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !200, line: 41, baseType: !122)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !189, file: !181, line: 112, baseType: !248, size: 128)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 108, size: 128, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !248, file: !181, line: 110, baseType: !229, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !248, file: !181, line: 111, baseType: !13, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !189, file: !181, line: 121, baseType: !253, size: 128)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !181, line: 116, size: 128, elements: !254)
!254 = !{!255, !256, !257}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !253, file: !181, line: 118, baseType: !96, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !253, file: !181, line: 119, baseType: !13, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !253, file: !181, line: 120, baseType: !122, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !163, file: !164, line: 43, baseType: !259, size: 1024, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !260, line: 8, baseType: !261)
!260 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !260, line: 5, size: 1024, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !261, file: !260, line: 7, baseType: !264, size: 1024)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1024, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 16)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !163, file: !164, line: 46, baseType: !13, size: 32, offset: 1088)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !163, file: !164, line: 49, baseType: !269, size: 64, offset: 1152)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null}
!272 = !DILocalVariable(name: "oi", scope: !273, file: !3, line: 4312, type: !13)
!273 = distinct !DILexicalBlock(scope: !10, file: !3, line: 4307, column: 5)
!274 = !DILocalVariable(name: "minus_pos_usage", scope: !275, file: !3, line: 4335, type: !34)
!275 = distinct !DILexicalBlock(scope: !276, file: !3, line: 4334, column: 13)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 4333, column: 15)
!277 = distinct !DILexicalBlock(scope: !278, file: !3, line: 4330, column: 9)
!278 = distinct !DILexicalBlock(scope: !273, file: !3, line: 4314, column: 11)
!279 = !DILocalVariable(name: "optarg1", scope: !280, file: !3, line: 4354, type: !36)
!280 = distinct !DILexicalBlock(scope: !281, file: !3, line: 4353, column: 25)
!281 = distinct !DILexicalBlock(scope: !282, file: !3, line: 4352, column: 27)
!282 = distinct !DILexicalBlock(scope: !283, file: !3, line: 4351, column: 21)
!283 = distinct !DILexicalBlock(scope: !284, file: !3, line: 4348, column: 23)
!284 = distinct !DILexicalBlock(scope: !285, file: !3, line: 4339, column: 17)
!285 = distinct !DILexicalBlock(scope: !275, file: !3, line: 4338, column: 19)
!286 = !DILocalVariable(name: "str", scope: !287, file: !3, line: 4402, type: !288)
!287 = distinct !DILexicalBlock(scope: !277, file: !3, line: 4401, column: 11)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 16, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 2)
!291 = !DILocalVariable(name: "newtab", scope: !292, file: !3, line: 4516, type: !16)
!292 = distinct !DILexicalBlock(scope: !277, file: !3, line: 4515, column: 11)
!293 = !DILocalVariable(name: "p", scope: !294, file: !3, line: 4564, type: !36)
!294 = distinct !DILexicalBlock(scope: !295, file: !3, line: 4563, column: 13)
!295 = distinct !DILexicalBlock(scope: !277, file: !3, line: 4562, column: 15)
!296 = !DILocalVariable(name: "stream", scope: !297, file: !3, line: 4586, type: !299)
!297 = distinct !DILexicalBlock(scope: !298, file: !3, line: 4585, column: 5)
!298 = distinct !DILexicalBlock(scope: !10, file: !3, line: 4584, column: 7)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !301, line: 7, baseType: !302)
!301 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !303, line: 241, size: 1728, elements: !304)
!303 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !325, !326, !327, !328, !330, !332, !334, !338, !341, !343, !344, !345, !346, !347, !348, !349}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !302, file: !303, line: 242, baseType: !13, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !302, file: !303, line: 247, baseType: !15, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !302, file: !303, line: 248, baseType: !15, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !302, file: !303, line: 249, baseType: !15, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !302, file: !303, line: 250, baseType: !15, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !302, file: !303, line: 251, baseType: !15, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !302, file: !303, line: 252, baseType: !15, size: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !302, file: !303, line: 253, baseType: !15, size: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !302, file: !303, line: 254, baseType: !15, size: 64, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !302, file: !303, line: 256, baseType: !15, size: 64, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !302, file: !303, line: 257, baseType: !15, size: 64, offset: 640)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !302, file: !303, line: 258, baseType: !15, size: 64, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !302, file: !303, line: 260, baseType: !318, size: 64, offset: 768)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !303, line: 156, size: 192, elements: !320)
!320 = !{!321, !322, !324}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !319, file: !303, line: 157, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !319, file: !303, line: 158, baseType: !323, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !319, file: !303, line: 162, baseType: !13, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !302, file: !303, line: 262, baseType: !323, size: 64, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !302, file: !303, line: 264, baseType: !13, size: 32, offset: 896)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !302, file: !303, line: 268, baseType: !13, size: 32, offset: 928)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !302, file: !303, line: 270, baseType: !329, size: 64, offset: 960)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !200, line: 140, baseType: !229)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !302, file: !303, line: 274, baseType: !331, size: 16, offset: 1024)
!331 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !302, file: !303, line: 275, baseType: !333, size: 8, offset: 1040)
!333 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !302, file: !303, line: 276, baseType: !335, size: 8, offset: 1048)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 1)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !302, file: !303, line: 280, baseType: !339, size: 64, offset: 1088)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !303, line: 150, baseType: null)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !302, file: !303, line: 289, baseType: !342, size: 64, offset: 1152)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !200, line: 141, baseType: !229)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !302, file: !303, line: 297, baseType: !96, size: 64, offset: 1216)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !302, file: !303, line: 298, baseType: !96, size: 64, offset: 1280)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !302, file: !303, line: 299, baseType: !96, size: 64, offset: 1344)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !302, file: !303, line: 300, baseType: !96, size: 64, offset: 1408)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !302, file: !303, line: 302, baseType: !25, size: 64, offset: 1472)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !302, file: !303, line: 303, baseType: !13, size: 32, offset: 1536)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !302, file: !303, line: 305, baseType: !350, size: 160, offset: 1568)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 160, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 20)
!353 = !DILocalVariable(name: "i", scope: !354, file: !3, line: 4616, type: !25)
!354 = distinct !DILexicalBlock(scope: !355, file: !3, line: 4615, column: 9)
!355 = distinct !DILexicalBlock(scope: !297, file: !3, line: 4614, column: 11)
!356 = !DILocalVariable(name: "file_number", scope: !357, file: !3, line: 4631, type: !27)
!357 = distinct !DILexicalBlock(scope: !358, file: !3, line: 4627, column: 17)
!358 = distinct !DILexicalBlock(scope: !359, file: !3, line: 4626, column: 24)
!359 = distinct !DILexicalBlock(scope: !360, file: !3, line: 4622, column: 19)
!360 = distinct !DILexicalBlock(scope: !361, file: !3, line: 4621, column: 13)
!361 = distinct !DILexicalBlock(scope: !362, file: !3, line: 4620, column: 11)
!362 = distinct !DILexicalBlock(scope: !354, file: !3, line: 4620, column: 11)
!363 = !DILocalVariable(name: "tmp_dir", scope: !364, file: !3, line: 4706, type: !36)
!364 = distinct !DILexicalBlock(scope: !365, file: !3, line: 4705, column: 5)
!365 = distinct !DILexicalBlock(scope: !10, file: !3, line: 4704, column: 7)
!366 = !DILocalVariable(name: "sortfiles", scope: !367, file: !3, line: 4749, type: !369)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 4748, column: 5)
!368 = distinct !DILexicalBlock(scope: !10, file: !3, line: 4747, column: 7)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sortfile", file: !3, line: 677, size: 128, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !3, line: 680, baseType: !36, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !370, file: !3, line: 683, baseType: !374, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tempnode", file: !3, line: 666, size: 128, elements: !376)
!376 = !{!377, !379, !382, !383}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !375, file: !3, line: 668, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !374)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !375, file: !3, line: 669, baseType: !380, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !381, line: 38, baseType: !199)
!381 = !DIFile(filename: "/usr/include/sched.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!382 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !375, file: !3, line: 670, baseType: !16, size: 8, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !375, file: !3, line: 671, baseType: !85, offset: 104)
!384 = !DILocalVariable(name: "i", scope: !367, file: !3, line: 4750, type: !25)
!385 = !DILocalVariable(name: "np", scope: !386, file: !3, line: 4762, type: !27)
!386 = distinct !DILexicalBlock(scope: !387, file: !3, line: 4761, column: 9)
!387 = distinct !DILexicalBlock(scope: !388, file: !3, line: 4760, column: 11)
!388 = distinct !DILexicalBlock(scope: !368, file: !3, line: 4759, column: 5)
!389 = !DILocalVariable(name: "nthreads_max", scope: !388, file: !3, line: 4767, type: !25)
!390 = !{!391}
!391 = !DIEnumerator(name: "nsigs", value: 11)
!392 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blanktype", file: !3, line: 177, size: 32, elements: !393)
!393 = !{!394, !395, !396}
!394 = !DIEnumerator(name: "bl_start", value: 0)
!395 = !DIEnumerator(name: "bl_end", value: 1)
!396 = !DIEnumerator(name: "bl_both", value: 2)
!397 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 350, size: 32, elements: !398)
!398 = !{!399}
!399 = !DIEnumerator(name: "TAB_DEFAULT", value: 128)
!400 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !401, line: 32, size: 32, elements: !402)
!401 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413}
!403 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!404 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!405 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!406 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!407 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!408 = !DIEnumerator(name: "c_quoting_style", value: 5)
!409 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!410 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!411 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!412 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!413 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nproc_query", file: !415, line: 32, size: 32, elements: !416)
!415 = !DIFile(filename: "./lib/nproc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!416 = !{!417, !418, !419}
!417 = !DIEnumerator(name: "NPROC_ALL", value: 0)
!418 = !DIEnumerator(name: "NPROC_CURRENT", value: 1)
!419 = !DIEnumerator(name: "NPROC_CURRENT_OVERRIDABLE", value: 2)
!420 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 125, size: 32, elements: !421)
!421 = !{!422}
!422 = !DIEnumerator(name: "DEFAULT_MAX_THREADS", value: 8)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 46, size: 32, elements: !425)
!424 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437}
!426 = !DIEnumerator(name: "_ISupper", value: 256)
!427 = !DIEnumerator(name: "_ISlower", value: 512)
!428 = !DIEnumerator(name: "_ISalpha", value: 1024)
!429 = !DIEnumerator(name: "_ISdigit", value: 2048)
!430 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!431 = !DIEnumerator(name: "_ISspace", value: 8192)
!432 = !DIEnumerator(name: "_ISprint", value: 16384)
!433 = !DIEnumerator(name: "_ISgraph", value: 32768)
!434 = !DIEnumerator(name: "_ISblank", value: 1)
!435 = !DIEnumerator(name: "_IScntrl", value: 2)
!436 = !DIEnumerator(name: "_ISpunct", value: 4)
!437 = !DIEnumerator(name: "_ISalnum", value: 8)
!438 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !439, line: 41, size: 32, elements: !440)
!439 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775}
!441 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!442 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!443 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!444 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!445 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!446 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!447 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!448 = !DIEnumerator(name: "DAY_1", value: 131079)
!449 = !DIEnumerator(name: "DAY_2", value: 131080)
!450 = !DIEnumerator(name: "DAY_3", value: 131081)
!451 = !DIEnumerator(name: "DAY_4", value: 131082)
!452 = !DIEnumerator(name: "DAY_5", value: 131083)
!453 = !DIEnumerator(name: "DAY_6", value: 131084)
!454 = !DIEnumerator(name: "DAY_7", value: 131085)
!455 = !DIEnumerator(name: "ABMON_1", value: 131086)
!456 = !DIEnumerator(name: "ABMON_2", value: 131087)
!457 = !DIEnumerator(name: "ABMON_3", value: 131088)
!458 = !DIEnumerator(name: "ABMON_4", value: 131089)
!459 = !DIEnumerator(name: "ABMON_5", value: 131090)
!460 = !DIEnumerator(name: "ABMON_6", value: 131091)
!461 = !DIEnumerator(name: "ABMON_7", value: 131092)
!462 = !DIEnumerator(name: "ABMON_8", value: 131093)
!463 = !DIEnumerator(name: "ABMON_9", value: 131094)
!464 = !DIEnumerator(name: "ABMON_10", value: 131095)
!465 = !DIEnumerator(name: "ABMON_11", value: 131096)
!466 = !DIEnumerator(name: "ABMON_12", value: 131097)
!467 = !DIEnumerator(name: "MON_1", value: 131098)
!468 = !DIEnumerator(name: "MON_2", value: 131099)
!469 = !DIEnumerator(name: "MON_3", value: 131100)
!470 = !DIEnumerator(name: "MON_4", value: 131101)
!471 = !DIEnumerator(name: "MON_5", value: 131102)
!472 = !DIEnumerator(name: "MON_6", value: 131103)
!473 = !DIEnumerator(name: "MON_7", value: 131104)
!474 = !DIEnumerator(name: "MON_8", value: 131105)
!475 = !DIEnumerator(name: "MON_9", value: 131106)
!476 = !DIEnumerator(name: "MON_10", value: 131107)
!477 = !DIEnumerator(name: "MON_11", value: 131108)
!478 = !DIEnumerator(name: "MON_12", value: 131109)
!479 = !DIEnumerator(name: "AM_STR", value: 131110)
!480 = !DIEnumerator(name: "PM_STR", value: 131111)
!481 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!482 = !DIEnumerator(name: "D_FMT", value: 131113)
!483 = !DIEnumerator(name: "T_FMT", value: 131114)
!484 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!485 = !DIEnumerator(name: "ERA", value: 131116)
!486 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!487 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!488 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!489 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!490 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!491 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!492 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!493 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!494 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!495 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!496 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!497 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!498 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!499 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!500 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!501 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!502 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!503 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!504 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!505 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!506 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!507 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!508 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!509 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!510 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!511 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!512 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!513 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!514 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!515 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!516 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!517 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!518 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!519 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!520 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!521 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!522 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!523 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!524 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!525 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!526 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!527 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!528 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!529 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!530 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!531 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!532 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!533 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!534 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!535 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!536 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!537 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!538 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!539 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!540 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!541 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!542 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!543 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!544 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!545 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!546 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!547 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!548 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!549 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!550 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!551 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!552 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!553 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!554 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!555 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!556 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!557 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!558 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!559 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!560 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!561 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!562 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!563 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!564 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!565 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!566 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!567 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!568 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!569 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!570 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!571 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!572 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!573 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!574 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!575 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!576 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!577 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!578 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!579 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!580 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!581 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!582 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!583 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!584 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!585 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!586 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!587 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!588 = !DIEnumerator(name: "CODESET", value: 14)
!589 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!590 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!591 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!592 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!593 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!594 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!595 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!596 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!597 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!598 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!599 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!600 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!601 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!602 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!603 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!604 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!605 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!606 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!607 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!608 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!609 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!610 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!611 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!612 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!613 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!614 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!615 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!616 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!617 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!618 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!619 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!620 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!621 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!622 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!623 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!624 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!625 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!626 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!627 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!628 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!629 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!630 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!631 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!632 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!633 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!634 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!635 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!636 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!637 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!638 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!639 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!640 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!641 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!642 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!643 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!644 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!645 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!646 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!647 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!648 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!649 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!650 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!651 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!652 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!653 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!654 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!655 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!656 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!657 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!658 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!659 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!660 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!661 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!662 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!663 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!664 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!665 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!666 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!667 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!668 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!669 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!670 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!671 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!672 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!673 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!674 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!675 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!676 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!677 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!678 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!679 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!680 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!681 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!682 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!683 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!684 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!685 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!686 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!687 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!688 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!689 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!690 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!691 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!692 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!693 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!694 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!695 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!696 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!697 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!698 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!699 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!700 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!701 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!702 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!703 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!704 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!705 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!706 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!707 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!708 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!709 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!710 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!711 = !DIEnumerator(name: "THOUSEP", value: 65537)
!712 = !DIEnumerator(name: "__GROUPING", value: 65538)
!713 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!714 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!715 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!716 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!717 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!718 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!719 = !DIEnumerator(name: "__YESSTR", value: 327682)
!720 = !DIEnumerator(name: "__NOSTR", value: 327683)
!721 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!722 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!723 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!724 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!725 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!726 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!727 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!728 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!729 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!730 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!731 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!732 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!733 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!734 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!735 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!736 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!737 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!738 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!739 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!740 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!741 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!742 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!743 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!744 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!745 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!746 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!747 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!748 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!749 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!750 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!751 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!752 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!753 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!754 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!755 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!756 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!757 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!758 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!759 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!760 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!761 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!762 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!763 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!764 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!765 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!766 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!767 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!768 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!769 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!770 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!771 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!772 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!773 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!774 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!775 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!776 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !777, line: 26, size: 32, elements: !778)
!777 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!778 = !{!779, !780, !781, !782, !783}
!779 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!780 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!781 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!782 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!783 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!784 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !785, line: 31, size: 32, elements: !786)
!785 = !DIFile(filename: "/usr/include/bits/resource.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805}
!787 = !DIEnumerator(name: "RLIMIT_CPU", value: 0)
!788 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1)
!789 = !DIEnumerator(name: "RLIMIT_DATA", value: 2)
!790 = !DIEnumerator(name: "RLIMIT_STACK", value: 3)
!791 = !DIEnumerator(name: "RLIMIT_CORE", value: 4)
!792 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5)
!793 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7)
!794 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7)
!795 = !DIEnumerator(name: "RLIMIT_AS", value: 9)
!796 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6)
!797 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8)
!798 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10)
!799 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11)
!800 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12)
!801 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13)
!802 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14)
!803 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15)
!804 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16)
!805 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16)
!806 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !808, file: !807, line: 192, size: 32, elements: !816)
!807 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!808 = distinct !DISubprogram(name: "x2nrealloc", scope: !807, file: !807, line: 180, type: !809, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !811)
!809 = !DISubroutineType(types: !810)
!810 = !{!96, !96, !72, !25}
!811 = !{!812, !813, !814, !815}
!812 = !DILocalVariable(name: "p", arg: 1, scope: !808, file: !807, line: 180, type: !96)
!813 = !DILocalVariable(name: "pn", arg: 2, scope: !808, file: !807, line: 180, type: !72)
!814 = !DILocalVariable(name: "s", arg: 3, scope: !808, file: !807, line: 180, type: !25)
!815 = !DILocalVariable(name: "n", scope: !808, file: !807, line: 182, type: !25)
!816 = !{!817}
!817 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!818 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !820, file: !819, line: 187, size: 32, elements: !828)
!819 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!820 = distinct !DISubprogram(name: "select_plural", scope: !819, file: !819, line: 183, type: !821, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !826)
!821 = !DISubroutineType(types: !822)
!822 = !{!27, !823}
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !824, line: 112, baseType: !825)
!824 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !200, line: 62, baseType: !27)
!826 = !{!827}
!827 = !DILocalVariable(name: "n", arg: 1, scope: !820, file: !819, line: 183, type: !823)
!828 = !{!829}
!829 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000)
!830 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !831, line: 45, size: 32, elements: !832)
!831 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!832 = !{!833, !834, !835, !836, !837, !838}
!833 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!834 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!835 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!836 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!837 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!838 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!839 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 663, size: 32, elements: !840)
!840 = !{!841, !842, !843}
!841 = !DIEnumerator(name: "UNCOMPRESSED", value: 0)
!842 = !DIEnumerator(name: "UNREAPED", value: 1)
!843 = !DIEnumerator(name: "REAPED", value: 2)
!844 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 139, size: 32, elements: !845)
!845 = !{!846, !847}
!846 = !DIEnumerator(name: "MAX_FORK_TRIES_COMPRESS", value: 4)
!847 = !DIEnumerator(name: "MAX_FORK_TRIES_DECOMPRESS", value: 9)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 689, size: 32, elements: !849)
!849 = !{!850}
!850 = !DIEnumerator(name: "INIT_PROCTAB_SIZE", value: 47)
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 153, size: 32, elements: !852)
!852 = !{!853, !854}
!853 = !DIEnumerator(name: "MERGE_END", value: 0)
!854 = !DIEnumerator(name: "MERGE_ROOT", value: 1)
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 120, size: 32, elements: !856)
!856 = !{!857}
!857 = !DIEnumerator(name: "SUBTHREAD_LINES_HEURISTIC", value: 131072)
!858 = !{!96, !170, !122, !36, !15, !13, !331, !25, !859}
!859 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!860 = !{!861, !867, !872, !877, !879, !0, !881, !883, !885, !887, !889, !891, !893, !895, !897, !899, !901, !905, !924, !929, !931, !933, !936, !945, !947, !952, !964, !969, !973, !976, !981, !983, !985, !988, !990, !1008, !1010, !1012, !1015, !1021, !1023, !1026, !1046, !1048, !1107}
!861 = !DIGlobalVariableExpression(var: !862)
!862 = distinct !DIGlobalVariable(name: "sig", scope: !10, file: !3, line: 4247, type: !863, isLocal: true, isDefinition: true)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 352, elements: !865)
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!865 = !{!866}
!866 = !DISubrange(count: 11)
!867 = !DIGlobalVariableExpression(var: !868)
!868 = distinct !DIGlobalVariable(name: "opts", scope: !10, file: !3, line: 4677, type: !869, isLocal: true, isDefinition: true)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 80, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 10)
!872 = !DIGlobalVariableExpression(var: !873)
!873 = distinct !DIGlobalVariable(name: "opts", scope: !10, file: !3, line: 4731, type: !874, isLocal: true, isDefinition: true)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 3)
!877 = !DIGlobalVariableExpression(var: !878)
!878 = distinct !DIGlobalVariable(name: "decimal_point", scope: !2, file: !3, line: 163, type: !13, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880)
!880 = distinct !DIGlobalVariable(name: "thousands_sep", scope: !2, file: !3, line: 166, type: !13, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882)
!882 = distinct !DIGlobalVariable(name: "hard_LC_TIME", scope: !2, file: !3, line: 171, type: !34, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884)
!884 = distinct !DIGlobalVariable(name: "sort_size", scope: !2, file: !3, line: 323, type: !25, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886)
!886 = distinct !DIGlobalVariable(name: "temp_dir_count", scope: !2, file: !3, line: 336, type: !25, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888)
!888 = distinct !DIGlobalVariable(name: "reverse", scope: !2, file: !3, line: 342, type: !34, isLocal: true, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890)
!890 = distinct !DIGlobalVariable(name: "stable", scope: !2, file: !3, line: 347, type: !34, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892)
!892 = distinct !DIGlobalVariable(name: "unique", scope: !2, file: !3, line: 359, type: !34, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894)
!894 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 362, type: !34, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896)
!896 = distinct !DIGlobalVariable(name: "keylist", scope: !2, file: !3, line: 365, type: !21, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898)
!898 = distinct !DIGlobalVariable(name: "compress_program", scope: !2, file: !3, line: 368, type: !36, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900)
!900 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 371, type: !34, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902)
!902 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 631, type: !903, isLocal: true, isDefinition: true)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !904, line: 7, baseType: !259)
!904 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!905 = !DIGlobalVariableExpression(var: !906)
!906 = distinct !DIGlobalVariable(name: "infomap", scope: !907, file: !819, line: 632, type: !921, isLocal: true, isDefinition: true)
!907 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !819, file: !819, line: 630, type: !908, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !910)
!908 = !DISubroutineType(types: !909)
!909 = !{null, !36}
!910 = !{!911, !912, !913, !920}
!911 = !DILocalVariable(name: "program", arg: 1, scope: !907, file: !819, line: 630, type: !36)
!912 = !DILocalVariable(name: "node", scope: !907, file: !819, line: 642, type: !36)
!913 = !DILocalVariable(name: "map_prog", scope: !907, file: !819, line: 643, type: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !907, file: !819, line: 632, size: 128, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !916, file: !819, line: 632, baseType: !36, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !916, file: !819, line: 632, baseType: !36, size: 64, offset: 64)
!920 = !DILocalVariable(name: "lc_messages", scope: !907, file: !819, line: 655, type: !36)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 896, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 7)
!924 = !DIGlobalVariableExpression(var: !925)
!925 = distinct !DIGlobalVariable(name: "blanks", scope: !2, file: !3, line: 276, type: !926, isLocal: true, isDefinition: true)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 2048, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 256)
!929 = !DIGlobalVariableExpression(var: !930)
!930 = distinct !DIGlobalVariable(name: "nonprinting", scope: !2, file: !3, line: 279, type: !926, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932)
!932 = distinct !DIGlobalVariable(name: "nondictionary", scope: !2, file: !3, line: 282, type: !926, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934)
!934 = distinct !DIGlobalVariable(name: "fold_toupper", scope: !2, file: !3, line: 285, type: !935, isLocal: true, isDefinition: true)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, elements: !927)
!936 = !DIGlobalVariableExpression(var: !937)
!937 = distinct !DIGlobalVariable(name: "monthtab", scope: !2, file: !3, line: 291, type: !938, isLocal: true, isDefinition: true)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 1536, elements: !943)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "month", file: !3, line: 233, size: 128, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !939, file: !3, line: 235, baseType: !36, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !939, file: !3, line: 236, baseType: !13, size: 32, offset: 64)
!943 = !{!944}
!944 = !DISubrange(count: 12)
!945 = !DIGlobalVariableExpression(var: !946)
!946 = distinct !DIGlobalVariable(name: "temphead", scope: !2, file: !3, line: 673, type: !378, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948)
!948 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 554, type: !949, isLocal: true, isDefinition: true)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 248, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 31)
!952 = !DIGlobalVariableExpression(var: !953)
!953 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 556, type: !954, isLocal: true, isDefinition: true)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 7936, elements: !950)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !957, line: 50, size: 256, elements: !958)
!957 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!958 = !{!959, !960, !961, !963}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !956, file: !957, line: 52, baseType: !36, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !956, file: !957, line: 55, baseType: !13, size: 32, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !956, file: !957, line: 56, baseType: !962, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !956, file: !957, line: 57, baseType: !13, size: 32, offset: 192)
!964 = !DIGlobalVariableExpression(var: !965)
!965 = distinct !DIGlobalVariable(name: "sort_types", scope: !2, file: !3, line: 623, type: !966, isLocal: true, isDefinition: true)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 48, elements: !967)
!967 = !{!968}
!968 = !DISubrange(count: 6)
!969 = !DIGlobalVariableExpression(var: !970)
!970 = distinct !DIGlobalVariable(name: "sort_args", scope: !2, file: !3, line: 617, type: !971, isLocal: true, isDefinition: true)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 448, elements: !922)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!973 = !DIGlobalVariableExpression(var: !974)
!974 = distinct !DIGlobalVariable(name: "check_types", scope: !2, file: !3, line: 602, type: !975, isLocal: true, isDefinition: true)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 24, elements: !875)
!976 = !DIGlobalVariableExpression(var: !977)
!977 = distinct !DIGlobalVariable(name: "check_args", scope: !2, file: !3, line: 596, type: !978, isLocal: true, isDefinition: true)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 256, elements: !979)
!979 = !{!980}
!980 = !DISubrange(count: 4)
!981 = !DIGlobalVariableExpression(var: !982)
!982 = distinct !DIGlobalVariable(name: "tab", scope: !2, file: !3, line: 355, type: !13, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984)
!984 = distinct !DIGlobalVariable(name: "temp_dir_alloc", scope: !2, file: !3, line: 339, type: !25, isLocal: true, isDefinition: true)
!985 = !DIGlobalVariableExpression(var: !986)
!986 = distinct !DIGlobalVariable(name: "temp_dirs", scope: !2, file: !3, line: 333, type: !987, isLocal: true, isDefinition: true)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!988 = !DIGlobalVariableExpression(var: !989)
!989 = distinct !DIGlobalVariable(name: "eolchar", scope: !2, file: !3, line: 180, type: !16, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991)
!991 = distinct !DIGlobalVariable(name: "random_md5_state", scope: !2, file: !3, line: 2077, type: !992, isLocal: true, isDefinition: true)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "md5_ctx", file: !993, line: 69, size: 1248, elements: !994)
!993 = !DIFile(filename: "./lib/md5.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!994 = !{!995, !998, !999, !1000, !1001, !1003, !1004}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !992, file: !993, line: 71, baseType: !996, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !997, line: 26, baseType: !246)
!997 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!998 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !992, file: !993, line: 72, baseType: !996, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !992, file: !993, line: 73, baseType: !996, size: 32, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !992, file: !993, line: 74, baseType: !996, size: 32, offset: 96)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !992, file: !993, line: 76, baseType: !1002, size: 64, offset: 128)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 64, elements: !289)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !992, file: !993, line: 77, baseType: !996, size: 32, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !992, file: !993, line: 78, baseType: !1005, size: 1024, offset: 224)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 1024, elements: !1006)
!1006 = !{!1007}
!1007 = !DISubrange(count: 32)
!1008 = !DIGlobalVariableExpression(var: !1009)
!1009 = distinct !DIGlobalVariable(name: "nmerge", scope: !2, file: !3, line: 375, type: !122, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011)
!1011 = distinct !DIGlobalVariable(name: "merge_buffer_size", scope: !2, file: !3, line: 319, type: !25, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013)
!1013 = distinct !DIGlobalVariable(name: "unit_order", scope: !2, file: !3, line: 1861, type: !1014, isLocal: true, isDefinition: true)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, elements: !927)
!1015 = !DIGlobalVariableExpression(var: !1016)
!1016 = distinct !DIGlobalVariable(name: "proctab", scope: !2, file: !3, line: 687, type: !1017, isLocal: true, isDefinition: true)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !1019, line: 69, baseType: !1020)
!1019 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1020 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1019, line: 67, flags: DIFlagFwdDecl)
!1021 = !DIGlobalVariableExpression(var: !1022)
!1022 = distinct !DIGlobalVariable(name: "nprocs", scope: !2, file: !3, line: 707, type: !380, isLocal: true, isDefinition: true)
!1023 = !DIGlobalVariableExpression(var: !1024)
!1024 = distinct !DIGlobalVariable(name: "temptail", scope: !2, file: !3, line: 674, type: !1025, isLocal: true, isDefinition: true)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!1026 = !DIGlobalVariableExpression(var: !1027)
!1027 = distinct !DIGlobalVariable(name: "slashbase", scope: !1028, file: !3, line: 852, type: !1045, isLocal: true, isDefinition: true)
!1028 = distinct !DISubprogram(name: "create_temp_file", scope: !3, file: !3, line: 850, type: !1029, isLocal: true, isDefinition: true, scopeLine: 851, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1031)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!374, !962, !34}
!1031 = !{!1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040}
!1032 = !DILocalVariable(name: "pfd", arg: 1, scope: !1028, file: !3, line: 850, type: !962)
!1033 = !DILocalVariable(name: "survive_fd_exhaustion", arg: 2, scope: !1028, file: !3, line: 850, type: !34)
!1034 = !DILocalVariable(name: "fd", scope: !1028, file: !3, line: 854, type: !13)
!1035 = !DILocalVariable(name: "saved_errno", scope: !1028, file: !3, line: 855, type: !13)
!1036 = !DILocalVariable(name: "temp_dir", scope: !1028, file: !3, line: 856, type: !36)
!1037 = !DILocalVariable(name: "len", scope: !1028, file: !3, line: 857, type: !25)
!1038 = !DILocalVariable(name: "node", scope: !1028, file: !3, line: 858, type: !374)
!1039 = !DILocalVariable(name: "file", scope: !1028, file: !3, line: 860, type: !15)
!1040 = !DILocalVariable(name: "cs", scope: !1028, file: !3, line: 861, type: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cs_status", file: !3, line: 634, size: 1088, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !1041, file: !3, line: 636, baseType: !34, size: 8)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "sigs", scope: !1041, file: !3, line: 637, baseType: !903, size: 1024, offset: 64)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 96, elements: !943)
!1046 = !DIGlobalVariableExpression(var: !1047)
!1047 = distinct !DIGlobalVariable(name: "temp_dir_index", scope: !1028, file: !3, line: 853, type: !25, isLocal: true, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049)
!1049 = distinct !DIGlobalVariable(name: "size_bound", scope: !1050, file: !3, line: 1505, type: !25, isLocal: true, isDefinition: true)
!1050 = distinct !DISubprogram(name: "sort_buffer_size", scope: !3, file: !3, line: 1499, type: !1051, isLocal: true, isDefinition: true, scopeLine: 1502, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1057)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!25, !1053, !25, !1055, !25, !25}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!1057 = !{!1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1103, !1106}
!1058 = !DILocalVariable(name: "fps", arg: 1, scope: !1050, file: !3, line: 1499, type: !1053)
!1059 = !DILocalVariable(name: "nfps", arg: 2, scope: !1050, file: !3, line: 1499, type: !25)
!1060 = !DILocalVariable(name: "files", arg: 3, scope: !1050, file: !3, line: 1500, type: !1055)
!1061 = !DILocalVariable(name: "nfiles", arg: 4, scope: !1050, file: !3, line: 1500, type: !25)
!1062 = !DILocalVariable(name: "line_bytes", arg: 5, scope: !1050, file: !3, line: 1501, type: !25)
!1063 = !DILocalVariable(name: "worst_case_per_input_byte", scope: !1050, file: !3, line: 1508, type: !25)
!1064 = !DILocalVariable(name: "size", scope: !1050, file: !3, line: 1512, type: !25)
!1065 = !DILocalVariable(name: "i", scope: !1050, file: !3, line: 1514, type: !25)
!1066 = !DILocalVariable(name: "st", scope: !1067, file: !3, line: 1518, type: !1070)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !3, line: 1517, column: 5)
!1068 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 1516, column: 3)
!1069 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 1516, column: 3)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1071, line: 46, size: 1152, elements: !1072)
!1071 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1072 = !{!1073, !1075, !1077, !1079, !1081, !1082, !1084, !1085, !1086, !1087, !1089, !1091, !1099, !1100, !1101}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1070, file: !1071, line: 48, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !200, line: 133, baseType: !27)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1070, file: !1071, line: 53, baseType: !1076, size: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !200, line: 136, baseType: !27)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1070, file: !1071, line: 61, baseType: !1078, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !200, line: 139, baseType: !27)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1070, file: !1071, line: 62, baseType: !1080, size: 32, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !200, line: 138, baseType: !122)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1070, file: !1071, line: 64, baseType: !202, size: 32, offset: 224)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1070, file: !1071, line: 65, baseType: !1083, size: 32, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !200, line: 135, baseType: !122)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1070, file: !1071, line: 67, baseType: !13, size: 32, offset: 288)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1070, file: !1071, line: 69, baseType: !1074, size: 64, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1070, file: !1071, line: 74, baseType: !329, size: 64, offset: 384)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1070, file: !1071, line: 78, baseType: !1088, size: 64, offset: 448)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !200, line: 162, baseType: !229)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1070, file: !1071, line: 80, baseType: !1090, size: 64, offset: 512)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !200, line: 167, baseType: !229)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1070, file: !1071, line: 91, baseType: !1092, size: 128, offset: 576)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1093, line: 8, size: 128, elements: !1094)
!1093 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1094 = !{!1095, !1097}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1092, file: !1093, line: 10, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !200, line: 148, baseType: !229)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1092, file: !1093, line: 11, baseType: !1098, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !200, line: 184, baseType: !229)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1070, file: !1071, line: 92, baseType: !1092, size: 128, offset: 704)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1070, file: !1071, line: 93, baseType: !1092, size: 128, offset: 832)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1070, file: !1071, line: 106, baseType: !1102, size: 192, offset: 960)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 192, elements: !875)
!1103 = !DILocalVariable(name: "file_size", scope: !1067, file: !3, line: 1519, type: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !1105, line: 86, baseType: !329)
!1105 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1106 = !DILocalVariable(name: "worst_case", scope: !1067, file: !3, line: 1520, type: !25)
!1107 = !DIGlobalVariableExpression(var: !1108)
!1108 = distinct !DIGlobalVariable(name: "saved_line", scope: !2, file: !3, line: 267, type: !1109, isLocal: true, isDefinition: true)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !3, line: 183, size: 256, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1109, file: !3, line: 185, baseType: !15, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1109, file: !3, line: 186, baseType: !25, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "keybeg", scope: !1109, file: !3, line: 187, baseType: !15, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "keylim", scope: !1109, file: !3, line: 188, baseType: !15, size: 64, offset: 192)
!1115 = !DIGlobalVariableExpression(var: !1116)
!1116 = distinct !DIGlobalVariable(name: "Version", scope: !1117, file: !1118, line: 2, type: !36, isLocal: false, isDefinition: true)
!1117 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1118, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1119, globals: !1120)
!1118 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1119 = !{}
!1120 = !{!1115}
!1121 = !DIGlobalVariableExpression(var: !1122)
!1122 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1123, file: !1128, line: 69, type: !1129, isLocal: false, isDefinition: true)
!1123 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1124, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1125, retainedTypes: !1126, globals: !1127)
!1124 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1125 = !{!400}
!1126 = !{!96, !859}
!1127 = !{!1121}
!1128 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1130, line: 55, baseType: !269)
!1130 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1131 = !DIGlobalVariableExpression(var: !1132)
!1132 = distinct !DIGlobalVariable(name: "file_name", scope: !1133, file: !1138, line: 36, type: !36, isLocal: true, isDefinition: true)
!1133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1134, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1119, globals: !1135)
!1134 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1135 = !{!1131, !1136}
!1136 = !DIGlobalVariableExpression(var: !1137)
!1137 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1133, file: !1138, line: 46, type: !34, isLocal: true, isDefinition: true)
!1138 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1139 = !DIGlobalVariableExpression(var: !1140)
!1140 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1141, file: !1146, line: 70, type: !1147, isLocal: true, isDefinition: true)
!1141 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1142, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1119, retainedTypes: !1143, globals: !1145)
!1142 = !DIFile(filename: "./lib/md5.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1143 = !{!15, !36, !1144}
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !824, line: 100, baseType: !27)
!1145 = !{!1139}
!1146 = !DIFile(filename: "lib/md5.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1148, size: 512, elements: !1149)
!1148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !859)
!1149 = !{!1150}
!1150 = !DISubrange(count: 64)
!1151 = !DIGlobalVariableExpression(var: !1152)
