; ModuleID = 'coreutils-8.27/src/split.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__sigset_t = type { [16 x i64] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.numname = type { i32, [8 x i8] }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.of_info = type { i8*, i32, %struct._IO_FILE*, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.__mbstate_t = type { i32, %union.anon.4 }
%union.anon.4 = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [39 x i8] c"Usage: %s [OPTION]... [FILE [PREFIX]]\0A\00", align 1

!87 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !81, line: 62, baseType: !65)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !92, line: 68, baseType: !93)
!92 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !83}
!96 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!97 = !{!98, !247, !250, !252, !256, !258, !260, !262, !264, !266, !0, !268, !305, !307, !309, !311, !331, !343, !345, !347, !349, !362, !364, !366, !368, !370, !372, !374, !376}
!98 = !DIGlobalVariableExpression(var: !99)
!99 = distinct !DIGlobalVariable(name: "multipliers", scope: !100, file: !3, line: 1293, type: !243, isLocal: true, isDefinition: true)
!100 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1285, type: !101, isLocal: false, isDefinition: true, scopeLine: 1286, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !104)
!101 = !DISubroutineType(types: !102)
!102 = !{!83, !83, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !117, !118, !121, !127, !129, !130, !131, !132, !137}
!105 = !DILocalVariable(name: "argc", arg: 1, scope: !100, file: !3, line: 1285, type: !83)
!106 = !DILocalVariable(name: "argv", arg: 2, scope: !100, file: !3, line: 1285, type: !103)
!107 = !DILocalVariable(name: "split_type", scope: !100, file: !3, line: 1287, type: !5)
!108 = !DILocalVariable(name: "in_blk_size", scope: !100, file: !3, line: 1288, type: !63)
!109 = !DILocalVariable(name: "page_size", scope: !100, file: !3, line: 1289, type: !63)
!110 = !DILocalVariable(name: "k_units", scope: !100, file: !3, line: 1290, type: !86)
!111 = !DILocalVariable(name: "n_units", scope: !100, file: !3, line: 1291, type: !86)
!112 = !DILocalVariable(name: "c", scope: !100, file: !3, line: 1294, type: !83)
!113 = !DILocalVariable(name: "digits_optind", scope: !100, file: !3, line: 1295, type: !83)
!114 = !DILocalVariable(name: "file_size", scope: !100, file: !3, line: 1296, type: !78)
!115 = !DILocalVariable(name: "this_optind", scope: !116, file: !3, line: 1314, type: !83)
!116 = distinct !DILexicalBlock(scope: !100, file: !3, line: 1312, column: 5)
!117 = !DILocalVariable(name: "slash", scope: !116, file: !3, line: 1315, type: !89)
!118 = !DILocalVariable(name: "neweol", scope: !119, file: !3, line: 1398, type: !90)
!119 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1397, column: 11)
!120 = distinct !DILexicalBlock(scope: !116, file: !3, line: 1323, column: 9)
!121 = !DILocalVariable(name: "buffer", scope: !122, file: !3, line: 1448, type: !124)
!122 = distinct !DILexicalBlock(scope: !123, file: !3, line: 1447, column: 13)
!123 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1446, column: 15)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 168, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 21)
!127 = !DILocalVariable(name: "specified_buf_size", scope: !100, file: !3, line: 1563, type: !128)
!128 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!129 = !DILocalVariable(name: "b", scope: !100, file: !3, line: 1567, type: !61)
!130 = !DILocalVariable(name: "buf", scope: !100, file: !3, line: 1568, type: !89)
!131 = !DILocalVariable(name: "initial_read", scope: !100, file: !3, line: 1569, type: !63)
!132 = !DILocalVariable(name: "buffer", scope: !133, file: !3, line: 1582, type: !124)
!133 = distinct !DILexicalBlock(scope: !134, file: !3, line: 1581, column: 9)
!134 = distinct !DILexicalBlock(scope: !135, file: !3, line: 1580, column: 11)
!135 = distinct !DILexicalBlock(scope: !136, file: !3, line: 1572, column: 5)
!136 = distinct !DILexicalBlock(scope: !100, file: !3, line: 1571, column: 7)
!137 = !DILocalVariable(name: "act", scope: !138, file: !3, line: 1596, type: !140)
!138 = distinct !DILexicalBlock(scope: !139, file: !3, line: 1595, column: 5)
!139 = distinct !DILexicalBlock(scope: !100, file: !3, line: 1594, column: 7)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !141, line: 24, size: 1216, elements: !142)
!141 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!142 = !{!143, !229, !238, !239}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !140, file: !141, line: 35, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !140, file: !141, line: 28, size: 64, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !144, file: !141, line: 31, baseType: !91, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !144, file: !141, line: 33, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !83, !151, !61}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !153, line: 124, baseType: !154)
!153 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 36, size: 1024, elements: !155)
!155 = !{!156, !157, !158, !159, !160}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !154, file: !153, line: 38, baseType: !83, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !154, file: !153, line: 40, baseType: !83, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !154, file: !153, line: 42, baseType: !83, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !154, file: !153, line: 48, baseType: !83, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !154, file: !153, line: 123, baseType: !161, size: 896, offset: 128)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !154, file: !153, line: 51, size: 896, elements: !162)
!162 = !{!163, !167, !175, !187, !193, !202, !218, !223}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !161, file: !153, line: 53, baseType: !164, size: 896)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 896, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 28)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !161, file: !153, line: 60, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !153, line: 56, size: 64, elements: !169)
!169 = !{!170, !172}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !168, file: !153, line: 58, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !81, line: 142, baseType: !83)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !168, file: !153, line: 59, baseType: !173, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !81, line: 134, baseType: !174)
!174 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !161, file: !153, line: 68, baseType: !176, size: 128)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !153, line: 63, size: 128, elements: !177)
!177 = !{!178, !179, !180}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !176, file: !153, line: 65, baseType: !83, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !176, file: !153, line: 66, baseType: !83, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !176, file: !153, line: 67, baseType: !181, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !182, line: 11, baseType: !183)
!182 = !DIFile(filename: "/usr/include/bits/types/sigval_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!183 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !182, line: 5, size: 64, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !183, file: !182, line: 7, baseType: !83, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !183, file: !182, line: 8, baseType: !61, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !161, file: !153, line: 76, baseType: !188, size: 128)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !153, line: 71, size: 128, elements: !189)
!189 = !{!190, !191, !192}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !188, file: !153, line: 73, baseType: !171, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !188, file: !153, line: 74, baseType: !173, size: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !188, file: !153, line: 75, baseType: !181, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !161, file: !153, line: 86, baseType: !194, size: 256)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !153, line: 79, size: 256, elements: !195)
!195 = !{!196, !197, !198, !199, !201}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !194, file: !153, line: 81, baseType: !171, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !194, file: !153, line: 82, baseType: !173, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !194, file: !153, line: 83, baseType: !83, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !194, file: !153, line: 84, baseType: !200, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !81, line: 144, baseType: !82)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !194, file: !153, line: 85, baseType: !200, size: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !161, file: !153, line: 105, baseType: !203, size: 256)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !153, line: 89, size: 256, elements: !204)
!204 = !{!205, !206, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !203, file: !153, line: 91, baseType: !61, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !203, file: !153, line: 93, baseType: !207, size: 16, offset: 64)
!207 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !203, file: !153, line: 104, baseType: !209, size: 128, offset: 128)
!209 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !203, file: !153, line: 94, size: 128, elements: !210)
!210 = !{!211, !216}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !209, file: !153, line: 101, baseType: !212, size: 128)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !209, file: !153, line: 97, size: 128, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !212, file: !153, line: 99, baseType: !61, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !212, file: !153, line: 100, baseType: !61, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !209, file: !153, line: 103, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !81, line: 41, baseType: !174)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !161, file: !153, line: 112, baseType: !219, size: 128)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !153, line: 108, size: 128, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !219, file: !153, line: 110, baseType: !82, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !219, file: !153, line: 111, baseType: !83, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !161, file: !153, line: 121, baseType: !224, size: 128)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !153, line: 116, size: 128, elements: !225)
!225 = !{!226, !227, !228}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !224, file: !153, line: 118, baseType: !61, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !224, file: !153, line: 119, baseType: !83, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !224, file: !153, line: 120, baseType: !174, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !140, file: !141, line: 43, baseType: !230, size: 1024, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !231, line: 8, baseType: !232)
!231 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !231, line: 5, size: 1024, elements: !233)
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !232, file: !231, line: 7, baseType: !235, size: 1024)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 1024, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !140, file: !141, line: 46, baseType: !83, size: 32, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !140, file: !141, line: 49, baseType: !240, size: 64, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null}
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 104, elements: !245)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!245 = !{!246}
!246 = !DISubrange(count: 13)
!247 = !DIGlobalVariableExpression(var: !248)
!248 = distinct !DIGlobalVariable(name: "filter_command", scope: !2, file: !3, line: 53, type: !249, isLocal: true, isDefinition: true)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!250 = !DIGlobalVariableExpression(var: !251)
!251 = distinct !DIGlobalVariable(name: "filter_pid", scope: !2, file: !3, line: 56, type: !83, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253)
!253 = distinct !DIGlobalVariable(name: "oldblocked", scope: !2, file: !3, line: 64, type: !254, isLocal: true, isDefinition: true)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !255, line: 7, baseType: !230)
!255 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!256 = !DIGlobalVariableExpression(var: !257)
!257 = distinct !DIGlobalVariable(name: "newblocked", scope: !2, file: !3, line: 65, type: !254, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259)
!259 = distinct !DIGlobalVariable(name: "outbase", scope: !2, file: !3, line: 68, type: !249, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261)
!261 = distinct !DIGlobalVariable(name: "outfile", scope: !2, file: !3, line: 71, type: !89, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263)
!263 = distinct !DIGlobalVariable(name: "suffix_length", scope: !2, file: !3, line: 81, type: !63, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265)
!265 = distinct !DIGlobalVariable(name: "numeric_suffix_start", scope: !2, file: !3, line: 87, type: !249, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267)
!267 = distinct !DIGlobalVariable(name: "additional_suffix", scope: !2, file: !3, line: 90, type: !249, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269)
!269 = distinct !DIGlobalVariable(name: "in_stat_buf", scope: !2, file: !3, line: 96, type: !270, isLocal: true, isDefinition: true)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !271, line: 46, size: 1152, elements: !272)
!271 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!272 = !{!273, !275, !277, !279, !281, !282, !284, !285, !286, !287, !289, !291, !299, !300, !301}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !270, file: !271, line: 48, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !81, line: 133, baseType: !65)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !270, file: !271, line: 53, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !81, line: 136, baseType: !65)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !270, file: !271, line: 61, baseType: !278, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !81, line: 139, baseType: !65)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !270, file: !271, line: 62, baseType: !280, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !81, line: 138, baseType: !174)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !270, file: !271, line: 64, baseType: !173, size: 32, offset: 224)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !270, file: !271, line: 65, baseType: !283, size: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !81, line: 135, baseType: !174)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !270, file: !271, line: 67, baseType: !83, size: 32, offset: 288)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !270, file: !271, line: 69, baseType: !274, size: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !270, file: !271, line: 74, baseType: !80, size: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !270, file: !271, line: 78, baseType: !288, size: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !81, line: 162, baseType: !82)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !270, file: !271, line: 80, baseType: !290, size: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !81, line: 167, baseType: !82)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !270, file: !271, line: 91, baseType: !292, size: 128, offset: 576)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !293, line: 8, size: 128, elements: !294)
!293 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!294 = !{!295, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !292, file: !293, line: 10, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !81, line: 148, baseType: !82)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !292, file: !293, line: 11, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !81, line: 184, baseType: !82)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !270, file: !271, line: 92, baseType: !292, size: 128, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !270, file: !271, line: 93, baseType: !292, size: 128, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !270, file: !271, line: 106, baseType: !302, size: 192, offset: 960)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 192, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 3)
!305 = !DIGlobalVariableExpression(var: !306)
!306 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 103, type: !128, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308)
!308 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !2, file: !3, line: 106, type: !128, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310)
!310 = distinct !DIGlobalVariable(name: "unbuffered", scope: !2, file: !3, line: 110, type: !128, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312)
!312 = distinct !DIGlobalVariable(name: "infomap", scope: !313, file: !314, line: 632, type: !328, isLocal: true, isDefinition: true)
!313 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !314, file: !314, line: 630, type: !315, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !317)
!314 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!315 = !DISubroutineType(types: !316)
!316 = !{null, !249}
!317 = !{!318, !319, !320, !327}
!318 = !DILocalVariable(name: "program", arg: 1, scope: !313, file: !314, line: 630, type: !249)
!319 = !DILocalVariable(name: "node", scope: !313, file: !314, line: 642, type: !249)
!320 = !DILocalVariable(name: "map_prog", scope: !313, file: !314, line: 643, type: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !313, file: !314, line: 632, size: 128, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !323, file: !314, line: 632, baseType: !249, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !323, file: !314, line: 632, baseType: !249, size: 64, offset: 64)
!327 = !DILocalVariable(name: "lc_messages", scope: !313, file: !314, line: 655, type: !249)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 896, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 7)
!331 = !DIGlobalVariableExpression(var: !332)
!332 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 132, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 4096, elements: !236)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !336, line: 50, size: 256, elements: !337)
!336 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!337 = !{!338, !339, !340, !342}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !335, file: !336, line: 52, baseType: !249, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !335, file: !336, line: 55, baseType: !83, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !335, file: !336, line: 56, baseType: !341, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !335, file: !336, line: 57, baseType: !83, size: 32, offset: 192)
!343 = !DIGlobalVariableExpression(var: !344)
!344 = distinct !DIGlobalVariable(name: "eolchar", scope: !2, file: !3, line: 113, type: !83, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346)
!346 = distinct !DIGlobalVariable(name: "suffix_alphabet", scope: !2, file: !3, line: 84, type: !249, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348)
!348 = distinct !DIGlobalVariable(name: "suffix_auto", scope: !2, file: !3, line: 78, type: !128, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350)
!350 = distinct !DIGlobalVariable(name: "sufindex", scope: !351, file: !3, line: 350, type: !62, isLocal: true, isDefinition: true)
!351 = distinct !DISubprogram(name: "next_file_name", scope: !3, file: !3, line: 347, type: !241, isLocal: true, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !352)
!352 = !{!353, !356, !359, !360}
!353 = !DILocalVariable(name: "widen", scope: !354, file: !3, line: 357, type: !128)
!354 = distinct !DILexicalBlock(scope: !355, file: !3, line: 356, column: 5)
!355 = distinct !DILexicalBlock(scope: !351, file: !3, line: 355, column: 7)
!356 = !DILocalVariable(name: "i", scope: !357, file: !3, line: 408, type: !63)
!357 = distinct !DILexicalBlock(scope: !358, file: !3, line: 404, column: 9)
!358 = distinct !DILexicalBlock(scope: !354, file: !3, line: 403, column: 11)
!359 = !DILocalVariable(name: "sufindex_end", scope: !357, file: !3, line: 412, type: !62)
!360 = !DILocalVariable(name: "i", scope: !361, file: !3, line: 435, type: !63)
!361 = distinct !DILexicalBlock(scope: !355, file: !3, line: 432, column: 5)
!362 = !DIGlobalVariableExpression(var: !363)
!363 = distinct !DIGlobalVariable(name: "outbase_length", scope: !351, file: !3, line: 351, type: !63, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365)
!365 = distinct !DIGlobalVariable(name: "outfile_length", scope: !351, file: !3, line: 352, type: !63, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367)
!367 = distinct !DIGlobalVariable(name: "addsuf_length", scope: !351, file: !3, line: 353, type: !63, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369)
!369 = distinct !DIGlobalVariable(name: "outfile_mid", scope: !2, file: !3, line: 75, type: !89, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371)
!371 = distinct !DIGlobalVariable(name: "n_open_pipes", scope: !2, file: !3, line: 61, type: !63, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373)
!373 = distinct !DIGlobalVariable(name: "open_pipes", scope: !2, file: !3, line: 59, type: !341, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375)
!375 = distinct !DIGlobalVariable(name: "open_pipes_alloc", scope: !2, file: !3, line: 60, type: !63, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377)
!377 = distinct !DIGlobalVariable(name: "output_desc", scope: !2, file: !3, line: 99, type: !83, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379)
!379 = distinct !DIGlobalVariable(name: "Version", scope: !380, file: !381, line: 2, type: !249, isLocal: false, isDefinition: true)
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, globals: !383)
!381 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!382 = !{}
!383 = !{!378}
!384 = !DIGlobalVariableExpression(var: !385)
!385 = distinct !DIGlobalVariable(name: "file_name", scope: !386, file: !391, line: 36, type: !249, isLocal: true, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, globals: !388)
!387 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!388 = !{!384, !389}
!389 = !DIGlobalVariableExpression(var: !390)
!390 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !386, file: !391, line: 46, type: !128, isLocal: true, isDefinition: true)
!391 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!392 = !DIGlobalVariableExpression(var: !393)
!393 = distinct !DIGlobalVariable(name: "exit_failure", scope: !394, file: !397, line: 24, type: !398, isLocal: false, isDefinition: true)
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, globals: !396)
!395 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!396 = !{!392}
!397 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!398 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !83)
!399 = !DIGlobalVariableExpression(var: !400)
!400 = distinct !DIGlobalVariable(name: "program_name", scope: !401, file: !405, line: 33, type: !249, isLocal: false, isDefinition: true)
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !403, globals: !404)
!402 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!403 = !{!61, !89}
!404 = !{!399}
!405 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!406 = !DIGlobalVariableExpression(var: !407)
!407 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !408, file: !420, line: 77, type: !455, isLocal: false, isDefinition: true)
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !410, retainedTypes: !416, globals: !417)
!409 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!410 = !{!30, !411, !15}
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !31, line: 242, size: 32, elements: !412)
!412 = !{!413, !414, !415}
!413 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!414 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!415 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!416 = !{!83, !84, !63, !89}
!417 = !{!406, !418, !425, !437, !439, !444, !451, !453}
!418 = !DIGlobalVariableExpression(var: !419)
!419 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !408, file: !420, line: 93, type: !421, isLocal: false, isDefinition: true)
!420 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 320, elements: !423)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!423 = !{!424}
!424 = !DISubrange(count: 10)
!425 = !DIGlobalVariableExpression(var: !426)
!426 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !408, file: !420, line: 1043, type: !427, isLocal: false, isDefinition: true)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !420, line: 57, size: 448, elements: !428)
!428 = !{!429, !430, !431, !435, !436}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !427, file: !420, line: 60, baseType: !30, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !427, file: !420, line: 63, baseType: !83, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !427, file: !420, line: 67, baseType: !432, size: 256, offset: 64)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 256, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 8)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !427, file: !420, line: 70, baseType: !249, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !427, file: !420, line: 73, baseType: !249, size: 64, offset: 384)
!437 = !DIGlobalVariableExpression(var: !438)
!438 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !408, file: !420, line: 108, type: !427, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440)
!440 = distinct !DIGlobalVariable(name: "slot0", scope: !408, file: !420, line: 834, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 2048, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 256)
!444 = !DIGlobalVariableExpression(var: !445)
!445 = distinct !DIGlobalVariable(name: "slotvec", scope: !408, file: !420, line: 837, type: !446, isLocal: true, isDefinition: true)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !420, line: 826, size: 128, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !447, file: !420, line: 828, baseType: !63, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !447, file: !420, line: 829, baseType: !89, size: 64, offset: 64)
!451 = !DIGlobalVariableExpression(var: !452)
!452 = distinct !DIGlobalVariable(name: "nslots", scope: !408, file: !420, line: 835, type: !83, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454)
!454 = distinct !DIGlobalVariable(name: "slotvec0", scope: !408, file: !420, line: 836, type: !447, isLocal: true, isDefinition: true)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 704, elements: !457)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!457 = !{!458}
!458 = !DISubrange(count: 11)
!459 = !DIGlobalVariableExpression(var: !460)
!460 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !461, file: !464, line: 26, type: !465, isLocal: false, isDefinition: true)
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, globals: !463)
!462 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!463 = !{!459}
!464 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 376, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 47)
!468 = !DIGlobalVariableExpression(var: !469)
!469 = distinct !DIGlobalVariable(name: "numname_table", scope: !470, file: !474, line: 41, type: !475, isLocal: true, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !472, globals: !473)
!471 = !DIFile(filename: "./lib/sig2str.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!472 = !{!174}
!473 = !{!468}
!474 = !DIFile(filename: "lib/sig2str.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 3360, elements: !481)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !474, line: 41, size: 96, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !476, file: !474, line: 41, baseType: !83, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !476, file: !474, line: 41, baseType: !480, size: 64, offset: 32)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 64, elements: !433)
!481 = !{!482}
!482 = !DISubrange(count: 35)
!483 = !DIGlobalVariableExpression(var: !484)
!484 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !485, file: !830, line: 120, type: !831, isLocal: true, isDefinition: true)
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !487, retainedTypes: !826, globals: !829)
!486 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!487 = !{!488}
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !489, line: 41, size: 32, elements: !490)
!489 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825}
!491 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!492 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!493 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!494 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!495 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!496 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!497 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!498 = !DIEnumerator(name: "DAY_1", value: 131079)
!499 = !DIEnumerator(name: "DAY_2", value: 131080)
!500 = !DIEnumerator(name: "DAY_3", value: 131081)
!501 = !DIEnumerator(name: "DAY_4", value: 131082)
!502 = !DIEnumerator(name: "DAY_5", value: 131083)
!503 = !DIEnumerator(name: "DAY_6", value: 131084)
!504 = !DIEnumerator(name: "DAY_7", value: 131085)
!505 = !DIEnumerator(name: "ABMON_1", value: 131086)
!506 = !DIEnumerator(name: "ABMON_2", value: 131087)
!507 = !DIEnumerator(name: "ABMON_3", value: 131088)
!508 = !DIEnumerator(name: "ABMON_4", value: 131089)
!509 = !DIEnumerator(name: "ABMON_5", value: 131090)
!510 = !DIEnumerator(name: "ABMON_6", value: 131091)
!511 = !DIEnumerator(name: "ABMON_7", value: 131092)
!512 = !DIEnumerator(name: "ABMON_8", value: 131093)
!513 = !DIEnumerator(name: "ABMON_9", value: 131094)
!514 = !DIEnumerator(name: "ABMON_10", value: 131095)
!515 = !DIEnumerator(name: "ABMON_11", value: 131096)
!516 = !DIEnumerator(name: "ABMON_12", value: 131097)
!517 = !DIEnumerator(name: "MON_1", value: 131098)
!518 = !DIEnumerator(name: "MON_2", value: 131099)
!519 = !DIEnumerator(name: "MON_3", value: 131100)
!520 = !DIEnumerator(name: "MON_4", value: 131101)
!521 = !DIEnumerator(name: "MON_5", value: 131102)
!522 = !DIEnumerator(name: "MON_6", value: 131103)
!523 = !DIEnumerator(name: "MON_7", value: 131104)
!524 = !DIEnumerator(name: "MON_8", value: 131105)
!525 = !DIEnumerator(name: "MON_9", value: 131106)
!526 = !DIEnumerator(name: "MON_10", value: 131107)
!527 = !DIEnumerator(name: "MON_11", value: 131108)
!528 = !DIEnumerator(name: "MON_12", value: 131109)
!529 = !DIEnumerator(name: "AM_STR", value: 131110)
!530 = !DIEnumerator(name: "PM_STR", value: 131111)
!531 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!532 = !DIEnumerator(name: "D_FMT", value: 131113)
!533 = !DIEnumerator(name: "T_FMT", value: 131114)
!534 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!535 = !DIEnumerator(name: "ERA", value: 131116)
!536 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!537 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!538 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!539 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!540 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!541 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!542 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!543 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!544 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!545 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!546 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!547 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!548 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!549 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!550 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!551 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!552 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!553 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!554 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!555 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!556 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!557 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!558 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!559 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!560 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!561 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!562 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!563 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!564 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!565 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!566 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!567 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!568 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!569 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!570 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!571 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!572 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!573 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!574 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!575 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!576 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!577 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!578 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!579 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!580 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!581 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!582 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!583 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!584 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!585 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!586 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!587 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!588 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!589 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!590 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!591 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!592 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!593 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!594 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!595 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!596 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!597 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!598 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!599 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!600 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!601 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!602 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!603 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!604 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!605 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!606 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!607 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!608 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!609 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!610 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!611 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!612 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!613 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!614 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!615 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!616 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!617 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!618 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!619 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!620 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!621 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!622 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!623 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!624 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!625 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!626 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!627 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!628 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!629 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!630 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!631 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!632 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!633 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!634 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!635 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!636 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!637 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!638 = !DIEnumerator(name: "CODESET", value: 14)
!639 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!640 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!641 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!642 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!643 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!644 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!645 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!646 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!647 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!648 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!649 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!650 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!651 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!652 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!653 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!654 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!655 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!656 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!657 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!658 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!659 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!660 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!661 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!662 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!663 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!664 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!665 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!666 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!667 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!668 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!669 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!670 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!671 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!672 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!673 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!674 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!675 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!676 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!677 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!678 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!679 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!680 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!681 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!682 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!683 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!684 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!685 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!686 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!687 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!688 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!689 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!690 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!691 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!692 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!693 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!694 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!695 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!696 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!697 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!698 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!699 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!700 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!701 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!702 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!703 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!704 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!705 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!706 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!707 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!708 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!709 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!710 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!711 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!712 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!713 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!714 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!715 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!716 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!717 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!718 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!719 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!720 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!721 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!722 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!723 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!724 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!725 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!726 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!727 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!728 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!729 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!730 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!731 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!732 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!733 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!734 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!735 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!736 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!737 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!738 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!739 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!740 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!741 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!742 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!743 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!744 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!745 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!746 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!747 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!748 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!749 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!750 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!751 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!752 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!753 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!754 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!755 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!756 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!757 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!758 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!759 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!760 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!761 = !DIEnumerator(name: "THOUSEP", value: 65537)
!762 = !DIEnumerator(name: "__GROUPING", value: 65538)
!763 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!764 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!765 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!766 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!767 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!768 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!769 = !DIEnumerator(name: "__YESSTR", value: 327682)
!770 = !DIEnumerator(name: "__NOSTR", value: 327683)
!771 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!772 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!773 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!774 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!775 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!776 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!777 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!778 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!779 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!780 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!781 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!782 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!783 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!784 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!785 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!786 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!787 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!788 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!789 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!790 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!791 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!792 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!793 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!794 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!795 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!796 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!797 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!798 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!799 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!800 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!801 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!802 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!803 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!804 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!805 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!806 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!807 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!808 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!809 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!810 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!811 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!812 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!813 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!814 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!815 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!816 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!817 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!818 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!819 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!820 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!821 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!822 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!823 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!824 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!825 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!826 = !{!61, !89, !827}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!829 = !{!483}
!830 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!831 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !249)
!832 = !DIGlobalVariableExpression(var: !833)
!833 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !834, file: !835, line: 335, type: !83, isLocal: true, isDefinition: true)
!834 = distinct !DISubprogram(name: "rpl_fcntl", scope: !835, file: !835, line: 272, type: !836, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !838, variables: !841)
!835 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!836 = !DISubroutineType(types: !837)
!837 = !{!83, !83, !83, null}
!838 = distinct !DICompileUnit(language: DW_LANG_C99, file: !839, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, globals: !840)
!839 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!840 = !{!832}
!841 = !{!842, !843, !844, !857, !858, !861, !864, !867}
!842 = !DILocalVariable(name: "fd", arg: 1, scope: !834, file: !835, line: 272, type: !83)
!843 = !DILocalVariable(name: "action", arg: 2, scope: !834, file: !835, line: 272, type: !83)
!844 = !DILocalVariable(name: "arg", scope: !834, file: !835, line: 274, type: !845)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !846, line: 30, baseType: !847)
!846 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !839, line: 274, baseType: !848)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !849, size: 192, elements: !855)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !839, line: 274, size: 192, elements: !850)
!850 = !{!851, !852, !853, !854}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !849, file: !839, line: 274, baseType: !174, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !849, file: !839, line: 274, baseType: !174, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !849, file: !839, line: 274, baseType: !61, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !849, file: !839, line: 274, baseType: !61, size: 64, offset: 128)
!855 = !{!856}
!856 = !DISubrange(count: 1)
!857 = !DILocalVariable(name: "result", scope: !834, file: !835, line: 275, type: !83)
!858 = !DILocalVariable(name: "target", scope: !859, file: !835, line: 322, type: !83)
!859 = distinct !DILexicalBlock(scope: !860, file: !835, line: 321, column: 7)
!860 = distinct !DILexicalBlock(scope: !834, file: !835, line: 278, column: 5)
!861 = !DILocalVariable(name: "flags", scope: !862, file: !835, line: 359, type: !83)
!862 = distinct !DILexicalBlock(scope: !863, file: !835, line: 358, column: 11)
!863 = distinct !DILexicalBlock(scope: !859, file: !835, line: 357, column: 13)
!864 = !DILocalVariable(name: "saved_errno", scope: !865, file: !835, line: 362, type: !83)
!865 = distinct !DILexicalBlock(scope: !866, file: !835, line: 361, column: 15)
!866 = distinct !DILexicalBlock(scope: !862, file: !835, line: 360, column: 17)
!867 = !DILocalVariable(name: "p", scope: !868, file: !835, line: 404, type: !61)
!868 = distinct !DILexicalBlock(scope: !860, file: !835, line: 402, column: 7)
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !871)
!870 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!871 = !{!89}
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382)
!873 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382)
!875 = !DIFile(filename: "./lib/fd-reopen.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !878)
!877 = !DIFile(filename: "./lib/full-write.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!878 = !{!249, !63}
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !881)
!880 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!881 = !{!86}
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !884)
!883 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!884 = !{!885}
!885 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !887, file: !886, line: 62, size: 32, elements: !901)
!886 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!887 = distinct !DISubprogram(name: "safe_read", scope: !886, file: !886, line: 56, type: !888, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !882, variables: !890)
!888 = !DISubroutineType(types: !889)
!889 = !{!63, !83, !61, !63}
!890 = !{!891, !892, !893, !894}
!891 = !DILocalVariable(name: "fd", arg: 1, scope: !887, file: !886, line: 56, type: !83)
!892 = !DILocalVariable(name: "buf", arg: 2, scope: !887, file: !886, line: 56, type: !61)
!893 = !DILocalVariable(name: "count", arg: 3, scope: !887, file: !886, line: 56, type: !63)
!894 = !DILocalVariable(name: "result", scope: !895, file: !886, line: 66, type: !898)
!895 = distinct !DILexicalBlock(scope: !896, file: !886, line: 65, column: 5)
!896 = distinct !DILexicalBlock(scope: !897, file: !886, line: 64, column: 3)
!897 = distinct !DILexicalBlock(scope: !887, file: !886, line: 64, column: 3)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !899, line: 109, baseType: !900)
!899 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !81, line: 181, baseType: !82)
!901 = !{!902}
!902 = !DIEnumerator(name: "BUGGY_READ_MAXIMUM", value: 2147475456)
!903 = distinct !DICompileUnit(language: DW_LANG_C99, file: !904, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !905)
!904 = !DIFile(filename: "./lib/safe-write.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!905 = !{!906}
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !907, file: !883, line: 62, size: 32, elements: !901)
!907 = distinct !DISubprogram(name: "safe_write", scope: !883, file: !883, line: 56, type: !908, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !903, variables: !912)
!908 = !DISubroutineType(types: !909)
!909 = !{!63, !83, !910, !63}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!912 = !{!913, !914, !915, !916}
!913 = !DILocalVariable(name: "fd", arg: 1, scope: !907, file: !883, line: 56, type: !83)
!914 = !DILocalVariable(name: "buf", arg: 2, scope: !907, file: !883, line: 56, type: !910)
!915 = !DILocalVariable(name: "count", arg: 3, scope: !907, file: !883, line: 56, type: !63)
!916 = !DILocalVariable(name: "result", scope: !917, file: !883, line: 66, type: !898)
!917 = distinct !DILexicalBlock(scope: !918, file: !883, line: 65, column: 5)
!918 = distinct !DILexicalBlock(scope: !919, file: !883, line: 64, column: 3)
!919 = distinct !DILexicalBlock(scope: !907, file: !883, line: 64, column: 3)
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382)
!921 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!922 = distinct !DICompileUnit(language: DW_LANG_C99, file: !923, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !924, retainedTypes: !929)
!923 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!924 = !{!925}
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !926, line: 41, size: 32, elements: !927)
!926 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!927 = !{!928}
!928 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!929 = !{!61}
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !932, retainedTypes: !940)
!931 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!932 = !{!933}
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !934, file: !57, line: 192, size: 32, elements: !71)
!934 = distinct !DISubprogram(name: "x2nrealloc", scope: !57, file: !57, line: 180, type: !59, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !930, variables: !935)
!935 = !{!936, !937, !938, !939}
!936 = !DILocalVariable(name: "p", arg: 1, scope: !934, file: !57, line: 180, type: !61)
!937 = !DILocalVariable(name: "pn", arg: 2, scope: !934, file: !57, line: 180, type: !62)
!938 = !DILocalVariable(name: "s", arg: 3, scope: !934, file: !57, line: 180, type: !63)
!939 = !DILocalVariable(name: "n", scope: !934, file: !57, line: 182, type: !63)
!940 = !{!63, !89, !61}
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382)
!942 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !945)
!944 = !DIFile(filename: "./lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!945 = !{!44}
!946 = distinct !DICompileUnit(language: DW_LANG_C99, file: !947, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !948, retainedTypes: !949)
!947 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!948 = !{!44, !15}
!949 = !{!83, !84}
!950 = distinct !DICompileUnit(language: DW_LANG_C99, file: !951, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !929)
!951 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!952 = distinct !DICompileUnit(language: DW_LANG_C99, file: !953, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382)
!953 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!954 = distinct !DICompileUnit(language: DW_LANG_C99, file: !955, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !929)
!955 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!956 = distinct !DICompileUnit(language: DW_LANG_C99, file: !957, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !929)
!957 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!958 = distinct !DICompileUnit(language: DW_LANG_C99, file: !959, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !960)
!959 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!960 = !{!63}
!961 = distinct !DICompileUnit(language: DW_LANG_C99, file: !962, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382)
!962 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!963 = distinct !DICompileUnit(language: DW_LANG_C99, file: !964, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382)
!964 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!965 = distinct !DICompileUnit(language: DW_LANG_C99, file: !966, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382)
!966 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!967 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!968 = !{i32 2, !"Dwarf Version", i32 4}
!969 = !{i32 2, !"Debug Info Version", i32 3}
!970 = !{i32 1, !"wchar_size", i32 4}
!971 = !{i32 7, !"PIC Level", i32 2}
!972 = !{i32 7, !"PIE Level", i32 2}
!973 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 219, type: !94, isLocal: false, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !974)
!974 = !{!975}
!975 = !DILocalVariable(name: "status", arg: 1, scope: !973, file: !3, line: 219, type: !83)
!976 = !DIExpression()
!977 = !DILocation(line: 219, column: 12, scope: !973)
!978 = !DILocation(line: 221, column: 14, scope: !979)
!979 = distinct !DILexicalBlock(scope: !973, file: !3, line: 221, column: 7)
!980 = !DILocation(line: 221, column: 7, scope: !973)
!981 = !DILocation(line: 222, column: 5, scope: !982)
!982 = distinct !DILexicalBlock(scope: !979, file: !3, line: 222, column: 5)
!983 = !{!984, !984, i64 0}
!984 = !{!"any pointer", !985, i64 0}
!985 = !{!"omnipotent char", !986, i64 0}
!986 = !{!"Simple C/C++ TBAA"}
!987 = !DILocation(line: 225, column: 7, scope: !988)
!988 = distinct !DILexicalBlock(scope: !979, file: !3, line: 224, column: 5)
!989 = !DILocation(line: 229, column: 7, scope: !988)
!990 = !DILocation(line: 580, column: 3, scope: !991, inlinedAt: !992)
!991 = distinct !DISubprogram(name: "emit_stdin_note", scope: !314, file: !314, line: 578, type: !241, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !382)
!992 = distinct !DILocation(line: 234, column: 7, scope: !988)
!993 = !DILocation(line: 587, column: 3, scope: !994, inlinedAt: !995)
!994 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !314, file: !314, line: 585, type: !241, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !382)
!995 = distinct !DILocation(line: 235, column: 7, scope: !988)
!996 = !DILocation(line: 237, column: 7, scope: !988)
!997 = !DILocation(line: 253, column: 7, scope: !988)
!998 = !DILocation(line: 257, column: 7, scope: !988)
!999 = !DILocation(line: 258, column: 7, scope: !988)
!1000 = !DILocation(line: 595, column: 3, scope: !1001, inlinedAt: !1002)
!1001 = distinct !DISubprogram(name: "emit_size_note", scope: !314, file: !314, line: 593, type: !241, isLocal: true, isDefinition: true, scopeLine: 594, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !382)
!1002 = distinct !DILocation(line: 259, column: 7, scope: !988)
!1003 = !DILocation(line: 260, column: 7, scope: !988)
!1004 = !DILocation(line: 642, column: 15, scope: !313, inlinedAt: !1005)
!1005 = distinct !DILocation(line: 269, column: 7, scope: !988)
!1006 = !DILocation(line: 651, column: 3, scope: !313, inlinedAt: !1005)
!1007 = !DILocation(line: 655, column: 29, scope: !313, inlinedAt: !1005)
!1008 = !DILocation(line: 655, column: 15, scope: !313, inlinedAt: !1005)
!1009 = !DILocation(line: 656, column: 7, scope: !1010, inlinedAt: !1005)
!1010 = distinct !DILexicalBlock(scope: !313, file: !314, line: 656, column: 7)
!1011 = !DILocation(line: 656, column: 19, scope: !1010, inlinedAt: !1005)
!1012 = !DILocation(line: 656, column: 22, scope: !1010, inlinedAt: !1005)
!1013 = !DILocation(line: 656, column: 7, scope: !313, inlinedAt: !1005)
!1014 = !DILocation(line: 662, column: 7, scope: !1015, inlinedAt: !1005)
!1015 = distinct !DILexicalBlock(scope: !1010, file: !314, line: 657, column: 5)
!1016 = !DILocation(line: 664, column: 5, scope: !1015, inlinedAt: !1005)
!1017 = !DILocation(line: 665, column: 3, scope: !313, inlinedAt: !1005)
!1018 = !DILocation(line: 667, column: 3, scope: !313, inlinedAt: !1005)
!1019 = !DILocation(line: 271, column: 3, scope: !973)
!1020 = !DILocation(line: 1285, column: 11, scope: !100)
!1021 = !DILocation(line: 1285, column: 24, scope: !100)
!1022 = !DILocation(line: 1287, column: 19, scope: !100)
!1023 = !DILocation(line: 1288, column: 10, scope: !100)
!1024 = !DILocation(line: 1289, column: 22, scope: !100)
!1025 = !DILocation(line: 1289, column: 10, scope: !100)
!1026 = !DILocation(line: 1290, column: 13, scope: !100)
!1027 = !DILocation(line: 1291, column: 13, scope: !100)
!1028 = !DILocation(line: 1295, column: 7, scope: !100)
!1029 = !DILocation(line: 1296, column: 9, scope: !100)
!1030 = !DILocation(line: 1299, column: 21, scope: !100)
!1031 = !DILocation(line: 1299, column: 3, scope: !100)
!1032 = !DILocation(line: 1300, column: 3, scope: !100)
!1033 = !DILocation(line: 1301, column: 3, scope: !100)
!1034 = !DILocation(line: 1302, column: 3, scope: !100)
!1035 = !DILocation(line: 1304, column: 3, scope: !100)
!1036 = !DILocation(line: 1308, column: 10, scope: !100)
!1037 = !DILocation(line: 1309, column: 11, scope: !100)
!1038 = !DILocation(line: 1311, column: 3, scope: !100)
!1039 = !DILocation(line: 1314, column: 25, scope: !116)
!1040 = !{!1041, !1041, i64 0}
!1041 = !{!"int", !985, i64 0}
!1042 = !DILocation(line: 1314, column: 11, scope: !116)
!1043 = !DILocation(line: 1317, column: 11, scope: !116)
!1044 = !DILocation(line: 1294, column: 7, scope: !100)
!1045 = !DILocation(line: 1319, column: 11, scope: !116)
!1046 = !DILocation(line: 1325, column: 39, scope: !120)
!1047 = !DILocation(line: 1326, column: 43, scope: !120)
!1048 = !DILocation(line: 1325, column: 27, scope: !120)
!1049 = !DILocation(line: 1325, column: 25, scope: !120)
!1050 = !{!1051, !1051, i64 0}
!1051 = !{!"long", !985, i64 0}
!1052 = !DILocation(line: 1327, column: 11, scope: !120)
!1053 = !DILocation(line: 1330, column: 31, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1330, column: 15)
!1055 = !DILocation(line: 1330, column: 15, scope: !1054)
!1056 = !DILocation(line: 1330, column: 39, scope: !1054)
!1057 = !DILocation(line: 1330, column: 15, scope: !120)
!1058 = !DILocation(line: 1333, column: 22, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1331, column: 13)
!1060 = !DILocation(line: 1334, column: 29, scope: !1059)
!1061 = !DILocation(line: 1334, column: 22, scope: !1059)
!1062 = !DILocation(line: 1332, column: 15, scope: !1059)
!1063 = !DILocation(line: 1335, column: 15, scope: !1059)
!1064 = !DILocation(line: 1337, column: 29, scope: !120)
!1065 = !DILocation(line: 1338, column: 11, scope: !120)
!1066 = !DILocation(line: 1341, column: 26, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1341, column: 15)
!1068 = !DILocation(line: 1341, column: 15, scope: !120)
!1069 = !DILocation(line: 1342, column: 13, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 1342, column: 13)
!1071 = !DILocation(line: 1347, column: 33, scope: !120)
!1072 = !DILocation(line: 1348, column: 33, scope: !120)
!1073 = !DILocation(line: 1347, column: 21, scope: !120)
!1074 = !DILocation(line: 1349, column: 11, scope: !120)
!1075 = !DILocation(line: 1352, column: 26, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1352, column: 15)
!1077 = !DILocation(line: 1352, column: 15, scope: !120)
!1078 = !DILocation(line: 1353, column: 13, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1076, file: !3, line: 1353, column: 13)
!1080 = !DILocation(line: 1355, column: 33, scope: !120)
!1081 = !DILocation(line: 1356, column: 33, scope: !120)
!1082 = !DILocation(line: 1355, column: 21, scope: !120)
!1083 = !DILocation(line: 1357, column: 11, scope: !120)
!1084 = !DILocation(line: 1360, column: 26, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1360, column: 15)
!1086 = !DILocation(line: 1360, column: 15, scope: !120)
!1087 = !DILocation(line: 1361, column: 13, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 1361, column: 13)
!1089 = !DILocation(line: 1363, column: 33, scope: !120)
!1090 = !DILocation(line: 1364, column: 46, scope: !120)
!1091 = !DILocation(line: 1363, column: 21, scope: !120)
!1092 = !DILocation(line: 1365, column: 11, scope: !120)
!1093 = !DILocation(line: 1368, column: 26, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1368, column: 15)
!1095 = !DILocation(line: 1368, column: 15, scope: !120)
!1096 = !DILocation(line: 1369, column: 13, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1094, file: !3, line: 1369, column: 13)
!1098 = !DILocation(line: 1371, column: 18, scope: !120)
!1099 = !{!985, !985, i64 0}
!1100 = !{!1101, !1101, i64 0}
!1101 = !{!"short", !985, i64 0}
!1102 = !DILocation(line: 1371, column: 11, scope: !120)
!1103 = !DILocation(line: 1372, column: 19, scope: !120)
!1104 = distinct !{!1104, !1102, !1103}
!1105 = !DILocation(line: 1373, column: 15, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1373, column: 15)
!1107 = !DILocation(line: 1373, column: 42, scope: !1106)
!1108 = !DILocation(line: 1373, column: 15, scope: !120)
!1109 = !DILocation(line: 1378, column: 20, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 1378, column: 20)
!1111 = !DILocation(line: 1378, column: 47, scope: !1110)
!1112 = !DILocation(line: 1378, column: 20, scope: !1106)
!1113 = !DILocation(line: 1385, column: 32, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1385, column: 15)
!1115 = !DILocation(line: 1385, column: 24, scope: !1114)
!1116 = !DILocation(line: 1315, column: 13, scope: !116)
!1117 = !DILocation(line: 1385, column: 22, scope: !1114)
!1118 = !DILocation(line: 1385, column: 15, scope: !120)
!1119 = !DILocalVariable(name: "slash", arg: 3, scope: !1120, file: !3, line: 1271, type: !89)
!1120 = distinct !DISubprogram(name: "parse_chunk", scope: !3, file: !3, line: 1271, type: !1121, isLocal: true, isDefinition: true, scopeLine: 1272, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1123)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{null, !85, !85, !89}
!1123 = !{!1124, !1125, !1119}
!1124 = !DILocalVariable(name: "k_units", arg: 1, scope: !1120, file: !3, line: 1271, type: !85)
!1125 = !DILocalVariable(name: "n_units", arg: 2, scope: !1120, file: !3, line: 1271, type: !85)
!1126 = !DILocation(line: 1271, column: 60, scope: !1120, inlinedAt: !1127)
!1127 = distinct !DILocation(line: 1386, column: 13, scope: !1114)
!1128 = !DILocation(line: 1273, column: 32, scope: !1120, inlinedAt: !1127)
!1129 = !DILocation(line: 1274, column: 26, scope: !1120, inlinedAt: !1127)
!1130 = !DILocation(line: 1273, column: 14, scope: !1120, inlinedAt: !1127)
!1131 = !DILocation(line: 1275, column: 16, scope: !1132, inlinedAt: !1127)
!1132 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 1275, column: 7)
!1133 = !DILocation(line: 1275, column: 13, scope: !1132, inlinedAt: !1127)
!1134 = !DILocation(line: 1275, column: 7, scope: !1120, inlinedAt: !1127)
!1135 = !DILocation(line: 1277, column: 14, scope: !1136, inlinedAt: !1127)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 1276, column: 5)
!1137 = !DILocation(line: 1278, column: 30, scope: !1136, inlinedAt: !1127)
!1138 = !DILocation(line: 1279, column: 30, scope: !1136, inlinedAt: !1127)
!1139 = !DILocation(line: 1278, column: 18, scope: !1136, inlinedAt: !1127)
!1140 = !DILocation(line: 1280, column: 5, scope: !1136, inlinedAt: !1127)
!1141 = !DILocation(line: 1389, column: 35, scope: !1114)
!1142 = !DILocation(line: 1388, column: 23, scope: !1114)
!1143 = !DILocation(line: 1394, column: 11, scope: !120)
!1144 = !DILocation(line: 1398, column: 27, scope: !119)
!1145 = !DILocation(line: 1398, column: 18, scope: !119)
!1146 = !DILocation(line: 1399, column: 19, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !119, file: !3, line: 1399, column: 17)
!1148 = !DILocation(line: 1399, column: 17, scope: !119)
!1149 = !DILocation(line: 1400, column: 15, scope: !1147)
!1150 = !DILocation(line: 1401, column: 17, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !119, file: !3, line: 1401, column: 17)
!1152 = !DILocation(line: 1401, column: 17, scope: !119)
!1153 = !DILocation(line: 1403, column: 21, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !3, line: 1403, column: 21)
!1155 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 1402, column: 15)
!1156 = !DILocation(line: 1403, column: 21, scope: !1155)
!1157 = !DILocation(line: 1411, column: 21, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1154, file: !3, line: 1406, column: 19)
!1159 = !DILocation(line: 1416, column: 22, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !119, file: !3, line: 1416, column: 17)
!1161 = !DILocation(line: 1416, column: 19, scope: !1160)
!1162 = !DILocation(line: 1416, column: 33, scope: !1160)
!1163 = !DILocation(line: 1416, column: 40, scope: !1160)
!1164 = !DILocation(line: 1416, column: 30, scope: !1160)
!1165 = !DILocation(line: 1418, column: 17, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1160, file: !3, line: 1417, column: 15)
!1167 = !DILocation(line: 1422, column: 21, scope: !119)
!1168 = !DILocation(line: 1424, column: 11, scope: !120)
!1169 = !DILocation(line: 1436, column: 26, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1436, column: 15)
!1171 = !DILocation(line: 1436, column: 15, scope: !120)
!1172 = !DILocation(line: 1441, column: 40, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1441, column: 15)
!1174 = !DILocation(line: 1442, column: 13, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1173, file: !3, line: 1442, column: 13)
!1176 = !DILocation(line: 1443, column: 29, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1443, column: 15)
!1178 = !DILocation(line: 1443, column: 51, scope: !1177)
!1179 = !DILocation(line: 1443, column: 34, scope: !1177)
!1180 = !DILocation(line: 1446, column: 16, scope: !123)
!1181 = !DILocation(line: 1448, column: 15, scope: !122)
!1182 = !DILocation(line: 1448, column: 20, scope: !122)
!1183 = !DILocation(line: 1449, column: 15, scope: !122)
!1184 = !DILocation(line: 1456, column: 27, scope: !120)
!1185 = !DILocation(line: 1457, column: 15, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1457, column: 15)
!1187 = !DILocation(line: 1457, column: 15, scope: !120)
!1188 = distinct !{!1188, !1038, !1189}
!1189 = !DILocation(line: 1500, column: 5, scope: !100)
!1190 = !DILocation(line: 1459, column: 19, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1192, file: !3, line: 1459, column: 19)
!1192 = distinct !DILexicalBlock(scope: !1186, file: !3, line: 1458, column: 13)
!1193 = !DILocation(line: 1459, column: 38, scope: !1191)
!1194 = !DILocation(line: 1459, column: 35, scope: !1191)
!1195 = !DILocation(line: 1459, column: 19, scope: !1192)
!1196 = !DILocation(line: 1462, column: 26, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1191, file: !3, line: 1460, column: 17)
!1198 = !DILocation(line: 1463, column: 33, scope: !1197)
!1199 = !DILocation(line: 1463, column: 26, scope: !1197)
!1200 = !DILocation(line: 1461, column: 19, scope: !1197)
!1201 = !DILocation(line: 1464, column: 19, scope: !1197)
!1202 = !DILocation(line: 1469, column: 26, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1191, file: !3, line: 1467, column: 17)
!1204 = !DILocation(line: 1469, column: 34, scope: !1203)
!1205 = !DILocation(line: 1469, column: 41, scope: !1203)
!1206 = !DILocation(line: 1469, column: 53, scope: !1203)
!1207 = !DILocation(line: 1469, column: 44, scope: !1203)
!1208 = !DILocation(line: 1469, column: 58, scope: !1203)
!1209 = !DILocation(line: 1469, column: 19, scope: !1203)
!1210 = !DILocation(line: 1470, column: 27, scope: !1203)
!1211 = distinct !{!1211, !1209, !1210}
!1212 = !DILocation(line: 1471, column: 40, scope: !1203)
!1213 = !DILocation(line: 1473, column: 13, scope: !1192)
!1214 = !DILocation(line: 1478, column: 11, scope: !120)
!1215 = !DILocation(line: 1481, column: 28, scope: !120)
!1216 = !DILocation(line: 1481, column: 26, scope: !120)
!1217 = !DILocation(line: 1482, column: 11, scope: !120)
!1218 = !DILocation(line: 1485, column: 37, scope: !120)
!1219 = !DILocation(line: 1486, column: 50, scope: !120)
!1220 = !DILocation(line: 1485, column: 25, scope: !120)
!1221 = !DILocation(line: 1487, column: 11, scope: !120)
!1222 = !DILocation(line: 1491, column: 11, scope: !120)
!1223 = !DILocation(line: 1493, column: 9, scope: !120)
!1224 = !DILocation(line: 1495, column: 9, scope: !120)
!1225 = !DILocation(line: 1498, column: 11, scope: !120)
!1226 = !DILocation(line: 1502, column: 15, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !100, file: !3, line: 1502, column: 7)
!1228 = !DILocation(line: 1502, column: 23, scope: !1227)
!1229 = !DILocation(line: 1502, column: 20, scope: !1227)
!1230 = !DILocation(line: 1504, column: 20, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1227, file: !3, line: 1503, column: 5)
!1232 = !DILocation(line: 1504, column: 7, scope: !1231)
!1233 = !DILocation(line: 1505, column: 7, scope: !1231)
!1234 = !DILocation(line: 1509, column: 18, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !100, file: !3, line: 1509, column: 7)
!1236 = !DILocation(line: 1509, column: 7, scope: !100)
!1237 = !DILocation(line: 1515, column: 15, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !100, file: !3, line: 1515, column: 7)
!1239 = !DILocation(line: 1515, column: 7, scope: !100)
!1240 = !DILocation(line: 1517, column: 30, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1238, file: !3, line: 1516, column: 5)
!1242 = !DILocation(line: 1517, column: 60, scope: !1241)
!1243 = !DILocation(line: 1517, column: 7, scope: !1241)
!1244 = !DILocation(line: 1518, column: 7, scope: !1241)
!1245 = !DILocation(line: 1521, column: 7, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !100, file: !3, line: 1521, column: 7)
!1247 = !DILocation(line: 1521, column: 15, scope: !1246)
!1248 = !DILocation(line: 1521, column: 7, scope: !100)
!1249 = !DILocation(line: 1522, column: 13, scope: !1246)
!1250 = !DILocation(line: 1522, column: 5, scope: !1246)
!1251 = !DILocalVariable(name: "n_units", arg: 1, scope: !1252, file: !3, line: 162, type: !86)
!1252 = distinct !DISubprogram(name: "set_suffix_length", scope: !3, file: !3, line: 162, type: !1253, isLocal: true, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1255)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{null, !86, !5}
!1255 = !{!1251, !1256, !1257, !1258, !1261, !1264, !1266, !1267}
!1256 = !DILocalVariable(name: "split_type", arg: 2, scope: !1252, file: !3, line: 162, type: !5)
!1257 = !DILocalVariable(name: "suffix_needed", scope: !1252, file: !3, line: 166, type: !86)
!1258 = !DILocalVariable(name: "n_units_end", scope: !1259, file: !3, line: 178, type: !86)
!1259 = distinct !DILexicalBlock(scope: !1260, file: !3, line: 177, column: 5)
!1260 = distinct !DILexicalBlock(scope: !1252, file: !3, line: 175, column: 7)
!1261 = !DILocalVariable(name: "n_start", scope: !1262, file: !3, line: 181, type: !86)
!1262 = distinct !DILexicalBlock(scope: !1263, file: !3, line: 180, column: 9)
!1263 = distinct !DILexicalBlock(scope: !1259, file: !3, line: 179, column: 11)
!1264 = !DILocalVariable(name: "e", scope: !1262, file: !3, line: 182, type: !1265)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "strtol_error", file: !45, line: 39, baseType: !44)
!1266 = !DILocalVariable(name: "alphabet_len", scope: !1259, file: !3, line: 195, type: !63)
!1267 = !DILocalVariable(name: "alphabet_slop", scope: !1259, file: !3, line: 196, type: !128)
!1268 = !DILocation(line: 162, column: 30, scope: !1252, inlinedAt: !1269)
!1269 = distinct !DILocation(line: 1524, column: 3, scope: !100)
!1270 = !DILocation(line: 162, column: 55, scope: !1252, inlinedAt: !1269)
!1271 = !DILocation(line: 166, column: 13, scope: !1252, inlinedAt: !1269)
!1272 = !DILocation(line: 171, column: 7, scope: !1273, inlinedAt: !1269)
!1273 = distinct !DILexicalBlock(scope: !1252, file: !3, line: 171, column: 7)
!1274 = !DILocation(line: 171, column: 7, scope: !1252, inlinedAt: !1269)
!1275 = !DILocation(line: 172, column: 5, scope: !1273, inlinedAt: !1269)
!1276 = !DILocation(line: 175, column: 38, scope: !1260, inlinedAt: !1269)
!1277 = !DILocation(line: 178, column: 17, scope: !1259, inlinedAt: !1269)
!1278 = !DILocation(line: 179, column: 11, scope: !1259, inlinedAt: !1269)
!1279 = !DILocation(line: 181, column: 11, scope: !1262, inlinedAt: !1269)
!1280 = !DILocation(line: 181, column: 21, scope: !1262, inlinedAt: !1269)
!1281 = !DILocation(line: 182, column: 28, scope: !1262, inlinedAt: !1269)
!1282 = !DILocation(line: 182, column: 24, scope: !1262, inlinedAt: !1269)
!1283 = !DILocation(line: 184, column: 17, scope: !1284, inlinedAt: !1269)
!1284 = distinct !DILexicalBlock(scope: !1262, file: !3, line: 184, column: 15)
!1285 = !DILocation(line: 184, column: 31, scope: !1284, inlinedAt: !1269)
!1286 = !DILocation(line: 184, column: 34, scope: !1284, inlinedAt: !1269)
!1287 = !DILocation(line: 184, column: 57, scope: !1284, inlinedAt: !1269)
!1288 = !DILocation(line: 184, column: 42, scope: !1284, inlinedAt: !1269)
!1289 = !DILocation(line: 190, column: 27, scope: !1290, inlinedAt: !1269)
!1290 = distinct !DILexicalBlock(scope: !1291, file: !3, line: 190, column: 19)
!1291 = distinct !DILexicalBlock(scope: !1284, file: !3, line: 185, column: 13)
!1292 = !DILocation(line: 184, column: 15, scope: !1262, inlinedAt: !1269)
!1293 = !DILocation(line: 194, column: 9, scope: !1263, inlinedAt: !1269)
!1294 = !DILocation(line: 194, column: 9, scope: !1262, inlinedAt: !1269)
!1295 = !DILocation(line: 195, column: 37, scope: !1259, inlinedAt: !1269)
!1296 = !DILocation(line: 195, column: 29, scope: !1259, inlinedAt: !1269)
!1297 = !DILocation(line: 195, column: 14, scope: !1259, inlinedAt: !1269)
!1298 = !DILocation(line: 196, column: 41, scope: !1259, inlinedAt: !1269)
!1299 = !DILocation(line: 196, column: 57, scope: !1259, inlinedAt: !1269)
!1300 = !DILocation(line: 197, column: 7, scope: !1259, inlinedAt: !1269)
!1301 = !DILocation(line: 197, column: 26, scope: !1259, inlinedAt: !1269)
!1302 = !DILocation(line: 198, column: 22, scope: !1259, inlinedAt: !1269)
!1303 = distinct !{!1303, !1304, !1305}
!1304 = !DILocation(line: 197, column: 7, scope: !1259)
!1305 = !DILocation(line: 198, column: 22, scope: !1259)
!1306 = !DILocation(line: 199, column: 24, scope: !1259, inlinedAt: !1269)
!1307 = !DILocation(line: 199, column: 21, scope: !1259, inlinedAt: !1269)
