; ModuleID = 'coreutils-8.27/src/stat.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.mount_entry = type { i8*, i8*, i8*, i8*, i64, i8, %struct.mount_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }
%struct.__fsid_t = type { [2 x i32] }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.saved_cwd = type { i32, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !33, line: 62, baseType: !34)
!33 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!34 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !54, !55, !56, !59, !60}
!39 = !DILocalVariable(name: "format", arg: 1, scope: !20, file: !3, line: 1216, type: !24)
!40 = !DILocalVariable(name: "fd", arg: 2, scope: !20, file: !3, line: 1216, type: !27)
!41 = !DILocalVariable(name: "filename", arg: 3, scope: !20, file: !3, line: 1216, type: !24)
!42 = !DILocalVariable(name: "print_func", arg: 4, scope: !20, file: !3, line: 1217, type: !28)
!43 = !DILocalVariable(name: "data", arg: 5, scope: !20, file: !3, line: 1219, type: !36)
!44 = !DILocalVariable(name: "fail", scope: !20, file: !3, line: 1221, type: !23)
!45 = !DILocalVariable(name: "n_alloc", scope: !20, file: !3, line: 1232, type: !32)
!46 = !DILocalVariable(name: "dest", scope: !20, file: !3, line: 1233, type: !31)
!47 = !DILocalVariable(name: "b", scope: !20, file: !3, line: 1234, type: !24)
!48 = !DILocalVariable(name: "len", scope: !49, file: !3, line: 1241, type: !32)
!49 = distinct !DILexicalBlock(scope: !50, file: !3, line: 1240, column: 11)
!50 = distinct !DILexicalBlock(scope: !51, file: !3, line: 1238, column: 9)
!51 = distinct !DILexicalBlock(scope: !52, file: !3, line: 1236, column: 5)
!52 = distinct !DILexicalBlock(scope: !53, file: !3, line: 1235, column: 3)
!53 = distinct !DILexicalBlock(scope: !20, file: !3, line: 1235, column: 3)
!54 = !DILocalVariable(name: "fmt_char", scope: !49, file: !3, line: 1242, type: !24)
!55 = !DILocalVariable(name: "fmt_code", scope: !49, file: !3, line: 1247, type: !35)
!56 = !DILocalVariable(name: "esc_value", scope: !57, file: !3, line: 1283, type: !27)
!57 = distinct !DILexicalBlock(scope: !58, file: !3, line: 1282, column: 13)
!58 = distinct !DILexicalBlock(scope: !50, file: !3, line: 1281, column: 15)
!59 = !DILocalVariable(name: "esc_length", scope: !57, file: !3, line: 1284, type: !27)
!60 = !DILocalVariable(name: "esc_value", scope: !61, file: !3, line: 1295, type: !27)
!61 = distinct !DILexicalBlock(scope: !62, file: !3, line: 1294, column: 13)
!62 = distinct !DILexicalBlock(scope: !58, file: !3, line: 1293, column: 20)
!63 = !{!64}
!64 = !DIEnumerator(name: "MAX_ADDITIONAL_BYTES", value: 2)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 46, size: 32, elements: !67)
!66 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!68 = !DIEnumerator(name: "_ISupper", value: 256)
!69 = !DIEnumerator(name: "_ISlower", value: 512)
!70 = !DIEnumerator(name: "_ISalpha", value: 1024)
!71 = !DIEnumerator(name: "_ISdigit", value: 2048)
!72 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!73 = !DIEnumerator(name: "_ISspace", value: 8192)
!74 = !DIEnumerator(name: "_ISprint", value: 16384)
!75 = !DIEnumerator(name: "_ISgraph", value: 32768)
!76 = !DIEnumerator(name: "_ISblank", value: 1)
!77 = !DIEnumerator(name: "_IScntrl", value: 2)
!78 = !DIEnumerator(name: "_ISpunct", value: 4)
!79 = !DIEnumerator(name: "_ISalnum", value: 8)
!80 = !{!31, !81, !24, !27, !82, !83, !84, !145, !32, !150, !35}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!83 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsid_word", scope: !86, file: !3, line: 813, baseType: !35)
!86 = distinct !DISubprogram(name: "print_statfs", scope: !3, file: !3, line: 795, type: !29, isLocal: true, isDefinition: true, scopeLine: 798, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !87)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !127, !128, !133, !137, !138, !139, !143}
!88 = !DILocalVariable(name: "pformat", arg: 1, scope: !86, file: !3, line: 795, type: !31)
!89 = !DILocalVariable(name: "prefix_len", arg: 2, scope: !86, file: !3, line: 795, type: !32)
!90 = !DILocalVariable(name: "m", arg: 3, scope: !86, file: !3, line: 795, type: !35)
!91 = !DILocalVariable(name: "fd", arg: 4, scope: !86, file: !3, line: 796, type: !27)
!92 = !DILocalVariable(name: "filename", arg: 5, scope: !86, file: !3, line: 796, type: !24)
!93 = !DILocalVariable(name: "data", arg: 6, scope: !86, file: !3, line: 797, type: !36)
!94 = !DILocalVariable(name: "statfsbuf", scope: !86, file: !3, line: 799, type: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !98, line: 24, size: 960, elements: !99)
!98 = !DIFile(filename: "/usr/include/bits/statfs.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!99 = !{!100, !104, !105, !107, !108, !109, !111, !112, !120, !121, !122, !123}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !97, file: !98, line: 26, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsword_t", file: !102, line: 179, baseType: !103)
!102 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !97, file: !98, line: 27, baseType: !101, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !97, file: !98, line: 29, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt_t", file: !102, line: 171, baseType: !34)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !97, file: !98, line: 30, baseType: !106, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !97, file: !98, line: 31, baseType: !106, size: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !97, file: !98, line: 32, baseType: !110, size: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt_t", file: !102, line: 175, baseType: !34)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !97, file: !98, line: 33, baseType: !110, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !97, file: !98, line: 41, baseType: !113, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsid_t", file: !102, line: 143, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 143, size: 64, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !114, file: !102, line: 143, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 2)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "f_namelen", scope: !97, file: !98, line: 42, baseType: !101, size: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !97, file: !98, line: 43, baseType: !101, size: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !97, file: !98, line: 44, baseType: !101, size: 64, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "f_spare", scope: !97, file: !98, line: 45, baseType: !124, size: 256, offset: 704)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 256, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 4)
!127 = !DILocalVariable(name: "fail", scope: !86, file: !3, line: 800, type: !23)
!128 = !DILocalVariable(name: "p", scope: !129, file: !3, line: 817, type: !131)
!129 = distinct !DILexicalBlock(scope: !130, file: !3, line: 809, column: 7)
!130 = distinct !DILexicalBlock(scope: !86, file: !3, line: 803, column: 5)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!133 = !DILocalVariable(name: "fsid", scope: !129, file: !3, line: 821, type: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !135, line: 112, baseType: !136)
!135 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !102, line: 62, baseType: !34)
!137 = !DILocalVariable(name: "words", scope: !129, file: !3, line: 822, type: !27)
!138 = !DILocalVariable(name: "i", scope: !129, file: !3, line: 823, type: !27)
!139 = !DILocalVariable(name: "u", scope: !140, file: !3, line: 826, type: !134)
!140 = distinct !DILexicalBlock(scope: !141, file: !3, line: 825, column: 11)
!141 = distinct !DILexicalBlock(scope: !142, file: !3, line: 824, column: 9)
!142 = distinct !DILexicalBlock(scope: !129, file: !3, line: 824, column: 9)
!143 = !DILocalVariable(name: "frsize", scope: !144, file: !3, line: 861, type: !134)
!144 = distinct !DILexicalBlock(scope: !130, file: !3, line: 860, column: 7)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !147, line: 46, size: 1152, elements: !148)
!147 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!148 = !{!149, !151, !153, !155, !157, !159, !161, !162, !163, !165, !167, !169, !177, !178, !179}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !146, file: !147, line: 48, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !102, line: 133, baseType: !34)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !146, file: !147, line: 53, baseType: !152, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !102, line: 136, baseType: !34)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !146, file: !147, line: 61, baseType: !154, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !102, line: 139, baseType: !34)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !146, file: !147, line: 62, baseType: !156, size: 32, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !102, line: 138, baseType: !35)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !146, file: !147, line: 64, baseType: !158, size: 32, offset: 224)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !102, line: 134, baseType: !35)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !146, file: !147, line: 65, baseType: !160, size: 32, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !102, line: 135, baseType: !35)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !146, file: !147, line: 67, baseType: !27, size: 32, offset: 288)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !146, file: !147, line: 69, baseType: !150, size: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !146, file: !147, line: 74, baseType: !164, size: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 140, baseType: !103)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !146, file: !147, line: 78, baseType: !166, size: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !102, line: 162, baseType: !103)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !146, file: !147, line: 80, baseType: !168, size: 64, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !102, line: 167, baseType: !103)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !146, file: !147, line: 91, baseType: !170, size: 128, offset: 576)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !171, line: 8, size: 128, elements: !172)
!171 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!172 = !{!173, !175}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !170, file: !171, line: 10, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !102, line: 148, baseType: !103)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !170, file: !171, line: 11, baseType: !176, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !102, line: 184, baseType: !103)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !146, file: !147, line: 92, baseType: !170, size: 128, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !146, file: !147, line: 93, baseType: !170, size: 128, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !146, file: !147, line: 106, baseType: !180, size: 192, offset: 960)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 192, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 3)
!183 = !{!184, !186, !0, !188, !190, !210, !224, !226, !229, !234, !247, !259, !290, !292, !324}
!184 = !DIGlobalVariableExpression(var: !185)
!185 = distinct !DIGlobalVariable(name: "follow_links", scope: !2, file: !3, line: 200, type: !23, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187)
!187 = distinct !DIGlobalVariable(name: "interpret_backslash_escapes", scope: !2, file: !3, line: 204, type: !23, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189)
!189 = distinct !DIGlobalVariable(name: "decimal_point_len", scope: !2, file: !3, line: 212, type: !32, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191)
!191 = distinct !DIGlobalVariable(name: "infomap", scope: !192, file: !193, line: 632, type: !207, isLocal: true, isDefinition: true)
!192 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !193, file: !193, line: 630, type: !194, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !196)
!193 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!194 = !DISubroutineType(types: !195)
!195 = !{null, !24}
!196 = !{!197, !198, !199, !206}
!197 = !DILocalVariable(name: "program", arg: 1, scope: !192, file: !193, line: 630, type: !24)
!198 = !DILocalVariable(name: "node", scope: !192, file: !193, line: 642, type: !24)
!199 = !DILocalVariable(name: "map_prog", scope: !192, file: !193, line: 643, type: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !192, file: !193, line: 632, size: 128, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !202, file: !193, line: 632, baseType: !24, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !202, file: !193, line: 632, baseType: !24, size: 64, offset: 64)
!206 = !DILocalVariable(name: "lc_messages", scope: !192, file: !193, line: 655, type: !24)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 896, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 7)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 187, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 2048, elements: !222)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !215, line: 50, size: 256, elements: !216)
!215 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!216 = !{!217, !218, !219, !221}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !215, line: 52, baseType: !24, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !214, file: !215, line: 55, baseType: !27, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !214, file: !215, line: 56, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !214, file: !215, line: 57, baseType: !27, size: 32, offset: 192)
!222 = !{!223}
!223 = !DISubrange(count: 8)
!224 = !DIGlobalVariableExpression(var: !225)
!225 = distinct !DIGlobalVariable(name: "trailing_delim", scope: !2, file: !3, line: 208, type: !24, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227)
!227 = distinct !DIGlobalVariable(name: "printf_flags", scope: !2, file: !3, line: 176, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 64, elements: !222)
!229 = !DIGlobalVariableExpression(var: !230)
!230 = distinct !DIGlobalVariable(name: "digits", scope: !2, file: !3, line: 168, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 88, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 11)
!234 = !DIGlobalVariableExpression(var: !235)
!235 = distinct !DIGlobalVariable(name: "buf", scope: !236, file: !3, line: 560, type: !244, isLocal: true, isDefinition: true)
!236 = distinct !DISubprogram(name: "human_fstype", scope: !3, file: !3, line: 221, type: !237, isLocal: true, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !239)
!237 = !DISubroutineType(types: !238)
!238 = !{!24, !95}
!239 = !{!240, !241}
!240 = !DILocalVariable(name: "statfsbuf", arg: 1, scope: !236, file: !3, line: 221, type: !95)
!241 = !DILocalVariable(name: "type", scope: !242, file: !3, line: 559, type: !34)
!242 = distinct !DILexicalBlock(scope: !243, file: !3, line: 558, column: 7)
!243 = distinct !DILexicalBlock(scope: !236, file: !3, line: 227, column: 5)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 232, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 29)
!247 = !DIGlobalVariableExpression(var: !248)
!248 = distinct !DIGlobalVariable(name: "modebuf", scope: !249, file: !3, line: 572, type: !256, isLocal: true, isDefinition: true)
!249 = distinct !DISubprogram(name: "human_access", scope: !3, file: !3, line: 570, type: !250, isLocal: true, isDefinition: true, scopeLine: 571, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !254)
!250 = !DISubroutineType(types: !251)
!251 = !{!31, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!254 = !{!255}
!255 = !DILocalVariable(name: "statbuf", arg: 1, scope: !249, file: !3, line: 570, type: !252)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 96, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 12)
!259 = !DIGlobalVariableExpression(var: !260)
!260 = distinct !DIGlobalVariable(name: "mount_list", scope: !261, file: !3, line: 888, type: !269, isLocal: true, isDefinition: true)
!261 = distinct !DISubprogram(name: "find_bind_mount", scope: !3, file: !3, line: 884, type: !262, isLocal: true, isDefinition: true, scopeLine: 885, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !264)
!262 = !DISubroutineType(types: !263)
!263 = !{!24, !24}
!264 = !{!265, !266, !267, !268, !284}
!265 = !DILocalVariable(name: "name", arg: 1, scope: !261, file: !3, line: 884, type: !24)
!266 = !DILocalVariable(name: "bind_mount", scope: !261, file: !3, line: 886, type: !24)
!267 = !DILocalVariable(name: "name_stats", scope: !261, file: !3, line: 897, type: !146)
!268 = !DILocalVariable(name: "me", scope: !261, file: !3, line: 901, type: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !271, line: 26, size: 448, elements: !272)
!271 = !DIFile(filename: "./lib/mountlist.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!272 = !{!273, !274, !275, !276, !277, !280, !281, !282, !283}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !270, file: !271, line: 28, baseType: !31, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !270, file: !271, line: 29, baseType: !31, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !270, file: !271, line: 30, baseType: !31, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !270, file: !271, line: 32, baseType: !31, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !270, file: !271, line: 33, baseType: !278, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !279, line: 60, baseType: !150)
!279 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!280 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !270, file: !271, line: 34, baseType: !35, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !270, file: !271, line: 35, baseType: !35, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !270, file: !271, line: 36, baseType: !35, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !270, file: !271, line: 37, baseType: !269, size: 64, offset: 384)
!284 = !DILocalVariable(name: "dev_stats", scope: !285, file: !3, line: 907, type: !146)
!285 = distinct !DILexicalBlock(scope: !286, file: !3, line: 906, column: 9)
!286 = distinct !DILexicalBlock(scope: !287, file: !3, line: 904, column: 11)
!287 = distinct !DILexicalBlock(scope: !288, file: !3, line: 903, column: 5)
!288 = distinct !DILexicalBlock(scope: !289, file: !3, line: 902, column: 3)
!289 = distinct !DILexicalBlock(scope: !261, file: !3, line: 902, column: 3)
!290 = !DIGlobalVariableExpression(var: !291)
!291 = distinct !DIGlobalVariable(name: "tried_mount_list", scope: !261, file: !3, line: 889, type: !23, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293)
!293 = distinct !DIGlobalVariable(name: "str", scope: !294, file: !3, line: 586, type: !321, isLocal: true, isDefinition: true)
!294 = distinct !DISubprogram(name: "human_time", scope: !3, file: !3, line: 579, type: !295, isLocal: true, isDefinition: true, scopeLine: 580, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !297)
!295 = !DISubroutineType(types: !296)
!296 = !{!31, !170}
!297 = !{!298, !299, !314, !315}
!298 = !DILocalVariable(name: "t", arg: 1, scope: !294, file: !3, line: 579, type: !170)
!299 = !DILocalVariable(name: "tm", scope: !294, file: !3, line: 593, type: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !301, line: 7, size: 448, elements: !302)
!301 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !300, file: !301, line: 9, baseType: !27, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !300, file: !301, line: 10, baseType: !27, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !300, file: !301, line: 11, baseType: !27, size: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !300, file: !301, line: 12, baseType: !27, size: 32, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !300, file: !301, line: 13, baseType: !27, size: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !300, file: !301, line: 14, baseType: !27, size: 32, offset: 160)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !300, file: !301, line: 15, baseType: !27, size: 32, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !300, file: !301, line: 16, baseType: !27, size: 32, offset: 224)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !300, file: !301, line: 17, baseType: !27, size: 32, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !300, file: !301, line: 20, baseType: !103, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !300, file: !301, line: 21, baseType: !24, size: 64, offset: 384)
!314 = !DILocalVariable(name: "ns", scope: !294, file: !3, line: 594, type: !27)
!315 = !DILocalVariable(name: "secbuf", scope: !316, file: !3, line: 599, type: !318)
!316 = distinct !DILexicalBlock(scope: !317, file: !3, line: 598, column: 5)
!317 = distinct !DILexicalBlock(scope: !294, file: !3, line: 595, column: 7)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 168, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 21)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 488, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 61)
!324 = !DIGlobalVariableExpression(var: !325)
!325 = distinct !DIGlobalVariable(name: "tz", scope: !294, file: !3, line: 590, type: !326, isLocal: true, isDefinition: true)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !327, line: 594, baseType: !328)
!327 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !327, line: 594, flags: DIFlagFwdDecl)
!330 = !DIGlobalVariableExpression(var: !331)
!331 = distinct !DIGlobalVariable(name: "Version", scope: !332, file: !333, line: 2, type: !24, isLocal: false, isDefinition: true)
!332 = distinct !DICompileUnit(language: DW_LANG_C99, file: !333, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, globals: !335)
!333 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!334 = !{}
!335 = !{!330}
!336 = !DIGlobalVariableExpression(var: !337)
!337 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !338, file: !343, line: 69, type: !344, isLocal: false, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, retainedTypes: !341, globals: !342)
!339 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!340 = !{!5}
!341 = !{!81, !83}
!342 = !{!336}
!343 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !345, line: 55, baseType: !346)
!345 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{null}
!349 = !DIGlobalVariableExpression(var: !350)
!350 = distinct !DIGlobalVariable(name: "file_name", scope: !351, file: !356, line: 36, type: !24, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, globals: !353)
!352 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!353 = !{!349, !354}
!354 = !DIGlobalVariableExpression(var: !355)
!355 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !351, file: !356, line: 46, type: !23, isLocal: true, isDefinition: true)
!356 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!357 = !DIGlobalVariableExpression(var: !358)
!358 = distinct !DIGlobalVariable(name: "exit_failure", scope: !359, file: !362, line: 24, type: !363, isLocal: false, isDefinition: true)
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, globals: !361)
!360 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!361 = !{!357}
!362 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!363 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !27)
!364 = !DIGlobalVariableExpression(var: !365)
!365 = distinct !DIGlobalVariable(name: "program_name", scope: !366, file: !370, line: 33, type: !24, isLocal: false, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !368, globals: !369)
!367 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!368 = !{!81, !31}
!369 = !{!364}
!370 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!371 = !DIGlobalVariableExpression(var: !372)
!372 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !373, file: !385, line: 77, type: !418, isLocal: false, isDefinition: true)
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !375, retainedTypes: !381, globals: !382)
!374 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!375 = !{!5, !376, !65}
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !377)
!377 = !{!378, !379, !380}
!378 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!379 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!380 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!381 = !{!27, !82, !32, !31}
!382 = !{!371, !383, !390, !400, !402, !407, !414, !416}
!383 = !DIGlobalVariableExpression(var: !384)
!384 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !373, file: !385, line: 93, type: !386, isLocal: false, isDefinition: true)
!385 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 320, elements: !388)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!388 = !{!389}
!389 = !DISubrange(count: 10)
!390 = !DIGlobalVariableExpression(var: !391)
!391 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !373, file: !385, line: 1043, type: !392, isLocal: false, isDefinition: true)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !385, line: 57, size: 448, elements: !393)
!393 = !{!394, !395, !396, !398, !399}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !392, file: !385, line: 60, baseType: !5, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !392, file: !385, line: 63, baseType: !27, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !392, file: !385, line: 67, baseType: !397, size: 256, offset: 64)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 256, elements: !222)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !392, file: !385, line: 70, baseType: !24, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !392, file: !385, line: 73, baseType: !24, size: 64, offset: 384)
!400 = !DIGlobalVariableExpression(var: !401)
!401 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !373, file: !385, line: 108, type: !392, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403)
!403 = distinct !DIGlobalVariable(name: "slot0", scope: !373, file: !385, line: 834, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 256)
!407 = !DIGlobalVariableExpression(var: !408)
!408 = distinct !DIGlobalVariable(name: "slotvec", scope: !373, file: !385, line: 837, type: !409, isLocal: true, isDefinition: true)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !385, line: 826, size: 128, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !410, file: !385, line: 828, baseType: !32, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !410, file: !385, line: 829, baseType: !31, size: 64, offset: 64)
!414 = !DIGlobalVariableExpression(var: !415)
!415 = distinct !DIGlobalVariable(name: "nslots", scope: !373, file: !385, line: 835, type: !27, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417)
!417 = distinct !DIGlobalVariable(name: "slotvec0", scope: !373, file: !385, line: 836, type: !410, isLocal: true, isDefinition: true)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 704, elements: !232)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!420 = !DIGlobalVariableExpression(var: !421)
!421 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !422, file: !425, line: 26, type: !426, isLocal: false, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, globals: !424)
!423 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!424 = !{!420}
!425 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 376, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 47)
!429 = !DIGlobalVariableExpression(var: !430)
!430 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !431, file: !775, line: 120, type: !776, isLocal: true, isDefinition: true)
!431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !432, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !433, retainedTypes: !772, globals: !774)
!432 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!433 = !{!434}
!434 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !435, line: 41, size: 32, elements: !436)
!435 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771}
!437 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!438 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!439 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!440 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!441 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!442 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!443 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!444 = !DIEnumerator(name: "DAY_1", value: 131079)
!445 = !DIEnumerator(name: "DAY_2", value: 131080)
!446 = !DIEnumerator(name: "DAY_3", value: 131081)
!447 = !DIEnumerator(name: "DAY_4", value: 131082)
!448 = !DIEnumerator(name: "DAY_5", value: 131083)
!449 = !DIEnumerator(name: "DAY_6", value: 131084)
!450 = !DIEnumerator(name: "DAY_7", value: 131085)
!451 = !DIEnumerator(name: "ABMON_1", value: 131086)
!452 = !DIEnumerator(name: "ABMON_2", value: 131087)
!453 = !DIEnumerator(name: "ABMON_3", value: 131088)
!454 = !DIEnumerator(name: "ABMON_4", value: 131089)
!455 = !DIEnumerator(name: "ABMON_5", value: 131090)
!456 = !DIEnumerator(name: "ABMON_6", value: 131091)
!457 = !DIEnumerator(name: "ABMON_7", value: 131092)
!458 = !DIEnumerator(name: "ABMON_8", value: 131093)
!459 = !DIEnumerator(name: "ABMON_9", value: 131094)
!460 = !DIEnumerator(name: "ABMON_10", value: 131095)
!461 = !DIEnumerator(name: "ABMON_11", value: 131096)
!462 = !DIEnumerator(name: "ABMON_12", value: 131097)
!463 = !DIEnumerator(name: "MON_1", value: 131098)
!464 = !DIEnumerator(name: "MON_2", value: 131099)
!465 = !DIEnumerator(name: "MON_3", value: 131100)
!466 = !DIEnumerator(name: "MON_4", value: 131101)
!467 = !DIEnumerator(name: "MON_5", value: 131102)
!468 = !DIEnumerator(name: "MON_6", value: 131103)
!469 = !DIEnumerator(name: "MON_7", value: 131104)
!470 = !DIEnumerator(name: "MON_8", value: 131105)
!471 = !DIEnumerator(name: "MON_9", value: 131106)
!472 = !DIEnumerator(name: "MON_10", value: 131107)
!473 = !DIEnumerator(name: "MON_11", value: 131108)
!474 = !DIEnumerator(name: "MON_12", value: 131109)
!475 = !DIEnumerator(name: "AM_STR", value: 131110)
!476 = !DIEnumerator(name: "PM_STR", value: 131111)
!477 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!478 = !DIEnumerator(name: "D_FMT", value: 131113)
!479 = !DIEnumerator(name: "T_FMT", value: 131114)
!480 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!481 = !DIEnumerator(name: "ERA", value: 131116)
!482 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!483 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!484 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!485 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!486 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!487 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!488 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!489 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!490 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!491 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!492 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!493 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!494 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!495 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!496 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!497 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!498 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!499 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!500 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!501 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!502 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!503 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!504 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!505 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!506 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!507 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!508 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!509 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!510 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!511 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!512 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!513 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!514 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!515 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!516 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!517 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!518 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!519 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!520 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!521 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!522 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!523 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!524 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!525 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!526 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!527 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!528 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!529 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!530 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!531 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!532 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!533 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!534 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!535 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!536 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!537 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!538 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!539 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!540 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!541 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!542 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!543 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!544 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!545 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!546 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!547 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!548 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!549 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!550 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!551 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!552 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!553 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!554 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!555 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!556 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!557 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!558 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!559 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!560 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!561 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!562 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!563 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!564 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!565 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!566 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!567 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!568 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!569 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!570 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!571 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!572 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!573 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!574 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!575 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!576 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!577 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!578 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!579 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!580 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!581 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!582 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!583 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!584 = !DIEnumerator(name: "CODESET", value: 14)
!585 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!586 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!587 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!588 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!589 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!590 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!591 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!592 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!593 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!594 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!595 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!596 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!597 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!598 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!599 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!600 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!601 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!602 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!603 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!604 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!605 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!606 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!607 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!608 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!609 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!610 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!611 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!612 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!613 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!614 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!615 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!616 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!617 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!618 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!619 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!620 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!621 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!622 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!623 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!624 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!625 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!626 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!627 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!628 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!629 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!630 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!631 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!632 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!633 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!634 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!635 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!636 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!637 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!638 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!639 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!640 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!641 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!642 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!643 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!644 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!645 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!646 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!647 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!648 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!649 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!650 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!651 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!652 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!653 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!654 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!655 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!656 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!657 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!658 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!659 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!660 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!661 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!662 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!663 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!664 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!665 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!666 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!667 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!668 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!669 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!670 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!671 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!672 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!673 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!674 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!675 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!676 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!677 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!678 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!679 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!680 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!681 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!682 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!683 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!684 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!685 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!686 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!687 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!688 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!689 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!690 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!691 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!692 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!693 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!694 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!695 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!696 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!697 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!698 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!699 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!700 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!701 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!702 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!703 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!704 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!705 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!706 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!707 = !DIEnumerator(name: "THOUSEP", value: 65537)
!708 = !DIEnumerator(name: "__GROUPING", value: 65538)
!709 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!710 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!711 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!712 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!713 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!714 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!715 = !DIEnumerator(name: "__YESSTR", value: 327682)
!716 = !DIEnumerator(name: "__NOSTR", value: 327683)
!717 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!718 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!719 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!720 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!721 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!722 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!723 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!724 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!725 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!726 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!727 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!728 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!729 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!730 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!731 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!732 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!733 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!734 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!735 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!736 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!737 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!738 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!739 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!740 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!741 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!742 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!743 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!744 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!745 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!746 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!747 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!748 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!749 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!750 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!751 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!752 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!753 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!754 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!755 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!756 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!757 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!758 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!759 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!760 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!761 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!762 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!763 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!764 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!765 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!766 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!767 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!768 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!769 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!770 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!771 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!772 = !{!81, !31, !773}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!774 = !{!429}
!775 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!776 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !24)
!777 = !DIGlobalVariableExpression(var: !778)
!778 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !779, file: !780, line: 335, type: !27, isLocal: true, isDefinition: true)
!779 = distinct !DISubprogram(name: "rpl_fcntl", scope: !780, file: !780, line: 272, type: !781, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !783, variables: !786)
!780 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!781 = !DISubroutineType(types: !782)
!782 = !{!27, !27, !27, null}
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, globals: !785)
!784 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!785 = !{!777}
!786 = !{!787, !788, !789, !802, !803, !806, !809, !812}
!787 = !DILocalVariable(name: "fd", arg: 1, scope: !779, file: !780, line: 272, type: !27)
!788 = !DILocalVariable(name: "action", arg: 2, scope: !779, file: !780, line: 272, type: !27)
!789 = !DILocalVariable(name: "arg", scope: !779, file: !780, line: 274, type: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !791, line: 30, baseType: !792)
!791 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !784, line: 274, baseType: !793)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 192, elements: !800)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !784, line: 274, size: 192, elements: !795)
!795 = !{!796, !797, !798, !799}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !794, file: !784, line: 274, baseType: !35, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !794, file: !784, line: 274, baseType: !35, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !794, file: !784, line: 274, baseType: !81, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !794, file: !784, line: 274, baseType: !81, size: 64, offset: 128)
!800 = !{!801}
!801 = !DISubrange(count: 1)
!802 = !DILocalVariable(name: "result", scope: !779, file: !780, line: 275, type: !27)
!803 = !DILocalVariable(name: "target", scope: !804, file: !780, line: 322, type: !27)
!804 = distinct !DILexicalBlock(scope: !805, file: !780, line: 321, column: 7)
!805 = distinct !DILexicalBlock(scope: !779, file: !780, line: 278, column: 5)
!806 = !DILocalVariable(name: "flags", scope: !807, file: !780, line: 359, type: !27)
!807 = distinct !DILexicalBlock(scope: !808, file: !780, line: 358, column: 11)
!808 = distinct !DILexicalBlock(scope: !804, file: !780, line: 357, column: 13)
!809 = !DILocalVariable(name: "saved_errno", scope: !810, file: !780, line: 362, type: !27)
!810 = distinct !DILexicalBlock(scope: !811, file: !780, line: 361, column: 15)
!811 = distinct !DILexicalBlock(scope: !807, file: !780, line: 360, column: 17)
!812 = !DILocalVariable(name: "p", scope: !813, file: !780, line: 404, type: !81)
!813 = distinct !DILexicalBlock(scope: !805, file: !780, line: 402, column: 7)
!814 = !DIGlobalVariableExpression(var: !815)
!815 = distinct !DIGlobalVariable(name: "__mon_yday", scope: !816, file: !826, line: 124, type: !839, isLocal: true, isDefinition: true)
!816 = distinct !DICompileUnit(language: DW_LANG_C99, file: !817, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !818, globals: !823)
!817 = !DIFile(filename: "./lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!818 = !{!35, !27, !819, !83, !820, !82, !103, !34, !821, !822}
!819 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!820 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!821 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!822 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!823 = !{!824, !830, !833, !814}
!824 = !DIGlobalVariableExpression(var: !825, expr: !829)
!825 = distinct !DIGlobalVariable(name: "mktime_min", scope: !816, file: !826, line: 95, type: !827, isLocal: true, isDefinition: true)
!826 = !DIFile(filename: "lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_int", file: !826, line: 68, baseType: !103)
!829 = !DIExpression(DW_OP_constu, 9223372036854775808, DW_OP_stack_value)
!830 = !DIGlobalVariableExpression(var: !831, expr: !832)
!831 = distinct !DIGlobalVariable(name: "mktime_max", scope: !816, file: !826, line: 98, type: !827, isLocal: true, isDefinition: true)
!832 = !DIExpression(DW_OP_constu, 9223372036854775807, DW_OP_stack_value)
!833 = !DIGlobalVariableExpression(var: !834)
!834 = distinct !DIGlobalVariable(name: "localtime_offset", scope: !816, file: !826, line: 462, type: !835, isLocal: true, isDefinition: true)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "mktime_offset_t", file: !836, line: 30, baseType: !837)
!836 = !DIFile(filename: "./lib/mktime-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !838, line: 7, baseType: !174)
!838 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 416, elements: !841)
!840 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!841 = !{!119, !842}
!842 = !DISubrange(count: 13)
!843 = distinct !DICompileUnit(language: DW_LANG_C99, file: !844, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, retainedTypes: !845)
!844 = !DIFile(filename: "src/find-mount-point.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!845 = !{!31}
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !848)
!847 = !DIFile(filename: "./lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!848 = !{!81}
!849 = distinct !DICompileUnit(language: DW_LANG_C99, file: !850, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!850 = !DIFile(filename: "./lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!852 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !854, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !845)
!854 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!856 = !DIFile(filename: "./lib/file-type.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!858 = !DIFile(filename: "./lib/filemode.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !861)
!860 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!861 = !{!862}
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !135, line: 111, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !102, line: 61, baseType: !103)
!864 = distinct !DICompileUnit(language: DW_LANG_C99, file: !865, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!865 = !DIFile(filename: "./lib/save-cwd.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !868)
!867 = !DIFile(filename: "./lib/strftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!868 = !{!24, !35, !32, !81, !36, !27, !83}
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !871, retainedTypes: !848)
!870 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!871 = !{!872}
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !873, line: 41, size: 32, elements: !874)
!873 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!874 = !{!875}
!875 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !878, retainedTypes: !892)
!877 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!878 = !{!879}
!879 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !881, file: !880, line: 192, size: 32, elements: !890)
!880 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!881 = distinct !DISubprogram(name: "x2nrealloc", scope: !880, file: !880, line: 180, type: !882, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !876, variables: !885)
!882 = !DISubroutineType(types: !883)
!883 = !{!81, !81, !884, !32}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!885 = !{!886, !887, !888, !889}
!886 = !DILocalVariable(name: "p", arg: 1, scope: !881, file: !880, line: 180, type: !81)
!887 = !DILocalVariable(name: "pn", arg: 2, scope: !881, file: !880, line: 180, type: !884)
!888 = !DILocalVariable(name: "s", arg: 3, scope: !881, file: !880, line: 180, type: !32)
!889 = !DILocalVariable(name: "n", scope: !881, file: !880, line: 182, type: !32)
!890 = !{!891}
!891 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!892 = !{!32, !31, !81}
!893 = distinct !DICompileUnit(language: DW_LANG_C99, file: !894, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!894 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!895 = distinct !DICompileUnit(language: DW_LANG_C99, file: !896, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!896 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!897 = distinct !DICompileUnit(language: DW_LANG_C99, file: !898, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!898 = !DIFile(filename: "./lib/xasprintf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!899 = distinct !DICompileUnit(language: DW_LANG_C99, file: !900, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !848)
!900 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !368)
!902 = !DIFile(filename: "./lib/chdir-long.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!903 = distinct !DICompileUnit(language: DW_LANG_C99, file: !904, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !905)
!904 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!905 = !{!32}
!906 = distinct !DICompileUnit(language: DW_LANG_C99, file: !907, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !908)
!907 = !DIFile(filename: "./lib/mountlist.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!908 = !{!81, !150}
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !911, retainedTypes: !845, globals: !916)
!910 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!911 = !{!912}
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !913, line: 49, size: 32, elements: !914)
!913 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!914 = !{!915}
!915 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119)
!916 = !{!917}
!917 = !DIGlobalVariableExpression(var: !918)
!918 = distinct !DIGlobalVariable(name: "local_tz", scope: !909, file: !913, line: 54, type: !919, isLocal: true, isDefinition: true)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !327, line: 594, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !923, line: 21, size: 128, elements: !924)
!923 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!924 = !{!925, !926, !927}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !922, file: !923, line: 25, baseType: !921, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !922, file: !923, line: 36, baseType: !26, size: 8, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !922, file: !923, line: 48, baseType: !928, offset: 72)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, elements: !929)
!929 = !{!930}
!930 = !DISubrange(count: -1)
!931 = distinct !DICompileUnit(language: DW_LANG_C99, file: !932, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!932 = !DIFile(filename: "./lib/cloexec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!933 = distinct !DICompileUnit(language: DW_LANG_C99, file: !934, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!934 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!935 = distinct !DICompileUnit(language: DW_LANG_C99, file: !936, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!936 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!937 = distinct !DICompileUnit(language: DW_LANG_C99, file: !938, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!938 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!939 = distinct !DICompileUnit(language: DW_LANG_C99, file: !940, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!940 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !845)
!942 = !DIFile(filename: "./lib/xvasprintf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!944 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!945 = distinct !DICompileUnit(language: DW_LANG_C99, file: !946, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !848)
!946 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!947 = distinct !DICompileUnit(language: DW_LANG_C99, file: !948, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !848)
!948 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334)
!950 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!951 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!952 = !{i32 2, !"Dwarf Version", i32 4}
!953 = !{i32 2, !"Debug Info Version", i32 3}
!954 = !{i32 1, !"wchar_size", i32 4}
!955 = !{i32 7, !"PIC Level", i32 2}
!956 = !{i32 7, !"PIE Level", i32 2}
!957 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 1482, type: !958, isLocal: false, isDefinition: true, scopeLine: 1483, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !960)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !27}
!960 = !{!961}
!961 = !DILocalVariable(name: "status", arg: 1, scope: !957, file: !3, line: 1482, type: !27)
!962 = !DIExpression()
!963 = !DILocation(line: 1482, column: 12, scope: !957)
!964 = !DILocation(line: 1484, column: 14, scope: !965)
!965 = distinct !DILexicalBlock(scope: !957, file: !3, line: 1484, column: 7)
!966 = !DILocation(line: 1484, column: 7, scope: !957)
!967 = !DILocation(line: 1485, column: 5, scope: !968)
!968 = distinct !DILexicalBlock(scope: !965, file: !3, line: 1485, column: 5)
!969 = !{!970, !970, i64 0}
!970 = !{!"any pointer", !971, i64 0}
!971 = !{!"omnipotent char", !972, i64 0}
!972 = !{!"Simple C/C++ TBAA"}
!973 = !DILocation(line: 1488, column: 7, scope: !974)
!974 = distinct !DILexicalBlock(scope: !965, file: !3, line: 1487, column: 5)
!975 = !DILocation(line: 1489, column: 7, scope: !974)
!976 = !DILocation(line: 587, column: 3, scope: !977, inlinedAt: !978)
!977 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !193, file: !193, line: 585, type: !347, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !334)
!978 = distinct !DILocation(line: 1493, column: 7, scope: !974)
!979 = !DILocation(line: 1495, column: 7, scope: !974)
!980 = !DILocation(line: 1499, column: 7, scope: !974)
!981 = !DILocation(line: 1507, column: 7, scope: !974)
!982 = !DILocation(line: 1508, column: 7, scope: !974)
!983 = !DILocation(line: 1510, column: 7, scope: !974)
!984 = !DILocation(line: 1519, column: 7, scope: !974)
!985 = !DILocation(line: 1527, column: 7, scope: !974)
!986 = !DILocation(line: 1538, column: 7, scope: !974)
!987 = !DILocation(line: 1552, column: 7, scope: !974)
!988 = !DILocation(line: 1561, column: 7, scope: !974)
!989 = !DILocation(line: 1570, column: 7, scope: !974)
!990 = !DILocation(line: 642, column: 15, scope: !192, inlinedAt: !991)
!991 = distinct !DILocation(line: 1571, column: 7, scope: !974)
!992 = !DILocation(line: 651, column: 3, scope: !192, inlinedAt: !991)
!993 = !DILocation(line: 655, column: 29, scope: !192, inlinedAt: !991)
!994 = !DILocation(line: 655, column: 15, scope: !192, inlinedAt: !991)
!995 = !DILocation(line: 656, column: 7, scope: !996, inlinedAt: !991)
!996 = distinct !DILexicalBlock(scope: !192, file: !193, line: 656, column: 7)
!997 = !DILocation(line: 656, column: 19, scope: !996, inlinedAt: !991)
!998 = !DILocation(line: 656, column: 22, scope: !996, inlinedAt: !991)
!999 = !DILocation(line: 656, column: 7, scope: !192, inlinedAt: !991)
!1000 = !DILocation(line: 662, column: 7, scope: !1001, inlinedAt: !991)
!1001 = distinct !DILexicalBlock(scope: !996, file: !193, line: 657, column: 5)
!1002 = !DILocation(line: 664, column: 5, scope: !1001, inlinedAt: !991)
!1003 = !DILocation(line: 665, column: 3, scope: !192, inlinedAt: !991)
!1004 = !DILocation(line: 667, column: 3, scope: !192, inlinedAt: !991)
!1005 = !DILocation(line: 1573, column: 3, scope: !957)
!1006 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1577, type: !1007, isLocal: false, isDefinition: true, scopeLine: 1578, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1010)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!27, !27, !1009}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020}
!1011 = !DILocalVariable(name: "argc", arg: 1, scope: !1006, file: !3, line: 1577, type: !27)
!1012 = !DILocalVariable(name: "argv", arg: 2, scope: !1006, file: !3, line: 1577, type: !1009)
!1013 = !DILocalVariable(name: "c", scope: !1006, file: !3, line: 1579, type: !27)
!1014 = !DILocalVariable(name: "i", scope: !1006, file: !3, line: 1580, type: !27)
!1015 = !DILocalVariable(name: "fs", scope: !1006, file: !3, line: 1581, type: !23)
!1016 = !DILocalVariable(name: "terse", scope: !1006, file: !3, line: 1582, type: !23)
!1017 = !DILocalVariable(name: "format", scope: !1006, file: !3, line: 1583, type: !31)
!1018 = !DILocalVariable(name: "format2", scope: !1006, file: !3, line: 1584, type: !31)
!1019 = !DILocalVariable(name: "ok", scope: !1006, file: !3, line: 1585, type: !23)
!1020 = !DILocalVariable(name: "locale", scope: !1006, file: !3, line: 1593, type: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !1024, line: 51, size: 768, elements: !1025)
!1024 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !1023, file: !1024, line: 55, baseType: !31, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !1023, file: !1024, line: 56, baseType: !31, size: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !1023, file: !1024, line: 62, baseType: !31, size: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !1023, file: !1024, line: 68, baseType: !31, size: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !1023, file: !1024, line: 69, baseType: !31, size: 64, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !1023, file: !1024, line: 70, baseType: !31, size: 64, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !1023, file: !1024, line: 71, baseType: !31, size: 64, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !1023, file: !1024, line: 72, baseType: !31, size: 64, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !1023, file: !1024, line: 73, baseType: !31, size: 64, offset: 512)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !1023, file: !1024, line: 74, baseType: !31, size: 64, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !1023, file: !1024, line: 75, baseType: !26, size: 8, offset: 640)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !1023, file: !1024, line: 76, baseType: !26, size: 8, offset: 648)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !1023, file: !1024, line: 78, baseType: !26, size: 8, offset: 656)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !1023, file: !1024, line: 80, baseType: !26, size: 8, offset: 664)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !1023, file: !1024, line: 82, baseType: !26, size: 8, offset: 672)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !1023, file: !1024, line: 84, baseType: !26, size: 8, offset: 680)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !1023, file: !1024, line: 91, baseType: !26, size: 8, offset: 688)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !1023, file: !1024, line: 92, baseType: !26, size: 8, offset: 696)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !1023, file: !1024, line: 95, baseType: !26, size: 8, offset: 704)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !1023, file: !1024, line: 97, baseType: !26, size: 8, offset: 712)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !1023, file: !1024, line: 99, baseType: !26, size: 8, offset: 720)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !1023, file: !1024, line: 101, baseType: !26, size: 8, offset: 728)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !1023, file: !1024, line: 108, baseType: !26, size: 8, offset: 736)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !1023, file: !1024, line: 109, baseType: !26, size: 8, offset: 744)
!1050 = !DILocation(line: 1577, column: 11, scope: !1006)
!1051 = !DILocation(line: 1577, column: 23, scope: !1006)
!1052 = !DILocation(line: 1581, column: 8, scope: !1006)
!1053 = !DILocation(line: 1582, column: 8, scope: !1006)
!1054 = !DILocation(line: 1583, column: 9, scope: !1006)
!1055 = !DILocation(line: 1585, column: 8, scope: !1006)
!1056 = !DILocation(line: 1588, column: 21, scope: !1006)
!1057 = !DILocation(line: 1588, column: 3, scope: !1006)
!1058 = !DILocation(line: 1589, column: 3, scope: !1006)
!1059 = !DILocation(line: 1590, column: 3, scope: !1006)
!1060 = !DILocation(line: 1591, column: 3, scope: !1006)
!1061 = !DILocation(line: 1593, column: 32, scope: !1006)
!1062 = !DILocation(line: 1593, column: 23, scope: !1006)
!1063 = !DILocation(line: 1594, column: 28, scope: !1006)
!1064 = !{!1065, !970, i64 0}
!1065 = !{!"lconv", !970, i64 0, !970, i64 8, !970, i64 16, !970, i64 24, !970, i64 32, !970, i64 40, !970, i64 48, !970, i64 56, !970, i64 64, !970, i64 72, !971, i64 80, !971, i64 81, !971, i64 82, !971, i64 83, !971, i64 84, !971, i64 85, !971, i64 86, !971, i64 87, !971, i64 88, !971, i64 89, !971, i64 90, !971, i64 91, !971, i64 92, !971, i64 93}
!1066 = !DILocation(line: 1594, column: 20, scope: !1006)
!1067 = !{!971, !971, i64 0}
!1068 = !DILocation(line: 1594, column: 17, scope: !1006)
!1069 = !DILocation(line: 1595, column: 23, scope: !1006)
!1070 = !DILocation(line: 1595, column: 21, scope: !1006)
!1071 = !{!1072, !1072, i64 0}
!1072 = !{!"long", !971, i64 0}
!1073 = !DILocation(line: 1597, column: 3, scope: !1006)
!1074 = !DILocation(line: 1599, column: 3, scope: !1006)
!1075 = !DILocation(line: 1599, column: 15, scope: !1006)
!1076 = !DILocation(line: 1579, column: 7, scope: !1006)
!1077 = distinct !{!1077, !1074, !1078}
!1078 = !DILocation(line: 1634, column: 5, scope: !1006)
!1079 = !DIExpression(DW_OP_deref)
!1080 = !DILocation(line: 1613, column: 11, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 1602, column: 9)
!1082 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 1600, column: 5)
!1083 = !DILocation(line: 1617, column: 11, scope: !1081)
!1084 = !DILocation(line: 1625, column: 11, scope: !1081)
!1085 = !DILocation(line: 1627, column: 9, scope: !1081)
!1086 = !DILocation(line: 1629, column: 9, scope: !1081)
!1087 = !DILocation(line: 1632, column: 11, scope: !1081)
!1088 = !DILocation(line: 1636, column: 15, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 1636, column: 7)
!1090 = !{!1091, !1091, i64 0}
!1091 = !{!"int", !971, i64 0}
!1092 = !DILocation(line: 1636, column: 12, scope: !1089)
!1093 = !DILocation(line: 1636, column: 7, scope: !1006)
!1094 = !DILocation(line: 1638, column: 20, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 1637, column: 5)
!1096 = !DILocation(line: 1638, column: 7, scope: !1095)
!1097 = !DILocation(line: 1639, column: 7, scope: !1095)
!1098 = !DILocation(line: 1642, column: 7, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 1642, column: 7)
!1100 = !DILocation(line: 1642, column: 7, scope: !1006)
!1101 = !DILocation(line: 1644, column: 11, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 1644, column: 11)
!1103 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 1643, column: 5)
!1104 = !DILocation(line: 1644, column: 11, scope: !1103)
!1105 = !DILocation(line: 1018, column: 25, scope: !1106, inlinedAt: !1112)
!1106 = distinct !DISubprogram(name: "getenv_quoting_style", scope: !3, file: !3, line: 1016, type: !347, isLocal: true, isDefinition: true, scopeLine: 1017, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1107)
!1107 = !{!1108, !1109}
!1108 = !DILocalVariable(name: "q_style", scope: !1106, file: !3, line: 1018, type: !24)
!1109 = !DILocalVariable(name: "i", scope: !1110, file: !3, line: 1021, type: !27)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 1020, column: 5)
!1111 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 1019, column: 7)
!1112 = distinct !DILocation(line: 1645, column: 9, scope: !1102)
!1113 = !DILocation(line: 1018, column: 15, scope: !1106, inlinedAt: !1112)
!1114 = !DILocation(line: 1019, column: 7, scope: !1111, inlinedAt: !1112)
!1115 = !DILocation(line: 1019, column: 7, scope: !1106, inlinedAt: !1112)
!1116 = !DILocation(line: 1021, column: 15, scope: !1110, inlinedAt: !1112)
!1117 = !DILocation(line: 1021, column: 11, scope: !1110, inlinedAt: !1112)
!1118 = !DILocation(line: 1022, column: 13, scope: !1119, inlinedAt: !1112)
!1119 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 1022, column: 11)
!1120 = !DILocation(line: 1022, column: 11, scope: !1110, inlinedAt: !1112)
!1121 = !DILocation(line: 1023, column: 34, scope: !1119, inlinedAt: !1112)
!1122 = !DILocation(line: 1023, column: 9, scope: !1119, inlinedAt: !1112)
!1123 = !DILocation(line: 1026, column: 11, scope: !1124, inlinedAt: !1112)
!1124 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 1025, column: 9)
!1125 = !DILocation(line: 1027, column: 24, scope: !1124, inlinedAt: !1112)
!1126 = !DILocation(line: 1028, column: 57, scope: !1124, inlinedAt: !1112)
!1127 = !DILocation(line: 1027, column: 11, scope: !1124, inlinedAt: !1112)
!1128 = !DILocation(line: 1032, column: 5, scope: !1111, inlinedAt: !1112)
!1129 = !DILocation(line: 1650, column: 32, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 1649, column: 5)
!1131 = !DILocation(line: 1650, column: 36, scope: !1130)
!1132 = !DILocation(line: 1650, column: 16, scope: !1130)
!1133 = !DILocation(line: 1651, column: 17, scope: !1130)
!1134 = !DILocation(line: 1584, column: 9, scope: !1006)
!1135 = !DILocation(line: 1654, column: 12, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 1654, column: 3)
!1137 = !DILocation(line: 1580, column: 7, scope: !1006)
!1138 = !DILocation(line: 1654, column: 22, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1136, file: !3, line: 1654, column: 3)
!1140 = !DILocation(line: 1654, column: 3, scope: !1136)
!1141 = !DILocation(line: 1655, column: 12, scope: !1139)
!1142 = !DILocalVariable(name: "filename", arg: 1, scope: !1143, file: !3, line: 1333, type: !24)
!1143 = distinct !DISubprogram(name: "do_statfs", scope: !3, file: !3, line: 1333, type: !1144, isLocal: true, isDefinition: true, scopeLine: 1334, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1146)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!23, !24, !24}
!1146 = !{!1142, !1147, !1148, !1149}
!1147 = !DILocalVariable(name: "format", arg: 2, scope: !1143, file: !3, line: 1333, type: !24)
!1148 = !DILocalVariable(name: "statfsbuf", scope: !1143, file: !3, line: 1335, type: !97)
!1149 = !DILocalVariable(name: "fail", scope: !1143, file: !3, line: 1351, type: !23)
!1150 = !DILocation(line: 1333, column: 24, scope: !1143, inlinedAt: !1151)
!1151 = distinct !DILocation(line: 1656, column: 14, scope: !1139)
!1152 = !DILocation(line: 1333, column: 46, scope: !1143, inlinedAt: !1151)
!1153 = !DILocation(line: 1335, column: 3, scope: !1143, inlinedAt: !1151)
!1154 = !DILocation(line: 1337, column: 7, scope: !1155, inlinedAt: !1151)
!1155 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 1337, column: 7)
!1156 = !DILocation(line: 1337, column: 7, scope: !1143, inlinedAt: !1151)
!1157 = !DILocation(line: 1339, column: 20, scope: !1158, inlinedAt: !1151)
!1158 = distinct !DILexicalBlock(scope: !1155, file: !3, line: 1338, column: 5)
!1159 = !DILocation(line: 1340, column: 47, scope: !1158, inlinedAt: !1151)
!1160 = !DILocation(line: 1339, column: 7, scope: !1158, inlinedAt: !1151)
!1161 = !DILocation(line: 1341, column: 7, scope: !1158, inlinedAt: !1151)
!1162 = !DILocation(line: 1335, column: 18, scope: !1143, inlinedAt: !1151)
!1163 = !DILocation(line: 1344, column: 7, scope: !1164, inlinedAt: !1151)
!1164 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 1344, column: 7)
!1165 = !DILocation(line: 1344, column: 37, scope: !1164, inlinedAt: !1151)
!1166 = !DILocation(line: 1344, column: 7, scope: !1143, inlinedAt: !1151)
!1167 = !DILocation(line: 1346, column: 17, scope: !1168, inlinedAt: !1151)
!1168 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 1345, column: 5)
!1169 = !DILocation(line: 1346, column: 24, scope: !1168, inlinedAt: !1151)
!1170 = !DILocation(line: 1347, column: 14, scope: !1168, inlinedAt: !1151)
!1171 = !DILocation(line: 1346, column: 7, scope: !1168, inlinedAt: !1151)
!1172 = !DILocation(line: 1348, column: 7, scope: !1168, inlinedAt: !1151)
!1173 = !DILocation(line: 1351, column: 15, scope: !1143, inlinedAt: !1151)
!1174 = !DILocation(line: 1352, column: 10, scope: !1143, inlinedAt: !1151)
!1175 = !DILocation(line: 1353, column: 1, scope: !1143, inlinedAt: !1151)
!1176 = !DILocalVariable(name: "filename", arg: 1, scope: !1177, file: !3, line: 1357, type: !24)
!1177 = distinct !DISubprogram(name: "do_stat", scope: !3, file: !3, line: 1357, type: !1178, isLocal: true, isDefinition: true, scopeLine: 1359, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1180)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!23, !24, !24, !24}
!1180 = !{!1176, !1181, !1182, !1183, !1184, !1185}
!1181 = !DILocalVariable(name: "format", arg: 2, scope: !1177, file: !3, line: 1357, type: !24)
