; ModuleID = 'coreutils-8.27/src/sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [48 x i8] c"Print checksum and block counts for each FILE.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.16 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 44, type: !76, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !41, globals: !50)
!3 = !DIFile(filename: "src/sum.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19, !28}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 45, size: 32, elements: !21)
!20 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!23 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!24 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!25 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!26 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!27 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 43, size: 32, elements: !30)
!29 = !DIFile(filename: "./lib/human.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!31 = !DIEnumerator(name: "human_ceiling", value: 0)
!32 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!33 = !DIEnumerator(name: "human_floor", value: 2)
!34 = !DIEnumerator(name: "human_group_digits", value: 4)
!35 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!36 = !DIEnumerator(name: "human_autoscale", value: 16)
!37 = !DIEnumerator(name: "human_base_1024", value: 32)
!38 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!39 = !DIEnumerator(name: "human_SI", value: 128)
!40 = !DIEnumerator(name: "human_B", value: 256)
!41 = !{!42, !44, !45, !46, !47}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 62, baseType: !49)
!48 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!49 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!50 = !{!51, !54, !0}
!51 = !DIGlobalVariableExpression(var: !52)
!52 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 42, type: !53, isLocal: true, isDefinition: true)
!53 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!54 = !DIGlobalVariableExpression(var: !55)
!55 = distinct !DIGlobalVariable(name: "infomap", scope: !56, file: !57, line: 632, type: !73, isLocal: true, isDefinition: true)
!56 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !57, file: !57, line: 630, type: !58, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !62)
!57 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!62 = !{!63, !64, !65, !72}
!63 = !DILocalVariable(name: "program", arg: 1, scope: !56, file: !57, line: 630, type: !60)
!64 = !DILocalVariable(name: "node", scope: !56, file: !57, line: 642, type: !60)
!65 = !DILocalVariable(name: "map_prog", scope: !56, file: !57, line: 643, type: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !56, file: !57, line: 632, size: 128, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !68, file: !57, line: 632, baseType: !60, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !68, file: !57, line: 632, baseType: !60, size: 64, offset: 64)
!72 = !DILocalVariable(name: "lc_messages", scope: !56, file: !57, line: 655, type: !60)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 896, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 7)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 1024, elements: !87)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !79, line: 50, size: 256, elements: !80)
!79 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!80 = !{!81, !82, !84, !86}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !79, line: 52, baseType: !60, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !78, file: !79, line: 55, baseType: !83, size: 32, offset: 64)
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !78, file: !79, line: 56, baseType: !85, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !78, file: !79, line: 57, baseType: !83, size: 32, offset: 192)
!87 = !{!88}
!88 = !DISubrange(count: 4)
!89 = !DIGlobalVariableExpression(var: !90)
!90 = distinct !DIGlobalVariable(name: "Version", scope: !91, file: !92, line: 2, type: !60, isLocal: false, isDefinition: true)
!91 = distinct !DICompileUnit(language: DW_LANG_C99, file: !92, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !93, globals: !94)
!92 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!93 = !{}
!94 = !{!89}
!95 = !DIGlobalVariableExpression(var: !96)
!96 = distinct !DIGlobalVariable(name: "file_name", scope: !97, file: !102, line: 36, type: !60, isLocal: true, isDefinition: true)
!97 = distinct !DICompileUnit(language: DW_LANG_C99, file: !98, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !93, globals: !99)
!98 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!99 = !{!95, !100}
!100 = !DIGlobalVariableExpression(var: !101)
!101 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !97, file: !102, line: 46, type: !53, isLocal: true, isDefinition: true)
!102 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!103 = !DIGlobalVariableExpression(var: !104)
!104 = distinct !DIGlobalVariable(name: "exit_failure", scope: !105, file: !108, line: 24, type: !109, isLocal: false, isDefinition: true)
!105 = distinct !DICompileUnit(language: DW_LANG_C99, file: !106, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !93, globals: !107)
!106 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!107 = !{!103}
!108 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!109 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !83)
!110 = !DIGlobalVariableExpression(var: !111)
!111 = distinct !DIGlobalVariable(name: "power_letter", scope: !112, file: !127, line: 36, type: !138, isLocal: true, isDefinition: true)
!112 = distinct !DICompileUnit(language: DW_LANG_C99, file: !113, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !114, retainedTypes: !123, globals: !124)
!113 = !DIFile(filename: "./lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!114 = !{!28, !115}
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !116, line: 26, size: 32, elements: !117)
!116 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!117 = !{!118, !119, !120, !121, !122}
!118 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!119 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!120 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!121 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!122 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!123 = !{!60}
!124 = !{!110, !125, !132}
!125 = !DIGlobalVariableExpression(var: !126)
!126 = distinct !DIGlobalVariable(name: "block_size_args", scope: !112, file: !127, line: 398, type: !128, isLocal: true, isDefinition: true)
!127 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 192, elements: !130)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!130 = !{!131}
!131 = !DISubrange(count: 3)
!132 = !DIGlobalVariableExpression(var: !133)
!133 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !112, file: !127, line: 399, type: !134, isLocal: true, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 64, elements: !136)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!136 = !{!137}
!137 = !DISubrange(count: 2)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 72, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 9)
!141 = !DIGlobalVariableExpression(var: !142)
!142 = distinct !DIGlobalVariable(name: "program_name", scope: !143, file: !147, line: 33, type: !60, isLocal: false, isDefinition: true)
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !93, retainedTypes: !145, globals: !146)
!144 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!145 = !{!44, !42}
!146 = !{!141}
!147 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!148 = !DIGlobalVariableExpression(var: !149)
!149 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !150, file: !178, line: 77, type: !214, isLocal: false, isDefinition: true)
!150 = distinct !DICompileUnit(language: DW_LANG_C99, file: !151, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !173, globals: !175)
!151 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!152 = !{!5, !153, !158}
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !154)
!154 = !{!155, !156, !157}
!155 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!156 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!157 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !159, line: 46, size: 32, elements: !160)
!159 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!161 = !DIEnumerator(name: "_ISupper", value: 256)
!162 = !DIEnumerator(name: "_ISlower", value: 512)
!163 = !DIEnumerator(name: "_ISalpha", value: 1024)
!164 = !DIEnumerator(name: "_ISdigit", value: 2048)
!165 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!166 = !DIEnumerator(name: "_ISspace", value: 8192)
!167 = !DIEnumerator(name: "_ISprint", value: 16384)
!168 = !DIEnumerator(name: "_ISgraph", value: 32768)
!169 = !DIEnumerator(name: "_ISblank", value: 1)
!170 = !DIEnumerator(name: "_IScntrl", value: 2)
!171 = !DIEnumerator(name: "_ISpunct", value: 4)
!172 = !DIEnumerator(name: "_ISalnum", value: 8)
!173 = !{!83, !174, !47, !42}
!174 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!175 = !{!148, !176, !183, !196, !198, !203, !210, !212}
!176 = !DIGlobalVariableExpression(var: !177)
!177 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !150, file: !178, line: 93, type: !179, isLocal: false, isDefinition: true)
!178 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 320, elements: !181)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!181 = !{!182}
!182 = !DISubrange(count: 10)
!183 = !DIGlobalVariableExpression(var: !184)
!184 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !150, file: !178, line: 1043, type: !185, isLocal: false, isDefinition: true)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !178, line: 57, size: 448, elements: !186)
!186 = !{!187, !188, !189, !194, !195}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !185, file: !178, line: 60, baseType: !5, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !185, file: !178, line: 63, baseType: !83, size: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !185, file: !178, line: 67, baseType: !190, size: 256, offset: 64)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 256, elements: !192)
!191 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!192 = !{!193}
!193 = !DISubrange(count: 8)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !185, file: !178, line: 70, baseType: !60, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !185, file: !178, line: 73, baseType: !60, size: 64, offset: 384)
!196 = !DIGlobalVariableExpression(var: !197)
!197 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !150, file: !178, line: 108, type: !185, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199)
!199 = distinct !DIGlobalVariable(name: "slot0", scope: !150, file: !178, line: 834, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 2048, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 256)
!203 = !DIGlobalVariableExpression(var: !204)
!204 = distinct !DIGlobalVariable(name: "slotvec", scope: !150, file: !178, line: 837, type: !205, isLocal: true, isDefinition: true)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !178, line: 826, size: 128, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !206, file: !178, line: 828, baseType: !47, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !206, file: !178, line: 829, baseType: !42, size: 64, offset: 64)
!210 = !DIGlobalVariableExpression(var: !211)
!211 = distinct !DIGlobalVariable(name: "nslots", scope: !150, file: !178, line: 835, type: !83, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213)
!213 = distinct !DIGlobalVariable(name: "slotvec0", scope: !150, file: !178, line: 836, type: !206, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 704, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 11)
!217 = !DIGlobalVariableExpression(var: !218)
!218 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !219, file: !222, line: 26, type: !223, isLocal: false, isDefinition: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !93, globals: !221)
!220 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!221 = !{!217}
!222 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 376, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 47)
!226 = !DIGlobalVariableExpression(var: !227)
!227 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !228, file: !233, line: 69, type: !234, isLocal: false, isDefinition: true)
!228 = distinct !DICompileUnit(language: DW_LANG_C99, file: !229, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !230, retainedTypes: !231, globals: !232)
!229 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!230 = !{!5}
!231 = !{!44, !46}
!232 = !{!226}
!233 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !235, line: 55, baseType: !236)
!235 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{null}
!239 = !DIGlobalVariableExpression(var: !240)
!240 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !241, file: !584, line: 120, type: !585, isLocal: true, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !243, retainedTypes: !582, globals: !583)
!242 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!243 = !{!244}
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !245, line: 41, size: 32, elements: !246)
!245 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581}
!247 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!248 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!249 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!250 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!251 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!252 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!253 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!254 = !DIEnumerator(name: "DAY_1", value: 131079)
!255 = !DIEnumerator(name: "DAY_2", value: 131080)
!256 = !DIEnumerator(name: "DAY_3", value: 131081)
!257 = !DIEnumerator(name: "DAY_4", value: 131082)
!258 = !DIEnumerator(name: "DAY_5", value: 131083)
!259 = !DIEnumerator(name: "DAY_6", value: 131084)
!260 = !DIEnumerator(name: "DAY_7", value: 131085)
!261 = !DIEnumerator(name: "ABMON_1", value: 131086)
!262 = !DIEnumerator(name: "ABMON_2", value: 131087)
!263 = !DIEnumerator(name: "ABMON_3", value: 131088)
!264 = !DIEnumerator(name: "ABMON_4", value: 131089)
!265 = !DIEnumerator(name: "ABMON_5", value: 131090)
!266 = !DIEnumerator(name: "ABMON_6", value: 131091)
!267 = !DIEnumerator(name: "ABMON_7", value: 131092)
!268 = !DIEnumerator(name: "ABMON_8", value: 131093)
!269 = !DIEnumerator(name: "ABMON_9", value: 131094)
!270 = !DIEnumerator(name: "ABMON_10", value: 131095)
!271 = !DIEnumerator(name: "ABMON_11", value: 131096)
!272 = !DIEnumerator(name: "ABMON_12", value: 131097)
!273 = !DIEnumerator(name: "MON_1", value: 131098)
!274 = !DIEnumerator(name: "MON_2", value: 131099)
!275 = !DIEnumerator(name: "MON_3", value: 131100)
!276 = !DIEnumerator(name: "MON_4", value: 131101)
!277 = !DIEnumerator(name: "MON_5", value: 131102)
!278 = !DIEnumerator(name: "MON_6", value: 131103)
!279 = !DIEnumerator(name: "MON_7", value: 131104)
!280 = !DIEnumerator(name: "MON_8", value: 131105)
!281 = !DIEnumerator(name: "MON_9", value: 131106)
!282 = !DIEnumerator(name: "MON_10", value: 131107)
!283 = !DIEnumerator(name: "MON_11", value: 131108)
!284 = !DIEnumerator(name: "MON_12", value: 131109)
!285 = !DIEnumerator(name: "AM_STR", value: 131110)
!286 = !DIEnumerator(name: "PM_STR", value: 131111)
!287 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!288 = !DIEnumerator(name: "D_FMT", value: 131113)
!289 = !DIEnumerator(name: "T_FMT", value: 131114)
!290 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!291 = !DIEnumerator(name: "ERA", value: 131116)
!292 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!293 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!294 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!295 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!296 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!297 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!298 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!299 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!300 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!301 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!302 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!303 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!304 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!305 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!306 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!307 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!308 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!309 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!310 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!311 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!312 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!313 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!314 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!315 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!316 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!317 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!318 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!319 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!320 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!321 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!322 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!323 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!324 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!325 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!326 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!327 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!328 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!329 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!330 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!331 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!332 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!333 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!334 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!335 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!336 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!337 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!338 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!339 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!340 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!341 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!342 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!343 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!344 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!345 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!346 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!347 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!348 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!349 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!350 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!351 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!352 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!353 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!354 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!355 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!356 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!357 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!358 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!359 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!360 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!361 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!362 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!363 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!364 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!365 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!366 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!367 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!368 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!369 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!370 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!371 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!372 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!373 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!374 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!375 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!376 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!377 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!378 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!379 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!380 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!381 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!382 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!383 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!384 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!385 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!386 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!387 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!388 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!389 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!390 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!391 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!392 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!393 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!394 = !DIEnumerator(name: "CODESET", value: 14)
!395 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!396 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!397 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!398 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!399 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!400 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!401 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!402 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!403 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!404 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!405 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!406 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!407 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!408 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!409 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!410 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!411 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!412 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!413 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!414 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!415 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!416 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!417 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!418 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!419 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!420 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!421 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!422 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!423 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!424 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!425 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!426 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!427 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!428 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!429 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!430 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!431 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!432 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!433 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!434 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!435 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!436 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!437 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!438 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!439 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!440 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!441 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!442 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!443 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!444 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!445 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!446 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!447 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!448 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!449 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!450 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!451 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!452 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!453 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!454 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!455 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!456 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!457 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!458 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!459 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!460 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!461 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!462 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!463 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!464 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!465 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!466 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!467 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!468 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!469 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!470 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!471 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!472 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!473 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!474 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!475 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!476 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!477 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!478 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!479 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!480 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!481 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!482 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!483 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!484 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!485 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!486 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!487 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!488 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!489 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!490 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!491 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!492 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!493 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!494 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!495 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!496 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!497 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!498 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!499 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!500 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!501 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!502 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!503 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!504 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!505 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!506 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!507 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!508 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!509 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!510 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!511 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!512 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!513 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!514 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!515 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!516 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!517 = !DIEnumerator(name: "THOUSEP", value: 65537)
!518 = !DIEnumerator(name: "__GROUPING", value: 65538)
!519 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!520 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!521 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!522 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!523 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!524 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!525 = !DIEnumerator(name: "__YESSTR", value: 327682)
!526 = !DIEnumerator(name: "__NOSTR", value: 327683)
!527 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!528 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!529 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!530 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!531 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!532 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!533 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!534 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!535 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!536 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!537 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!538 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!539 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!540 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!541 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!542 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!543 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!544 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!545 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!546 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!547 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!548 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!549 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!550 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!551 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!552 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!553 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!554 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!555 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!556 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!557 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!558 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!559 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!560 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!561 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!562 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!563 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!564 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!565 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!566 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!567 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!568 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!569 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!570 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!571 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!572 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!573 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!574 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!575 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!576 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!577 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!578 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!579 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!580 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!581 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!582 = !{!44, !42, !45}
!583 = !{!239}
!584 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!585 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!586 = distinct !DICompileUnit(language: DW_LANG_C99, file: !587, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !588)
!587 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!588 = !{!19}
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !590, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !591)
!590 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!591 = !{!592}
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !594, file: !593, line: 62, size: 32, elements: !610)
!593 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!594 = distinct !DISubprogram(name: "safe_read", scope: !593, file: !593, line: 56, type: !595, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !589, variables: !597)
!595 = !DISubroutineType(types: !596)
!596 = !{!47, !83, !44, !47}
!597 = !{!598, !599, !600, !601}
!598 = !DILocalVariable(name: "fd", arg: 1, scope: !594, file: !593, line: 56, type: !83)
!599 = !DILocalVariable(name: "buf", arg: 2, scope: !594, file: !593, line: 56, type: !44)
!600 = !DILocalVariable(name: "count", arg: 3, scope: !594, file: !593, line: 56, type: !47)
!601 = !DILocalVariable(name: "result", scope: !602, file: !593, line: 66, type: !605)
!602 = distinct !DILexicalBlock(scope: !603, file: !593, line: 65, column: 5)
!603 = distinct !DILexicalBlock(scope: !604, file: !593, line: 64, column: 3)
!604 = distinct !DILexicalBlock(scope: !594, file: !593, line: 64, column: 3)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !606, line: 109, baseType: !607)
!606 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !608, line: 181, baseType: !609)
!608 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!609 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!610 = !{!611}
!611 = !DIEnumerator(name: "BUGGY_READ_MAXIMUM", value: 2147475456)
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !614, retainedTypes: !619)
!613 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!614 = !{!615}
!615 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !616, line: 41, size: 32, elements: !617)
!616 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!617 = !{!618}
!618 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!619 = !{!44}
!620 = distinct !DICompileUnit(language: DW_LANG_C99, file: !621, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !622, retainedTypes: !636)
!621 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!622 = !{!623}
!623 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !625, file: !624, line: 192, size: 32, elements: !634)
!624 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!625 = distinct !DISubprogram(name: "x2nrealloc", scope: !624, file: !624, line: 180, type: !626, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !620, variables: !629)
!626 = !DISubroutineType(types: !627)
!627 = !{!44, !44, !628, !47}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!629 = !{!630, !631, !632, !633}
!630 = !DILocalVariable(name: "p", arg: 1, scope: !625, file: !624, line: 180, type: !44)
!631 = !DILocalVariable(name: "pn", arg: 2, scope: !625, file: !624, line: 180, type: !628)
!632 = !DILocalVariable(name: "s", arg: 3, scope: !625, file: !624, line: 180, type: !47)
!633 = !DILocalVariable(name: "n", scope: !625, file: !624, line: 182, type: !47)
!634 = !{!635}
!635 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!636 = !{!47, !42, !44}
!637 = distinct !DICompileUnit(language: DW_LANG_C99, file: !638, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !93)
!638 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !641, retainedTypes: !642)
!640 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!641 = !{!115, !158}
!642 = !{!83, !174}
!643 = distinct !DICompileUnit(language: DW_LANG_C99, file: !644, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !93, retainedTypes: !619)
!644 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!645 = distinct !DICompileUnit(language: DW_LANG_C99, file: !646, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !93)
!646 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !93, retainedTypes: !619)
!648 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !93, retainedTypes: !619)
!650 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !93, retainedTypes: !653)
!652 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!653 = !{!47}
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !93)
!655 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!656 = distinct !DICompileUnit(language: DW_LANG_C99, file: !657, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !93)
!657 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!658 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!659 = !{i32 2, !"Dwarf Version", i32 4}
!660 = !{i32 2, !"Debug Info Version", i32 3}
!661 = !{i32 1, !"wchar_size", i32 4}
!662 = !{i32 7, !"PIC Level", i32 2}
!663 = !{i32 7, !"PIE Level", i32 2}
!664 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 53, type: !665, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !667)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !83}
!667 = !{!668}
!668 = !DILocalVariable(name: "status", arg: 1, scope: !664, file: !3, line: 53, type: !83)
!669 = !DIExpression()
!670 = !DILocation(line: 53, column: 12, scope: !664)
!671 = !DILocation(line: 55, column: 14, scope: !672)
!672 = distinct !DILexicalBlock(scope: !664, file: !3, line: 55, column: 7)
!673 = !DILocation(line: 55, column: 7, scope: !664)
!674 = !DILocation(line: 56, column: 5, scope: !675)
!675 = distinct !DILexicalBlock(scope: !672, file: !3, line: 56, column: 5)
!676 = !{!677, !677, i64 0}
!677 = !{!"any pointer", !678, i64 0}
!678 = !{!"omnipotent char", !679, i64 0}
!679 = !{!"Simple C/C++ TBAA"}
!680 = !DILocation(line: 59, column: 7, scope: !681)
!681 = distinct !DILexicalBlock(scope: !672, file: !3, line: 58, column: 5)
!682 = !DILocation(line: 63, column: 7, scope: !681)
!683 = !DILocation(line: 580, column: 3, scope: !684, inlinedAt: !685)
!684 = distinct !DISubprogram(name: "emit_stdin_note", scope: !57, file: !57, line: 578, type: !237, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !93)
!685 = distinct !DILocation(line: 67, column: 7, scope: !681)
!686 = !DILocation(line: 69, column: 7, scope: !681)
!687 = !DILocation(line: 74, column: 7, scope: !681)
!688 = !DILocation(line: 75, column: 7, scope: !681)
!689 = !DILocation(line: 642, column: 15, scope: !56, inlinedAt: !690)
!690 = distinct !DILocation(line: 76, column: 7, scope: !681)
!691 = !DILocation(line: 651, column: 3, scope: !56, inlinedAt: !690)
!692 = !DILocation(line: 655, column: 29, scope: !56, inlinedAt: !690)
!693 = !DILocation(line: 655, column: 15, scope: !56, inlinedAt: !690)
!694 = !DILocation(line: 656, column: 7, scope: !695, inlinedAt: !690)
!695 = distinct !DILexicalBlock(scope: !56, file: !57, line: 656, column: 7)
!696 = !DILocation(line: 656, column: 19, scope: !695, inlinedAt: !690)
!697 = !DILocation(line: 656, column: 22, scope: !695, inlinedAt: !690)
!698 = !DILocation(line: 656, column: 7, scope: !56, inlinedAt: !690)
!699 = !DILocation(line: 662, column: 7, scope: !700, inlinedAt: !690)
!700 = distinct !DILexicalBlock(scope: !695, file: !57, line: 657, column: 5)
!701 = !DILocation(line: 664, column: 5, scope: !700, inlinedAt: !690)
!702 = !DILocation(line: 665, column: 3, scope: !56, inlinedAt: !690)
!703 = !DILocation(line: 667, column: 3, scope: !56, inlinedAt: !690)
!704 = !DILocation(line: 78, column: 3, scope: !664)
!705 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 222, type: !706, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !709)
!706 = !DISubroutineType(types: !707)
!707 = !{!83, !83, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!709 = !{!710, !711, !712, !713, !714, !715}
!710 = !DILocalVariable(name: "argc", arg: 1, scope: !705, file: !3, line: 222, type: !83)
!711 = !DILocalVariable(name: "argv", arg: 2, scope: !705, file: !3, line: 222, type: !708)
!712 = !DILocalVariable(name: "ok", scope: !705, file: !3, line: 224, type: !53)
!713 = !DILocalVariable(name: "optc", scope: !705, file: !3, line: 225, type: !83)
!714 = !DILocalVariable(name: "files_given", scope: !705, file: !3, line: 226, type: !83)
!715 = !DILocalVariable(name: "sum_func", scope: !705, file: !3, line: 227, type: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!53, !60, !83}
!719 = !DILocation(line: 222, column: 11, scope: !705)
!720 = !DILocation(line: 222, column: 24, scope: !705)
!721 = !DILocation(line: 227, column: 10, scope: !705)
!722 = !DILocation(line: 230, column: 21, scope: !705)
!723 = !DILocation(line: 230, column: 3, scope: !705)
!724 = !DILocation(line: 231, column: 3, scope: !705)
!725 = !DILocation(line: 232, column: 3, scope: !705)
!726 = !DILocation(line: 233, column: 3, scope: !705)
!727 = !DILocation(line: 235, column: 3, scope: !705)
!728 = !DILocation(line: 239, column: 12, scope: !705)
!729 = !DILocation(line: 239, column: 3, scope: !705)
!730 = !DILocation(line: 243, column: 3, scope: !705)
!731 = !DILocation(line: 243, column: 18, scope: !705)
!732 = !DILocation(line: 225, column: 7, scope: !705)
!733 = distinct !{!733, !730, !734}
!734 = !DILocation(line: 262, column: 5, scope: !705)
!735 = !DILocation(line: 253, column: 11, scope: !736)
!736 = distinct !DILexicalBlock(scope: !737, file: !3, line: 246, column: 9)
!737 = distinct !DILexicalBlock(scope: !705, file: !3, line: 244, column: 5)
!738 = !DILocation(line: 255, column: 9, scope: !736)
!739 = !DILocation(line: 257, column: 9, scope: !736)
!740 = !DILocation(line: 260, column: 11, scope: !736)
!741 = !DILocation(line: 264, column: 24, scope: !705)
!742 = !{!743, !743, i64 0}
!743 = !{!"int", !678, i64 0}
!744 = !DILocation(line: 264, column: 22, scope: !705)
!745 = !DILocation(line: 226, column: 7, scope: !705)
!746 = !DILocation(line: 265, column: 19, scope: !747)
!747 = distinct !DILexicalBlock(scope: !705, file: !3, line: 265, column: 7)
!748 = !DILocation(line: 265, column: 7, scope: !705)
!749 = !DILocation(line: 266, column: 10, scope: !747)
!750 = !DILocation(line: 266, column: 8, scope: !747)
!751 = !DILocation(line: 224, column: 8, scope: !705)
!752 = !DILocation(line: 266, column: 5, scope: !747)
!753 = !DILocation(line: 268, column: 28, scope: !754)
!754 = distinct !DILexicalBlock(scope: !755, file: !3, line: 268, column: 5)
!755 = distinct !DILexicalBlock(scope: !747, file: !3, line: 268, column: 5)
!756 = !DILocation(line: 268, column: 5, scope: !755)
!757 = !DILocation(line: 269, column: 23, scope: !754)
!758 = !DILocation(line: 269, column: 13, scope: !754)
!759 = !DILocation(line: 269, column: 10, scope: !754)
!760 = !DILocation(line: 268, column: 42, scope: !754)
!761 = distinct !{!761, !756, !762}
!762 = !DILocation(line: 269, column: 48, scope: !755)
!763 = !DILocation(line: 271, column: 23, scope: !764)
!764 = distinct !DILexicalBlock(scope: !705, file: !3, line: 271, column: 7)
!765 = !DILocation(line: 271, column: 34, scope: !764)
!766 = !DILocation(line: 271, column: 26, scope: !764)
!767 = !DILocation(line: 271, column: 41, scope: !764)
!768 = !DILocation(line: 271, column: 7, scope: !705)
!769 = !DILocation(line: 272, column: 5, scope: !764)
!770 = !DILocation(line: 273, column: 10, scope: !705)
!771 = !DILocation(line: 274, column: 1, scope: !705)
!772 = distinct !DISubprogram(name: "bsd_sum_file", scope: !3, file: !3, line: 88, type: !717, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !773)
!773 = !{!774, !775, !776, !830, !831, !835, !836, !840}
!774 = !DILocalVariable(name: "file", arg: 1, scope: !772, file: !3, line: 88, type: !60)
!775 = !DILocalVariable(name: "print_name", arg: 2, scope: !772, file: !3, line: 88, type: !83)
!776 = !DILocalVariable(name: "fp", scope: !772, file: !3, line: 90, type: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !779, line: 7, baseType: !780)
!779 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !781, line: 241, size: 1728, elements: !782)
!781 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !803, !804, !805, !806, !808, !809, !811, !815, !818, !820, !821, !822, !823, !824, !825, !826}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !780, file: !781, line: 242, baseType: !83, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !780, file: !781, line: 247, baseType: !42, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !780, file: !781, line: 248, baseType: !42, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !780, file: !781, line: 249, baseType: !42, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !780, file: !781, line: 250, baseType: !42, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !780, file: !781, line: 251, baseType: !42, size: 64, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !780, file: !781, line: 252, baseType: !42, size: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !780, file: !781, line: 253, baseType: !42, size: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !780, file: !781, line: 254, baseType: !42, size: 64, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !780, file: !781, line: 256, baseType: !42, size: 64, offset: 576)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !780, file: !781, line: 257, baseType: !42, size: 64, offset: 640)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !780, file: !781, line: 258, baseType: !42, size: 64, offset: 704)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !780, file: !781, line: 260, baseType: !796, size: 64, offset: 768)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !781, line: 156, size: 192, elements: !798)
!798 = !{!799, !800, !802}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !797, file: !781, line: 157, baseType: !796, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !797, file: !781, line: 158, baseType: !801, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !797, file: !781, line: 162, baseType: !83, size: 32, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !780, file: !781, line: 262, baseType: !801, size: 64, offset: 832)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !780, file: !781, line: 264, baseType: !83, size: 32, offset: 896)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !780, file: !781, line: 268, baseType: !83, size: 32, offset: 928)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !780, file: !781, line: 270, baseType: !807, size: 64, offset: 960)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !608, line: 140, baseType: !609)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !780, file: !781, line: 274, baseType: !174, size: 16, offset: 1024)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !780, file: !781, line: 275, baseType: !810, size: 8, offset: 1040)
!810 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !780, file: !781, line: 276, baseType: !812, size: 8, offset: 1048)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 1)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !780, file: !781, line: 280, baseType: !816, size: 64, offset: 1088)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !781, line: 150, baseType: null)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !780, file: !781, line: 289, baseType: !819, size: 64, offset: 1152)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !608, line: 141, baseType: !609)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !780, file: !781, line: 297, baseType: !44, size: 64, offset: 1216)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !780, file: !781, line: 298, baseType: !44, size: 64, offset: 1280)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !780, file: !781, line: 299, baseType: !44, size: 64, offset: 1344)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !780, file: !781, line: 300, baseType: !44, size: 64, offset: 1408)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !780, file: !781, line: 302, baseType: !47, size: 64, offset: 1472)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !780, file: !781, line: 303, baseType: !83, size: 32, offset: 1536)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !780, file: !781, line: 305, baseType: !827, size: 160, offset: 1568)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 20)
!830 = !DILocalVariable(name: "checksum", scope: !772, file: !3, line: 91, type: !83)
!831 = !DILocalVariable(name: "total_bytes", scope: !772, file: !3, line: 92, type: !832)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !833, line: 112, baseType: !834)
!833 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !608, line: 62, baseType: !49)
!835 = !DILocalVariable(name: "ch", scope: !772, file: !3, line: 93, type: !83)
!836 = !DILocalVariable(name: "hbuf", scope: !772, file: !3, line: 94, type: !837)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 5216, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 652)
!840 = !DILocalVariable(name: "is_stdin", scope: !772, file: !3, line: 95, type: !53)
!841 = !DILocation(line: 88, column: 27, scope: !772)
!842 = !DILocation(line: 88, column: 37, scope: !772)
!843 = !DILocation(line: 91, column: 7, scope: !772)
!844 = !DILocation(line: 92, column: 13, scope: !772)
!845 = !DILocation(line: 94, column: 3, scope: !772)
!846 = !DILocation(line: 94, column: 8, scope: !772)
!847 = !DILocation(line: 95, column: 19, scope: !772)
!848 = !DILocation(line: 97, column: 7, scope: !772)
!849 = !DILocation(line: 99, column: 12, scope: !850)
!850 = distinct !DILexicalBlock(scope: !851, file: !3, line: 98, column: 5)
!851 = distinct !DILexicalBlock(scope: !772, file: !3, line: 97, column: 7)
!852 = !DILocation(line: 90, column: 9, scope: !772)
!853 = !DILocation(line: 102, column: 5, scope: !850)
!854 = !DILocation(line: 105, column: 12, scope: !855)
!855 = distinct !DILexicalBlock(scope: !851, file: !3, line: 104, column: 5)
!856 = !DILocation(line: 106, column: 14, scope: !857)
!857 = distinct !DILexicalBlock(scope: !855, file: !3, line: 106, column: 11)
!858 = !DILocation(line: 106, column: 11, scope: !855)
!859 = !DILocation(line: 108, column: 21, scope: !860)
!860 = distinct !DILexicalBlock(scope: !857, file: !3, line: 107, column: 9)
!861 = !DILocation(line: 108, column: 34, scope: !860)
!862 = !DILocation(line: 108, column: 11, scope: !860)
!863 = !DILocation(line: 109, column: 11, scope: !860)
!864 = !DILocation(line: 113, column: 3, scope: !772)
!865 = !DILocation(line: 115, column: 3, scope: !772)
!866 = !DILocalVariable(name: "__fp", arg: 1, scope: !867, file: !868, line: 63, type: !777)
!867 = distinct !DISubprogram(name: "getc_unlocked", scope: !868, file: !868, line: 63, type: !869, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !871)
!868 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!869 = !DISubroutineType(types: !870)
!870 = !{!83, !777}
!871 = !{!866}
!872 = !DILocation(line: 63, column: 22, scope: !867, inlinedAt: !873)
!873 = distinct !DILocation(line: 115, column: 16, scope: !772)
!874 = !DILocation(line: 65, column: 10, scope: !867, inlinedAt: !873)
!875 = !{!876, !677, i64 8}
!876 = !{!"_IO_FILE", !743, i64 0, !677, i64 8, !677, i64 16, !677, i64 24, !677, i64 32, !677, i64 40, !677, i64 48, !677, i64 56, !677, i64 64, !677, i64 72, !677, i64 80, !677, i64 88, !677, i64 96, !677, i64 104, !743, i64 112, !743, i64 116, !877, i64 120, !878, i64 128, !678, i64 130, !678, i64 131, !677, i64 136, !877, i64 144, !677, i64 152, !677, i64 160, !677, i64 168, !677, i64 176, !877, i64 184, !743, i64 192, !678, i64 196}
!877 = !{!"long", !678, i64 0}
!878 = !{!"short", !678, i64 0}
!879 = !{!876, !677, i64 16}
!880 = !{!"branch_weights", i32 2000, i32 1}
!881 = !{!678, !678, i64 0}
!882 = !DILocation(line: 93, column: 7, scope: !772)
!883 = !DILocation(line: 115, column: 27, scope: !772)
!884 = !DILocation(line: 117, column: 18, scope: !885)
!885 = distinct !DILexicalBlock(scope: !772, file: !3, line: 116, column: 5)
!886 = !DILocation(line: 118, column: 28, scope: !885)
!887 = !DILocation(line: 118, column: 52, scope: !885)
!888 = !DILocation(line: 118, column: 34, scope: !885)
!889 = !DILocation(line: 119, column: 16, scope: !885)
!890 = !DILocation(line: 120, column: 16, scope: !885)
!891 = distinct !{!891, !865, !892}
!892 = !DILocation(line: 121, column: 5, scope: !772)
!893 = !DILocalVariable(name: "__stream", arg: 1, scope: !894, file: !868, line: 132, type: !777)
!894 = distinct !DISubprogram(name: "ferror_unlocked", scope: !868, file: !868, line: 132, type: !869, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !895)
!895 = !{!893}
!896 = !DILocation(line: 132, column: 1, scope: !894, inlinedAt: !897)
!897 = distinct !DILocation(line: 123, column: 7, scope: !898)
!898 = distinct !DILexicalBlock(scope: !772, file: !3, line: 123, column: 7)
!899 = !DILocation(line: 134, column: 10, scope: !894, inlinedAt: !897)
!900 = !{!876, !743, i64 0}
!901 = !DILocation(line: 123, column: 7, scope: !898)
!902 = !DILocation(line: 123, column: 7, scope: !772)
!903 = !DILocation(line: 125, column: 17, scope: !904)
!904 = distinct !DILexicalBlock(scope: !898, file: !3, line: 124, column: 5)
!905 = !DILocation(line: 125, column: 30, scope: !904)
!906 = !DILocation(line: 125, column: 7, scope: !904)
!907 = !DILocation(line: 126, column: 11, scope: !904)
!908 = !DILocation(line: 127, column: 9, scope: !909)
!909 = distinct !DILexicalBlock(scope: !904, file: !3, line: 126, column: 11)
!910 = !DILocation(line: 131, column: 17, scope: !911)
!911 = distinct !DILexicalBlock(scope: !772, file: !3, line: 131, column: 7)
!912 = !DILocation(line: 131, column: 20, scope: !911)
!913 = !DILocation(line: 131, column: 32, scope: !911)
!914 = !DILocation(line: 131, column: 7, scope: !772)
!915 = !DILocation(line: 133, column: 17, scope: !916)
!916 = distinct !DILexicalBlock(scope: !911, file: !3, line: 132, column: 5)
!917 = !DILocation(line: 133, column: 30, scope: !916)
!918 = !DILocation(line: 133, column: 7, scope: !916)
!919 = !DILocation(line: 134, column: 7, scope: !916)
!920 = !DILocation(line: 137, column: 3, scope: !772)
!921 = !DILocation(line: 139, column: 18, scope: !922)
!922 = distinct !DILexicalBlock(scope: !772, file: !3, line: 139, column: 7)
!923 = !DILocation(line: 139, column: 7, scope: !772)
!924 = !DILocation(line: 140, column: 5, scope: !922)
!925 = !DILocalVariable(name: "__c", arg: 1, scope: !926, file: !868, line: 105, type: !83)
!926 = distinct !DISubprogram(name: "putchar_unlocked", scope: !868, file: !868, line: 105, type: !927, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !929)
!927 = !DISubroutineType(types: !928)
!928 = !{!83, !83}
!929 = !{!925}
!930 = !DILocation(line: 105, column: 23, scope: !926, inlinedAt: !931)
!931 = distinct !DILocation(line: 141, column: 3, scope: !772)
!932 = !DILocation(line: 107, column: 10, scope: !926, inlinedAt: !931)
!933 = !{!876, !677, i64 40}
!934 = !{!876, !677, i64 48}
!935 = !DILocation(line: 144, column: 1, scope: !772)
!936 = distinct !DISubprogram(name: "sysv_sum_file", scope: !3, file: !3, line: 152, type: !717, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !937)
!937 = !{!938, !939, !940, !941, !945, !946, !947, !948, !949, !950, !951, !953}
!938 = !DILocalVariable(name: "file", arg: 1, scope: !936, file: !3, line: 152, type: !60)
!939 = !DILocalVariable(name: "print_name", arg: 2, scope: !936, file: !3, line: 152, type: !83)
!940 = !DILocalVariable(name: "fd", scope: !936, file: !3, line: 154, type: !83)
!941 = !DILocalVariable(name: "buf", scope: !936, file: !3, line: 155, type: !942)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 65536, elements: !943)
!943 = !{!944}
!944 = !DISubrange(count: 8192)
!945 = !DILocalVariable(name: "total_bytes", scope: !936, file: !3, line: 156, type: !832)
!946 = !DILocalVariable(name: "hbuf", scope: !936, file: !3, line: 157, type: !837)
!947 = !DILocalVariable(name: "r", scope: !936, file: !3, line: 158, type: !83)
!948 = !DILocalVariable(name: "checksum", scope: !936, file: !3, line: 159, type: !83)
!949 = !DILocalVariable(name: "s", scope: !936, file: !3, line: 162, type: !191)
!950 = !DILocalVariable(name: "is_stdin", scope: !936, file: !3, line: 164, type: !53)
!951 = !DILocalVariable(name: "i", scope: !952, file: !3, line: 184, type: !47)
!952 = distinct !DILexicalBlock(scope: !936, file: !3, line: 183, column: 5)
!953 = !DILocalVariable(name: "bytes_read", scope: !952, file: !3, line: 185, type: !47)
!954 = !DILocation(line: 152, column: 28, scope: !936)
!955 = !DILocation(line: 152, column: 38, scope: !936)
!956 = !DILocation(line: 155, column: 3, scope: !936)
!957 = !DILocation(line: 155, column: 17, scope: !936)
!958 = !DILocation(line: 156, column: 13, scope: !936)
!959 = !DILocation(line: 157, column: 3, scope: !936)
!960 = !DILocation(line: 157, column: 8, scope: !936)
!961 = !DILocation(line: 162, column: 16, scope: !936)
!962 = !DILocation(line: 164, column: 19, scope: !936)
!963 = !DILocation(line: 166, column: 7, scope: !936)
!964 = !DILocation(line: 154, column: 7, scope: !936)
!965 = !DILocation(line: 171, column: 5, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !3, line: 167, column: 5)
!967 = distinct !DILexicalBlock(scope: !936, file: !3, line: 166, column: 7)
!968 = !DILocation(line: 174, column: 12, scope: !969)
!969 = distinct !DILexicalBlock(scope: !967, file: !3, line: 173, column: 5)
!970 = !DILocation(line: 175, column: 14, scope: !971)
!971 = distinct !DILexicalBlock(scope: !969, file: !3, line: 175, column: 11)
!972 = !DILocation(line: 175, column: 11, scope: !969)
!973 = !DILocation(line: 177, column: 21, scope: !974)
!974 = distinct !DILexicalBlock(scope: !971, file: !3, line: 176, column: 9)
!975 = !DILocation(line: 177, column: 34, scope: !974)
!976 = !DILocation(line: 177, column: 11, scope: !974)
!977 = !DILocation(line: 178, column: 11, scope: !974)
!978 = !DILocation(line: 182, column: 3, scope: !936)
!979 = !DILocation(line: 185, column: 27, scope: !952)
!980 = !DILocation(line: 185, column: 14, scope: !952)
!981 = !DILocation(line: 187, column: 11, scope: !952)
!982 = !DILocation(line: 192, column: 21, scope: !983)
!983 = distinct !DILexicalBlock(scope: !984, file: !3, line: 191, column: 9)
!984 = distinct !DILexicalBlock(scope: !952, file: !3, line: 190, column: 11)
!985 = !DILocation(line: 192, column: 34, scope: !983)
!986 = !DILocation(line: 192, column: 11, scope: !983)
!987 = !DILocation(line: 193, column: 15, scope: !983)
!988 = !DILocation(line: 194, column: 13, scope: !989)
!989 = distinct !DILexicalBlock(scope: !983, file: !3, line: 193, column: 15)
!990 = !DILocation(line: 184, column: 14, scope: !952)
!991 = !DILocation(line: 198, column: 7, scope: !992)
!992 = distinct !DILexicalBlock(scope: !952, file: !3, line: 198, column: 7)
!993 = !DILocation(line: 198, column: 36, scope: !994)
!994 = distinct !DILexicalBlock(scope: !992, file: !3, line: 198, column: 7)
!995 = !DILocation(line: 199, column: 14, scope: !994)
!996 = !DILocation(line: 199, column: 11, scope: !994)
!997 = distinct !{!997, !991, !998, !999, !1000}
!998 = !DILocation(line: 199, column: 19, scope: !992)
!999 = !{!"llvm.loop.vectorize.width", i32 1}
!1000 = !{!"llvm.loop.interleave.count", i32 1}
!1001 = !DILocation(line: 198, column: 21, scope: !994)
!1002 = distinct !{!1002, !991, !998, !1003, !999, !1000}
!1003 = !{!"llvm.loop.unroll.runtime.disable"}
!1004 = !DILocation(line: 200, column: 19, scope: !952)
!1005 = distinct !{!1005, !978, !1006}
!1006 = !DILocation(line: 201, column: 5, scope: !936)
!1007 = !DILocation(line: 203, column: 17, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !936, file: !3, line: 203, column: 7)
!1009 = !DILocation(line: 203, column: 20, scope: !1008)
!1010 = !DILocation(line: 203, column: 31, scope: !1008)
!1011 = !DILocation(line: 203, column: 7, scope: !936)
!1012 = !DILocation(line: 205, column: 17, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 204, column: 5)
!1014 = !DILocation(line: 205, column: 30, scope: !1013)
!1015 = !DILocation(line: 205, column: 7, scope: !1013)
!1016 = !DILocation(line: 206, column: 7, scope: !1013)
!1017 = !DILocation(line: 209, column: 10, scope: !936)
!1018 = !DILocation(line: 209, column: 40, scope: !936)
!1019 = !DILocation(line: 209, column: 20, scope: !936)
!1020 = !DILocation(line: 158, column: 7, scope: !936)
!1021 = !DILocation(line: 210, column: 17, scope: !936)
!1022 = !DILocation(line: 210, column: 32, scope: !936)
!1023 = !DILocation(line: 210, column: 27, scope: !936)
!1024 = !DILocation(line: 159, column: 7, scope: !936)
!1025 = !DILocation(line: 212, column: 3, scope: !936)
!1026 = !DILocation(line: 214, column: 7, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !936, file: !3, line: 214, column: 7)
!1028 = !DILocation(line: 214, column: 7, scope: !936)
!1029 = !DILocation(line: 215, column: 5, scope: !1027)
!1030 = !DILocation(line: 105, column: 23, scope: !926, inlinedAt: !1031)
!1031 = distinct !DILocation(line: 216, column: 3, scope: !936)
!1032 = !DILocation(line: 107, column: 10, scope: !926, inlinedAt: !1031)
!1033 = !DILocation(line: 219, column: 1, scope: !936)
!1034 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !102, file: !102, line: 41, type: !58, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !97, variables: !1035)
!1035 = !{!1036}
!1036 = !DILocalVariable(name: "file", arg: 1, scope: !1034, file: !102, line: 41, type: !60)
!1037 = !DILocation(line: 41, column: 41, scope: !1034)
!1038 = !DILocation(line: 43, column: 13, scope: !1034)
!1039 = !DILocation(line: 44, column: 1, scope: !1034)
!1040 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !102, file: !102, line: 78, type: !1041, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !97, variables: !1043)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !53}
!1043 = !{!1044}
!1044 = !DILocalVariable(name: "ignore", arg: 1, scope: !1040, file: !102, line: 78, type: !53)
!1045 = !DILocation(line: 78, column: 37, scope: !1040)
!1046 = !DILocation(line: 80, column: 16, scope: !1040)
!1047 = !{!1048, !1048, i64 0}
!1048 = !{!"_Bool", !678, i64 0}
!1049 = !DILocation(line: 81, column: 1, scope: !1040)
!1050 = distinct !DISubprogram(name: "close_stdout", scope: !102, file: !102, line: 107, type: !237, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, unit: !97, variables: !1051)
!1051 = !{!1052}
!1052 = !DILocalVariable(name: "write_error", scope: !1053, file: !102, line: 112, type: !60)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !102, line: 111, column: 5)
!1054 = distinct !DILexicalBlock(scope: !1050, file: !102, line: 109, column: 7)
!1055 = !DILocation(line: 109, column: 21, scope: !1054)
!1056 = !DILocation(line: 109, column: 7, scope: !1054)
!1057 = !DILocation(line: 109, column: 29, scope: !1054)
!1058 = !DILocation(line: 110, column: 7, scope: !1054)
!1059 = !DILocation(line: 110, column: 12, scope: !1054)
!1060 = !{i8 0, i8 2}
!1061 = !DILocation(line: 114, column: 19, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1053, file: !102, line: 113, column: 11)
!1063 = !DILocation(line: 110, column: 25, scope: !1054)
!1064 = !DILocation(line: 110, column: 28, scope: !1054)
!1065 = !DILocation(line: 110, column: 34, scope: !1054)
!1066 = !DILocation(line: 109, column: 7, scope: !1050)
!1067 = !DILocation(line: 112, column: 33, scope: !1053)
!1068 = !DILocation(line: 112, column: 19, scope: !1053)
!1069 = !DILocation(line: 113, column: 11, scope: !1062)
!1070 = !DILocation(line: 113, column: 11, scope: !1053)
!1071 = !DILocation(line: 114, column: 36, scope: !1062)
!1072 = !DILocation(line: 114, column: 9, scope: !1062)
!1073 = !DILocation(line: 117, column: 9, scope: !1062)
!1074 = !DILocation(line: 119, column: 14, scope: !1053)
!1075 = !DILocation(line: 119, column: 7, scope: !1053)
!1076 = !DILocation(line: 122, column: 22, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1050, file: !102, line: 122, column: 8)
!1078 = !DILocation(line: 122, column: 8, scope: !1077)
!1079 = !DILocation(line: 122, column: 30, scope: !1077)
!1080 = !DILocation(line: 122, column: 8, scope: !1050)
!1081 = !DILocation(line: 123, column: 13, scope: !1077)
!1082 = !DILocation(line: 123, column: 6, scope: !1077)
!1083 = !DILocation(line: 124, column: 1, scope: !1050)
!1084 = distinct !DISubprogram(name: "fdadvise", scope: !1085, file: !1085, line: 31, type: !1086, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !586, variables: !1091)
!1085 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1086 = !DISubroutineType(types: !1087)
!1087 = !{null, !83, !1088, !1088, !1090}
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !1089, line: 57, baseType: !807)
!1089 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "fadvice_t", file: !20, line: 52, baseType: !19)
!1091 = !{!1092, !1093, !1094, !1095, !1096}
!1092 = !DILocalVariable(name: "fd", arg: 1, scope: !1084, file: !1085, line: 31, type: !83)
!1093 = !DILocalVariable(name: "offset", arg: 2, scope: !1084, file: !1085, line: 31, type: !1088)
!1094 = !DILocalVariable(name: "len", arg: 3, scope: !1084, file: !1085, line: 31, type: !1088)
!1095 = !DILocalVariable(name: "advice", arg: 4, scope: !1084, file: !1085, line: 31, type: !1090)
!1096 = !DILocalVariable(name: "__x", scope: !1097, file: !1085, line: 34, type: !83)
!1097 = distinct !DILexicalBlock(scope: !1084, file: !1085, line: 34, column: 3)
!1098 = !DILocation(line: 31, column: 15, scope: !1084)
!1099 = !DILocation(line: 31, column: 25, scope: !1084)
!1100 = !DILocation(line: 31, column: 39, scope: !1084)
!1101 = !DILocation(line: 31, column: 54, scope: !1084)
!1102 = !DILocation(line: 34, column: 3, scope: !1097)
!1103 = !DILocation(line: 36, column: 1, scope: !1084)
!1104 = distinct !DISubprogram(name: "fadvise", scope: !1085, file: !1085, line: 39, type: !1105, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !586, variables: !1147)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{null, !1107, !1090}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !779, line: 7, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !781, line: 241, size: 1728, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1109, file: !781, line: 242, baseType: !83, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1109, file: !781, line: 247, baseType: !42, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1109, file: !781, line: 248, baseType: !42, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1109, file: !781, line: 249, baseType: !42, size: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1109, file: !781, line: 250, baseType: !42, size: 64, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1109, file: !781, line: 251, baseType: !42, size: 64, offset: 320)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1109, file: !781, line: 252, baseType: !42, size: 64, offset: 384)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1109, file: !781, line: 253, baseType: !42, size: 64, offset: 448)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1109, file: !781, line: 254, baseType: !42, size: 64, offset: 512)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1109, file: !781, line: 256, baseType: !42, size: 64, offset: 576)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1109, file: !781, line: 257, baseType: !42, size: 64, offset: 640)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1109, file: !781, line: 258, baseType: !42, size: 64, offset: 704)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1109, file: !781, line: 260, baseType: !1124, size: 64, offset: 768)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !781, line: 156, size: 192, elements: !1126)
!1126 = !{!1127, !1128, !1130}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1125, file: !781, line: 157, baseType: !1124, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1125, file: !781, line: 158, baseType: !1129, size: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1125, file: !781, line: 162, baseType: !83, size: 32, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1109, file: !781, line: 262, baseType: !1129, size: 64, offset: 832)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1109, file: !781, line: 264, baseType: !83, size: 32, offset: 896)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1109, file: !781, line: 268, baseType: !83, size: 32, offset: 928)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1109, file: !781, line: 270, baseType: !807, size: 64, offset: 960)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1109, file: !781, line: 274, baseType: !174, size: 16, offset: 1024)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1109, file: !781, line: 275, baseType: !810, size: 8, offset: 1040)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1109, file: !781, line: 276, baseType: !812, size: 8, offset: 1048)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1109, file: !781, line: 280, baseType: !816, size: 64, offset: 1088)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1109, file: !781, line: 289, baseType: !819, size: 64, offset: 1152)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1109, file: !781, line: 297, baseType: !44, size: 64, offset: 1216)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1109, file: !781, line: 298, baseType: !44, size: 64, offset: 1280)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1109, file: !781, line: 299, baseType: !44, size: 64, offset: 1344)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1109, file: !781, line: 300, baseType: !44, size: 64, offset: 1408)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1109, file: !781, line: 302, baseType: !47, size: 64, offset: 1472)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1109, file: !781, line: 303, baseType: !83, size: 32, offset: 1536)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1109, file: !781, line: 305, baseType: !827, size: 160, offset: 1568)
!1147 = !{!1148, !1149}
!1148 = !DILocalVariable(name: "fp", arg: 1, scope: !1104, file: !1085, line: 39, type: !1107)
!1149 = !DILocalVariable(name: "advice", arg: 2, scope: !1104, file: !1085, line: 39, type: !1090)
!1150 = !DILocation(line: 39, column: 16, scope: !1104)
!1151 = !DILocation(line: 39, column: 30, scope: !1104)
!1152 = !DILocation(line: 41, column: 7, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1104, file: !1085, line: 41, column: 7)
!1154 = !DILocation(line: 41, column: 7, scope: !1104)
!1155 = !DILocation(line: 42, column: 15, scope: !1153)
!1156 = !DILocation(line: 31, column: 15, scope: !1084, inlinedAt: !1157)
!1157 = distinct !DILocation(line: 42, column: 5, scope: !1153)
!1158 = !DILocation(line: 31, column: 25, scope: !1084, inlinedAt: !1157)
!1159 = !DILocation(line: 31, column: 39, scope: !1084, inlinedAt: !1157)
!1160 = !DILocation(line: 31, column: 54, scope: !1084, inlinedAt: !1157)
!1161 = !DILocation(line: 34, column: 3, scope: !1097, inlinedAt: !1157)
!1162 = !DILocation(line: 42, column: 5, scope: !1153)
!1163 = !DILocation(line: 43, column: 1, scope: !1104)
!1164 = distinct !DISubprogram(name: "human_readable", scope: !127, file: !127, line: 153, type: !1165, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: true, unit: !112, variables: !1167)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!42, !832, !42, !83, !832, !832}
!1167 = !{!1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1217, !1218, !1223, !1226, !1227, !1228, !1231, !1232, !1233, !1234, !1237, !1244, !1245, !1247}
!1168 = !DILocalVariable(name: "n", arg: 1, scope: !1164, file: !127, line: 153, type: !832)
!1169 = !DILocalVariable(name: "buf", arg: 2, scope: !1164, file: !127, line: 153, type: !42)
!1170 = !DILocalVariable(name: "opts", arg: 3, scope: !1164, file: !127, line: 153, type: !83)
!1171 = !DILocalVariable(name: "from_block_size", arg: 4, scope: !1164, file: !127, line: 154, type: !832)
!1172 = !DILocalVariable(name: "to_block_size", arg: 5, scope: !1164, file: !127, line: 154, type: !832)
!1173 = !DILocalVariable(name: "inexact_style", scope: !1164, file: !127, line: 156, type: !83)
!1174 = !DILocalVariable(name: "base", scope: !1164, file: !127, line: 158, type: !191)
!1175 = !DILocalVariable(name: "amt", scope: !1164, file: !127, line: 159, type: !832)
!1176 = !DILocalVariable(name: "tenths", scope: !1164, file: !127, line: 160, type: !83)
!1177 = !DILocalVariable(name: "exponent", scope: !1164, file: !127, line: 161, type: !83)
!1178 = !DILocalVariable(name: "exponent_max", scope: !1164, file: !127, line: 162, type: !83)
!1179 = !DILocalVariable(name: "p", scope: !1164, file: !127, line: 163, type: !42)
!1180 = !DILocalVariable(name: "psuffix", scope: !1164, file: !127, line: 164, type: !42)
!1181 = !DILocalVariable(name: "integerlim", scope: !1164, file: !127, line: 165, type: !60)
!1182 = !DILocalVariable(name: "rounding", scope: !1164, file: !127, line: 171, type: !83)
!1183 = !DILocalVariable(name: "decimal_point", scope: !1164, file: !127, line: 173, type: !60)
!1184 = !DILocalVariable(name: "decimal_pointlen", scope: !1164, file: !127, line: 174, type: !47)
!1185 = !DILocalVariable(name: "grouping", scope: !1164, file: !127, line: 175, type: !60)
!1186 = !DILocalVariable(name: "thousands_sep", scope: !1164, file: !127, line: 176, type: !60)
!1187 = !DILocalVariable(name: "l", scope: !1164, file: !127, line: 177, type: !1188)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !1191, line: 51, size: 768, elements: !1192)
!1191 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1192 = !{!1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !1190, file: !1191, line: 55, baseType: !42, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !1190, file: !1191, line: 56, baseType: !42, size: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !1190, file: !1191, line: 62, baseType: !42, size: 64, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !1190, file: !1191, line: 68, baseType: !42, size: 64, offset: 192)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !1190, file: !1191, line: 69, baseType: !42, size: 64, offset: 256)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !1190, file: !1191, line: 70, baseType: !42, size: 64, offset: 320)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !1190, file: !1191, line: 71, baseType: !42, size: 64, offset: 384)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !1190, file: !1191, line: 72, baseType: !42, size: 64, offset: 448)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !1190, file: !1191, line: 73, baseType: !42, size: 64, offset: 512)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !1190, file: !1191, line: 74, baseType: !42, size: 64, offset: 576)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !1190, file: !1191, line: 75, baseType: !43, size: 8, offset: 640)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !1190, file: !1191, line: 76, baseType: !43, size: 8, offset: 648)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !1190, file: !1191, line: 78, baseType: !43, size: 8, offset: 656)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !1190, file: !1191, line: 80, baseType: !43, size: 8, offset: 664)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !1190, file: !1191, line: 82, baseType: !43, size: 8, offset: 672)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !1190, file: !1191, line: 84, baseType: !43, size: 8, offset: 680)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !1190, file: !1191, line: 91, baseType: !43, size: 8, offset: 688)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !1190, file: !1191, line: 92, baseType: !43, size: 8, offset: 696)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !1190, file: !1191, line: 95, baseType: !43, size: 8, offset: 704)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !1190, file: !1191, line: 97, baseType: !43, size: 8, offset: 712)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !1190, file: !1191, line: 99, baseType: !43, size: 8, offset: 720)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !1190, file: !1191, line: 101, baseType: !43, size: 8, offset: 728)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !1190, file: !1191, line: 108, baseType: !43, size: 8, offset: 736)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !1190, file: !1191, line: 109, baseType: !43, size: 8, offset: 744)
!1217 = !DILocalVariable(name: "pointlen", scope: !1164, file: !127, line: 178, type: !47)
!1218 = !DILocalVariable(name: "multiplier", scope: !1219, file: !127, line: 199, type: !832)
!1219 = distinct !DILexicalBlock(scope: !1220, file: !127, line: 198, column: 9)
!1220 = distinct !DILexicalBlock(scope: !1221, file: !127, line: 197, column: 11)
!1221 = distinct !DILexicalBlock(scope: !1222, file: !127, line: 196, column: 5)
!1222 = distinct !DILexicalBlock(scope: !1164, file: !127, line: 195, column: 7)
!1223 = !DILocalVariable(name: "divisor", scope: !1224, file: !127, line: 211, type: !832)
!1224 = distinct !DILexicalBlock(scope: !1225, file: !127, line: 210, column: 5)
!1225 = distinct !DILexicalBlock(scope: !1222, file: !127, line: 209, column: 12)
!1226 = !DILocalVariable(name: "r10", scope: !1224, file: !127, line: 212, type: !832)
!1227 = !DILocalVariable(name: "r2", scope: !1224, file: !127, line: 213, type: !832)
!1228 = !DILocalVariable(name: "dto_block_size", scope: !1229, file: !127, line: 225, type: !1230)
!1229 = distinct !DILexicalBlock(scope: !1164, file: !127, line: 220, column: 3)
!1230 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!1231 = !DILocalVariable(name: "damt", scope: !1229, file: !127, line: 226, type: !1230)
!1232 = !DILocalVariable(name: "buflen", scope: !1229, file: !127, line: 227, type: !47)
!1233 = !DILocalVariable(name: "nonintegerlen", scope: !1229, file: !127, line: 228, type: !47)
!1234 = !DILocalVariable(name: "e", scope: !1235, file: !127, line: 238, type: !1230)
!1235 = distinct !DILexicalBlock(scope: !1236, file: !127, line: 237, column: 7)
!1236 = distinct !DILexicalBlock(scope: !1229, file: !127, line: 230, column: 9)
!1237 = !DILocalVariable(name: "r10", scope: !1238, file: !127, line: 286, type: !191)
!1238 = distinct !DILexicalBlock(scope: !1239, file: !127, line: 285, column: 15)
!1239 = distinct !DILexicalBlock(scope: !1240, file: !127, line: 283, column: 11)
!1240 = distinct !DILexicalBlock(scope: !1241, file: !127, line: 282, column: 13)
!1241 = distinct !DILexicalBlock(scope: !1242, file: !127, line: 279, column: 7)
!1242 = distinct !DILexicalBlock(scope: !1243, file: !127, line: 278, column: 9)
!1243 = distinct !DILexicalBlock(scope: !1164, file: !127, line: 272, column: 3)
