; ModuleID = 'coreutils-8.27/src/tac.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_dfa_t = type opaque
%struct.re_registers = type { i32, i32*, i32* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [54 x i8] c"Write each FILE to standard output, last line first.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.18 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "separator", scope: !2, file: !3, line: 80, type: !25, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !30)
!3 = !DIFile(filename: "src/tac.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !{!20, !22, !23, !27}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !28, line: 62, baseType: !29)
!28 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!29 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !{!31, !0, !52, !54, !56, !58, !60, !62, !64, !90, !95, !115, !129, !199, !201, !211, !224, !226}
!31 = !DIGlobalVariableExpression(var: !32)
!32 = distinct !DIGlobalVariable(name: "default_file_list", scope: !33, file: !3, line: 612, type: !49, isLocal: true, isDefinition: true)
!33 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 603, type: !34, isLocal: false, isDefinition: true, scopeLine: 604, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !38)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !36, !37}
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!38 = !{!39, !40, !41, !42, !43, !45, !46, !47}
!39 = !DILocalVariable(name: "argc", arg: 1, scope: !33, file: !3, line: 603, type: !36)
!40 = !DILocalVariable(name: "argv", arg: 2, scope: !33, file: !3, line: 603, type: !37)
!41 = !DILocalVariable(name: "error_message", scope: !33, file: !3, line: 605, type: !25)
!42 = !DILocalVariable(name: "optc", scope: !33, file: !3, line: 606, type: !36)
!43 = !DILocalVariable(name: "ok", scope: !33, file: !3, line: 607, type: !44)
!44 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!45 = !DILocalVariable(name: "half_buffer_size", scope: !33, file: !3, line: 608, type: !27)
!46 = !DILocalVariable(name: "file", scope: !33, file: !3, line: 613, type: !23)
!47 = !DILocalVariable(name: "i", scope: !48, file: !3, line: 693, type: !27)
!48 = distinct !DILexicalBlock(scope: !33, file: !3, line: 692, column: 3)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 2)
!52 = !DIGlobalVariableExpression(var: !53)
!53 = distinct !DIGlobalVariable(name: "separator_ends_record", scope: !2, file: !3, line: 87, type: !44, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55)
!55 = distinct !DIGlobalVariable(name: "sentinel_length", scope: !2, file: !3, line: 92, type: !27, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57)
!57 = distinct !DIGlobalVariable(name: "match_length", scope: !2, file: !3, line: 97, type: !27, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59)
!59 = distinct !DIGlobalVariable(name: "G_buffer", scope: !2, file: !3, line: 100, type: !20, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61)
!61 = distinct !DIGlobalVariable(name: "read_size", scope: !2, file: !3, line: 103, type: !27, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63)
!63 = distinct !DIGlobalVariable(name: "G_buffer_size", scope: !2, file: !3, line: 108, type: !27, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65)
!65 = distinct !DIGlobalVariable(name: "compiled_separator", scope: !2, file: !3, line: 111, type: !66, isLocal: true, isDefinition: true)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !67, line: 414, size: 512, elements: !68)
!67 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!68 = !{!69, !72, !74, !75, !77, !78, !81, !82, !84, !85, !86, !87, !88, !89}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !66, file: !67, line: 418, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !67, line: 418, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !66, file: !67, line: 421, baseType: !73, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !67, line: 57, baseType: !29)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !66, file: !67, line: 424, baseType: !73, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !66, file: !67, line: 427, baseType: !76, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !67, line: 73, baseType: !29)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !66, file: !67, line: 432, baseType: !20, size: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !66, file: !67, line: 438, baseType: !79, size: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !66, file: !67, line: 441, baseType: !27, size: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !66, file: !67, line: 447, baseType: !83, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!83 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !66, file: !67, line: 458, baseType: !83, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !66, file: !67, line: 462, baseType: !83, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !66, file: !67, line: 466, baseType: !83, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !66, file: !67, line: 470, baseType: !83, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !66, file: !67, line: 473, baseType: !83, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !66, file: !67, line: 476, baseType: !83, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!90 = !DIGlobalVariableExpression(var: !91)
!91 = distinct !DIGlobalVariable(name: "compiled_separator_fastmap", scope: !2, file: !3, line: 112, type: !92, isLocal: true, isDefinition: true)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 256)
!95 = !DIGlobalVariableExpression(var: !96)
!96 = distinct !DIGlobalVariable(name: "infomap", scope: !97, file: !98, line: 632, type: !112, isLocal: true, isDefinition: true)
!97 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !98, file: !98, line: 630, type: !99, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !101)
!98 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!99 = !DISubroutineType(types: !100)
!100 = !{null, !25}
!101 = !{!102, !103, !104, !111}
!102 = !DILocalVariable(name: "program", arg: 1, scope: !97, file: !98, line: 630, type: !25)
!103 = !DILocalVariable(name: "node", scope: !97, file: !98, line: 642, type: !25)
!104 = !DILocalVariable(name: "map_prog", scope: !97, file: !98, line: 643, type: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !97, file: !98, line: 632, size: 128, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !107, file: !98, line: 632, baseType: !25, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !107, file: !98, line: 632, baseType: !25, size: 64, offset: 64)
!111 = !DILocalVariable(name: "lc_messages", scope: !97, file: !98, line: 655, type: !25)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 896, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 7)
!115 = !DIGlobalVariableExpression(var: !116)
!116 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 115, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 1536, elements: !127)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !120, line: 50, size: 256, elements: !121)
!120 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!121 = !{!122, !123, !124, !126}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !120, line: 52, baseType: !25, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !119, file: !120, line: 55, baseType: !36, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !119, file: !120, line: 56, baseType: !125, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !119, file: !120, line: 57, baseType: !36, size: 32, offset: 192)
!127 = !{!128}
!128 = !DISubrange(count: 6)
!129 = !DIGlobalVariableExpression(var: !130)
!130 = distinct !DIGlobalVariable(name: "tempfile", scope: !131, file: !3, line: 433, type: !20, isLocal: true, isDefinition: true)
!131 = distinct !DISubprogram(name: "temp_stream", scope: !3, file: !3, line: 431, type: !132, isLocal: true, isDefinition: true, scopeLine: 432, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !191)
!132 = !DISubroutineType(types: !133)
!133 = !{!44, !134, !37}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !137, line: 7, baseType: !138)
!137 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !139, line: 241, size: 1728, elements: !140)
!139 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !161, !162, !163, !164, !168, !170, !172, !176, !179, !181, !182, !183, !184, !185, !186, !187}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !138, file: !139, line: 242, baseType: !36, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !138, file: !139, line: 247, baseType: !20, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !138, file: !139, line: 248, baseType: !20, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !138, file: !139, line: 249, baseType: !20, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !138, file: !139, line: 250, baseType: !20, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !138, file: !139, line: 251, baseType: !20, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !138, file: !139, line: 252, baseType: !20, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !138, file: !139, line: 253, baseType: !20, size: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !138, file: !139, line: 254, baseType: !20, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !138, file: !139, line: 256, baseType: !20, size: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !138, file: !139, line: 257, baseType: !20, size: 64, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !138, file: !139, line: 258, baseType: !20, size: 64, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !138, file: !139, line: 260, baseType: !154, size: 64, offset: 768)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !139, line: 156, size: 192, elements: !156)
!156 = !{!157, !158, !160}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !155, file: !139, line: 157, baseType: !154, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !155, file: !139, line: 158, baseType: !159, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !155, file: !139, line: 162, baseType: !36, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !138, file: !139, line: 262, baseType: !159, size: 64, offset: 832)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !138, file: !139, line: 264, baseType: !36, size: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !138, file: !139, line: 268, baseType: !36, size: 32, offset: 928)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !138, file: !139, line: 270, baseType: !165, size: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !166, line: 140, baseType: !167)
!166 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!167 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !138, file: !139, line: 274, baseType: !169, size: 16, offset: 1024)
!169 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !138, file: !139, line: 275, baseType: !171, size: 8, offset: 1040)
!171 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !138, file: !139, line: 276, baseType: !173, size: 8, offset: 1048)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 1)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !138, file: !139, line: 280, baseType: !177, size: 64, offset: 1088)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !139, line: 150, baseType: null)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !138, file: !139, line: 289, baseType: !180, size: 64, offset: 1152)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !166, line: 141, baseType: !167)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !138, file: !139, line: 297, baseType: !22, size: 64, offset: 1216)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !138, file: !139, line: 298, baseType: !22, size: 64, offset: 1280)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !138, file: !139, line: 299, baseType: !22, size: 64, offset: 1344)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !138, file: !139, line: 300, baseType: !22, size: 64, offset: 1408)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !138, file: !139, line: 302, baseType: !27, size: 64, offset: 1472)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !138, file: !139, line: 303, baseType: !36, size: 32, offset: 1536)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !138, file: !139, line: 305, baseType: !188, size: 160, offset: 1568)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 20)
!191 = !{!192, !193, !194, !197, !198}
!192 = !DILocalVariable(name: "fp", arg: 1, scope: !131, file: !3, line: 431, type: !134)
!193 = !DILocalVariable(name: "file_name", arg: 2, scope: !131, file: !3, line: 431, type: !37)
!194 = !DILocalVariable(name: "t", scope: !195, file: !3, line: 437, type: !25)
!195 = distinct !DILexicalBlock(scope: !196, file: !3, line: 436, column: 5)
!196 = distinct !DILexicalBlock(scope: !131, file: !3, line: 435, column: 7)
!197 = !DILocalVariable(name: "tempdir", scope: !195, file: !3, line: 438, type: !25)
!198 = !DILocalVariable(name: "fd", scope: !195, file: !3, line: 455, type: !36)
!199 = !DIGlobalVariableExpression(var: !200)
!200 = distinct !DIGlobalVariable(name: "tmp_fp", scope: !131, file: !3, line: 434, type: !135, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202)
!202 = distinct !DIGlobalVariable(name: "regs", scope: !2, file: !3, line: 113, type: !203, isLocal: true, isDefinition: true)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !67, line: 498, size: 192, elements: !204)
!204 = !{!205, !207, !210}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !203, file: !67, line: 500, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !67, line: 56, baseType: !83)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !203, file: !67, line: 501, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !67, line: 491, baseType: !36)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !203, file: !67, line: 502, baseType: !208, size: 64, offset: 128)
!211 = !DIGlobalVariableExpression(var: !212)
!212 = distinct !DIGlobalVariable(name: "buffer", scope: !213, file: !3, line: 161, type: !221, isLocal: true, isDefinition: true)
!213 = distinct !DISubprogram(name: "output", scope: !3, file: !3, line: 159, type: !214, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !216)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !25, !25}
!216 = !{!217, !218, !219, !220}
!217 = !DILocalVariable(name: "start", arg: 1, scope: !213, file: !3, line: 159, type: !25)
!218 = !DILocalVariable(name: "past_end", arg: 2, scope: !213, file: !3, line: 159, type: !25)
!219 = !DILocalVariable(name: "bytes_to_add", scope: !213, file: !3, line: 163, type: !27)
!220 = !DILocalVariable(name: "bytes_available", scope: !213, file: !3, line: 164, type: !27)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 65536, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 8192)
!224 = !DIGlobalVariableExpression(var: !225)
!225 = distinct !DIGlobalVariable(name: "bytes_in_buffer", scope: !213, file: !3, line: 162, type: !27, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227)
!227 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 83, type: !44, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229)
!229 = distinct !DIGlobalVariable(name: "Version", scope: !230, file: !231, line: 2, type: !25, isLocal: false, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, globals: !233)
!231 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!232 = !{}
!233 = !{!228}
!234 = !DIGlobalVariableExpression(var: !235)
!235 = distinct !DIGlobalVariable(name: "file_name", scope: !236, file: !241, line: 36, type: !25, isLocal: true, isDefinition: true)
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, globals: !238)
!237 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!238 = !{!234, !239}
!239 = !DIGlobalVariableExpression(var: !240)
!240 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !236, file: !241, line: 46, type: !44, isLocal: true, isDefinition: true)
!241 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!242 = !DIGlobalVariableExpression(var: !243)
!243 = distinct !DIGlobalVariable(name: "exit_failure", scope: !244, file: !247, line: 24, type: !248, isLocal: false, isDefinition: true)
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, globals: !246)
!245 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!246 = !{!242}
!247 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!248 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !36)
!249 = !DIGlobalVariableExpression(var: !250)
!250 = distinct !DIGlobalVariable(name: "program_name", scope: !251, file: !255, line: 33, type: !25, isLocal: false, isDefinition: true)
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, retainedTypes: !253, globals: !254)
!252 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!253 = !{!22, !20}
!254 = !{!249}
!255 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!256 = !DIGlobalVariableExpression(var: !257)
!257 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !258, file: !285, line: 77, type: !317, isLocal: false, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !260, retainedTypes: !281, globals: !282)
!259 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!260 = !{!5, !261, !266}
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !262)
!262 = !{!263, !264, !265}
!263 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!264 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!265 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !267, line: 46, size: 32, elements: !268)
!267 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!269 = !DIEnumerator(name: "_ISupper", value: 256)
!270 = !DIEnumerator(name: "_ISlower", value: 512)
!271 = !DIEnumerator(name: "_ISalpha", value: 1024)
!272 = !DIEnumerator(name: "_ISdigit", value: 2048)
!273 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!274 = !DIEnumerator(name: "_ISspace", value: 8192)
!275 = !DIEnumerator(name: "_ISprint", value: 16384)
!276 = !DIEnumerator(name: "_ISgraph", value: 32768)
!277 = !DIEnumerator(name: "_ISblank", value: 1)
!278 = !DIEnumerator(name: "_IScntrl", value: 2)
!279 = !DIEnumerator(name: "_ISpunct", value: 4)
!280 = !DIEnumerator(name: "_ISalnum", value: 8)
!281 = !{!36, !169, !27, !20}
!282 = !{!256, !283, !290, !302, !304, !306, !313, !315}
!283 = !DIGlobalVariableExpression(var: !284)
!284 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !258, file: !285, line: 93, type: !286, isLocal: false, isDefinition: true)
!285 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 320, elements: !288)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!288 = !{!289}
!289 = !DISubrange(count: 10)
!290 = !DIGlobalVariableExpression(var: !291)
!291 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !258, file: !285, line: 1043, type: !292, isLocal: false, isDefinition: true)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !285, line: 57, size: 448, elements: !293)
!293 = !{!294, !295, !296, !300, !301}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !292, file: !285, line: 60, baseType: !5, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !292, file: !285, line: 63, baseType: !36, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !292, file: !285, line: 67, baseType: !297, size: 256, offset: 64)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 256, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 8)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !292, file: !285, line: 70, baseType: !25, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !292, file: !285, line: 73, baseType: !25, size: 64, offset: 384)
!302 = !DIGlobalVariableExpression(var: !303)
!303 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !258, file: !285, line: 108, type: !292, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305)
!305 = distinct !DIGlobalVariable(name: "slot0", scope: !258, file: !285, line: 834, type: !92, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307)
!307 = distinct !DIGlobalVariable(name: "slotvec", scope: !258, file: !285, line: 837, type: !308, isLocal: true, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !285, line: 826, size: 128, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !309, file: !285, line: 828, baseType: !27, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !309, file: !285, line: 829, baseType: !20, size: 64, offset: 64)
!313 = !DIGlobalVariableExpression(var: !314)
!314 = distinct !DIGlobalVariable(name: "nslots", scope: !258, file: !285, line: 835, type: !36, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316)
!316 = distinct !DIGlobalVariable(name: "slotvec0", scope: !258, file: !285, line: 836, type: !309, isLocal: true, isDefinition: true)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 704, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 11)
!320 = !DIGlobalVariableExpression(var: !321)
!321 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !322, file: !325, line: 26, type: !326, isLocal: false, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, globals: !324)
!323 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!324 = !{!320}
!325 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 376, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 47)
!329 = !DIGlobalVariableExpression(var: !330)
!330 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !331, file: !674, line: 120, type: !675, isLocal: true, isDefinition: true)
!331 = distinct !DICompileUnit(language: DW_LANG_C99, file: !332, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !333, retainedTypes: !672, globals: !673)
!332 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!333 = !{!334}
!334 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !335, line: 41, size: 32, elements: !336)
!335 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!337 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!338 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!339 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!340 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!341 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!342 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!343 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!344 = !DIEnumerator(name: "DAY_1", value: 131079)
!345 = !DIEnumerator(name: "DAY_2", value: 131080)
!346 = !DIEnumerator(name: "DAY_3", value: 131081)
!347 = !DIEnumerator(name: "DAY_4", value: 131082)
!348 = !DIEnumerator(name: "DAY_5", value: 131083)
!349 = !DIEnumerator(name: "DAY_6", value: 131084)
!350 = !DIEnumerator(name: "DAY_7", value: 131085)
!351 = !DIEnumerator(name: "ABMON_1", value: 131086)
!352 = !DIEnumerator(name: "ABMON_2", value: 131087)
!353 = !DIEnumerator(name: "ABMON_3", value: 131088)
!354 = !DIEnumerator(name: "ABMON_4", value: 131089)
!355 = !DIEnumerator(name: "ABMON_5", value: 131090)
!356 = !DIEnumerator(name: "ABMON_6", value: 131091)
!357 = !DIEnumerator(name: "ABMON_7", value: 131092)
!358 = !DIEnumerator(name: "ABMON_8", value: 131093)
!359 = !DIEnumerator(name: "ABMON_9", value: 131094)
!360 = !DIEnumerator(name: "ABMON_10", value: 131095)
!361 = !DIEnumerator(name: "ABMON_11", value: 131096)
!362 = !DIEnumerator(name: "ABMON_12", value: 131097)
!363 = !DIEnumerator(name: "MON_1", value: 131098)
!364 = !DIEnumerator(name: "MON_2", value: 131099)
!365 = !DIEnumerator(name: "MON_3", value: 131100)
!366 = !DIEnumerator(name: "MON_4", value: 131101)
!367 = !DIEnumerator(name: "MON_5", value: 131102)
!368 = !DIEnumerator(name: "MON_6", value: 131103)
!369 = !DIEnumerator(name: "MON_7", value: 131104)
!370 = !DIEnumerator(name: "MON_8", value: 131105)
!371 = !DIEnumerator(name: "MON_9", value: 131106)
!372 = !DIEnumerator(name: "MON_10", value: 131107)
!373 = !DIEnumerator(name: "MON_11", value: 131108)
!374 = !DIEnumerator(name: "MON_12", value: 131109)
!375 = !DIEnumerator(name: "AM_STR", value: 131110)
!376 = !DIEnumerator(name: "PM_STR", value: 131111)
!377 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!378 = !DIEnumerator(name: "D_FMT", value: 131113)
!379 = !DIEnumerator(name: "T_FMT", value: 131114)
!380 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!381 = !DIEnumerator(name: "ERA", value: 131116)
!382 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!383 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!384 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!385 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!386 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!387 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!388 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!389 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!390 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!391 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!392 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!393 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!394 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!395 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!396 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!397 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!398 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!399 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!400 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!401 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!402 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!403 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!404 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!405 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!406 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!407 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!408 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!409 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!410 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!411 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!412 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!413 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!414 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!415 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!416 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!417 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!418 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!419 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!420 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!421 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!422 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!423 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!424 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!425 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!426 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!427 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!428 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!429 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!430 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!431 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!432 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!433 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!434 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!435 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!436 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!437 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!438 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!439 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!440 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!441 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!442 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!443 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!444 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!445 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!446 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!447 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!448 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!449 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!450 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!451 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!452 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!453 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!454 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!455 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!456 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!457 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!458 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!459 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!460 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!461 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!462 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!463 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!464 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!465 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!466 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!467 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!468 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!469 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!470 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!471 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!472 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!473 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!474 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!475 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!476 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!477 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!478 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!479 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!480 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!481 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!482 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!483 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!484 = !DIEnumerator(name: "CODESET", value: 14)
!485 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!486 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!487 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!488 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!509 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!510 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!520 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!521 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!529 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!530 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!531 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!532 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!533 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!534 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!535 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!536 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!537 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!538 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!539 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!540 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!541 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!545 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!546 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!547 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!548 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!549 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!550 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!551 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!552 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!553 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!554 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!555 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!556 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!557 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!558 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!559 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!560 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!561 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!562 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!563 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!564 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!565 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!566 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!567 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!568 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!569 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!570 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!571 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!572 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!573 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!574 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!575 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!576 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!577 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!578 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!584 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!585 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!588 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!589 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!590 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!591 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!592 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!593 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!594 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!595 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!596 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!597 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!598 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!599 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!600 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!601 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!602 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!603 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!604 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!605 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!606 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!607 = !DIEnumerator(name: "THOUSEP", value: 65537)
!608 = !DIEnumerator(name: "__GROUPING", value: 65538)
!609 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!610 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!611 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!612 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!613 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!614 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!615 = !DIEnumerator(name: "__YESSTR", value: 327682)
!616 = !DIEnumerator(name: "__NOSTR", value: 327683)
!617 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!618 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!619 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!620 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!621 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!622 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!623 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!624 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!625 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!626 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!627 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!628 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!629 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!630 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!631 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!632 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!633 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!634 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!635 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!636 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!637 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!638 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!639 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!640 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!641 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!642 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!643 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!644 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!645 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!646 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!647 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!648 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!649 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!650 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!651 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!652 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!653 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!659 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!660 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!661 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!662 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!663 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!664 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!665 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!666 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!667 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!668 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!669 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!670 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!671 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!672 = !{!22, !20, !79}
!673 = !{!329}
!674 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!675 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!676 = !DIGlobalVariableExpression(var: !677)
!677 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !678, file: !679, line: 335, type: !36, isLocal: true, isDefinition: true)
!678 = distinct !DISubprogram(name: "rpl_fcntl", scope: !679, file: !679, line: 272, type: !680, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !682, variables: !685)
!679 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!680 = !DISubroutineType(types: !681)
!681 = !{!36, !36, !36, null}
!682 = distinct !DICompileUnit(language: DW_LANG_C99, file: !683, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, globals: !684)
!683 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!684 = !{!676}
!685 = !{!686, !687, !688, !699, !700, !703, !706, !709}
!686 = !DILocalVariable(name: "fd", arg: 1, scope: !678, file: !679, line: 272, type: !36)
!687 = !DILocalVariable(name: "action", arg: 2, scope: !678, file: !679, line: 272, type: !36)
!688 = !DILocalVariable(name: "arg", scope: !678, file: !679, line: 274, type: !689)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !690, line: 30, baseType: !691)
!690 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !683, line: 274, baseType: !692)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 192, elements: !174)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !683, line: 274, size: 192, elements: !694)
!694 = !{!695, !696, !697, !698}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !693, file: !683, line: 274, baseType: !83, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !693, file: !683, line: 274, baseType: !83, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !693, file: !683, line: 274, baseType: !22, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !693, file: !683, line: 274, baseType: !22, size: 64, offset: 128)
!699 = !DILocalVariable(name: "result", scope: !678, file: !679, line: 275, type: !36)
!700 = !DILocalVariable(name: "target", scope: !701, file: !679, line: 322, type: !36)
!701 = distinct !DILexicalBlock(scope: !702, file: !679, line: 321, column: 7)
!702 = distinct !DILexicalBlock(scope: !678, file: !679, line: 278, column: 5)
!703 = !DILocalVariable(name: "flags", scope: !704, file: !679, line: 359, type: !36)
!704 = distinct !DILexicalBlock(scope: !705, file: !679, line: 358, column: 11)
!705 = distinct !DILexicalBlock(scope: !701, file: !679, line: 357, column: 13)
!706 = !DILocalVariable(name: "saved_errno", scope: !707, file: !679, line: 362, type: !36)
!707 = distinct !DILexicalBlock(scope: !708, file: !679, line: 361, column: 15)
!708 = distinct !DILexicalBlock(scope: !704, file: !679, line: 360, column: 17)
!709 = !DILocalVariable(name: "p", scope: !710, file: !679, line: 404, type: !22)
!710 = distinct !DILexicalBlock(scope: !702, file: !679, line: 402, column: 7)
!711 = distinct !DICompileUnit(language: DW_LANG_C99, file: !712, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, retainedTypes: !713)
!712 = !DIFile(filename: "./lib/filenamecat-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!713 = !{!22}
!714 = distinct !DICompileUnit(language: DW_LANG_C99, file: !715, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !716)
!715 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!716 = !{!717}
!717 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !719, file: !718, line: 62, size: 32, elements: !733)
!718 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!719 = distinct !DISubprogram(name: "safe_read", scope: !718, file: !718, line: 56, type: !720, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !714, variables: !722)
!720 = !DISubroutineType(types: !721)
!721 = !{!27, !36, !22, !27}
!722 = !{!723, !724, !725, !726}
!723 = !DILocalVariable(name: "fd", arg: 1, scope: !719, file: !718, line: 56, type: !36)
!724 = !DILocalVariable(name: "buf", arg: 2, scope: !719, file: !718, line: 56, type: !22)
!725 = !DILocalVariable(name: "count", arg: 3, scope: !719, file: !718, line: 56, type: !27)
!726 = !DILocalVariable(name: "result", scope: !727, file: !718, line: 66, type: !730)
!727 = distinct !DILexicalBlock(scope: !728, file: !718, line: 65, column: 5)
!728 = distinct !DILexicalBlock(scope: !729, file: !718, line: 64, column: 3)
!729 = distinct !DILexicalBlock(scope: !719, file: !718, line: 64, column: 3)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !731, line: 109, baseType: !732)
!731 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !166, line: 181, baseType: !167)
!733 = !{!734}
!734 = !DIEnumerator(name: "BUGGY_READ_MAXIMUM", value: 2147475456)
!735 = distinct !DICompileUnit(language: DW_LANG_C99, file: !736, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232)
!736 = !DIFile(filename: "./lib/mkstemp-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!737 = distinct !DICompileUnit(language: DW_LANG_C99, file: !738, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232)
!738 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!739 = distinct !DICompileUnit(language: DW_LANG_C99, file: !740, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !741, retainedTypes: !713)
!740 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!741 = !{!742}
!742 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !743, line: 41, size: 32, elements: !744)
!743 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!744 = !{!745}
!745 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!746 = distinct !DICompileUnit(language: DW_LANG_C99, file: !747, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !748, retainedTypes: !762)
!747 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!748 = !{!749}
!749 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !751, file: !750, line: 192, size: 32, elements: !760)
!750 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!751 = distinct !DISubprogram(name: "x2nrealloc", scope: !750, file: !750, line: 180, type: !752, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !746, variables: !755)
!752 = !DISubroutineType(types: !753)
!753 = !{!22, !22, !754, !27}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!755 = !{!756, !757, !758, !759}
!756 = !DILocalVariable(name: "p", arg: 1, scope: !751, file: !750, line: 180, type: !22)
!757 = !DILocalVariable(name: "pn", arg: 2, scope: !751, file: !750, line: 180, type: !754)
!758 = !DILocalVariable(name: "s", arg: 3, scope: !751, file: !750, line: 180, type: !27)
!759 = !DILocalVariable(name: "n", scope: !751, file: !750, line: 182, type: !27)
!760 = !{!761}
!761 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!762 = !{!27, !20, !22}
!763 = distinct !DICompileUnit(language: DW_LANG_C99, file: !764, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232)
!764 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!765 = distinct !DICompileUnit(language: DW_LANG_C99, file: !766, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, retainedTypes: !713)
!766 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !768, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, retainedTypes: !713)
!768 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!769 = distinct !DICompileUnit(language: DW_LANG_C99, file: !770, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, retainedTypes: !771)
!770 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!771 = !{!27}
!772 = distinct !DICompileUnit(language: DW_LANG_C99, file: !773, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232)
!773 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!774 = distinct !DICompileUnit(language: DW_LANG_C99, file: !775, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, retainedTypes: !776)
!775 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!776 = !{!20}
!777 = distinct !DICompileUnit(language: DW_LANG_C99, file: !778, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232)
!778 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!779 = distinct !DICompileUnit(language: DW_LANG_C99, file: !780, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232)
!780 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!781 = distinct !DICompileUnit(language: DW_LANG_C99, file: !782, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232)
!782 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, retainedTypes: !713)
!784 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!785 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!786 = !{i32 2, !"Dwarf Version", i32 4}
!787 = !{i32 2, !"Debug Info Version", i32 3}
!788 = !{i32 1, !"wchar_size", i32 4}
!789 = !{i32 7, !"PIC Level", i32 2}
!790 = !{i32 7, !"PIE Level", i32 2}
!791 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 126, type: !792, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !794)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !36}
!794 = !{!795}
!795 = !DILocalVariable(name: "status", arg: 1, scope: !791, file: !3, line: 126, type: !36)
!796 = !DIExpression()
!797 = !DILocation(line: 126, column: 12, scope: !791)
!798 = !DILocation(line: 128, column: 14, scope: !799)
!799 = distinct !DILexicalBlock(scope: !791, file: !3, line: 128, column: 7)
!800 = !DILocation(line: 128, column: 7, scope: !791)
!801 = !DILocation(line: 129, column: 5, scope: !802)
!802 = distinct !DILexicalBlock(scope: !799, file: !3, line: 129, column: 5)
!803 = !{!804, !804, i64 0}
!804 = !{!"any pointer", !805, i64 0}
!805 = !{!"omnipotent char", !806, i64 0}
!806 = !{!"Simple C/C++ TBAA"}
!807 = !DILocation(line: 132, column: 7, scope: !808)
!808 = distinct !DILexicalBlock(scope: !799, file: !3, line: 131, column: 5)
!809 = !DILocation(line: 136, column: 7, scope: !808)
!810 = !DILocation(line: 580, column: 3, scope: !811, inlinedAt: !814)
!811 = distinct !DISubprogram(name: "emit_stdin_note", scope: !98, file: !98, line: 578, type: !812, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !232)
!812 = !DISubroutineType(types: !813)
!813 = !{null}
!814 = distinct !DILocation(line: 140, column: 7, scope: !808)
!815 = !DILocation(line: 587, column: 3, scope: !816, inlinedAt: !817)
!816 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !98, file: !98, line: 585, type: !812, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !232)
!817 = distinct !DILocation(line: 141, column: 7, scope: !808)
!818 = !DILocation(line: 143, column: 7, scope: !808)
!819 = !DILocation(line: 148, column: 7, scope: !808)
!820 = !DILocation(line: 149, column: 7, scope: !808)
!821 = !DILocation(line: 642, column: 15, scope: !97, inlinedAt: !822)
!822 = distinct !DILocation(line: 150, column: 7, scope: !808)
!823 = !DILocation(line: 651, column: 3, scope: !97, inlinedAt: !822)
!824 = !DILocation(line: 655, column: 29, scope: !97, inlinedAt: !822)
!825 = !DILocation(line: 655, column: 15, scope: !97, inlinedAt: !822)
!826 = !DILocation(line: 656, column: 7, scope: !827, inlinedAt: !822)
!827 = distinct !DILexicalBlock(scope: !97, file: !98, line: 656, column: 7)
!828 = !DILocation(line: 656, column: 19, scope: !827, inlinedAt: !822)
!829 = !DILocation(line: 656, column: 22, scope: !827, inlinedAt: !822)
!830 = !DILocation(line: 656, column: 7, scope: !97, inlinedAt: !822)
!831 = !DILocation(line: 662, column: 7, scope: !832, inlinedAt: !822)
!832 = distinct !DILexicalBlock(scope: !827, file: !98, line: 657, column: 5)
!833 = !DILocation(line: 664, column: 5, scope: !832, inlinedAt: !822)
!834 = !DILocation(line: 665, column: 3, scope: !97, inlinedAt: !822)
!835 = !DILocation(line: 667, column: 3, scope: !97, inlinedAt: !822)
!836 = !DILocation(line: 152, column: 3, scope: !791)
!837 = !DILocation(line: 603, column: 11, scope: !33)
!838 = !DILocation(line: 603, column: 24, scope: !33)
!839 = !DILocation(line: 616, column: 21, scope: !33)
!840 = !DILocation(line: 616, column: 3, scope: !33)
!841 = !DILocation(line: 617, column: 3, scope: !33)
!842 = !DILocation(line: 618, column: 3, scope: !33)
!843 = !DILocation(line: 619, column: 3, scope: !33)
!844 = !DILocation(line: 621, column: 3, scope: !33)
!845 = !DILocation(line: 623, column: 13, scope: !33)
!846 = !DILocation(line: 624, column: 19, scope: !33)
!847 = !{!848, !848, i64 0}
!848 = !{!"long", !805, i64 0}
!849 = !DILocation(line: 627, column: 3, scope: !33)
!850 = !DILocation(line: 627, column: 18, scope: !33)
!851 = !DILocation(line: 606, column: 7, scope: !33)
!852 = !DILocation(line: 633, column: 11, scope: !853)
!853 = distinct !DILexicalBlock(scope: !854, file: !3, line: 630, column: 9)
!854 = distinct !DILexicalBlock(scope: !33, file: !3, line: 628, column: 5)
!855 = !DILocation(line: 635, column: 27, scope: !853)
!856 = !DILocation(line: 636, column: 11, scope: !853)
!857 = !DILocation(line: 638, column: 23, scope: !853)
!858 = !DILocation(line: 638, column: 21, scope: !853)
!859 = !DILocation(line: 639, column: 11, scope: !853)
!860 = distinct !{!860, !849, !861}
!861 = !DILocation(line: 645, column: 5, scope: !33)
!862 = !DILocation(line: 640, column: 9, scope: !853)
!863 = !DILocation(line: 641, column: 9, scope: !853)
!864 = !DILocation(line: 643, column: 11, scope: !853)
!865 = !DILocation(line: 647, column: 7, scope: !866)
!866 = distinct !DILexicalBlock(scope: !33, file: !3, line: 647, column: 7)
!867 = !DILocation(line: 647, column: 23, scope: !866)
!868 = !{!805, !805, i64 0}
!869 = !DILocation(line: 647, column: 7, scope: !33)
!870 = !DILocation(line: 649, column: 11, scope: !871)
!871 = distinct !DILexicalBlock(scope: !866, file: !3, line: 648, column: 5)
!872 = !DILocation(line: 650, column: 9, scope: !873)
!873 = distinct !DILexicalBlock(scope: !871, file: !3, line: 649, column: 11)
!874 = !DILocation(line: 653, column: 36, scope: !871)
!875 = !DILocation(line: 654, column: 34, scope: !871)
!876 = !DILocation(line: 656, column: 54, scope: !871)
!877 = !DILocation(line: 656, column: 23, scope: !871)
!878 = !DILocation(line: 605, column: 15, scope: !33)
!879 = !DILocation(line: 658, column: 11, scope: !880)
!880 = distinct !DILexicalBlock(scope: !871, file: !3, line: 658, column: 11)
!881 = !DILocation(line: 658, column: 11, scope: !871)
!882 = !DILocation(line: 665, column: 10, scope: !33)
!883 = !DILocation(line: 659, column: 9, scope: !880)
!884 = !DILocation(line: 662, column: 38, scope: !866)
!885 = !DILocation(line: 662, column: 51, scope: !866)
!886 = !DILocation(line: 662, column: 36, scope: !866)
!887 = !DILocation(line: 662, column: 18, scope: !866)
!888 = !DILocation(line: 665, column: 26, scope: !33)
!889 = !DILocation(line: 665, column: 3, scope: !33)
!890 = !DILocation(line: 667, column: 24, scope: !891)
!891 = distinct !DILexicalBlock(scope: !892, file: !3, line: 667, column: 11)
!892 = distinct !DILexicalBlock(scope: !33, file: !3, line: 666, column: 5)
!893 = !DILocation(line: 667, column: 11, scope: !892)
!894 = !DILocation(line: 668, column: 9, scope: !891)
!895 = !DILocation(line: 669, column: 17, scope: !892)
!896 = !DILocation(line: 665, column: 39, scope: !33)
!897 = distinct !{!897, !889, !898}
!898 = !DILocation(line: 670, column: 5, scope: !33)
!899 = !DILocation(line: 671, column: 32, scope: !33)
!900 = !DILocation(line: 671, column: 50, scope: !33)
!901 = !DILocation(line: 608, column: 10, scope: !33)
!902 = !DILocation(line: 672, column: 21, scope: !33)
!903 = !DILocation(line: 672, column: 17, scope: !33)
!904 = !DILocation(line: 673, column: 20, scope: !905)
!905 = distinct !DILexicalBlock(scope: !33, file: !3, line: 673, column: 7)
!906 = !DILocation(line: 673, column: 59, scope: !905)
!907 = !DILocation(line: 673, column: 39, scope: !905)
!908 = !DILocation(line: 674, column: 5, scope: !905)
!909 = !DILocation(line: 675, column: 14, scope: !33)
!910 = !DILocation(line: 675, column: 12, scope: !33)
!911 = !DILocation(line: 676, column: 7, scope: !912)
!912 = distinct !DILexicalBlock(scope: !33, file: !3, line: 676, column: 7)
!913 = !DILocation(line: 676, column: 7, scope: !33)
!914 = !DILocation(line: 678, column: 25, scope: !915)
!915 = distinct !DILexicalBlock(scope: !912, file: !3, line: 677, column: 5)
!916 = !DILocation(line: 678, column: 52, scope: !915)
!917 = !DILocation(line: 678, column: 7, scope: !915)
!918 = !DILocation(line: 680, column: 5, scope: !915)
!919 = !DILocation(line: 686, column: 11, scope: !33)
!920 = !{!921, !921, i64 0}
!921 = !{!"int", !805, i64 0}
!922 = !DILocation(line: 686, column: 18, scope: !33)
!923 = !DILocation(line: 687, column: 36, scope: !33)
!924 = !DILocation(line: 613, column: 22, scope: !33)
!925 = !DILocation(line: 607, column: 8, scope: !33)
!926 = !DILocation(line: 693, column: 12, scope: !48)
!927 = !DILocation(line: 695, column: 17, scope: !928)
!928 = distinct !DILexicalBlock(scope: !929, file: !3, line: 695, column: 5)
!929 = distinct !DILexicalBlock(scope: !48, file: !3, line: 695, column: 5)
!930 = !DILocation(line: 695, column: 5, scope: !929)
!931 = !DILocation(line: 568, column: 19, scope: !932, inlinedAt: !943)
!932 = distinct !DISubprogram(name: "tac_file", scope: !3, file: !3, line: 563, type: !933, isLocal: true, isDefinition: true, scopeLine: 564, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !935)
!933 = !DISubroutineType(types: !934)
!934 = !{!44, !25}
!935 = !{!936, !937, !938, !941, !942}
!936 = !DILocalVariable(name: "filename", arg: 1, scope: !932, file: !3, line: 563, type: !25)
!937 = !DILocalVariable(name: "ok", scope: !932, file: !3, line: 565, type: !44)
!938 = !DILocalVariable(name: "file_size", scope: !932, file: !3, line: 566, type: !939)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !940, line: 57, baseType: !165)
!940 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!941 = !DILocalVariable(name: "fd", scope: !932, file: !3, line: 567, type: !36)
!942 = !DILocalVariable(name: "is_stdin", scope: !932, file: !3, line: 568, type: !44)
!943 = distinct !DILocation(line: 696, column: 13, scope: !928)
!944 = !DILocation(line: 563, column: 23, scope: !932, inlinedAt: !943)
!945 = !DILocation(line: 570, column: 7, scope: !932, inlinedAt: !943)
!946 = !DILocation(line: 567, column: 7, scope: !932, inlinedAt: !943)
!947 = !DILocation(line: 574, column: 18, scope: !948, inlinedAt: !943)
!948 = distinct !DILexicalBlock(scope: !949, file: !3, line: 571, column: 5)
!949 = distinct !DILexicalBlock(scope: !932, file: !3, line: 570, column: 7)
!950 = !DILocation(line: 576, column: 5, scope: !948, inlinedAt: !943)
!951 = !DILocation(line: 579, column: 12, scope: !952, inlinedAt: !943)
!952 = distinct !DILexicalBlock(scope: !949, file: !3, line: 578, column: 5)
!953 = !DILocation(line: 580, column: 14, scope: !954, inlinedAt: !943)
!954 = distinct !DILexicalBlock(scope: !952, file: !3, line: 580, column: 11)
!955 = !DILocation(line: 580, column: 11, scope: !952, inlinedAt: !943)
!956 = !DILocation(line: 582, column: 21, scope: !957, inlinedAt: !943)
!957 = distinct !DILexicalBlock(scope: !954, file: !3, line: 581, column: 9)
!958 = !DILocation(line: 582, column: 28, scope: !957, inlinedAt: !943)
!959 = !DILocation(line: 583, column: 18, scope: !957, inlinedAt: !943)
!960 = !DILocation(line: 582, column: 11, scope: !957, inlinedAt: !943)
!961 = !DILocation(line: 584, column: 11, scope: !957, inlinedAt: !943)
!962 = !DILocation(line: 588, column: 15, scope: !932, inlinedAt: !943)
!963 = !DILocation(line: 566, column: 9, scope: !932, inlinedAt: !943)
!964 = !DILocation(line: 590, column: 19, scope: !932, inlinedAt: !943)
!965 = !DILocation(line: 590, column: 23, scope: !932, inlinedAt: !943)
!966 = !DILocation(line: 590, column: 26, scope: !932, inlinedAt: !943)
!967 = !DILocation(line: 590, column: 9, scope: !932, inlinedAt: !943)
!968 = !DILocalVariable(name: "input_fd", arg: 1, scope: !969, file: !3, line: 546, type: !36)
!969 = distinct !DISubprogram(name: "tac_nonseekable", scope: !3, file: !3, line: 546, type: !970, isLocal: true, isDefinition: true, scopeLine: 547, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !972)
!970 = !DISubroutineType(types: !971)
!971 = !{!44, !36, !25}
!972 = !{!968, !973, !974, !975, !976, !977}
!973 = !DILocalVariable(name: "file", arg: 2, scope: !969, file: !3, line: 546, type: !25)
!974 = !DILocalVariable(name: "tmp_stream", scope: !969, file: !3, line: 548, type: !135)
!975 = !DILocalVariable(name: "tmp_file", scope: !969, file: !3, line: 549, type: !20)
!976 = !DILocalVariable(name: "bytes_copied", scope: !969, file: !3, line: 550, type: !939)
!977 = !DILocalVariable(name: "ok", scope: !969, file: !3, line: 554, type: !44)
!978 = !DILocation(line: 546, column: 22, scope: !969, inlinedAt: !979)
!979 = distinct !DILocation(line: 591, column: 11, scope: !932, inlinedAt: !943)
!980 = !DILocation(line: 546, column: 44, scope: !969, inlinedAt: !979)
!981 = !DILocation(line: 548, column: 9, scope: !969, inlinedAt: !979)
!982 = !DILocation(line: 549, column: 9, scope: !969, inlinedAt: !979)
!983 = !DILocalVariable(name: "g_tmp", arg: 1, scope: !984, file: !3, line: 500, type: !134)
!984 = distinct !DISubprogram(name: "copy_to_temp", scope: !3, file: !3, line: 500, type: !985, isLocal: true, isDefinition: true, scopeLine: 501, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !987)
!985 = !DISubroutineType(types: !986)
!986 = !{!939, !134, !37, !36, !25}
!987 = !{!983, !988, !989, !990, !991, !992, !993, !997}
!988 = !DILocalVariable(name: "g_tempfile", arg: 2, scope: !984, file: !3, line: 500, type: !37)
!989 = !DILocalVariable(name: "input_fd", arg: 3, scope: !984, file: !3, line: 500, type: !36)
!990 = !DILocalVariable(name: "file", arg: 4, scope: !984, file: !3, line: 500, type: !25)
!991 = !DILocalVariable(name: "fp", scope: !984, file: !3, line: 502, type: !135)
!992 = !DILocalVariable(name: "file_name", scope: !984, file: !3, line: 503, type: !20)
!993 = !DILocalVariable(name: "bytes_copied", scope: !984, file: !3, line: 504, type: !994)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !995, line: 112, baseType: !996)
!995 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !166, line: 62, baseType: !29)
!997 = !DILocalVariable(name: "bytes_read", scope: !998, file: !3, line: 510, type: !27)
!998 = distinct !DILexicalBlock(scope: !984, file: !3, line: 509, column: 5)
!999 = !DILocation(line: 500, column: 22, scope: !984, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 550, column: 24, scope: !969, inlinedAt: !979)
!1001 = !DILocation(line: 500, column: 36, scope: !984, inlinedAt: !1000)
!1002 = !DILocation(line: 500, column: 52, scope: !984, inlinedAt: !1000)
!1003 = !DILocation(line: 500, column: 74, scope: !984, inlinedAt: !1000)
!1004 = !DILocation(line: 504, column: 13, scope: !984, inlinedAt: !1000)
!1005 = !DILocation(line: 502, column: 9, scope: !984, inlinedAt: !1000)
!1006 = !DILocation(line: 503, column: 9, scope: !984, inlinedAt: !1000)
!1007 = !DILocation(line: 431, column: 21, scope: !131, inlinedAt: !1008)
!1008 = distinct !DILocation(line: 505, column: 8, scope: !1009, inlinedAt: !1000)
!1009 = distinct !DILexicalBlock(scope: !984, file: !3, line: 505, column: 7)
!1010 = !DILocation(line: 431, column: 32, scope: !131, inlinedAt: !1008)
!1011 = !DILocation(line: 435, column: 7, scope: !196, inlinedAt: !1008)
!1012 = !DILocation(line: 435, column: 16, scope: !196, inlinedAt: !1008)
!1013 = !DILocation(line: 435, column: 7, scope: !131, inlinedAt: !1008)
!1014 = !DILocation(line: 437, column: 23, scope: !195, inlinedAt: !1008)
!1015 = !DILocation(line: 437, column: 19, scope: !195, inlinedAt: !1008)
!1016 = !DILocation(line: 438, column: 29, scope: !195, inlinedAt: !1008)
!1017 = !DILocation(line: 438, column: 19, scope: !195, inlinedAt: !1008)
!1018 = !DILocation(line: 439, column: 18, scope: !195, inlinedAt: !1008)
!1019 = !DILocation(line: 439, column: 16, scope: !195, inlinedAt: !1008)
!1020 = !DILocation(line: 455, column: 16, scope: !195, inlinedAt: !1008)
!1021 = !DILocation(line: 455, column: 11, scope: !195, inlinedAt: !1008)
!1022 = !DILocation(line: 456, column: 14, scope: !1023, inlinedAt: !1008)
!1023 = distinct !DILexicalBlock(scope: !195, file: !3, line: 456, column: 11)
!1024 = !DILocation(line: 456, column: 11, scope: !195, inlinedAt: !1008)
!1025 = !DILocation(line: 458, column: 21, scope: !1026, inlinedAt: !1008)
!1026 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 457, column: 9)
!1027 = !DILocation(line: 458, column: 28, scope: !1026, inlinedAt: !1008)
!1028 = !DILocation(line: 459, column: 18, scope: !1026, inlinedAt: !1008)
!1029 = !DILocation(line: 458, column: 11, scope: !1026, inlinedAt: !1008)
!1030 = !DILocation(line: 460, column: 11, scope: !1026, inlinedAt: !1008)
!1031 = !DILocation(line: 463, column: 16, scope: !195, inlinedAt: !1008)
!1032 = !DILocation(line: 463, column: 14, scope: !195, inlinedAt: !1008)
!1033 = !DILocation(line: 464, column: 13, scope: !1034, inlinedAt: !1008)
!1034 = distinct !DILexicalBlock(scope: !195, file: !3, line: 464, column: 11)
!1035 = !DILocation(line: 464, column: 11, scope: !195, inlinedAt: !1008)
!1036 = !DILocation(line: 466, column: 21, scope: !1037, inlinedAt: !1008)
!1037 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 465, column: 9)
!1038 = !DILocation(line: 466, column: 28, scope: !1037, inlinedAt: !1008)
!1039 = !DILocation(line: 467, column: 18, scope: !1037, inlinedAt: !1008)
!1040 = !DILocation(line: 466, column: 11, scope: !1037, inlinedAt: !1008)
!1041 = !DILocation(line: 468, column: 11, scope: !1037, inlinedAt: !1008)
!1042 = !DILocation(line: 469, column: 19, scope: !1037, inlinedAt: !1008)
!1043 = !DILocation(line: 469, column: 11, scope: !1037, inlinedAt: !1008)
!1044 = !DILocation(line: 476, column: 34, scope: !195, inlinedAt: !1008)
!1045 = !DILocalVariable(name: "fp", arg: 2, scope: !1046, file: !3, line: 420, type: !135)
!1046 = distinct !DISubprogram(name: "record_or_unlink_tempfile", scope: !3, file: !3, line: 420, type: !1047, isLocal: true, isDefinition: true, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1049)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{null, !25, !135}
!1049 = !{!1050, !1045}
!1050 = !DILocalVariable(name: "fn", arg: 1, scope: !1046, file: !3, line: 420, type: !25)
!1051 = !DILocation(line: 420, column: 50, scope: !1046, inlinedAt: !1052)
!1052 = distinct !DILocation(line: 476, column: 7, scope: !195, inlinedAt: !1008)
!1053 = !DILocation(line: 422, column: 3, scope: !1046, inlinedAt: !1052)
!1054 = !DILocation(line: 471, column: 17, scope: !1037, inlinedAt: !1008)
!1055 = !DILocation(line: 471, column: 11, scope: !1037, inlinedAt: !1008)
!1056 = !DILocation(line: 472, column: 20, scope: !1037, inlinedAt: !1008)
!1057 = !DILocation(line: 480, column: 7, scope: !1058, inlinedAt: !1008)
!1058 = distinct !DILexicalBlock(scope: !196, file: !3, line: 479, column: 5)
!1059 = !DILocation(line: 481, column: 19, scope: !1060, inlinedAt: !1008)
!1060 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 481, column: 11)
!1061 = !DILocation(line: 481, column: 11, scope: !1060, inlinedAt: !1008)
!1062 = !DILocation(line: 481, column: 40, scope: !1060, inlinedAt: !1008)
!1063 = !DILocation(line: 482, column: 11, scope: !1060, inlinedAt: !1008)
!1064 = !DILocation(line: 482, column: 33, scope: !1060, inlinedAt: !1008)
!1065 = !DILocation(line: 482, column: 25, scope: !1060, inlinedAt: !1008)
!1066 = !DILocation(line: 482, column: 14, scope: !1060, inlinedAt: !1008)
!1067 = !DILocation(line: 482, column: 45, scope: !1060, inlinedAt: !1008)
!1068 = !DILocation(line: 481, column: 11, scope: !1058, inlinedAt: !1008)
!1069 = !DILocation(line: 484, column: 21, scope: !1070, inlinedAt: !1008)
!1070 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 483, column: 9)
!1071 = !DILocation(line: 484, column: 28, scope: !1070, inlinedAt: !1008)
!1072 = !DILocation(line: 485, column: 18, scope: !1070, inlinedAt: !1008)
!1073 = !DILocation(line: 484, column: 11, scope: !1070, inlinedAt: !1008)
!1074 = !DILocation(line: 486, column: 11, scope: !1070, inlinedAt: !1008)
!1075 = !DILocation(line: 490, column: 9, scope: !131, inlinedAt: !1008)
!1076 = !DILocation(line: 491, column: 16, scope: !131, inlinedAt: !1008)
!1077 = !DILocation(line: 508, column: 3, scope: !984, inlinedAt: !1000)
!1078 = !DILocation(line: 510, column: 48, scope: !998, inlinedAt: !1000)
!1079 = !DILocation(line: 510, column: 58, scope: !998, inlinedAt: !1000)
!1080 = !DILocation(line: 510, column: 27, scope: !998, inlinedAt: !1000)
!1081 = !DILocation(line: 510, column: 14, scope: !998, inlinedAt: !1000)
!1082 = !DILocation(line: 511, column: 11, scope: !998, inlinedAt: !1000)
!1083 = !DILocation(line: 515, column: 21, scope: !1084, inlinedAt: !1000)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 514, column: 9)
!1085 = distinct !DILexicalBlock(scope: !998, file: !3, line: 513, column: 11)
!1086 = !DILocation(line: 515, column: 28, scope: !1084, inlinedAt: !1000)
!1087 = !DILocation(line: 515, column: 49, scope: !1084, inlinedAt: !1000)
!1088 = !DILocation(line: 515, column: 11, scope: !1084, inlinedAt: !1000)
!1089 = !DILocation(line: 516, column: 11, scope: !1084, inlinedAt: !1000)
!1090 = !DILocation(line: 519, column: 11, scope: !1091, inlinedAt: !1000)
!1091 = distinct !DILexicalBlock(scope: !998, file: !3, line: 519, column: 11)
!1092 = !DILocation(line: 519, column: 48, scope: !1091, inlinedAt: !1000)
!1093 = !DILocation(line: 528, column: 20, scope: !998, inlinedAt: !1000)
!1094 = !DILocation(line: 519, column: 11, scope: !998, inlinedAt: !1000)
!1095 = distinct !{!1095, !1096, !1097}
!1096 = !DILocation(line: 508, column: 3, scope: !984)
!1097 = !DILocation(line: 529, column: 5, scope: !984)
!1098 = !DILocation(line: 521, column: 21, scope: !1099, inlinedAt: !1000)
!1099 = distinct !DILexicalBlock(scope: !1091, file: !3, line: 520, column: 9)
!1100 = !DILocation(line: 521, column: 28, scope: !1099, inlinedAt: !1000)
!1101 = !DILocation(line: 521, column: 50, scope: !1099, inlinedAt: !1000)
!1102 = !DILocation(line: 521, column: 11, scope: !1099, inlinedAt: !1000)
!1103 = !DILocation(line: 522, column: 11, scope: !1099, inlinedAt: !1000)
!1104 = !DILocation(line: 531, column: 7, scope: !1105, inlinedAt: !1000)
!1105 = distinct !DILexicalBlock(scope: !984, file: !3, line: 531, column: 7)
!1106 = !DILocation(line: 531, column: 19, scope: !1105, inlinedAt: !1000)
!1107 = !DILocation(line: 531, column: 7, scope: !984, inlinedAt: !1000)
!1108 = !DILocation(line: 533, column: 17, scope: !1109, inlinedAt: !1000)
!1109 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 532, column: 5)
!1110 = !DILocation(line: 533, column: 24, scope: !1109, inlinedAt: !1000)
!1111 = !DILocation(line: 533, column: 46, scope: !1109, inlinedAt: !1000)
!1112 = !DILocation(line: 533, column: 7, scope: !1109, inlinedAt: !1000)
!1113 = !DILocation(line: 534, column: 7, scope: !1109, inlinedAt: !1000)
!1114 = !DILocation(line: 550, column: 9, scope: !969, inlinedAt: !979)
!1115 = !DILocation(line: 551, column: 20, scope: !1116, inlinedAt: !979)
!1116 = distinct !DILexicalBlock(scope: !969, file: !3, line: 551, column: 7)
!1117 = !DILocation(line: 551, column: 7, scope: !969, inlinedAt: !979)
!1118 = !DILocation(line: 554, column: 27, scope: !969, inlinedAt: !979)
!1119 = !DILocation(line: 554, column: 48, scope: !969, inlinedAt: !979)
!1120 = !DILocation(line: 554, column: 13, scope: !969, inlinedAt: !979)
!1121 = !DILocation(line: 592, column: 11, scope: !932, inlinedAt: !943)
!1122 = !DILocation(line: 594, column: 17, scope: !1123, inlinedAt: !943)
!1123 = distinct !DILexicalBlock(scope: !932, file: !3, line: 594, column: 7)
!1124 = !DILocation(line: 594, column: 20, scope: !1123, inlinedAt: !943)
!1125 = !DILocation(line: 594, column: 31, scope: !1123, inlinedAt: !943)
!1126 = !DILocation(line: 594, column: 7, scope: !932, inlinedAt: !943)
!1127 = !DILocation(line: 596, column: 17, scope: !1128, inlinedAt: !943)
!1128 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 595, column: 5)
!1129 = !DILocation(line: 596, column: 24, scope: !1128, inlinedAt: !943)
!1130 = !DILocation(line: 596, column: 45, scope: !1128, inlinedAt: !943)
!1131 = !DILocation(line: 596, column: 7, scope: !1128, inlinedAt: !943)
!1132 = !DILocation(line: 565, column: 8, scope: !932, inlinedAt: !943)
!1133 = !DILocation(line: 598, column: 5, scope: !1128, inlinedAt: !943)
!1134 = !DILocation(line: 696, column: 13, scope: !928)
!1135 = !DILocation(line: 696, column: 10, scope: !928)
!1136 = !DILocation(line: 695, column: 26, scope: !928)
!1137 = distinct !{!1137, !930, !1138}
!1138 = !DILocation(line: 696, column: 30, scope: !929)
!1139 = !DILocation(line: 159, column: 21, scope: !213, inlinedAt: !1140)
!1140 = distinct !DILocation(line: 700, column: 3, scope: !33)
!1141 = !DILocation(line: 159, column: 40, scope: !213, inlinedAt: !1140)
!1142 = !DILocation(line: 164, column: 40, scope: !213, inlinedAt: !1140)
!1143 = !DILocation(line: 168, column: 7, scope: !1144, inlinedAt: !1140)
!1144 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 167, column: 5)
!1145 = distinct !DILexicalBlock(scope: !213, file: !3, line: 166, column: 7)
!1146 = !DILocation(line: 702, column: 23, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !33, file: !3, line: 702, column: 7)
!1148 = !DILocation(line: 702, column: 26, scope: !1147)
!1149 = !DILocation(line: 702, column: 47, scope: !1147)
!1150 = !DILocation(line: 702, column: 7, scope: !33)
!1151 = !DILocation(line: 704, column: 17, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1147, file: !3, line: 703, column: 5)
!1153 = !DILocation(line: 704, column: 7, scope: !1152)
!1154 = !DILocation(line: 706, column: 5, scope: !1152)
!1155 = !DILocation(line: 713, column: 10, scope: !33)
!1156 = !DILocation(line: 714, column: 1, scope: !33)
!1157 = distinct !DISubprogram(name: "tac_seekable", scope: !3, file: !3, line: 193, type: !1158, isLocal: true, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1160)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!44, !36, !25, !939}
!1160 = !{!1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1174, !1176, !1180, !1181, !1182, !1183, !1188, !1189, !1190}
!1161 = !DILocalVariable(name: "input_fd", arg: 1, scope: !1157, file: !3, line: 193, type: !36)
!1162 = !DILocalVariable(name: "file", arg: 2, scope: !1157, file: !3, line: 193, type: !25)
!1163 = !DILocalVariable(name: "file_pos", arg: 3, scope: !1157, file: !3, line: 193, type: !939)
!1164 = !DILocalVariable(name: "match_start", scope: !1157, file: !3, line: 197, type: !20)
!1165 = !DILocalVariable(name: "past_end", scope: !1157, file: !3, line: 201, type: !20)
!1166 = !DILocalVariable(name: "saved_record_size", scope: !1157, file: !3, line: 204, type: !27)
!1167 = !DILocalVariable(name: "first_time", scope: !1157, file: !3, line: 208, type: !44)
!1168 = !DILocalVariable(name: "first_char", scope: !1157, file: !3, line: 209, type: !21)
!1169 = !DILocalVariable(name: "separator1", scope: !1157, file: !3, line: 210, type: !25)
!1170 = !DILocalVariable(name: "match_length1", scope: !1157, file: !3, line: 211, type: !27)
!1171 = !DILocalVariable(name: "remainder", scope: !1157, file: !3, line: 218, type: !27)
!1172 = !DILocalVariable(name: "rsize", scope: !1173, file: !3, line: 231, type: !939)
!1173 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 230, column: 5)
!1174 = !DILocalVariable(name: "nread", scope: !1175, file: !3, line: 240, type: !27)
!1175 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 239, column: 5)
!1176 = !DILocalVariable(name: "i", scope: !1177, file: !3, line: 270, type: !27)
!1177 = distinct !DILexicalBlock(scope: !1178, file: !3, line: 269, column: 9)
!1178 = distinct !DILexicalBlock(scope: !1179, file: !3, line: 268, column: 11)
!1179 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 261, column: 5)
!1180 = !DILocalVariable(name: "ri", scope: !1177, file: !3, line: 271, type: !209)
!1181 = !DILocalVariable(name: "range", scope: !1177, file: !3, line: 272, type: !209)
!1182 = !DILocalVariable(name: "ret", scope: !1177, file: !3, line: 273, type: !209)
!1183 = !DILocalVariable(name: "newbuffer", scope: !1184, file: !3, line: 321, type: !20)
!1184 = distinct !DILexicalBlock(scope: !1185, file: !3, line: 316, column: 13)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !3, line: 315, column: 15)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 306, column: 9)
!1187 = distinct !DILexicalBlock(scope: !1179, file: !3, line: 305, column: 11)
!1188 = !DILocalVariable(name: "offset", scope: !1184, file: !3, line: 322, type: !27)
!1189 = !DILocalVariable(name: "old_G_buffer_size", scope: !1184, file: !3, line: 323, type: !27)
!1190 = !DILocalVariable(name: "match_end", scope: !1191, file: !3, line: 366, type: !20)
!1191 = distinct !DILexicalBlock(scope: !1192, file: !3, line: 365, column: 13)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 364, column: 15)
!1193 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 362, column: 9)
!1194 = !DILocation(line: 193, column: 19, scope: !1157)
!1195 = !DILocation(line: 193, column: 41, scope: !1157)
!1196 = !DILocation(line: 193, column: 53, scope: !1157)
!1197 = !DILocation(line: 208, column: 8, scope: !1157)
!1198 = !DILocation(line: 209, column: 22, scope: !1157)
!1199 = !DILocation(line: 209, column: 21, scope: !1157)
!1200 = !DILocation(line: 209, column: 8, scope: !1157)
!1201 = !DILocation(line: 210, column: 38, scope: !1157)
!1202 = !DILocation(line: 210, column: 15, scope: !1157)
!1203 = !DILocation(line: 211, column: 26, scope: !1157)
!1204 = !DILocation(line: 211, column: 39, scope: !1157)
!1205 = !DILocation(line: 211, column: 10, scope: !1157)
!1206 = !DILocation(line: 218, column: 33, scope: !1157)
!1207 = !DILocation(line: 218, column: 31, scope: !1157)
!1208 = !DILocation(line: 218, column: 10, scope: !1157)
!1209 = !DILocation(line: 219, column: 17, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 219, column: 7)
!1211 = !DILocation(line: 219, column: 7, scope: !1157)
!1212 = !DILocation(line: 221, column: 16, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1210, file: !3, line: 220, column: 5)
!1214 = !DILocation(line: 222, column: 11, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1213, file: !3, line: 222, column: 11)
!1216 = !DILocation(line: 222, column: 48, scope: !1215)
!1217 = !DILocation(line: 222, column: 11, scope: !1213)
!1218 = !DILocation(line: 223, column: 19, scope: !1215)
!1219 = !DILocation(line: 223, column: 26, scope: !1215)
!1220 = !DILocation(line: 223, column: 48, scope: !1215)
!1221 = !DILocation(line: 223, column: 9, scope: !1215)
!1222 = !DILocation(line: 228, column: 52, scope: !1157)
!1223 = !DILocation(line: 228, column: 62, scope: !1157)
!1224 = !DILocation(line: 228, column: 31, scope: !1157)
!1225 = !DILocation(line: 204, column: 10, scope: !1157)
!1226 = !DILocation(line: 228, column: 74, scope: !1157)
!1227 = !DILocation(line: 229, column: 22, scope: !1157)
!1228 = !DILocation(line: 229, column: 10, scope: !1157)
!1229 = !DILocation(line: 228, column: 3, scope: !1157)
!1230 = !DILocation(line: 231, column: 21, scope: !1173)
!1231 = !DILocation(line: 231, column: 13, scope: !1173)
!1232 = !DILocation(line: 232, column: 28, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1173, file: !3, line: 232, column: 11)
!1234 = !DILocation(line: 232, column: 11, scope: !1233)
!1235 = !DILocation(line: 232, column: 46, scope: !1233)
!1236 = !DILocation(line: 232, column: 11, scope: !1173)
!1237 = !DILocation(line: 233, column: 19, scope: !1233)
!1238 = !DILocation(line: 233, column: 26, scope: !1233)
!1239 = !DILocation(line: 233, column: 48, scope: !1233)
