; ModuleID = 'coreutils-8.27/src/tail.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.File_spec = type { i8*, i64, %struct.timespec, i64, i64, i32, i8, i8, i8, i32, i32, i32, i32, i32, i64, i64 }
%struct.fd_set = type { [16 x i64] }
%struct.linebuffer = type { [8192 x i8], i64, i64, %struct.linebuffer* }
%struct.charbuffer = type { [8192 x i8], i64, %struct.charbuffer* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }

!15 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!17 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!18 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!19 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!20 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!21 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!22 = !DIEnumerator(name: "c_quoting_style", value: 5)
!23 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!24 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!25 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!26 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!27 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !29, line: 26, size: 32, elements: !30)
!29 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!30 = !{!31, !32, !33, !34, !35}
!31 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!32 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!33 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!34 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!35 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!36 = !{!37, !38, !39, !42, !47, !48, !51, !55, !58, !46}
!37 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !43, line: 98, baseType: !44)
!43 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !45, line: 142, baseType: !46)
!45 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 62, baseType: !50)
!49 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !52, line: 57, baseType: !53)
!52 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !45, line: 140, baseType: !54)
!54 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !56, line: 7, baseType: !57)
!56 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !45, line: 148, baseType: !54)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !59, line: 49, baseType: !54)
!59 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!60 = !{!61, !0, !122, !124, !126, !128, !130, !132, !134, !154, !168, !170, !176, !182, !184, !186, !188, !190}
!61 = !DIGlobalVariableExpression(var: !62)
!62 = distinct !DIGlobalVariable(name: "dummy_stdin", scope: !63, file: !3, line: 2290, type: !47, isLocal: true, isDefinition: true)
!63 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 2235, type: !64, isLocal: false, isDefinition: true, scopeLine: 2236, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !67)
!64 = !DISubroutineType(types: !65)
!65 = !{!46, !46, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!67 = !{!68, !69, !70, !71, !73, !77, !78, !79, !111, !112, !113, !115, !117}
!68 = !DILocalVariable(name: "argc", arg: 1, scope: !63, file: !3, line: 2235, type: !46)
!69 = !DILocalVariable(name: "argv", arg: 2, scope: !63, file: !3, line: 2235, type: !66)
!70 = !DILocalVariable(name: "header_mode", scope: !63, file: !3, line: 2237, type: !5)
!71 = !DILocalVariable(name: "ok", scope: !63, file: !3, line: 2238, type: !72)
!72 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!73 = !DILocalVariable(name: "n_units", scope: !63, file: !3, line: 2242, type: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !75, line: 112, baseType: !76)
!75 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !45, line: 62, baseType: !50)
!77 = !DILocalVariable(name: "n_files", scope: !63, file: !3, line: 2243, type: !48)
!78 = !DILocalVariable(name: "file", scope: !63, file: !3, line: 2244, type: !66)
!79 = !DILocalVariable(name: "F", scope: !63, file: !3, line: 2245, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "File_spec", file: !3, line: 114, size: 768, elements: !82)
!82 = !{!83, !84, !85, !92, !95, !98, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !3, line: 117, baseType: !47, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !81, file: !3, line: 120, baseType: !51, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !81, file: !3, line: 121, baseType: !86, size: 128, offset: 128)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !87, line: 8, size: 128, elements: !88)
!87 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !86, file: !87, line: 10, baseType: !57, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !86, file: !87, line: 11, baseType: !91, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !45, line: 184, baseType: !54)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !81, file: !3, line: 122, baseType: !93, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !43, line: 60, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !45, line: 133, baseType: !50)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !81, file: !3, line: 123, baseType: !96, size: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !43, line: 48, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !45, line: 136, baseType: !50)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !81, file: !3, line: 124, baseType: !99, size: 32, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !43, line: 70, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !45, line: 138, baseType: !37)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !81, file: !3, line: 129, baseType: !72, size: 8, offset: 416)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !81, file: !3, line: 132, baseType: !72, size: 8, offset: 424)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tailable", scope: !81, file: !3, line: 136, baseType: !72, size: 8, offset: 432)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !81, file: !3, line: 139, baseType: !46, size: 32, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !81, file: !3, line: 142, baseType: !46, size: 32, offset: 480)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !81, file: !3, line: 145, baseType: !46, size: 32, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !81, file: !3, line: 149, baseType: !46, size: 32, offset: 544)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "parent_wd", scope: !81, file: !3, line: 153, baseType: !46, size: 32, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "basename_start", scope: !81, file: !3, line: 156, baseType: !48, size: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "n_unchanged_stats", scope: !81, file: !3, line: 160, baseType: !74, size: 64, offset: 704)
!111 = !DILocalVariable(name: "i", scope: !63, file: !3, line: 2246, type: !48)
!112 = !DILocalVariable(name: "obsolete_option", scope: !63, file: !3, line: 2247, type: !72)
!113 = !DILocalVariable(name: "sleep_interval", scope: !63, file: !3, line: 2252, type: !114)
!114 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!115 = !DILocalVariable(name: "found_hyphen", scope: !116, file: !3, line: 2296, type: !72)
!116 = distinct !DILexicalBlock(scope: !63, file: !3, line: 2295, column: 3)
!117 = !DILocalVariable(name: "wd", scope: !118, file: !3, line: 2384, type: !46)
!118 = distinct !DILexicalBlock(scope: !119, file: !3, line: 2383, column: 9)
!119 = distinct !DILexicalBlock(scope: !120, file: !3, line: 2382, column: 11)
!120 = distinct !DILexicalBlock(scope: !121, file: !3, line: 2332, column: 5)
!121 = distinct !DILexicalBlock(scope: !63, file: !3, line: 2331, column: 7)
!122 = !DIGlobalVariableExpression(var: !123)
!123 = distinct !DIGlobalVariable(name: "forever", scope: !2, file: !3, line: 176, type: !72, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125)
!125 = distinct !DIGlobalVariable(name: "from_start", scope: !2, file: !3, line: 179, type: !72, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127)
!127 = distinct !DIGlobalVariable(name: "print_headers", scope: !2, file: !3, line: 182, type: !72, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129)
!129 = distinct !DIGlobalVariable(name: "line_end", scope: !2, file: !3, line: 185, type: !41, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131)
!131 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 207, type: !72, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133)
!133 = distinct !DIGlobalVariable(name: "disable_inotify", scope: !2, file: !3, line: 215, type: !72, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135)
!135 = distinct !DIGlobalVariable(name: "infomap", scope: !136, file: !137, line: 632, type: !151, isLocal: true, isDefinition: true)
!136 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !137, file: !137, line: 630, type: !138, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !140)
!137 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!138 = !DISubroutineType(types: !139)
!139 = !{null, !39}
!140 = !{!141, !142, !143, !150}
!141 = !DILocalVariable(name: "program", arg: 1, scope: !136, file: !137, line: 630, type: !39)
!142 = !DILocalVariable(name: "node", scope: !136, file: !137, line: 642, type: !39)
!143 = !DILocalVariable(name: "map_prog", scope: !136, file: !137, line: 643, type: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !136, file: !137, line: 632, size: 128, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !146, file: !137, line: 632, baseType: !39, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !146, file: !137, line: 632, baseType: !39, size: 64, offset: 64)
!150 = !DILocalVariable(name: "lc_messages", scope: !136, file: !137, line: 655, type: !39)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 896, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 7)
!154 = !DIGlobalVariableExpression(var: !155)
!155 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 229, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 4096, elements: !166)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !159, line: 50, size: 256, elements: !160)
!159 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!160 = !{!161, !162, !163, !165}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !158, file: !159, line: 52, baseType: !39, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !158, file: !159, line: 55, baseType: !46, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !158, file: !159, line: 56, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !158, file: !159, line: 57, baseType: !46, size: 32, offset: 192)
!166 = !{!167}
!167 = !DISubrange(count: 16)
!168 = !DIGlobalVariableExpression(var: !169)
!169 = distinct !DIGlobalVariable(name: "reopen_inaccessible_files", scope: !2, file: !3, line: 165, type: !72, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171)
!171 = distinct !DIGlobalVariable(name: "follow_mode_map", scope: !2, file: !3, line: 109, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 64, elements: !174)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!174 = !{!175}
!175 = !DISubrange(count: 2)
!176 = !DIGlobalVariableExpression(var: !177)
!177 = distinct !DIGlobalVariable(name: "follow_mode_string", scope: !2, file: !3, line: 104, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 192, elements: !180)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!180 = !{!181}
!181 = !DISubrange(count: 3)
!182 = !DIGlobalVariableExpression(var: !183)
!183 = distinct !DIGlobalVariable(name: "max_n_unchanged_stats_between_opens", scope: !2, file: !3, line: 199, type: !74, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185)
!185 = distinct !DIGlobalVariable(name: "pid", scope: !2, file: !3, line: 204, type: !42, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187)
!187 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !2, file: !3, line: 212, type: !72, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189)
!189 = distinct !DIGlobalVariable(name: "follow_mode", scope: !2, file: !3, line: 173, type: !10, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191)
!191 = distinct !DIGlobalVariable(name: "first_file", scope: !192, file: !3, line: 376, type: !72, isLocal: true, isDefinition: true)
!192 = distinct !DISubprogram(name: "write_header", scope: !3, file: !3, line: 374, type: !138, isLocal: true, isDefinition: true, scopeLine: 375, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !193)
!193 = !{!194}
!194 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !192, file: !3, line: 374, type: !39)
!195 = !DIGlobalVariableExpression(var: !196)
!196 = distinct !DIGlobalVariable(name: "Version", scope: !197, file: !198, line: 2, type: !39, isLocal: false, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, globals: !200)
!198 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!199 = !{}
!200 = !{!195}
!201 = !DIGlobalVariableExpression(var: !202)
!202 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !203, file: !209, line: 69, type: !210, isLocal: false, isDefinition: true)
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !205, retainedTypes: !206, globals: !208)
!204 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!205 = !{!14}
!206 = !{!38, !207}
!207 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!208 = !{!201}
!209 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !211, line: 55, baseType: !212)
!211 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null}
!215 = !DIGlobalVariableExpression(var: !216)
!216 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !217, file: !244, line: 51, type: !245, isLocal: true, isDefinition: true)
!217 = distinct !DICompileUnit(language: DW_LANG_C99, file: !218, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, retainedTypes: !219, globals: !243)
!218 = !DIFile(filename: "./lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!219 = !{!47, !220}
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !221, line: 24, baseType: !222)
!221 = !DIFile(filename: "/usr/include/bits/types/locale_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !223, line: 42, baseType: !224)
!223 = !DIFile(filename: "/usr/include/bits/types/__locale_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !223, line: 28, size: 1856, elements: !226)
!226 = !{!227, !233, !237, !240, !241}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !225, file: !223, line: 31, baseType: !228, size: 832)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 832, elements: !231)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !223, line: 31, flags: DIFlagFwdDecl)
!231 = !{!232}
!232 = !DISubrange(count: 13)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !225, file: !223, line: 34, baseType: !234, size: 64, offset: 832)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!236 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !225, file: !223, line: 35, baseType: !238, size: 64, offset: 896)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !225, file: !223, line: 36, baseType: !238, size: 64, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !225, file: !223, line: 39, baseType: !242, size: 832, offset: 1024)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 832, elements: !231)
!243 = !{!215}
!244 = !DIFile(filename: "lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!245 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !220)
!246 = !DIGlobalVariableExpression(var: !247)
!247 = distinct !DIGlobalVariable(name: "file_name", scope: !248, file: !253, line: 36, type: !39, isLocal: true, isDefinition: true)
!248 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, globals: !250)
!249 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!250 = !{!246, !251}
!251 = !DIGlobalVariableExpression(var: !252)
!252 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !248, file: !253, line: 46, type: !72, isLocal: true, isDefinition: true)
!253 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!254 = !DIGlobalVariableExpression(var: !255)
!255 = distinct !DIGlobalVariable(name: "exit_failure", scope: !256, file: !259, line: 24, type: !260, isLocal: false, isDefinition: true)
!256 = distinct !DICompileUnit(language: DW_LANG_C99, file: !257, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, globals: !258)
!257 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!258 = !{!254}
!259 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!260 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !46)
!261 = !DIGlobalVariableExpression(var: !262)
!262 = distinct !DIGlobalVariable(name: "default_tuning", scope: !263, file: !267, line: 130, type: !268, isLocal: true, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, retainedTypes: !265, globals: !266)
!264 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!265 = !{!50, !38, !48}
!266 = !{!261}
!267 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !270, line: 65, baseType: !271)
!270 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !270, line: 53, size: 160, elements: !272)
!272 = !{!273, !275, !276, !277, !278}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !271, file: !270, line: 58, baseType: !274, size: 32)
!274 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !271, file: !270, line: 59, baseType: !274, size: 32, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !271, file: !270, line: 60, baseType: !274, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !271, file: !270, line: 61, baseType: !274, size: 32, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !271, file: !270, line: 62, baseType: !72, size: 8, offset: 128)
!279 = !DIGlobalVariableExpression(var: !280)
!280 = distinct !DIGlobalVariable(name: "program_name", scope: !281, file: !285, line: 33, type: !39, isLocal: false, isDefinition: true)
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, retainedTypes: !283, globals: !284)
!282 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!283 = !{!38, !47}
!284 = !{!279}
!285 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!286 = !DIGlobalVariableExpression(var: !287)
!287 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !288, file: !315, line: 77, type: !350, isLocal: false, isDefinition: true)
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !290, retainedTypes: !311, globals: !312)
!289 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!290 = !{!14, !291, !296}
!291 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !15, line: 242, size: 32, elements: !292)
!292 = !{!293, !294, !295}
!293 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!294 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!295 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 46, size: 32, elements: !298)
!297 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!299 = !DIEnumerator(name: "_ISupper", value: 256)
!300 = !DIEnumerator(name: "_ISlower", value: 512)
!301 = !DIEnumerator(name: "_ISalpha", value: 1024)
!302 = !DIEnumerator(name: "_ISdigit", value: 2048)
!303 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!304 = !DIEnumerator(name: "_ISspace", value: 8192)
!305 = !DIEnumerator(name: "_ISprint", value: 16384)
!306 = !DIEnumerator(name: "_ISgraph", value: 32768)
!307 = !DIEnumerator(name: "_ISblank", value: 1)
!308 = !DIEnumerator(name: "_IScntrl", value: 2)
!309 = !DIEnumerator(name: "_ISpunct", value: 4)
!310 = !DIEnumerator(name: "_ISalnum", value: 8)
!311 = !{!46, !236, !48, !47}
!312 = !{!286, !313, !320, !332, !334, !339, !346, !348}
!313 = !DIGlobalVariableExpression(var: !314)
!314 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !288, file: !315, line: 93, type: !316, isLocal: false, isDefinition: true)
!315 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 320, elements: !318)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!318 = !{!319}
!319 = !DISubrange(count: 10)
!320 = !DIGlobalVariableExpression(var: !321)
!321 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !288, file: !315, line: 1043, type: !322, isLocal: false, isDefinition: true)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !315, line: 57, size: 448, elements: !323)
!323 = !{!324, !325, !326, !330, !331}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !322, file: !315, line: 60, baseType: !14, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !322, file: !315, line: 63, baseType: !46, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !322, file: !315, line: 67, baseType: !327, size: 256, offset: 64)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 256, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 8)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !322, file: !315, line: 70, baseType: !39, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !322, file: !315, line: 73, baseType: !39, size: 64, offset: 384)
!332 = !DIGlobalVariableExpression(var: !333)
!333 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !288, file: !315, line: 108, type: !322, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335)
!335 = distinct !DIGlobalVariable(name: "slot0", scope: !288, file: !315, line: 834, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 256)
!339 = !DIGlobalVariableExpression(var: !340)
!340 = distinct !DIGlobalVariable(name: "slotvec", scope: !288, file: !315, line: 837, type: !341, isLocal: true, isDefinition: true)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !315, line: 826, size: 128, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !342, file: !315, line: 828, baseType: !48, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !342, file: !315, line: 829, baseType: !47, size: 64, offset: 64)
!346 = !DIGlobalVariableExpression(var: !347)
!347 = distinct !DIGlobalVariable(name: "nslots", scope: !288, file: !315, line: 835, type: !46, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349)
!349 = distinct !DIGlobalVariable(name: "slotvec0", scope: !288, file: !315, line: 836, type: !342, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 704, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 11)
!353 = !DIGlobalVariableExpression(var: !354)
!354 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !355, file: !358, line: 26, type: !359, isLocal: false, isDefinition: true)
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, globals: !357)
!356 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!357 = !{!353}
!358 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 376, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 47)
!362 = !DIGlobalVariableExpression(var: !363)
!363 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !364, file: !365, line: 335, type: !46, isLocal: true, isDefinition: true)
!364 = distinct !DISubprogram(name: "rpl_fcntl", scope: !365, file: !365, line: 272, type: !366, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !368, variables: !371)
!365 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!366 = !DISubroutineType(types: !367)
!367 = !{!46, !46, !46, null}
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, globals: !370)
!369 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!370 = !{!362}
!371 = !{!372, !373, !374, !387, !388, !391, !394, !397}
!372 = !DILocalVariable(name: "fd", arg: 1, scope: !364, file: !365, line: 272, type: !46)
!373 = !DILocalVariable(name: "action", arg: 2, scope: !364, file: !365, line: 272, type: !46)
!374 = !DILocalVariable(name: "arg", scope: !364, file: !365, line: 274, type: !375)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !376, line: 30, baseType: !377)
!376 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !369, line: 274, baseType: !378)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 192, elements: !385)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !369, line: 274, size: 192, elements: !380)
!380 = !{!381, !382, !383, !384}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !379, file: !369, line: 274, baseType: !37, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !379, file: !369, line: 274, baseType: !37, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !379, file: !369, line: 274, baseType: !38, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !379, file: !369, line: 274, baseType: !38, size: 64, offset: 128)
!385 = !{!386}
!386 = !DISubrange(count: 1)
!387 = !DILocalVariable(name: "result", scope: !364, file: !365, line: 275, type: !46)
!388 = !DILocalVariable(name: "target", scope: !389, file: !365, line: 322, type: !46)
!389 = distinct !DILexicalBlock(scope: !390, file: !365, line: 321, column: 7)
!390 = distinct !DILexicalBlock(scope: !364, file: !365, line: 278, column: 5)
!391 = !DILocalVariable(name: "flags", scope: !392, file: !365, line: 359, type: !46)
!392 = distinct !DILexicalBlock(scope: !393, file: !365, line: 358, column: 11)
!393 = distinct !DILexicalBlock(scope: !389, file: !365, line: 357, column: 13)
!394 = !DILocalVariable(name: "saved_errno", scope: !395, file: !365, line: 362, type: !46)
!395 = distinct !DILexicalBlock(scope: !396, file: !365, line: 361, column: 15)
!396 = distinct !DILexicalBlock(scope: !392, file: !365, line: 360, column: 17)
!397 = !DILocalVariable(name: "p", scope: !398, file: !365, line: 404, type: !38)
!398 = distinct !DILexicalBlock(scope: !390, file: !365, line: 402, column: 7)
!399 = !DIGlobalVariableExpression(var: !400)
!400 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !401, file: !745, line: 120, type: !746, isLocal: true, isDefinition: true)
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !403, retainedTypes: !742, globals: !744)
!402 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!403 = !{!404}
!404 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !405, line: 41, size: 32, elements: !406)
!405 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!407 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!408 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!409 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!410 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!411 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!412 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!413 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!414 = !DIEnumerator(name: "DAY_1", value: 131079)
!415 = !DIEnumerator(name: "DAY_2", value: 131080)
!416 = !DIEnumerator(name: "DAY_3", value: 131081)
!417 = !DIEnumerator(name: "DAY_4", value: 131082)
!418 = !DIEnumerator(name: "DAY_5", value: 131083)
!419 = !DIEnumerator(name: "DAY_6", value: 131084)
!420 = !DIEnumerator(name: "DAY_7", value: 131085)
!421 = !DIEnumerator(name: "ABMON_1", value: 131086)
!422 = !DIEnumerator(name: "ABMON_2", value: 131087)
!423 = !DIEnumerator(name: "ABMON_3", value: 131088)
!424 = !DIEnumerator(name: "ABMON_4", value: 131089)
!425 = !DIEnumerator(name: "ABMON_5", value: 131090)
!426 = !DIEnumerator(name: "ABMON_6", value: 131091)
!427 = !DIEnumerator(name: "ABMON_7", value: 131092)
!428 = !DIEnumerator(name: "ABMON_8", value: 131093)
!429 = !DIEnumerator(name: "ABMON_9", value: 131094)
!430 = !DIEnumerator(name: "ABMON_10", value: 131095)
!431 = !DIEnumerator(name: "ABMON_11", value: 131096)
!432 = !DIEnumerator(name: "ABMON_12", value: 131097)
!433 = !DIEnumerator(name: "MON_1", value: 131098)
!434 = !DIEnumerator(name: "MON_2", value: 131099)
!435 = !DIEnumerator(name: "MON_3", value: 131100)
!436 = !DIEnumerator(name: "MON_4", value: 131101)
!437 = !DIEnumerator(name: "MON_5", value: 131102)
!438 = !DIEnumerator(name: "MON_6", value: 131103)
!439 = !DIEnumerator(name: "MON_7", value: 131104)
!440 = !DIEnumerator(name: "MON_8", value: 131105)
!441 = !DIEnumerator(name: "MON_9", value: 131106)
!442 = !DIEnumerator(name: "MON_10", value: 131107)
!443 = !DIEnumerator(name: "MON_11", value: 131108)
!444 = !DIEnumerator(name: "MON_12", value: 131109)
!445 = !DIEnumerator(name: "AM_STR", value: 131110)
!446 = !DIEnumerator(name: "PM_STR", value: 131111)
!447 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!448 = !DIEnumerator(name: "D_FMT", value: 131113)
!449 = !DIEnumerator(name: "T_FMT", value: 131114)
!450 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!451 = !DIEnumerator(name: "ERA", value: 131116)
!452 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!453 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!454 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!455 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!456 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!457 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!458 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!459 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!460 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!461 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!462 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!463 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!464 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!465 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!466 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!467 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!468 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!469 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!470 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!471 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!472 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!473 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!474 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!475 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!476 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!477 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!478 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!479 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!480 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!481 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!482 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!483 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!484 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!485 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!486 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!487 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!488 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!489 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!490 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!491 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!492 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!493 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!494 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!495 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!496 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!497 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!498 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!499 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!500 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!501 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!502 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!503 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!504 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!505 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!506 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!507 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!508 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!509 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!510 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!511 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!512 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!513 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!514 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!515 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!516 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!517 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!518 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!519 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!520 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!521 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!522 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!523 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!524 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!525 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!526 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!527 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!528 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!529 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!530 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!531 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!532 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!533 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!534 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!535 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!536 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!537 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!538 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!539 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!540 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!541 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!542 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!543 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!544 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!545 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!546 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!547 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!548 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!549 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!550 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!551 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!552 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!553 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!554 = !DIEnumerator(name: "CODESET", value: 14)
!555 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!556 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!557 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!558 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!559 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!560 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!561 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!562 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!563 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!564 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!565 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!566 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!567 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!568 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!569 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!570 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!571 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!572 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!573 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!574 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!575 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!576 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!577 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!578 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!579 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!580 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!581 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!582 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!583 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!584 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!585 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!586 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!587 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!588 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!589 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!590 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!591 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!592 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!593 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!594 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!595 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!596 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!597 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!598 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!599 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!600 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!601 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!602 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!603 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!604 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!605 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!606 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!607 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!608 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!609 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!610 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!611 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!612 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!613 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!614 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!615 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!616 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!617 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!618 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!619 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!620 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!621 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!622 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!623 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!624 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!625 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!626 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!627 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!628 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!629 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!630 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!631 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!632 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!633 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!634 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!635 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!636 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!637 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!638 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!639 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!640 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!641 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!642 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!643 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!644 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!645 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!646 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!647 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!648 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!649 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!650 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!651 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!652 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!653 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!654 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!655 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!656 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!657 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!658 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!659 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!660 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!661 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!662 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!663 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!664 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!665 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!666 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!667 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!668 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!669 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!670 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!671 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!672 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!673 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!674 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!675 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!676 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!677 = !DIEnumerator(name: "THOUSEP", value: 65537)
!678 = !DIEnumerator(name: "__GROUPING", value: 65538)
!679 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!680 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!681 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!682 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!683 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!684 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!685 = !DIEnumerator(name: "__YESSTR", value: 327682)
!686 = !DIEnumerator(name: "__NOSTR", value: 327683)
!687 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!688 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!689 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!690 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!691 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!692 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!693 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!694 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!695 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!696 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!697 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!698 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!699 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!700 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!701 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!702 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!703 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!704 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!705 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!706 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!707 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!708 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!709 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!710 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!711 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!712 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!713 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!714 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!715 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!716 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!717 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!718 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!719 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!720 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!721 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!722 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!723 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!724 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!725 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!726 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!727 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!728 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!729 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!730 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!731 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!732 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!733 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!734 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!735 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!736 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!737 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!738 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!739 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!740 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!741 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!742 = !{!38, !47, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!744 = !{!399}
!745 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!746 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !39)
!747 = distinct !DICompileUnit(language: DW_LANG_C99, file: !748, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199)
!748 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, retainedTypes: !751)
!750 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!751 = !{!47}
!752 = distinct !DICompileUnit(language: DW_LANG_C99, file: !753, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199)
!753 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!754 = distinct !DICompileUnit(language: DW_LANG_C99, file: !755, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, retainedTypes: !756)
!755 = !DIFile(filename: "./lib/offtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !43, line: 86, baseType: !53)
!758 = distinct !DICompileUnit(language: DW_LANG_C99, file: !759, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199)
!759 = !DIFile(filename: "./lib/posixver.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!760 = distinct !DICompileUnit(language: DW_LANG_C99, file: !761, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !762)
!761 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!762 = !{!763}
!763 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !765, file: !764, line: 62, size: 32, elements: !778)
!764 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!765 = distinct !DISubprogram(name: "safe_read", scope: !764, file: !764, line: 56, type: !766, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !760, variables: !768)
!766 = !DISubroutineType(types: !767)
!767 = !{!48, !46, !38, !48}
!768 = !{!769, !770, !771, !772}
!769 = !DILocalVariable(name: "fd", arg: 1, scope: !765, file: !764, line: 56, type: !46)
!770 = !DILocalVariable(name: "buf", arg: 2, scope: !765, file: !764, line: 56, type: !38)
!771 = !DILocalVariable(name: "count", arg: 3, scope: !765, file: !764, line: 56, type: !48)
!772 = !DILocalVariable(name: "result", scope: !773, file: !764, line: 66, type: !776)
!773 = distinct !DILexicalBlock(scope: !774, file: !764, line: 65, column: 5)
!774 = distinct !DILexicalBlock(scope: !775, file: !764, line: 64, column: 3)
!775 = distinct !DILexicalBlock(scope: !765, file: !764, line: 64, column: 3)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !43, line: 109, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !45, line: 181, baseType: !54)
!778 = !{!779}
!779 = !DIEnumerator(name: "BUGGY_READ_MAXIMUM", value: 2147475456)
!780 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199)
!781 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!782 = distinct !DICompileUnit(language: DW_LANG_C99, file: !783, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !784, retainedTypes: !789)
!783 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!784 = !{!785}
!785 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !786, line: 41, size: 32, elements: !787)
!786 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!787 = !{!788}
!788 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!789 = !{!38}
!790 = distinct !DICompileUnit(language: DW_LANG_C99, file: !791, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !792, retainedTypes: !806)
!791 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!792 = !{!793}
!793 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !795, file: !794, line: 192, size: 32, elements: !804)
!794 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!795 = distinct !DISubprogram(name: "x2nrealloc", scope: !794, file: !794, line: 180, type: !796, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !790, variables: !799)
!796 = !DISubroutineType(types: !797)
!797 = !{!38, !38, !798, !48}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!799 = !{!800, !801, !802, !803}
!800 = !DILocalVariable(name: "p", arg: 1, scope: !795, file: !794, line: 180, type: !38)
!801 = !DILocalVariable(name: "pn", arg: 2, scope: !795, file: !794, line: 180, type: !798)
!802 = !DILocalVariable(name: "s", arg: 3, scope: !795, file: !794, line: 180, type: !48)
!803 = !DILocalVariable(name: "n", scope: !795, file: !794, line: 182, type: !48)
!804 = !{!805}
!805 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!806 = !{!48, !47, !38}
!807 = distinct !DICompileUnit(language: DW_LANG_C99, file: !808, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199)
!808 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!809 = distinct !DICompileUnit(language: DW_LANG_C99, file: !810, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !811)
!810 = !DIFile(filename: "./lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!811 = !{!28}
!812 = distinct !DICompileUnit(language: DW_LANG_C99, file: !813, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199)
!813 = !DIFile(filename: "./lib/xnanosleep.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!814 = distinct !DICompileUnit(language: DW_LANG_C99, file: !815, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, retainedTypes: !789)
!815 = !DIFile(filename: "./lib/xstrtod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!816 = distinct !DICompileUnit(language: DW_LANG_C99, file: !817, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !818, retainedTypes: !819)
!817 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!818 = !{!28, !296}
!819 = !{!46, !236}
!820 = distinct !DICompileUnit(language: DW_LANG_C99, file: !821, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, retainedTypes: !789)
!821 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!822 = distinct !DICompileUnit(language: DW_LANG_C99, file: !823, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, retainedTypes: !824)
!823 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!824 = !{!48}
!825 = distinct !DICompileUnit(language: DW_LANG_C99, file: !826, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !827)
!826 = !DIFile(filename: "./lib/nanosleep.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!827 = !{!828}
!828 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !829, line: 41, size: 32, elements: !830)
!829 = !DIFile(filename: "lib/nanosleep.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!830 = !{!831}
!831 = !DIEnumerator(name: "BILLION", value: 1000000000)
!832 = distinct !DICompileUnit(language: DW_LANG_C99, file: !833, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199)
!833 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !836, retainedTypes: !841)
!835 = !DIFile(filename: "./lib/dtotimespec.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!836 = !{!837}
!837 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !838, line: 35, size: 32, elements: !839)
!838 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!839 = !{!840}
!840 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000)
!841 = !{!55}
!842 = distinct !DICompileUnit(language: DW_LANG_C99, file: !843, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199)
!843 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199)
!845 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199)
!847 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!848 = distinct !DICompileUnit(language: DW_LANG_C99, file: !849, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, retainedTypes: !789)
!849 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!850 = distinct !DICompileUnit(language: DW_LANG_C99, file: !851, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, retainedTypes: !789)
!851 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!852 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!853 = !{i32 2, !"Dwarf Version", i32 4}
!854 = !{i32 2, !"Debug Info Version", i32 3}
!855 = !{i32 1, !"wchar_size", i32 4}
!856 = !{i32 7, !"PIC Level", i32 2}
!857 = !{i32 7, !"PIE Level", i32 2}
!858 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 252, type: !859, isLocal: false, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !861)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !46}
!861 = !{!862}
!862 = !DILocalVariable(name: "status", arg: 1, scope: !858, file: !3, line: 252, type: !46)
!863 = !DIExpression()
!864 = !DILocation(line: 252, column: 12, scope: !858)
!865 = !DILocation(line: 254, column: 14, scope: !866)
!866 = distinct !DILexicalBlock(scope: !858, file: !3, line: 254, column: 7)
!867 = !DILocation(line: 254, column: 7, scope: !858)
!868 = !DILocation(line: 255, column: 5, scope: !869)
!869 = distinct !DILexicalBlock(scope: !866, file: !3, line: 255, column: 5)
!870 = !{!871, !871, i64 0}
!871 = !{!"any pointer", !872, i64 0}
!872 = !{!"omnipotent char", !873, i64 0}
!873 = !{!"Simple C/C++ TBAA"}
!874 = !DILocation(line: 258, column: 7, scope: !875)
!875 = distinct !DILexicalBlock(scope: !866, file: !3, line: 257, column: 5)
!876 = !DILocation(line: 262, column: 7, scope: !875)
!877 = !DILocation(line: 580, column: 3, scope: !878, inlinedAt: !879)
!878 = distinct !DISubprogram(name: "emit_stdin_note", scope: !137, file: !137, line: 578, type: !213, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !199)
!879 = distinct !DILocation(line: 267, column: 7, scope: !875)
!880 = !DILocation(line: 587, column: 3, scope: !881, inlinedAt: !882)
!881 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !137, file: !137, line: 585, type: !213, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !199)
!882 = distinct !DILocation(line: 268, column: 7, scope: !875)
!883 = !DILocation(line: 270, column: 6, scope: !875)
!884 = !DILocation(line: 274, column: 6, scope: !875)
!885 = !DILocation(line: 280, column: 6, scope: !875)
!886 = !DILocation(line: 293, column: 6, scope: !875)
!887 = !DILocation(line: 298, column: 6, scope: !875)
!888 = !DILocation(line: 305, column: 6, scope: !875)
!889 = !DILocation(line: 308, column: 6, scope: !875)
!890 = !DILocation(line: 309, column: 6, scope: !875)
!891 = !DILocation(line: 310, column: 6, scope: !875)
!892 = !DILocation(line: 317, column: 6, scope: !875)
!893 = !DILocation(line: 642, column: 15, scope: !136, inlinedAt: !894)
!894 = distinct !DILocation(line: 325, column: 7, scope: !875)
!895 = !DILocation(line: 651, column: 3, scope: !136, inlinedAt: !894)
!896 = !DILocation(line: 655, column: 29, scope: !136, inlinedAt: !894)
!897 = !DILocation(line: 655, column: 15, scope: !136, inlinedAt: !894)
!898 = !DILocation(line: 656, column: 7, scope: !899, inlinedAt: !894)
!899 = distinct !DILexicalBlock(scope: !136, file: !137, line: 656, column: 7)
!900 = !DILocation(line: 656, column: 19, scope: !899, inlinedAt: !894)
!901 = !DILocation(line: 656, column: 22, scope: !899, inlinedAt: !894)
!902 = !DILocation(line: 656, column: 7, scope: !136, inlinedAt: !894)
!903 = !DILocation(line: 662, column: 7, scope: !904, inlinedAt: !894)
!904 = distinct !DILexicalBlock(scope: !899, file: !137, line: 657, column: 5)
!905 = !DILocation(line: 664, column: 5, scope: !904, inlinedAt: !894)
!906 = !DILocation(line: 665, column: 3, scope: !136, inlinedAt: !894)
!907 = !DILocation(line: 667, column: 3, scope: !136, inlinedAt: !894)
!908 = !DILocation(line: 327, column: 3, scope: !858)
!909 = !DILocalVariable(name: "buffer", scope: !910, file: !3, line: 859, type: !923)
!910 = distinct !DILexicalBlock(scope: !911, file: !3, line: 858, column: 5)
!911 = distinct !DISubprogram(name: "start_lines", scope: !3, file: !3, line: 851, type: !912, isLocal: true, isDefinition: true, scopeLine: 853, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !915)
!912 = !DISubroutineType(types: !913)
!913 = !{!46, !39, !46, !74, !914}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!915 = !{!916, !917, !918, !919, !909, !920, !921, !922}
!916 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !911, file: !3, line: 851, type: !39)
!917 = !DILocalVariable(name: "fd", arg: 2, scope: !911, file: !3, line: 851, type: !46)
!918 = !DILocalVariable(name: "n_lines", arg: 3, scope: !911, file: !3, line: 851, type: !74)
!919 = !DILocalVariable(name: "read_pos", arg: 4, scope: !911, file: !3, line: 852, type: !914)
!920 = !DILocalVariable(name: "bytes_read", scope: !910, file: !3, line: 860, type: !48)
!921 = !DILocalVariable(name: "buffer_end", scope: !910, file: !3, line: 869, type: !47)
!922 = !DILocalVariable(name: "p", scope: !910, file: !3, line: 873, type: !47)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 65536, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 8192)
!926 = !DILocation(line: 859, column: 12, scope: !910, inlinedAt: !927)
!927 = distinct !DILocation(line: 1823, column: 15, scope: !928, inlinedAt: !967)
!928 = distinct !DILexicalBlock(scope: !929, file: !3, line: 1822, column: 5)
!929 = distinct !DILexicalBlock(scope: !930, file: !3, line: 1821, column: 7)
!930 = distinct !DISubprogram(name: "tail_lines", scope: !3, file: !3, line: 1810, type: !931, isLocal: true, isDefinition: true, scopeLine: 1812, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !933)
!931 = !DISubroutineType(types: !932)
!932 = !{!72, !39, !46, !74, !914}
!933 = !{!934, !935, !936, !937, !938, !963, !964, !966}
!934 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !930, file: !3, line: 1810, type: !39)
!935 = !DILocalVariable(name: "fd", arg: 2, scope: !930, file: !3, line: 1810, type: !46)
!936 = !DILocalVariable(name: "n_lines", arg: 3, scope: !930, file: !3, line: 1810, type: !74)
!937 = !DILocalVariable(name: "read_pos", arg: 4, scope: !930, file: !3, line: 1811, type: !914)
!938 = !DILocalVariable(name: "stats", scope: !930, file: !3, line: 1813, type: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !940, line: 46, size: 1152, elements: !941)
!940 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!941 = !{!942, !943, !944, !946, !947, !949, !951, !952, !953, !954, !956, !958, !959, !960, !961}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !939, file: !940, line: 48, baseType: !94, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !939, file: !940, line: 53, baseType: !97, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !939, file: !940, line: 61, baseType: !945, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !45, line: 139, baseType: !50)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !939, file: !940, line: 62, baseType: !100, size: 32, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !939, file: !940, line: 64, baseType: !948, size: 32, offset: 224)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !45, line: 134, baseType: !37)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !939, file: !940, line: 65, baseType: !950, size: 32, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !45, line: 135, baseType: !37)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !939, file: !940, line: 67, baseType: !46, size: 32, offset: 288)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !939, file: !940, line: 69, baseType: !94, size: 64, offset: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !939, file: !940, line: 74, baseType: !53, size: 64, offset: 384)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !939, file: !940, line: 78, baseType: !955, size: 64, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !45, line: 162, baseType: !54)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !939, file: !940, line: 80, baseType: !957, size: 64, offset: 512)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !45, line: 167, baseType: !54)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !939, file: !940, line: 91, baseType: !86, size: 128, offset: 576)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !939, file: !940, line: 92, baseType: !86, size: 128, offset: 704)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !939, file: !940, line: 93, baseType: !86, size: 128, offset: 832)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !939, file: !940, line: 106, baseType: !962, size: 192, offset: 960)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 192, elements: !180)
!963 = !DILocalVariable(name: "t", scope: !928, file: !3, line: 1823, type: !46)
!964 = !DILocalVariable(name: "start_pos", scope: !965, file: !3, line: 1830, type: !51)
!965 = distinct !DILexicalBlock(scope: !929, file: !3, line: 1829, column: 5)
!966 = !DILocalVariable(name: "end_pos", scope: !965, file: !3, line: 1831, type: !51)
!967 = distinct !DILocation(line: 1877, column: 12, scope: !968, inlinedAt: !975)
!968 = distinct !DILexicalBlock(scope: !969, file: !3, line: 1876, column: 7)
!969 = distinct !DISubprogram(name: "tail", scope: !3, file: !3, line: 1872, type: !931, isLocal: true, isDefinition: true, scopeLine: 1874, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !970)
!970 = !{!971, !972, !973, !974}
!971 = !DILocalVariable(name: "filename", arg: 1, scope: !969, file: !3, line: 1872, type: !39)
!972 = !DILocalVariable(name: "fd", arg: 2, scope: !969, file: !3, line: 1872, type: !46)
!973 = !DILocalVariable(name: "n_units", arg: 3, scope: !969, file: !3, line: 1872, type: !74)
!974 = !DILocalVariable(name: "read_pos", arg: 4, scope: !969, file: !3, line: 1873, type: !914)
!975 = distinct !DILocation(line: 1924, column: 12, scope: !976, inlinedAt: !991)
!976 = distinct !DILexicalBlock(scope: !977, file: !3, line: 1919, column: 5)
!977 = distinct !DILexicalBlock(scope: !978, file: !3, line: 1904, column: 7)
!978 = distinct !DISubprogram(name: "tail_file", scope: !3, file: !3, line: 1886, type: !979, isLocal: true, isDefinition: true, scopeLine: 1887, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !981)
!979 = !DISubroutineType(types: !980)
!980 = !{!72, !80, !74}
!981 = !{!982, !983, !984, !985, !986, !987, !988}
!982 = !DILocalVariable(name: "f", arg: 1, scope: !978, file: !3, line: 1886, type: !80)
!983 = !DILocalVariable(name: "n_units", arg: 2, scope: !978, file: !3, line: 1886, type: !74)
!984 = !DILocalVariable(name: "fd", scope: !978, file: !3, line: 1888, type: !46)
!985 = !DILocalVariable(name: "ok", scope: !978, file: !3, line: 1889, type: !72)
!986 = !DILocalVariable(name: "is_stdin", scope: !978, file: !3, line: 1891, type: !72)
!987 = !DILocalVariable(name: "read_pos", scope: !976, file: !3, line: 1920, type: !74)
!988 = !DILocalVariable(name: "stats", scope: !989, file: !3, line: 1927, type: !939)
!989 = distinct !DILexicalBlock(scope: !990, file: !3, line: 1926, column: 9)
!990 = distinct !DILexicalBlock(scope: !976, file: !3, line: 1925, column: 11)
!991 = distinct !DILocation(line: 2329, column: 11, scope: !992)
!992 = distinct !DILexicalBlock(scope: !993, file: !3, line: 2328, column: 3)
!993 = distinct !DILexicalBlock(scope: !63, file: !3, line: 2328, column: 3)
!994 = !DILocation(line: 2235, column: 11, scope: !63)
!995 = !DILocation(line: 2235, column: 24, scope: !63)
!996 = !DILocation(line: 2237, column: 20, scope: !63)
!997 = !DILocation(line: 2238, column: 8, scope: !63)
!998 = !DILocation(line: 2242, column: 3, scope: !63)
!999 = !DILocation(line: 2242, column: 13, scope: !63)
!1000 = !{!1001, !1001, i64 0}
!1001 = !{!"long", !872, i64 0}
!1002 = !DILocation(line: 2252, column: 10, scope: !63)
!1003 = !DILocation(line: 2255, column: 21, scope: !63)
!1004 = !DILocation(line: 2255, column: 3, scope: !63)
!1005 = !DILocation(line: 2256, column: 3, scope: !63)
!1006 = !DILocation(line: 2257, column: 3, scope: !63)
!1007 = !DILocation(line: 2258, column: 3, scope: !63)
!1008 = !DILocation(line: 2260, column: 3, scope: !63)
!1009 = !DILocation(line: 2264, column: 15, scope: !63)
!1010 = !{!1011, !1011, i64 0}
!1011 = !{!"_Bool", !872, i64 0}
!1012 = !DILocation(line: 2265, column: 24, scope: !63)
!1013 = !DILocation(line: 2265, column: 11, scope: !63)
!1014 = !DILocalVariable(name: "argc", arg: 1, scope: !1015, file: !3, line: 1993, type: !46)
!1015 = distinct !DISubprogram(name: "parse_obsolete_option", scope: !3, file: !3, line: 1993, type: !1016, isLocal: true, isDefinition: true, scopeLine: 1994, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1020)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!72, !46, !1018, !914}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!1020 = !{!1014, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032}
!1021 = !DILocalVariable(name: "argv", arg: 2, scope: !1015, file: !3, line: 1993, type: !1018)
!1022 = !DILocalVariable(name: "n_units", arg: 3, scope: !1015, file: !3, line: 1993, type: !914)
!1023 = !DILocalVariable(name: "p", scope: !1015, file: !3, line: 1995, type: !39)
!1024 = !DILocalVariable(name: "n_string", scope: !1015, file: !3, line: 1996, type: !39)
!1025 = !DILocalVariable(name: "n_string_end", scope: !1015, file: !3, line: 1997, type: !39)
!1026 = !DILocalVariable(name: "default_count", scope: !1015, file: !3, line: 1998, type: !46)
!1027 = !DILocalVariable(name: "t_from_start", scope: !1015, file: !3, line: 1999, type: !72)
!1028 = !DILocalVariable(name: "t_count_lines", scope: !1015, file: !3, line: 2000, type: !72)
!1029 = !DILocalVariable(name: "t_forever", scope: !1015, file: !3, line: 2001, type: !72)
!1030 = !DILocalVariable(name: "posix_ver", scope: !1015, file: !3, line: 2010, type: !46)
!1031 = !DILocalVariable(name: "obsolete_usage", scope: !1015, file: !3, line: 2011, type: !72)
!1032 = !DILocalVariable(name: "traditional_usage", scope: !1015, file: !3, line: 2012, type: !72)
!1033 = !DILocation(line: 1993, column: 28, scope: !1015, inlinedAt: !1034)
!1034 = distinct !DILocation(line: 2267, column: 21, scope: !63)
!1035 = !DILocation(line: 1993, column: 48, scope: !1015, inlinedAt: !1034)
!1036 = !DILocation(line: 1993, column: 65, scope: !1015, inlinedAt: !1034)
!1037 = !DILocation(line: 1998, column: 7, scope: !1015, inlinedAt: !1034)
!1038 = !DILocation(line: 2000, column: 8, scope: !1015, inlinedAt: !1034)
!1039 = !DILocation(line: 2001, column: 8, scope: !1015, inlinedAt: !1034)
!1040 = !DILocation(line: 2006, column: 10, scope: !1041, inlinedAt: !1034)
!1041 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 2005, column: 7)
!1042 = !DILocation(line: 2006, column: 30, scope: !1041, inlinedAt: !1034)
!1043 = !{!872, !872, i64 0}
!1044 = !DILocation(line: 2006, column: 41, scope: !1041, inlinedAt: !1034)
!1045 = !DILocation(line: 2006, column: 48, scope: !1041, inlinedAt: !1034)
!1046 = !DILocation(line: 2006, column: 51, scope: !1041, inlinedAt: !1034)
!1047 = !DILocation(line: 2007, column: 10, scope: !1041, inlinedAt: !1034)
!1048 = !DILocation(line: 2007, column: 24, scope: !1041, inlinedAt: !1034)
!1049 = !DILocation(line: 2007, column: 40, scope: !1041, inlinedAt: !1034)
!1050 = !DILocation(line: 2005, column: 7, scope: !1015, inlinedAt: !1034)
!1051 = !DILocation(line: 2010, column: 19, scope: !1015, inlinedAt: !1034)
!1052 = !DILocation(line: 2010, column: 7, scope: !1015, inlinedAt: !1034)
!1053 = !DILocation(line: 2013, column: 7, scope: !1015, inlinedAt: !1034)
!1054 = !DILocation(line: 1995, column: 15, scope: !1015, inlinedAt: !1034)
!1055 = !DILocation(line: 2015, column: 11, scope: !1015, inlinedAt: !1034)
!1056 = !DILocation(line: 2015, column: 3, scope: !1015, inlinedAt: !1034)
!1057 = !DILocation(line: 2012, column: 43, scope: !1015, inlinedAt: !1034)
!1058 = !DILocation(line: 2022, column: 11, scope: !1059, inlinedAt: !1034)
!1059 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 2016, column: 5)
!1060 = !DILocation(line: 2011, column: 35, scope: !1015, inlinedAt: !1034)
!1061 = !DILocation(line: 2033, column: 27, scope: !1062, inlinedAt: !1034)
!1062 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 2033, column: 11)
!1063 = !DILocation(line: 2033, column: 33, scope: !1062, inlinedAt: !1034)
!1064 = !DILocation(line: 2033, column: 38, scope: !1062, inlinedAt: !1034)
!1065 = !DILocation(line: 2033, column: 31, scope: !1062, inlinedAt: !1034)
!1066 = !DILocation(line: 2033, column: 11, scope: !1059, inlinedAt: !1034)
!1067 = !DILocation(line: 1996, column: 15, scope: !1015, inlinedAt: !1034)
!1068 = !DILocation(line: 2041, column: 3, scope: !1015, inlinedAt: !1034)
!1069 = !DILocation(line: 2041, column: 10, scope: !1015, inlinedAt: !1034)
!1070 = !DILocation(line: 2042, column: 6, scope: !1015, inlinedAt: !1034)
!1071 = distinct !{!1071, !1072, !1073}
!1072 = !DILocation(line: 2041, column: 3, scope: !1015)
!1073 = !DILocation(line: 2042, column: 6, scope: !1015)
!1074 = !DILocation(line: 1997, column: 15, scope: !1015, inlinedAt: !1034)
!1075 = !DILocation(line: 2045, column: 3, scope: !1015, inlinedAt: !1034)
!1076 = !DILocation(line: 2047, column: 15, scope: !1077, inlinedAt: !1034)
!1077 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 2046, column: 5)
!1078 = !DILocation(line: 2048, column: 15, scope: !1077, inlinedAt: !1034)
!1079 = !DILocation(line: 2049, column: 16, scope: !1077, inlinedAt: !1034)
!1080 = !DILocation(line: 2052, column: 7, scope: !1081, inlinedAt: !1034)
!1081 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 2052, column: 7)
!1082 = !DILocation(line: 2049, column: 20, scope: !1077, inlinedAt: !1034)
!1083 = !DILocation(line: 2052, column: 10, scope: !1081, inlinedAt: !1034)
!1084 = !DILocation(line: 2055, column: 7, scope: !1085, inlinedAt: !1034)
!1085 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 2053, column: 5)
!1086 = !DILocation(line: 2052, column: 7, scope: !1015, inlinedAt: !1034)
!1087 = !DILocation(line: 2058, column: 7, scope: !1088, inlinedAt: !1034)
!1088 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 2058, column: 7)
!1089 = !DILocation(line: 2058, column: 7, scope: !1015, inlinedAt: !1034)
!1090 = !DILocation(line: 2061, column: 16, scope: !1091, inlinedAt: !1034)
!1091 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 2061, column: 7)
!1092 = !DILocation(line: 2061, column: 7, scope: !1015, inlinedAt: !1034)
!1093 = !DILocation(line: 2062, column: 14, scope: !1091, inlinedAt: !1034)
!1094 = !DILocation(line: 2062, column: 5, scope: !1091, inlinedAt: !1034)
!1095 = !DILocation(line: 2063, column: 13, scope: !1096, inlinedAt: !1034)
!1096 = distinct !DILexicalBlock(scope: !1091, file: !3, line: 2063, column: 12)
!1097 = !DILocation(line: 2064, column: 13, scope: !1096, inlinedAt: !1034)
!1098 = !DILocation(line: 2065, column: 12, scope: !1096, inlinedAt: !1034)
!1099 = !DILocation(line: 2063, column: 12, scope: !1091, inlinedAt: !1034)
!1100 = !DILocation(line: 2067, column: 7, scope: !1101, inlinedAt: !1034)
!1101 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 2066, column: 5)
!1102 = !{!1103, !1103, i64 0}
!1103 = !{!"int", !872, i64 0}
!1104 = !DILocation(line: 2072, column: 14, scope: !1015, inlinedAt: !1034)
!1105 = !DILocation(line: 2073, column: 15, scope: !1015, inlinedAt: !1034)
!1106 = !DILocation(line: 2074, column: 11, scope: !1015, inlinedAt: !1034)
!1107 = !DILocation(line: 2076, column: 3, scope: !1015, inlinedAt: !1034)
!1108 = !DILocation(line: 2268, column: 11, scope: !63)
!1109 = !DILocation(line: 2268, column: 8, scope: !63)
!1110 = !DILocation(line: 2269, column: 8, scope: !63)
!1111 = !DILocalVariable(name: "argc", arg: 1, scope: !1112, file: !3, line: 2080, type: !46)
!1112 = distinct !DISubprogram(name: "parse_options", scope: !3, file: !3, line: 2080, type: !1113, isLocal: true, isDefinition: true, scopeLine: 2083, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1117)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{null, !46, !66, !914, !1115, !1116}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!1117 = !{!1111, !1118, !1119, !1120, !1121, !1122, !1123}
!1118 = !DILocalVariable(name: "argv", arg: 2, scope: !1112, file: !3, line: 2080, type: !66)
!1119 = !DILocalVariable(name: "n_units", arg: 3, scope: !1112, file: !3, line: 2081, type: !914)
!1120 = !DILocalVariable(name: "header_mode", arg: 4, scope: !1112, file: !3, line: 2081, type: !1115)
!1121 = !DILocalVariable(name: "sleep_interval", arg: 5, scope: !1112, file: !3, line: 2082, type: !1116)
!1122 = !DILocalVariable(name: "c", scope: !1112, file: !3, line: 2084, type: !46)
!1123 = !DILocalVariable(name: "s", scope: !1124, file: !3, line: 2151, type: !114)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 2150, column: 11)
!1125 = distinct !DILexicalBlock(scope: !1126, file: !3, line: 2091, column: 9)
!1126 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 2089, column: 5)
!1127 = !DILocation(line: 2080, column: 20, scope: !1112, inlinedAt: !1128)
!1128 = distinct !DILocation(line: 2270, column: 3, scope: !63)
!1129 = !DILocation(line: 2080, column: 33, scope: !1112, inlinedAt: !1128)
!1130 = !DILocation(line: 2081, column: 27, scope: !1112, inlinedAt: !1128)
!1131 = !DILocation(line: 2086, column: 3, scope: !1112, inlinedAt: !1128)
!1132 = !DILocation(line: 2086, column: 15, scope: !1112, inlinedAt: !1128)
!1133 = !DILocation(line: 2084, column: 7, scope: !1112, inlinedAt: !1128)
!1134 = distinct !{!1134, !1135, !1136}
!1135 = !DILocation(line: 2086, column: 3, scope: !1112)
!1136 = !DILocation(line: 2178, column: 5, scope: !1112)
!1137 = !DILocation(line: 2093, column: 19, scope: !1125, inlinedAt: !1128)
!1138 = !DILocation(line: 2094, column: 23, scope: !1125, inlinedAt: !1128)
!1139 = !DILocation(line: 2096, column: 11, scope: !1125, inlinedAt: !1128)
!1140 = !DILocation(line: 2100, column: 28, scope: !1125, inlinedAt: !1128)
!1141 = !DILocation(line: 2100, column: 23, scope: !1125, inlinedAt: !1128)
!1142 = !DILocation(line: 2101, column: 16, scope: !1143, inlinedAt: !1128)
!1143 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 2101, column: 15)
!1144 = !DILocation(line: 2101, column: 15, scope: !1143, inlinedAt: !1128)
!1145 = !DILocation(line: 2101, column: 15, scope: !1125, inlinedAt: !1128)
!1146 = !DILocation(line: 2102, column: 24, scope: !1143, inlinedAt: !1128)
!1147 = !DILocation(line: 2102, column: 13, scope: !1143, inlinedAt: !1128)
!1148 = !DILocation(line: 2104, column: 13, scope: !1149, inlinedAt: !1128)
!1149 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 2103, column: 20)
!1150 = !DILocation(line: 2106, column: 34, scope: !1125, inlinedAt: !1128)
!1151 = !DILocation(line: 2107, column: 34, scope: !1125, inlinedAt: !1128)
!1152 = !DILocation(line: 2109, column: 36, scope: !1125, inlinedAt: !1128)
!1153 = !DILocation(line: 2106, column: 22, scope: !1125, inlinedAt: !1128)
!1154 = !DILocation(line: 2106, column: 20, scope: !1125, inlinedAt: !1128)
!1155 = !DILocation(line: 2110, column: 11, scope: !1125, inlinedAt: !1128)
!1156 = !DILocation(line: 2114, column: 19, scope: !1125, inlinedAt: !1128)
!1157 = !DILocation(line: 2115, column: 15, scope: !1158, inlinedAt: !1128)
!1158 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 2115, column: 15)
!1159 = !DILocation(line: 2115, column: 22, scope: !1158, inlinedAt: !1128)
!1160 = !DILocation(line: 2115, column: 15, scope: !1125, inlinedAt: !1128)
!1161 = !DILocation(line: 2118, column: 27, scope: !1158, inlinedAt: !1128)
!1162 = !DILocation(line: 2120, column: 11, scope: !1125, inlinedAt: !1128)
!1163 = !DILocation(line: 2124, column: 11, scope: !1125, inlinedAt: !1128)
!1164 = !DILocation(line: 2129, column: 25, scope: !1125, inlinedAt: !1128)
!1165 = !DILocation(line: 2130, column: 15, scope: !1125, inlinedAt: !1128)
!1166 = !DILocation(line: 2129, column: 13, scope: !1125, inlinedAt: !1128)
!1167 = !DILocation(line: 2128, column: 47, scope: !1125, inlinedAt: !1128)
!1168 = !DILocation(line: 2131, column: 11, scope: !1125, inlinedAt: !1128)
!1169 = !DILocation(line: 2135, column: 11, scope: !1125, inlinedAt: !1128)
!1170 = !DILocation(line: 2138, column: 29, scope: !1125, inlinedAt: !1128)
!1171 = !DILocation(line: 2138, column: 55, scope: !1125, inlinedAt: !1128)
!1172 = !DILocation(line: 2138, column: 17, scope: !1125, inlinedAt: !1128)
!1173 = !DILocation(line: 2138, column: 15, scope: !1125, inlinedAt: !1128)
!1174 = !DILocation(line: 2139, column: 11, scope: !1125, inlinedAt: !1128)
!1175 = !DILocation(line: 2143, column: 11, scope: !1125, inlinedAt: !1128)
!1176 = !DILocation(line: 2151, column: 13, scope: !1124, inlinedAt: !1128)
!1177 = !DILocation(line: 2152, column: 29, scope: !1178, inlinedAt: !1128)
!1178 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 2152, column: 17)
!1179 = !DILocation(line: 2151, column: 20, scope: !1124, inlinedAt: !1128)
!1180 = !DILocation(line: 2152, column: 20, scope: !1178, inlinedAt: !1128)
!1181 = !DILocation(line: 2152, column: 65, scope: !1178, inlinedAt: !1128)
!1182 = !DILocation(line: 2152, column: 62, scope: !1178, inlinedAt: !1128)
!1183 = !DILocation(line: 2152, column: 57, scope: !1178, inlinedAt: !1128)
!1184 = !DILocation(line: 2153, column: 15, scope: !1178, inlinedAt: !1128)
!1185 = !DILocation(line: 2156, column: 11, scope: !1125, inlinedAt: !1128)
!1186 = !DILocation(line: 2157, column: 11, scope: !1125, inlinedAt: !1128)
!1187 = !DILocation(line: 2161, column: 11, scope: !1125, inlinedAt: !1128)
!1188 = !DILocation(line: 2165, column: 11, scope: !1125, inlinedAt: !1128)
!1189 = !DILocation(line: 2167, column: 9, scope: !1125, inlinedAt: !1128)
!1190 = !DILocation(line: 2169, column: 9, scope: !1125, inlinedAt: !1128)
!1191 = !DILocation(line: 2173, column: 11, scope: !1125, inlinedAt: !1128)
!1192 = !DILocation(line: 2176, column: 11, scope: !1125, inlinedAt: !1128)
!1193 = !DILocation(line: 2180, column: 7, scope: !1112, inlinedAt: !1128)
!1194 = !DILocation(line: 2182, column: 12, scope: !1195, inlinedAt: !1128)
!1195 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 2182, column: 11)
!1196 = distinct !DILexicalBlock(scope: !1197, file: !3, line: 2181, column: 5)
!1197 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 2180, column: 7)
!1198 = !{i8 0, i8 2}
!1199 = !DILocation(line: 2182, column: 11, scope: !1196, inlinedAt: !1128)
!1200 = !DILocation(line: 2185, column: 24, scope: !1201, inlinedAt: !1128)
!1201 = distinct !DILexicalBlock(scope: !1195, file: !3, line: 2183, column: 9)
!1202 = !DILocation(line: 2185, column: 11, scope: !1201, inlinedAt: !1128)
!1203 = !DILocation(line: 2187, column: 9, scope: !1201, inlinedAt: !1128)
