; ModuleID = 'coreutils-8.27/src/tee.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [190 x i8] c"Copy standard input to each FILE, and also to standard output.\0A\0A  -a, --append              append to the given FILEs, do not overwrite\0A  -i, --ignore-interrupts   ignore interrupt signals\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 59, type: !90, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !35, globals: !50)
!3 = !DIFile(filename: "src/tee.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !12, !21}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "output_error", file: !3, line: 48, size: 32, elements: !6)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "output_error_sigpipe", value: 0)
!8 = !DIEnumerator(name: "output_error_warn", value: 1)
!9 = !DIEnumerator(name: "output_error_warn_nopipe", value: 2)
!10 = !DIEnumerator(name: "output_error_exit", value: 3)
!11 = !DIEnumerator(name: "output_error_exit_nopipe", value: 4)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 45, size: 32, elements: !14)
!13 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!14 = !{!15, !16, !17, !18, !19, !20}
!15 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!16 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!17 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!18 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!19 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!20 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !22, line: 32, size: 32, elements: !23)
!22 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!24 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!25 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!26 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!27 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!28 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!29 = !DIEnumerator(name: "c_quoting_style", value: 5)
!30 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!31 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!32 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!33 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!34 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!35 = !{!36, !39, !40, !41, !47}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !42, line: 68, baseType: !43)
!42 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46}
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 62, baseType: !49)
!48 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!49 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!50 = !{!51, !54, !56, !58, !0, !78, !84}
!51 = !DIGlobalVariableExpression(var: !52)
!52 = distinct !DIGlobalVariable(name: "append", scope: !2, file: !3, line: 43, type: !53, isLocal: true, isDefinition: true)
!53 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!54 = !DIGlobalVariableExpression(var: !55)
!55 = distinct !DIGlobalVariable(name: "ignore_interrupts", scope: !2, file: !3, line: 46, type: !53, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57)
!57 = distinct !DIGlobalVariable(name: "output_error", scope: !2, file: !3, line: 57, type: !5, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59)
!59 = distinct !DIGlobalVariable(name: "infomap", scope: !60, file: !61, line: 632, type: !75, isLocal: true, isDefinition: true)
!60 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !61, file: !61, line: 630, type: !62, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !64)
!61 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!62 = !DISubroutineType(types: !63)
!63 = !{null, !36}
!64 = !{!65, !66, !67, !74}
!65 = !DILocalVariable(name: "program", arg: 1, scope: !60, file: !61, line: 630, type: !36)
!66 = !DILocalVariable(name: "node", scope: !60, file: !61, line: 642, type: !36)
!67 = !DILocalVariable(name: "map_prog", scope: !60, file: !61, line: 643, type: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !60, file: !61, line: 632, size: 128, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !70, file: !61, line: 632, baseType: !36, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !70, file: !61, line: 632, baseType: !36, size: 64, offset: 64)
!74 = !DILocalVariable(name: "lc_messages", scope: !60, file: !61, line: 655, type: !36)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 896, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 7)
!78 = !DIGlobalVariableExpression(var: !79)
!79 = distinct !DIGlobalVariable(name: "output_error_types", scope: !2, file: !3, line: 73, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 128, elements: !82)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!82 = !{!83}
!83 = !DISubrange(count: 4)
!84 = !DIGlobalVariableExpression(var: !85)
!85 = distinct !DIGlobalVariable(name: "output_error_args", scope: !2, file: !3, line: 69, type: !86, isLocal: true, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 320, elements: !88)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!88 = !{!89}
!89 = !DISubrange(count: 5)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 1536, elements: !100)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !93, line: 50, size: 256, elements: !94)
!93 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!94 = !{!95, !96, !97, !99}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !92, file: !93, line: 52, baseType: !36, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !92, file: !93, line: 55, baseType: !46, size: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !92, file: !93, line: 56, baseType: !98, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !92, file: !93, line: 57, baseType: !46, size: 32, offset: 192)
!100 = !{!101}
!101 = !DISubrange(count: 6)
!102 = !DIGlobalVariableExpression(var: !103)
!103 = distinct !DIGlobalVariable(name: "Version", scope: !104, file: !105, line: 2, type: !36, isLocal: false, isDefinition: true)
!104 = distinct !DICompileUnit(language: DW_LANG_C99, file: !105, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106, globals: !107)
!105 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!106 = !{}
!107 = !{!102}
!108 = !DIGlobalVariableExpression(var: !109)
!109 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !110, file: !116, line: 69, type: !117, isLocal: false, isDefinition: true)
!110 = distinct !DICompileUnit(language: DW_LANG_C99, file: !111, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !112, retainedTypes: !113, globals: !115)
!111 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!112 = !{!21}
!113 = !{!40, !114}
!114 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!115 = !{!108}
!116 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !118, line: 55, baseType: !119)
!118 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null}
!122 = !DIGlobalVariableExpression(var: !123)
!123 = distinct !DIGlobalVariable(name: "file_name", scope: !124, file: !129, line: 36, type: !36, isLocal: true, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106, globals: !126)
!125 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!126 = !{!122, !127}
!127 = !DIGlobalVariableExpression(var: !128)
!128 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !124, file: !129, line: 46, type: !53, isLocal: true, isDefinition: true)
!129 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!130 = !DIGlobalVariableExpression(var: !131)
!131 = distinct !DIGlobalVariable(name: "exit_failure", scope: !132, file: !135, line: 24, type: !136, isLocal: false, isDefinition: true)
!132 = distinct !DICompileUnit(language: DW_LANG_C99, file: !133, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106, globals: !134)
!133 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!134 = !{!130}
!135 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!136 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !46)
!137 = !DIGlobalVariableExpression(var: !138)
!138 = distinct !DIGlobalVariable(name: "program_name", scope: !139, file: !143, line: 33, type: !36, isLocal: false, isDefinition: true)
!139 = distinct !DICompileUnit(language: DW_LANG_C99, file: !140, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106, retainedTypes: !141, globals: !142)
!140 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!141 = !{!40, !39}
!142 = !{!137}
!143 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!144 = !DIGlobalVariableExpression(var: !145)
!145 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !146, file: !174, line: 77, type: !210, isLocal: false, isDefinition: true)
!146 = distinct !DICompileUnit(language: DW_LANG_C99, file: !147, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !148, retainedTypes: !169, globals: !171)
!147 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!148 = !{!21, !149, !154}
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !22, line: 242, size: 32, elements: !150)
!150 = !{!151, !152, !153}
!151 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!152 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!153 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !155, line: 46, size: 32, elements: !156)
!155 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!156 = !{!157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168}
!157 = !DIEnumerator(name: "_ISupper", value: 256)
!158 = !DIEnumerator(name: "_ISlower", value: 512)
!159 = !DIEnumerator(name: "_ISalpha", value: 1024)
!160 = !DIEnumerator(name: "_ISdigit", value: 2048)
!161 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!162 = !DIEnumerator(name: "_ISspace", value: 8192)
!163 = !DIEnumerator(name: "_ISprint", value: 16384)
!164 = !DIEnumerator(name: "_ISgraph", value: 32768)
!165 = !DIEnumerator(name: "_ISblank", value: 1)
!166 = !DIEnumerator(name: "_IScntrl", value: 2)
!167 = !DIEnumerator(name: "_ISpunct", value: 4)
!168 = !DIEnumerator(name: "_ISalnum", value: 8)
!169 = !{!46, !170, !47, !39}
!170 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!171 = !{!144, !172, !179, !192, !194, !199, !206, !208}
!172 = !DIGlobalVariableExpression(var: !173)
!173 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !146, file: !174, line: 93, type: !175, isLocal: false, isDefinition: true)
!174 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 320, elements: !177)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!177 = !{!178}
!178 = !DISubrange(count: 10)
!179 = !DIGlobalVariableExpression(var: !180)
!180 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !146, file: !174, line: 1043, type: !181, isLocal: false, isDefinition: true)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !174, line: 57, size: 448, elements: !182)
!182 = !{!183, !184, !185, !190, !191}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !181, file: !174, line: 60, baseType: !21, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !181, file: !174, line: 63, baseType: !46, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !181, file: !174, line: 67, baseType: !186, size: 256, offset: 64)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 256, elements: !188)
!187 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!188 = !{!189}
!189 = !DISubrange(count: 8)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !181, file: !174, line: 70, baseType: !36, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !181, file: !174, line: 73, baseType: !36, size: 64, offset: 384)
!192 = !DIGlobalVariableExpression(var: !193)
!193 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !146, file: !174, line: 108, type: !181, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195)
!195 = distinct !DIGlobalVariable(name: "slot0", scope: !146, file: !174, line: 834, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 256)
!199 = !DIGlobalVariableExpression(var: !200)
!200 = distinct !DIGlobalVariable(name: "slotvec", scope: !146, file: !174, line: 837, type: !201, isLocal: true, isDefinition: true)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !174, line: 826, size: 128, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !202, file: !174, line: 828, baseType: !47, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !202, file: !174, line: 829, baseType: !39, size: 64, offset: 64)
!206 = !DIGlobalVariableExpression(var: !207)
!207 = distinct !DIGlobalVariable(name: "nslots", scope: !146, file: !174, line: 835, type: !46, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209)
!209 = distinct !DIGlobalVariable(name: "slotvec0", scope: !146, file: !174, line: 836, type: !202, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 704, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 11)
!213 = !DIGlobalVariableExpression(var: !214)
!214 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !215, file: !218, line: 26, type: !219, isLocal: false, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106, globals: !217)
!216 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!217 = !{!213}
!218 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 376, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 47)
!222 = !DIGlobalVariableExpression(var: !223)
!223 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !224, file: !225, line: 335, type: !46, isLocal: true, isDefinition: true)
!224 = distinct !DISubprogram(name: "rpl_fcntl", scope: !225, file: !225, line: 272, type: !226, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !228, variables: !231)
!225 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!226 = !DISubroutineType(types: !227)
!227 = !{!46, !46, !46, null}
!228 = distinct !DICompileUnit(language: DW_LANG_C99, file: !229, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106, globals: !230)
!229 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!230 = !{!222}
!231 = !{!232, !233, !234, !247, !248, !251, !254, !257}
!232 = !DILocalVariable(name: "fd", arg: 1, scope: !224, file: !225, line: 272, type: !46)
!233 = !DILocalVariable(name: "action", arg: 2, scope: !224, file: !225, line: 272, type: !46)
!234 = !DILocalVariable(name: "arg", scope: !224, file: !225, line: 274, type: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !236, line: 30, baseType: !237)
!236 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !229, line: 274, baseType: !238)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 192, elements: !245)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !229, line: 274, size: 192, elements: !240)
!240 = !{!241, !242, !243, !244}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !239, file: !229, line: 274, baseType: !187, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !239, file: !229, line: 274, baseType: !187, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !239, file: !229, line: 274, baseType: !40, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !239, file: !229, line: 274, baseType: !40, size: 64, offset: 128)
!245 = !{!246}
!246 = !DISubrange(count: 1)
!247 = !DILocalVariable(name: "result", scope: !224, file: !225, line: 275, type: !46)
!248 = !DILocalVariable(name: "target", scope: !249, file: !225, line: 322, type: !46)
!249 = distinct !DILexicalBlock(scope: !250, file: !225, line: 321, column: 7)
!250 = distinct !DILexicalBlock(scope: !224, file: !225, line: 278, column: 5)
!251 = !DILocalVariable(name: "flags", scope: !252, file: !225, line: 359, type: !46)
!252 = distinct !DILexicalBlock(scope: !253, file: !225, line: 358, column: 11)
!253 = distinct !DILexicalBlock(scope: !249, file: !225, line: 357, column: 13)
!254 = !DILocalVariable(name: "saved_errno", scope: !255, file: !225, line: 362, type: !46)
!255 = distinct !DILexicalBlock(scope: !256, file: !225, line: 361, column: 15)
!256 = distinct !DILexicalBlock(scope: !252, file: !225, line: 360, column: 17)
!257 = !DILocalVariable(name: "p", scope: !258, file: !225, line: 404, type: !40)
!258 = distinct !DILexicalBlock(scope: !250, file: !225, line: 402, column: 7)
!259 = !DIGlobalVariableExpression(var: !260)
!260 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !261, file: !605, line: 120, type: !606, isLocal: true, isDefinition: true)
!261 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !263, retainedTypes: !602, globals: !604)
!262 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!263 = !{!264}
!264 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 41, size: 32, elements: !266)
!265 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!267 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!268 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!269 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!270 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!271 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!272 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!273 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!274 = !DIEnumerator(name: "DAY_1", value: 131079)
!275 = !DIEnumerator(name: "DAY_2", value: 131080)
!276 = !DIEnumerator(name: "DAY_3", value: 131081)
!277 = !DIEnumerator(name: "DAY_4", value: 131082)
!278 = !DIEnumerator(name: "DAY_5", value: 131083)
!279 = !DIEnumerator(name: "DAY_6", value: 131084)
!280 = !DIEnumerator(name: "DAY_7", value: 131085)
!281 = !DIEnumerator(name: "ABMON_1", value: 131086)
!282 = !DIEnumerator(name: "ABMON_2", value: 131087)
!283 = !DIEnumerator(name: "ABMON_3", value: 131088)
!284 = !DIEnumerator(name: "ABMON_4", value: 131089)
!285 = !DIEnumerator(name: "ABMON_5", value: 131090)
!286 = !DIEnumerator(name: "ABMON_6", value: 131091)
!287 = !DIEnumerator(name: "ABMON_7", value: 131092)
!288 = !DIEnumerator(name: "ABMON_8", value: 131093)
!289 = !DIEnumerator(name: "ABMON_9", value: 131094)
!290 = !DIEnumerator(name: "ABMON_10", value: 131095)
!291 = !DIEnumerator(name: "ABMON_11", value: 131096)
!292 = !DIEnumerator(name: "ABMON_12", value: 131097)
!293 = !DIEnumerator(name: "MON_1", value: 131098)
!294 = !DIEnumerator(name: "MON_2", value: 131099)
!295 = !DIEnumerator(name: "MON_3", value: 131100)
!296 = !DIEnumerator(name: "MON_4", value: 131101)
!297 = !DIEnumerator(name: "MON_5", value: 131102)
!298 = !DIEnumerator(name: "MON_6", value: 131103)
!299 = !DIEnumerator(name: "MON_7", value: 131104)
!300 = !DIEnumerator(name: "MON_8", value: 131105)
!301 = !DIEnumerator(name: "MON_9", value: 131106)
!302 = !DIEnumerator(name: "MON_10", value: 131107)
!303 = !DIEnumerator(name: "MON_11", value: 131108)
!304 = !DIEnumerator(name: "MON_12", value: 131109)
!305 = !DIEnumerator(name: "AM_STR", value: 131110)
!306 = !DIEnumerator(name: "PM_STR", value: 131111)
!307 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!308 = !DIEnumerator(name: "D_FMT", value: 131113)
!309 = !DIEnumerator(name: "T_FMT", value: 131114)
!310 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!311 = !DIEnumerator(name: "ERA", value: 131116)
!312 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!313 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!314 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!315 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!316 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!317 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!318 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!319 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!320 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!321 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!322 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!323 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!324 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!325 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!326 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!327 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!328 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!329 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!330 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!331 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!332 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!333 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!334 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!335 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!336 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!337 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!338 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!339 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!340 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!341 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!342 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!343 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!344 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!345 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!346 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!347 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!348 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!349 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!350 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!351 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!352 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!353 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!354 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!355 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!356 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!357 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!358 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!359 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!360 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!361 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!362 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!363 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!364 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!365 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!366 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!367 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!368 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!369 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!370 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!371 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!372 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!373 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!374 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!375 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!376 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!377 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!378 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!379 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!380 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!381 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!382 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!383 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!384 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!385 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!386 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!387 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!388 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!389 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!390 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!391 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!392 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!393 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!394 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!395 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!396 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!397 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!398 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!399 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!400 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!401 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!402 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!403 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!404 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!405 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!406 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!407 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!408 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!409 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!410 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!411 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!412 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!413 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!414 = !DIEnumerator(name: "CODESET", value: 14)
!415 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!416 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!417 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!418 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!419 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!420 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!421 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!422 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!423 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!424 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!425 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!426 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!427 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!428 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!429 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!430 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!431 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!432 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!433 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!434 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!435 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!436 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!437 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!438 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!439 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!440 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!441 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!442 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!443 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!444 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!445 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!446 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!447 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!448 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!449 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!450 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!451 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!452 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!453 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!454 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!455 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!456 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!457 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!458 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!459 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!460 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!461 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!462 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!463 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!464 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!465 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!466 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!467 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!468 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!469 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!470 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!471 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!472 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!473 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!474 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!475 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!476 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!477 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!478 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!479 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!480 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!481 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!482 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!483 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!484 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!485 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!486 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!487 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!488 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!489 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!490 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!491 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!492 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!493 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!494 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!495 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!496 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!497 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!498 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!499 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!500 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!501 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!502 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!503 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!504 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!505 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!506 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!507 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!508 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!509 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!510 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!511 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!512 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!513 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!514 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!515 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!516 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!517 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!518 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!519 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!520 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!521 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!522 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!523 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!524 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!525 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!526 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!527 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!528 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!529 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!530 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!531 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!532 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!533 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!534 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!535 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!536 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!537 = !DIEnumerator(name: "THOUSEP", value: 65537)
!538 = !DIEnumerator(name: "__GROUPING", value: 65538)
!539 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!540 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!541 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!542 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!543 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!544 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!545 = !DIEnumerator(name: "__YESSTR", value: 327682)
!546 = !DIEnumerator(name: "__NOSTR", value: 327683)
!547 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!548 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!549 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!550 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!551 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!552 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!553 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!554 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!555 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!556 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!557 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!558 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!559 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!560 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!561 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!562 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!563 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!564 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!565 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!566 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!567 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!568 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!569 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!570 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!571 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!572 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!573 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!574 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!575 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!576 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!577 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!578 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!579 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!580 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!581 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!582 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!583 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!584 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!585 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!586 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!587 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!588 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!589 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!590 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!591 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!592 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!593 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!594 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!595 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!596 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!597 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!598 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!599 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!600 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!601 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!602 = !{!40, !39, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!604 = !{!259}
!605 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!606 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !36)
!607 = distinct !DICompileUnit(language: DW_LANG_C99, file: !608, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !609)
!608 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!609 = !{!12}
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106)
!611 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106)
!613 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !616, retainedTypes: !621)
!615 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!616 = !{!617}
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !618, line: 41, size: 32, elements: !619)
!618 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!619 = !{!620}
!620 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!621 = !{!40}
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !624, retainedTypes: !638)
!623 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!624 = !{!625}
!625 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !627, file: !626, line: 192, size: 32, elements: !636)
!626 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!627 = distinct !DISubprogram(name: "x2nrealloc", scope: !626, file: !626, line: 180, type: !628, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !622, variables: !631)
!628 = !DISubroutineType(types: !629)
!629 = !{!40, !40, !630, !47}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!631 = !{!632, !633, !634, !635}
!632 = !DILocalVariable(name: "p", arg: 1, scope: !627, file: !626, line: 180, type: !40)
!633 = !DILocalVariable(name: "pn", arg: 2, scope: !627, file: !626, line: 180, type: !630)
!634 = !DILocalVariable(name: "s", arg: 3, scope: !627, file: !626, line: 180, type: !47)
!635 = !DILocalVariable(name: "n", scope: !627, file: !626, line: 182, type: !47)
!636 = !{!637}
!637 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!638 = !{!47, !39, !40}
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106)
!640 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106, retainedTypes: !621)
!642 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!643 = distinct !DICompileUnit(language: DW_LANG_C99, file: !644, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106)
!644 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!645 = distinct !DICompileUnit(language: DW_LANG_C99, file: !646, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106, retainedTypes: !621)
!646 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106, retainedTypes: !621)
!648 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106, retainedTypes: !651)
!650 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!651 = !{!47}
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106)
!653 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !106)
!655 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!656 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!657 = !{i32 2, !"Dwarf Version", i32 4}
!658 = !{i32 2, !"Debug Info Version", i32 3}
!659 = !{i32 1, !"wchar_size", i32 4}
!660 = !{i32 7, !"PIC Level", i32 2}
!661 = !{i32 7, !"PIE Level", i32 2}
!662 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 81, type: !44, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !663)
!663 = !{!664}
!664 = !DILocalVariable(name: "status", arg: 1, scope: !662, file: !3, line: 81, type: !46)
!665 = !DIExpression()
!666 = !DILocation(line: 81, column: 12, scope: !662)
!667 = !DILocation(line: 83, column: 14, scope: !668)
!668 = distinct !DILexicalBlock(scope: !662, file: !3, line: 83, column: 7)
!669 = !DILocation(line: 83, column: 7, scope: !662)
!670 = !DILocation(line: 84, column: 5, scope: !671)
!671 = distinct !DILexicalBlock(scope: !668, file: !3, line: 84, column: 5)
!672 = !{!673, !673, i64 0}
!673 = !{!"any pointer", !674, i64 0}
!674 = !{!"omnipotent char", !675, i64 0}
!675 = !{!"Simple C/C++ TBAA"}
!676 = !DILocation(line: 87, column: 7, scope: !677)
!677 = distinct !DILexicalBlock(scope: !668, file: !3, line: 86, column: 5)
!678 = !DILocation(line: 88, column: 7, scope: !677)
!679 = !DILocation(line: 94, column: 7, scope: !677)
!680 = !DILocation(line: 98, column: 7, scope: !677)
!681 = !DILocation(line: 99, column: 7, scope: !677)
!682 = !DILocation(line: 100, column: 7, scope: !677)
!683 = !DILocation(line: 642, column: 15, scope: !60, inlinedAt: !684)
!684 = distinct !DILocation(line: 112, column: 7, scope: !677)
!685 = !DILocation(line: 651, column: 3, scope: !60, inlinedAt: !684)
!686 = !DILocation(line: 655, column: 29, scope: !60, inlinedAt: !684)
!687 = !DILocation(line: 655, column: 15, scope: !60, inlinedAt: !684)
!688 = !DILocation(line: 656, column: 7, scope: !689, inlinedAt: !684)
!689 = distinct !DILexicalBlock(scope: !60, file: !61, line: 656, column: 7)
!690 = !DILocation(line: 656, column: 19, scope: !689, inlinedAt: !684)
!691 = !DILocation(line: 656, column: 22, scope: !689, inlinedAt: !684)
!692 = !DILocation(line: 656, column: 7, scope: !60, inlinedAt: !684)
!693 = !DILocation(line: 662, column: 7, scope: !694, inlinedAt: !684)
!694 = distinct !DILexicalBlock(scope: !689, file: !61, line: 657, column: 5)
!695 = !DILocation(line: 664, column: 5, scope: !694, inlinedAt: !684)
!696 = !DILocation(line: 665, column: 3, scope: !60, inlinedAt: !684)
!697 = !DILocation(line: 667, column: 3, scope: !60, inlinedAt: !684)
!698 = !DILocation(line: 114, column: 3, scope: !662)
!699 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 118, type: !700, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !703)
!700 = !DISubroutineType(types: !701)
!701 = !{!46, !46, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!703 = !{!704, !705, !706, !707}
!704 = !DILocalVariable(name: "argc", arg: 1, scope: !699, file: !3, line: 118, type: !46)
!705 = !DILocalVariable(name: "argv", arg: 2, scope: !699, file: !3, line: 118, type: !702)
!706 = !DILocalVariable(name: "ok", scope: !699, file: !3, line: 120, type: !53)
!707 = !DILocalVariable(name: "optc", scope: !699, file: !3, line: 121, type: !46)
!708 = !DILocalVariable(name: "buffer", scope: !709, file: !3, line: 188, type: !785)
!709 = distinct !DISubprogram(name: "tee_files", scope: !3, file: !3, line: 184, type: !710, isLocal: true, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !712)
!710 = !DISubroutineType(types: !711)
!711 = !{!53, !46, !702}
!712 = !{!713, !714, !715, !716, !708, !771, !775, !776, !777, !778, !784}
!713 = !DILocalVariable(name: "nfiles", arg: 1, scope: !709, file: !3, line: 184, type: !46)
!714 = !DILocalVariable(name: "files", arg: 2, scope: !709, file: !3, line: 184, type: !702)
!715 = !DILocalVariable(name: "n_outputs", scope: !709, file: !3, line: 186, type: !47)
!716 = !DILocalVariable(name: "descriptors", scope: !709, file: !3, line: 187, type: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !720, line: 7, baseType: !721)
!720 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !722, line: 241, size: 1728, elements: !723)
!722 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !744, !745, !746, !747, !751, !752, !754, !756, !759, !761, !762, !763, !764, !765, !766, !767}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !721, file: !722, line: 242, baseType: !46, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !721, file: !722, line: 247, baseType: !39, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !721, file: !722, line: 248, baseType: !39, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !721, file: !722, line: 249, baseType: !39, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !721, file: !722, line: 250, baseType: !39, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !721, file: !722, line: 251, baseType: !39, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !721, file: !722, line: 252, baseType: !39, size: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !721, file: !722, line: 253, baseType: !39, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !721, file: !722, line: 254, baseType: !39, size: 64, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !721, file: !722, line: 256, baseType: !39, size: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !721, file: !722, line: 257, baseType: !39, size: 64, offset: 640)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !721, file: !722, line: 258, baseType: !39, size: 64, offset: 704)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !721, file: !722, line: 260, baseType: !737, size: 64, offset: 768)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !722, line: 156, size: 192, elements: !739)
!739 = !{!740, !741, !743}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !738, file: !722, line: 157, baseType: !737, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !738, file: !722, line: 158, baseType: !742, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !738, file: !722, line: 162, baseType: !46, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !721, file: !722, line: 262, baseType: !742, size: 64, offset: 832)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !721, file: !722, line: 264, baseType: !46, size: 32, offset: 896)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !721, file: !722, line: 268, baseType: !46, size: 32, offset: 928)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !721, file: !722, line: 270, baseType: !748, size: 64, offset: 960)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !749, line: 140, baseType: !750)
!749 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!750 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !721, file: !722, line: 274, baseType: !170, size: 16, offset: 1024)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !721, file: !722, line: 275, baseType: !753, size: 8, offset: 1040)
!753 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !721, file: !722, line: 276, baseType: !755, size: 8, offset: 1048)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, elements: !245)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !721, file: !722, line: 280, baseType: !757, size: 64, offset: 1088)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !722, line: 150, baseType: null)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !721, file: !722, line: 289, baseType: !760, size: 64, offset: 1152)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !749, line: 141, baseType: !750)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !721, file: !722, line: 297, baseType: !40, size: 64, offset: 1216)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !721, file: !722, line: 298, baseType: !40, size: 64, offset: 1280)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !721, file: !722, line: 299, baseType: !40, size: 64, offset: 1344)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !721, file: !722, line: 300, baseType: !40, size: 64, offset: 1408)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !721, file: !722, line: 302, baseType: !47, size: 64, offset: 1472)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !721, file: !722, line: 303, baseType: !46, size: 32, offset: 1536)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !721, file: !722, line: 305, baseType: !768, size: 160, offset: 1568)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 20)
!771 = !DILocalVariable(name: "bytes_read", scope: !709, file: !3, line: 189, type: !772)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !773, line: 109, baseType: !774)
!773 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !749, line: 181, baseType: !750)
!775 = !DILocalVariable(name: "i", scope: !709, file: !3, line: 190, type: !46)
!776 = !DILocalVariable(name: "ok", scope: !709, file: !3, line: 191, type: !53)
!777 = !DILocalVariable(name: "mode_string", scope: !709, file: !3, line: 192, type: !36)
!778 = !DILocalVariable(name: "w_errno", scope: !779, file: !3, line: 243, type: !46)
!779 = distinct !DILexicalBlock(scope: !780, file: !3, line: 242, column: 11)
!780 = distinct !DILexicalBlock(scope: !781, file: !3, line: 240, column: 13)
!781 = distinct !DILexicalBlock(scope: !782, file: !3, line: 239, column: 7)
!782 = distinct !DILexicalBlock(scope: !783, file: !3, line: 239, column: 7)
!783 = distinct !DILexicalBlock(scope: !709, file: !3, line: 230, column: 5)
!784 = !DILocalVariable(name: "fail", scope: !779, file: !3, line: 244, type: !53)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 65536, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 8192)
!788 = !DILocation(line: 188, column: 8, scope: !709, inlinedAt: !789)
!789 = distinct !DILocation(line: 172, column: 8, scope: !699)
!790 = !DILocation(line: 118, column: 11, scope: !699)
!791 = !DILocation(line: 118, column: 24, scope: !699)
!792 = !DILocation(line: 124, column: 21, scope: !699)
!793 = !DILocation(line: 124, column: 3, scope: !699)
!794 = !DILocation(line: 125, column: 3, scope: !699)
!795 = !DILocation(line: 126, column: 3, scope: !699)
!796 = !DILocation(line: 127, column: 3, scope: !699)
!797 = !DILocation(line: 129, column: 3, scope: !699)
!798 = !DILocation(line: 134, column: 3, scope: !699)
!799 = !DILocation(line: 134, column: 18, scope: !699)
!800 = !DILocation(line: 121, column: 7, scope: !699)
!801 = !DILocation(line: 140, column: 11, scope: !802)
!802 = distinct !DILexicalBlock(scope: !803, file: !3, line: 137, column: 9)
!803 = distinct !DILexicalBlock(scope: !699, file: !3, line: 135, column: 5)
!804 = !DILocation(line: 144, column: 11, scope: !802)
!805 = !DILocation(line: 147, column: 15, scope: !806)
!806 = distinct !DILexicalBlock(scope: !802, file: !3, line: 147, column: 15)
!807 = !DILocation(line: 147, column: 15, scope: !802)
!808 = !DILocation(line: 148, column: 28, scope: !806)
!809 = !{!674, !674, i64 0}
!810 = !DILocation(line: 148, column: 13, scope: !806)
!811 = !DILocation(line: 152, column: 11, scope: !802)
!812 = distinct !{!812, !798, !813}
!813 = !DILocation(line: 161, column: 5, scope: !699)
!814 = !DILocation(line: 154, column: 9, scope: !802)
!815 = !DILocation(line: 156, column: 9, scope: !802)
!816 = !DILocation(line: 159, column: 11, scope: !802)
!817 = !DILocation(line: 163, column: 7, scope: !699)
!818 = !DILocation(line: 164, column: 5, scope: !819)
!819 = distinct !DILexicalBlock(scope: !699, file: !3, line: 163, column: 7)
!820 = !DILocation(line: 166, column: 7, scope: !821)
!821 = distinct !DILexicalBlock(scope: !699, file: !3, line: 166, column: 7)
!822 = !DILocation(line: 166, column: 20, scope: !821)
!823 = !DILocation(line: 166, column: 7, scope: !699)
!824 = !DILocation(line: 167, column: 5, scope: !821)
!825 = !DILocation(line: 172, column: 26, scope: !699)
!826 = !{!827, !827, i64 0}
!827 = !{!"int", !674, i64 0}
!828 = !DILocation(line: 172, column: 24, scope: !699)
!829 = !DILocation(line: 184, column: 16, scope: !709, inlinedAt: !789)
!830 = !DILocation(line: 184, column: 31, scope: !709, inlinedAt: !789)
!831 = !DILocation(line: 186, column: 10, scope: !709, inlinedAt: !789)
!832 = !DILocation(line: 188, column: 3, scope: !709, inlinedAt: !789)
!833 = !DILocation(line: 189, column: 11, scope: !709, inlinedAt: !789)
!834 = !DILocation(line: 191, column: 8, scope: !709, inlinedAt: !789)
!835 = !DILocation(line: 195, column: 9, scope: !709, inlinedAt: !789)
!836 = !DILocation(line: 192, column: 15, scope: !709, inlinedAt: !789)
!837 = !DILocation(line: 199, column: 12, scope: !709, inlinedAt: !789)
!838 = !DILocation(line: 199, column: 3, scope: !709, inlinedAt: !789)
!839 = !DILocalVariable(name: "s", arg: 2, scope: !840, file: !626, line: 105, type: !47)
!840 = distinct !DISubprogram(name: "xnmalloc", scope: !626, file: !626, line: 105, type: !841, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !843)
!841 = !DISubroutineType(types: !842)
!842 = !{!40, !47, !47}
!843 = !{!844, !839}
!844 = !DILocalVariable(name: "n", arg: 1, scope: !840, file: !626, line: 105, type: !47)
!845 = !DILocation(line: 105, column: 28, scope: !840, inlinedAt: !846)
!846 = distinct !DILocation(line: 204, column: 17, scope: !709, inlinedAt: !789)
!847 = !DILocation(line: 107, column: 7, scope: !848, inlinedAt: !846)
!848 = distinct !DILexicalBlock(scope: !840, file: !626, line: 107, column: 7)
!849 = !DILocation(line: 107, column: 7, scope: !840, inlinedAt: !846)
!850 = !DILocation(line: 108, column: 5, scope: !848, inlinedAt: !846)
!851 = !DILocation(line: 172, column: 35, scope: !699)
!852 = !DILocation(line: 204, column: 34, scope: !709, inlinedAt: !789)
!853 = !DILocation(line: 204, column: 27, scope: !709, inlinedAt: !789)
!854 = !DILocation(line: 109, column: 21, scope: !840, inlinedAt: !846)
!855 = !DILocation(line: 109, column: 10, scope: !840, inlinedAt: !846)
!856 = !DILocation(line: 204, column: 17, scope: !709, inlinedAt: !789)
!857 = !DILocation(line: 187, column: 10, scope: !709, inlinedAt: !789)
!858 = !DILocation(line: 205, column: 8, scope: !709, inlinedAt: !789)
!859 = !DILocation(line: 206, column: 20, scope: !709, inlinedAt: !789)
!860 = !DILocation(line: 206, column: 18, scope: !709, inlinedAt: !789)
!861 = !DILocation(line: 207, column: 24, scope: !709, inlinedAt: !789)
!862 = !DILocation(line: 207, column: 12, scope: !709, inlinedAt: !789)
!863 = !DILocation(line: 208, column: 12, scope: !709, inlinedAt: !789)
!864 = !DILocation(line: 208, column: 3, scope: !709, inlinedAt: !789)
!865 = !DILocation(line: 190, column: 7, scope: !709, inlinedAt: !789)
!866 = !DILocation(line: 211, column: 17, scope: !867, inlinedAt: !789)
!867 = distinct !DILexicalBlock(scope: !868, file: !3, line: 211, column: 3)
!868 = distinct !DILexicalBlock(scope: !709, file: !3, line: 211, column: 3)
!869 = !DILocation(line: 211, column: 3, scope: !868, inlinedAt: !789)
!870 = !DILocation(line: 214, column: 31, scope: !871, inlinedAt: !789)
!871 = distinct !DILexicalBlock(scope: !867, file: !3, line: 212, column: 5)
!872 = !DILocation(line: 214, column: 24, scope: !871, inlinedAt: !789)
!873 = !DILocation(line: 214, column: 7, scope: !871, inlinedAt: !789)
!874 = !DILocation(line: 214, column: 22, scope: !871, inlinedAt: !789)
!875 = !DILocation(line: 215, column: 26, scope: !876, inlinedAt: !789)
!876 = distinct !DILexicalBlock(scope: !871, file: !3, line: 215, column: 11)
!877 = !DILocation(line: 215, column: 11, scope: !871, inlinedAt: !789)
!878 = !DILocation(line: 217, column: 18, scope: !879, inlinedAt: !789)
!879 = distinct !DILexicalBlock(scope: !876, file: !3, line: 216, column: 9)
!880 = !DILocation(line: 218, column: 18, scope: !879, inlinedAt: !789)
!881 = !DILocation(line: 219, column: 18, scope: !879, inlinedAt: !789)
!882 = !DILocation(line: 219, column: 31, scope: !879, inlinedAt: !789)
!883 = !DILocation(line: 217, column: 11, scope: !879, inlinedAt: !789)
!884 = !DILocation(line: 221, column: 9, scope: !879, inlinedAt: !789)
!885 = !DILocation(line: 224, column: 11, scope: !886, inlinedAt: !789)
!886 = distinct !DILexicalBlock(scope: !876, file: !3, line: 223, column: 9)
!887 = !DILocation(line: 225, column: 20, scope: !886, inlinedAt: !789)
!888 = !DILocation(line: 211, column: 29, scope: !867, inlinedAt: !789)
!889 = distinct !{!889, !890, !891}
!890 = !DILocation(line: 211, column: 3, scope: !868)
!891 = !DILocation(line: 227, column: 5, scope: !868)
!892 = !DILocation(line: 229, column: 3, scope: !709, inlinedAt: !789)
!893 = !DILocation(line: 231, column: 20, scope: !783, inlinedAt: !789)
!894 = !DILocation(line: 232, column: 22, scope: !895, inlinedAt: !789)
!895 = distinct !DILexicalBlock(scope: !783, file: !3, line: 232, column: 11)
!896 = !DILocation(line: 232, column: 26, scope: !895, inlinedAt: !789)
!897 = !DILocation(line: 232, column: 29, scope: !895, inlinedAt: !789)
!898 = !DILocation(line: 232, column: 35, scope: !895, inlinedAt: !789)
!899 = !DILocation(line: 232, column: 11, scope: !783, inlinedAt: !789)
!900 = !DILocation(line: 234, column: 22, scope: !901, inlinedAt: !789)
!901 = distinct !DILexicalBlock(scope: !783, file: !3, line: 234, column: 11)
!902 = !DILocation(line: 234, column: 11, scope: !783, inlinedAt: !789)
!903 = !DILocation(line: 239, column: 7, scope: !782, inlinedAt: !789)
!904 = !DILocation(line: 240, column: 13, scope: !780, inlinedAt: !789)
!905 = !DILocation(line: 241, column: 13, scope: !780, inlinedAt: !789)
!906 = !DILocation(line: 241, column: 16, scope: !780, inlinedAt: !789)
!907 = !DILocation(line: 241, column: 63, scope: !780, inlinedAt: !789)
!908 = !DILocation(line: 240, column: 13, scope: !781, inlinedAt: !789)
!909 = !DILocation(line: 243, column: 27, scope: !779, inlinedAt: !789)
!910 = !DILocation(line: 243, column: 17, scope: !779, inlinedAt: !789)
!911 = !DILocation(line: 244, column: 31, scope: !779, inlinedAt: !789)
!912 = !DILocation(line: 244, column: 40, scope: !779, inlinedAt: !789)
!913 = !DILocation(line: 244, column: 44, scope: !779, inlinedAt: !789)
!914 = !DILocation(line: 245, column: 43, scope: !779, inlinedAt: !789)
!915 = !DILocation(line: 246, column: 35, scope: !916, inlinedAt: !789)
!916 = distinct !DILexicalBlock(scope: !779, file: !3, line: 246, column: 17)
!917 = !DILocation(line: 246, column: 32, scope: !916, inlinedAt: !789)
!918 = !DILocation(line: 246, column: 17, scope: !779, inlinedAt: !789)
!919 = !DILocation(line: 247, column: 15, scope: !916, inlinedAt: !789)
!920 = !DILocation(line: 248, column: 17, scope: !779, inlinedAt: !789)
!921 = !DILocation(line: 250, column: 24, scope: !922, inlinedAt: !789)
!922 = distinct !DILexicalBlock(scope: !923, file: !3, line: 249, column: 15)
!923 = distinct !DILexicalBlock(scope: !779, file: !3, line: 248, column: 17)
!924 = !DILocation(line: 251, column: 24, scope: !922, inlinedAt: !789)
!925 = !DILocation(line: 252, column: 39, scope: !922, inlinedAt: !789)
!926 = !DILocation(line: 250, column: 17, scope: !922, inlinedAt: !789)
!927 = !DILocation(line: 253, column: 15, scope: !922, inlinedAt: !789)
!928 = !DILocation(line: 254, column: 28, scope: !779, inlinedAt: !789)
!929 = !DILocation(line: 255, column: 17, scope: !779, inlinedAt: !789)
!930 = !DILocation(line: 257, column: 22, scope: !779, inlinedAt: !789)
!931 = !DILocation(line: 258, column: 11, scope: !779, inlinedAt: !789)
!932 = !DILocation(line: 239, column: 33, scope: !781, inlinedAt: !789)
!933 = !DILocation(line: 239, column: 21, scope: !781, inlinedAt: !789)
!934 = distinct !{!934, !935, !936}
!935 = !DILocation(line: 239, column: 7, scope: !782)
!936 = !DILocation(line: 258, column: 11, scope: !782)
!937 = distinct !{!937, !938, !939}
!938 = !DILocation(line: 229, column: 3, scope: !709)
!939 = !DILocation(line: 259, column: 5, scope: !709)
!940 = !DILocation(line: 261, column: 18, scope: !941, inlinedAt: !789)
!941 = distinct !DILexicalBlock(scope: !709, file: !3, line: 261, column: 7)
!942 = !DILocation(line: 261, column: 7, scope: !709, inlinedAt: !789)
!943 = !DILocation(line: 263, column: 17, scope: !944, inlinedAt: !789)
!944 = distinct !DILexicalBlock(scope: !941, file: !3, line: 262, column: 5)
!945 = !DILocation(line: 263, column: 24, scope: !944, inlinedAt: !789)
!946 = !DILocation(line: 263, column: 7, scope: !944, inlinedAt: !789)
!947 = !DILocation(line: 265, column: 5, scope: !944, inlinedAt: !789)
!948 = !DILocation(line: 268, column: 3, scope: !949, inlinedAt: !789)
!949 = distinct !DILexicalBlock(scope: !709, file: !3, line: 268, column: 3)
!950 = !DILocation(line: 269, column: 9, scope: !951, inlinedAt: !789)
!951 = distinct !DILexicalBlock(scope: !952, file: !3, line: 269, column: 9)
!952 = distinct !DILexicalBlock(scope: !949, file: !3, line: 268, column: 3)
!953 = !DILocation(line: 269, column: 24, scope: !951, inlinedAt: !789)
!954 = !DILocation(line: 269, column: 27, scope: !951, inlinedAt: !789)
!955 = !DILocation(line: 269, column: 51, scope: !951, inlinedAt: !789)
!956 = !DILocation(line: 269, column: 9, scope: !952, inlinedAt: !789)
!957 = !DILocation(line: 271, column: 19, scope: !958, inlinedAt: !789)
!958 = distinct !DILexicalBlock(scope: !951, file: !3, line: 270, column: 7)
!959 = !DILocation(line: 271, column: 32, scope: !958, inlinedAt: !789)
!960 = !DILocation(line: 271, column: 9, scope: !958, inlinedAt: !789)
!961 = !DILocation(line: 273, column: 7, scope: !958, inlinedAt: !789)
!962 = !DILocation(line: 268, column: 29, scope: !952, inlinedAt: !789)
!963 = !DILocation(line: 268, column: 17, scope: !952, inlinedAt: !789)
!964 = distinct !{!964, !965, !966}
!965 = !DILocation(line: 268, column: 3, scope: !949)
!966 = !DILocation(line: 273, column: 7, scope: !949)
!967 = !DILocation(line: 275, column: 3, scope: !709, inlinedAt: !789)
!968 = !DILocation(line: 278, column: 1, scope: !709, inlinedAt: !789)
!969 = !DILocation(line: 173, column: 7, scope: !970)
!970 = distinct !DILexicalBlock(scope: !699, file: !3, line: 173, column: 7)
!971 = !DILocation(line: 173, column: 28, scope: !970)
!972 = !DILocation(line: 173, column: 7, scope: !699)
!973 = !DILocation(line: 174, column: 5, scope: !970)
!974 = !DILocation(line: 277, column: 10, scope: !709, inlinedAt: !789)
!975 = !DILocation(line: 176, column: 10, scope: !699)
!976 = !DILocation(line: 177, column: 1, scope: !699)
!977 = distinct !DISubprogram(name: "__argmatch_die", scope: !116, file: !116, line: 62, type: !120, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, unit: !110, variables: !106)
!978 = !DILocation(line: 64, column: 3, scope: !977)
!979 = !DILocation(line: 65, column: 1, scope: !977)
!980 = distinct !DISubprogram(name: "argmatch", scope: !116, file: !116, line: 84, type: !981, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, unit: !110, variables: !985)
!981 = !DISubroutineType(types: !982)
!982 = !{!983, !36, !984, !36, !47}
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !48, line: 51, baseType: !750)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!985 = !{!986, !987, !988, !989, !990, !991, !992, !993}
!986 = !DILocalVariable(name: "arg", arg: 1, scope: !980, file: !116, line: 84, type: !36)
!987 = !DILocalVariable(name: "arglist", arg: 2, scope: !980, file: !116, line: 84, type: !984)
!988 = !DILocalVariable(name: "vallist", arg: 3, scope: !980, file: !116, line: 85, type: !36)
!989 = !DILocalVariable(name: "valsize", arg: 4, scope: !980, file: !116, line: 85, type: !47)
!990 = !DILocalVariable(name: "i", scope: !980, file: !116, line: 87, type: !47)
!991 = !DILocalVariable(name: "arglen", scope: !980, file: !116, line: 88, type: !47)
!992 = !DILocalVariable(name: "matchind", scope: !980, file: !116, line: 89, type: !983)
!993 = !DILocalVariable(name: "ambiguous", scope: !980, file: !116, line: 90, type: !53)
!994 = !DILocation(line: 84, column: 23, scope: !980)
!995 = !DILocation(line: 84, column: 47, scope: !980)
!996 = !DILocation(line: 85, column: 23, scope: !980)
!997 = !DILocation(line: 85, column: 39, scope: !980)
!998 = !DILocation(line: 89, column: 13, scope: !980)
!999 = !DILocation(line: 90, column: 8, scope: !980)
!1000 = !DILocation(line: 92, column: 12, scope: !980)
!1001 = !DILocation(line: 88, column: 10, scope: !980)
!1002 = !DILocation(line: 87, column: 10, scope: !980)
!1003 = !DILocation(line: 95, column: 15, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !116, line: 95, column: 3)
!1005 = distinct !DILexicalBlock(scope: !980, file: !116, line: 95, column: 3)
!1006 = !DILocation(line: 95, column: 3, scope: !1005)
!1007 = !DILocation(line: 97, column: 12, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !116, line: 97, column: 11)
!1009 = distinct !DILexicalBlock(scope: !1004, file: !116, line: 96, column: 5)
!1010 = !DILocation(line: 97, column: 11, scope: !1009)
!1011 = !DILocation(line: 99, column: 15, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !116, line: 99, column: 15)
!1013 = distinct !DILexicalBlock(scope: !1008, file: !116, line: 98, column: 9)
!1014 = !DILocation(line: 99, column: 35, scope: !1012)
!1015 = !DILocation(line: 99, column: 15, scope: !1013)
!1016 = !DILocation(line: 102, column: 29, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !116, line: 102, column: 20)
!1018 = !DILocation(line: 102, column: 20, scope: !1012)
!1019 = !DILocation(line: 109, column: 19, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !116, line: 108, column: 19)
!1021 = distinct !DILexicalBlock(scope: !1017, file: !116, line: 106, column: 13)
!1022 = !DILocation(line: 109, column: 48, scope: !1020)
!1023 = !DILocation(line: 109, column: 38, scope: !1020)
!1024 = !DILocation(line: 110, column: 48, scope: !1020)
!1025 = !DILocation(line: 110, column: 38, scope: !1020)
!1026 = !DILocation(line: 109, column: 22, scope: !1020)
!1027 = !DILocation(line: 108, column: 19, scope: !1021)
!1028 = !DILocation(line: 115, column: 17, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1020, file: !116, line: 111, column: 17)
!1030 = !DILocation(line: 95, column: 28, scope: !1004)
!1031 = distinct !{!1031, !1006, !1032}
!1032 = !DILocation(line: 118, column: 5, scope: !1005)
!1033 = !DILocation(line: 119, column: 7, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !980, file: !116, line: 119, column: 7)
!1035 = !DILocation(line: 122, column: 5, scope: !1034)
!1036 = !DILocation(line: 123, column: 1, scope: !980)
!1037 = distinct !DISubprogram(name: "argmatch_invalid", scope: !116, file: !116, line: 131, type: !1038, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, unit: !110, variables: !1040)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{null, !36, !36, !983}
!1040 = !{!1041, !1042, !1043, !1044}
!1041 = !DILocalVariable(name: "context", arg: 1, scope: !1037, file: !116, line: 131, type: !36)
!1042 = !DILocalVariable(name: "value", arg: 2, scope: !1037, file: !116, line: 131, type: !36)
!1043 = !DILocalVariable(name: "problem", arg: 3, scope: !1037, file: !116, line: 131, type: !983)
!1044 = !DILocalVariable(name: "format", scope: !1037, file: !116, line: 133, type: !36)
!1045 = !DILocation(line: 131, column: 31, scope: !1037)
!1046 = !DILocation(line: 131, column: 52, scope: !1037)
!1047 = !DILocation(line: 131, column: 69, scope: !1037)
!1048 = !DILocation(line: 133, column: 33, scope: !1037)
!1049 = !DILocation(line: 133, column: 25, scope: !1037)
!1050 = !DILocation(line: 135, column: 27, scope: !1037)
!1051 = !DILocation(line: 133, column: 15, scope: !1037)
!1052 = !DILocation(line: 137, column: 24, scope: !1037)
!1053 = !DILocation(line: 138, column: 10, scope: !1037)
!1054 = !DILocation(line: 137, column: 3, scope: !1037)
!1055 = !DILocation(line: 139, column: 1, scope: !1037)
!1056 = distinct !DISubprogram(name: "argmatch_valid", scope: !116, file: !116, line: 146, type: !1057, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: true, unit: !110, variables: !1059)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{null, !984, !36, !47}
!1059 = !{!1060, !1061, !1062, !1063, !1064}
!1060 = !DILocalVariable(name: "arglist", arg: 1, scope: !1056, file: !116, line: 146, type: !984)
!1061 = !DILocalVariable(name: "vallist", arg: 2, scope: !1056, file: !116, line: 147, type: !36)
!1062 = !DILocalVariable(name: "valsize", arg: 3, scope: !1056, file: !116, line: 147, type: !47)
!1063 = !DILocalVariable(name: "i", scope: !1056, file: !116, line: 149, type: !47)
!1064 = !DILocalVariable(name: "last_val", scope: !1056, file: !116, line: 150, type: !36)
!1065 = !DILocation(line: 146, column: 36, scope: !1056)
!1066 = !DILocation(line: 147, column: 29, scope: !1056)
!1067 = !DILocation(line: 147, column: 45, scope: !1056)
!1068 = !DILocation(line: 150, column: 15, scope: !1056)
!1069 = !DILocation(line: 154, column: 3, scope: !1056)
!1070 = !DILocation(line: 149, column: 10, scope: !1056)
!1071 = !DILocation(line: 155, column: 15, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1073, file: !116, line: 155, column: 3)
!1073 = distinct !DILexicalBlock(scope: !1056, file: !116, line: 155, column: 3)
!1074 = !DILocation(line: 155, column: 3, scope: !1073)
!1075 = !DILocation(line: 156, column: 12, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1072, file: !116, line: 156, column: 9)
!1077 = !DILocation(line: 157, column: 9, scope: !1076)
!1078 = !DILocation(line: 157, column: 12, scope: !1076)
!1079 = !DILocation(line: 156, column: 9, scope: !1072)
!1080 = !DILocation(line: 159, column: 9, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1076, file: !116, line: 158, column: 7)
!1082 = !DILocation(line: 161, column: 7, scope: !1081)
!1083 = !DILocation(line: 164, column: 9, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1076, file: !116, line: 163, column: 7)
!1085 = !DILocation(line: 155, column: 28, scope: !1072)
!1086 = distinct !{!1086, !1074, !1087}
!1087 = !DILocation(line: 165, column: 7, scope: !1073)
!1088 = !DILocation(line: 166, column: 3, scope: !1056)
!1089 = !DILocalVariable(name: "__c", arg: 1, scope: !1090, file: !1091, line: 98, type: !46)
!1090 = distinct !DISubprogram(name: "putc_unlocked", scope: !1091, file: !1091, line: 98, type: !1092, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, unit: !110, variables: !1134)
!1091 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!46, !46, !1094}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !720, line: 7, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !722, line: 241, size: 1728, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1096, file: !722, line: 242, baseType: !46, size: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1096, file: !722, line: 247, baseType: !39, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1096, file: !722, line: 248, baseType: !39, size: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1096, file: !722, line: 249, baseType: !39, size: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1096, file: !722, line: 250, baseType: !39, size: 64, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1096, file: !722, line: 251, baseType: !39, size: 64, offset: 320)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1096, file: !722, line: 252, baseType: !39, size: 64, offset: 384)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1096, file: !722, line: 253, baseType: !39, size: 64, offset: 448)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1096, file: !722, line: 254, baseType: !39, size: 64, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1096, file: !722, line: 256, baseType: !39, size: 64, offset: 576)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1096, file: !722, line: 257, baseType: !39, size: 64, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1096, file: !722, line: 258, baseType: !39, size: 64, offset: 704)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1096, file: !722, line: 260, baseType: !1111, size: 64, offset: 768)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !722, line: 156, size: 192, elements: !1113)
!1113 = !{!1114, !1115, !1117}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1112, file: !722, line: 157, baseType: !1111, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1112, file: !722, line: 158, baseType: !1116, size: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1112, file: !722, line: 162, baseType: !46, size: 32, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1096, file: !722, line: 262, baseType: !1116, size: 64, offset: 832)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1096, file: !722, line: 264, baseType: !46, size: 32, offset: 896)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1096, file: !722, line: 268, baseType: !46, size: 32, offset: 928)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1096, file: !722, line: 270, baseType: !748, size: 64, offset: 960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1096, file: !722, line: 274, baseType: !170, size: 16, offset: 1024)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1096, file: !722, line: 275, baseType: !753, size: 8, offset: 1040)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1096, file: !722, line: 276, baseType: !755, size: 8, offset: 1048)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1096, file: !722, line: 280, baseType: !757, size: 64, offset: 1088)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1096, file: !722, line: 289, baseType: !760, size: 64, offset: 1152)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1096, file: !722, line: 297, baseType: !40, size: 64, offset: 1216)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1096, file: !722, line: 298, baseType: !40, size: 64, offset: 1280)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1096, file: !722, line: 299, baseType: !40, size: 64, offset: 1344)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1096, file: !722, line: 300, baseType: !40, size: 64, offset: 1408)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1096, file: !722, line: 302, baseType: !47, size: 64, offset: 1472)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1096, file: !722, line: 303, baseType: !46, size: 32, offset: 1536)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1096, file: !722, line: 305, baseType: !768, size: 160, offset: 1568)
!1134 = !{!1089, !1135}
!1135 = !DILocalVariable(name: "__stream", arg: 2, scope: !1090, file: !1091, line: 98, type: !1094)
!1136 = !DILocation(line: 98, column: 20, scope: !1090, inlinedAt: !1137)
!1137 = distinct !DILocation(line: 166, column: 3, scope: !1056)
!1138 = !DILocation(line: 98, column: 31, scope: !1090, inlinedAt: !1137)
!1139 = !DILocation(line: 100, column: 10, scope: !1090, inlinedAt: !1137)
!1140 = !{!1141, !673, i64 40}
!1141 = !{!"_IO_FILE", !827, i64 0, !673, i64 8, !673, i64 16, !673, i64 24, !673, i64 32, !673, i64 40, !673, i64 48, !673, i64 56, !673, i64 64, !673, i64 72, !673, i64 80, !673, i64 88, !673, i64 96, !673, i64 104, !827, i64 112, !827, i64 116, !1142, i64 120, !1143, i64 128, !674, i64 130, !674, i64 131, !673, i64 136, !1142, i64 144, !673, i64 152, !673, i64 160, !673, i64 168, !673, i64 176, !1142, i64 184, !827, i64 192, !674, i64 196}
!1142 = !{!"long", !674, i64 0}
!1143 = !{!"short", !674, i64 0}
!1144 = !{!1141, !673, i64 48}
!1145 = !{!"branch_weights", i32 2000, i32 1}
!1146 = !DILocation(line: 167, column: 1, scope: !1056)
!1147 = distinct !DISubprogram(name: "__xargmatch_internal", scope: !116, file: !116, line: 176, type: !1148, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, unit: !110, variables: !1150)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!983, !36, !36, !984, !36, !47, !117}
!1150 = !{!1151, !1152, !1153, !1154, !1155, !1156, !1157}
!1151 = !DILocalVariable(name: "context", arg: 1, scope: !1147, file: !116, line: 176, type: !36)
!1152 = !DILocalVariable(name: "arg", arg: 2, scope: !1147, file: !116, line: 177, type: !36)
!1153 = !DILocalVariable(name: "arglist", arg: 3, scope: !1147, file: !116, line: 177, type: !984)
!1154 = !DILocalVariable(name: "vallist", arg: 4, scope: !1147, file: !116, line: 178, type: !36)
!1155 = !DILocalVariable(name: "valsize", arg: 5, scope: !1147, file: !116, line: 178, type: !47)
!1156 = !DILocalVariable(name: "exit_fn", arg: 6, scope: !1147, file: !116, line: 179, type: !117)
!1157 = !DILocalVariable(name: "res", scope: !1147, file: !116, line: 181, type: !983)
!1158 = !DILocation(line: 176, column: 35, scope: !1147)
!1159 = !DILocation(line: 177, column: 35, scope: !1147)
!1160 = !DILocation(line: 177, column: 59, scope: !1147)
!1161 = !DILocation(line: 178, column: 35, scope: !1147)
!1162 = !DILocation(line: 178, column: 51, scope: !1147)
!1163 = !DILocation(line: 179, column: 40, scope: !1147)
!1164 = !DILocation(line: 84, column: 23, scope: !980, inlinedAt: !1165)
!1165 = distinct !DILocation(line: 181, column: 19, scope: !1147)
!1166 = !DILocation(line: 84, column: 47, scope: !980, inlinedAt: !1165)
!1167 = !DILocation(line: 85, column: 23, scope: !980, inlinedAt: !1165)
!1168 = !DILocation(line: 85, column: 39, scope: !980, inlinedAt: !1165)
!1169 = !DILocation(line: 89, column: 13, scope: !980, inlinedAt: !1165)
!1170 = !DILocation(line: 90, column: 8, scope: !980, inlinedAt: !1165)
!1171 = !DILocation(line: 92, column: 12, scope: !980, inlinedAt: !1165)
!1172 = !DILocation(line: 88, column: 10, scope: !980, inlinedAt: !1165)
!1173 = !DILocation(line: 87, column: 10, scope: !980, inlinedAt: !1165)
!1174 = !DILocation(line: 95, column: 15, scope: !1004, inlinedAt: !1165)
!1175 = !DILocation(line: 95, column: 3, scope: !1005, inlinedAt: !1165)
!1176 = !DILocation(line: 97, column: 12, scope: !1008, inlinedAt: !1165)
!1177 = !DILocation(line: 97, column: 11, scope: !1009, inlinedAt: !1165)
!1178 = !DILocation(line: 99, column: 15, scope: !1012, inlinedAt: !1165)
!1179 = !DILocation(line: 99, column: 35, scope: !1012, inlinedAt: !1165)
!1180 = !DILocation(line: 99, column: 15, scope: !1013, inlinedAt: !1165)
!1181 = !DILocation(line: 102, column: 29, scope: !1017, inlinedAt: !1165)
!1182 = !DILocation(line: 102, column: 20, scope: !1012, inlinedAt: !1165)
!1183 = !DILocation(line: 109, column: 19, scope: !1020, inlinedAt: !1165)
!1184 = !DILocation(line: 109, column: 48, scope: !1020, inlinedAt: !1165)
!1185 = !DILocation(line: 109, column: 38, scope: !1020, inlinedAt: !1165)
!1186 = !DILocation(line: 110, column: 48, scope: !1020, inlinedAt: !1165)
!1187 = !DILocation(line: 110, column: 38, scope: !1020, inlinedAt: !1165)
!1188 = !DILocation(line: 109, column: 22, scope: !1020, inlinedAt: !1165)
!1189 = !DILocation(line: 108, column: 19, scope: !1021, inlinedAt: !1165)
!1190 = !DILocation(line: 115, column: 17, scope: !1029, inlinedAt: !1165)
!1191 = !DILocation(line: 95, column: 28, scope: !1004, inlinedAt: !1165)
!1192 = !DILocation(line: 119, column: 7, scope: !1034, inlinedAt: !1165)
!1193 = !DILocation(line: 181, column: 13, scope: !1147)
!1194 = !DILocation(line: 182, column: 11, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1147, file: !116, line: 182, column: 7)
!1196 = !DILocation(line: 182, column: 7, scope: !1147)
!1197 = !DILocation(line: 131, column: 31, scope: !1037, inlinedAt: !1198)
!1198 = distinct !DILocation(line: 187, column: 3, scope: !1147)
!1199 = !DILocation(line: 131, column: 52, scope: !1037, inlinedAt: !1198)
!1200 = !DILocation(line: 131, column: 69, scope: !1037, inlinedAt: !1198)
!1201 = !DILocation(line: 133, column: 33, scope: !1037, inlinedAt: !1198)
!1202 = !DILocation(line: 133, column: 25, scope: !1037, inlinedAt: !1198)
!1203 = !DILocation(line: 135, column: 27, scope: !1037, inlinedAt: !1198)
!1204 = !DILocation(line: 133, column: 15, scope: !1037, inlinedAt: !1198)
!1205 = !DILocation(line: 137, column: 24, scope: !1037, inlinedAt: !1198)
!1206 = !DILocation(line: 138, column: 10, scope: !1037, inlinedAt: !1198)
!1207 = !DILocation(line: 137, column: 3, scope: !1037, inlinedAt: !1198)
!1208 = !DILocation(line: 188, column: 3, scope: !1147)
!1209 = !DILocation(line: 189, column: 3, scope: !1147)
!1210 = !DILocation(line: 191, column: 3, scope: !1147)
!1211 = !DILocation(line: 192, column: 1, scope: !1147)
!1212 = distinct !DISubprogram(name: "argmatch_to_argument", scope: !116, file: !116, line: 197, type: !1213, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: true, unit: !110, variables: !1215)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!36, !36, !984, !36, !47}
!1215 = !{!1216, !1217, !1218, !1219, !1220}
!1216 = !DILocalVariable(name: "value", arg: 1, scope: !1212, file: !116, line: 197, type: !36)
!1217 = !DILocalVariable(name: "arglist", arg: 2, scope: !1212, file: !116, line: 198, type: !984)
!1218 = !DILocalVariable(name: "vallist", arg: 3, scope: !1212, file: !116, line: 199, type: !36)
!1219 = !DILocalVariable(name: "valsize", arg: 4, scope: !1212, file: !116, line: 199, type: !47)
!1220 = !DILocalVariable(name: "i", scope: !1212, file: !116, line: 201, type: !47)
!1221 = !DILocation(line: 197, column: 35, scope: !1212)
!1222 = !DILocation(line: 198, column: 42, scope: !1212)
!1223 = !DILocation(line: 199, column: 35, scope: !1212)
!1224 = !DILocation(line: 199, column: 51, scope: !1212)
!1225 = !DILocation(line: 201, column: 10, scope: !1212)
!1226 = !DILocation(line: 203, column: 15, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1228, file: !116, line: 203, column: 3)
!1228 = distinct !DILexicalBlock(scope: !1212, file: !116, line: 203, column: 3)
!1229 = !DILocation(line: 203, column: 3, scope: !1228)
!1230 = !DILocation(line: 204, column: 43, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1227, file: !116, line: 204, column: 9)
!1232 = distinct !{!1232, !1229, !1233}
!1233 = !DILocation(line: 205, column: 23, scope: !1228)
!1234 = !DILocation(line: 204, column: 33, scope: !1231)
!1235 = !DILocation(line: 204, column: 10, scope: !1231)
!1236 = !DILocation(line: 203, column: 28, scope: !1227)
!1237 = !DILocation(line: 204, column: 9, scope: !1227)
!1238 = !DILocation(line: 207, column: 1, scope: !1212)
!1239 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !129, file: !129, line: 41, type: !62, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !124, variables: !1240)
!1240 = !{!1241}
!1241 = !DILocalVariable(name: "file", arg: 1, scope: !1239, file: !129, line: 41, type: !36)
!1242 = !DILocation(line: 41, column: 41, scope: !1239)
!1243 = !DILocation(line: 43, column: 13, scope: !1239)
!1244 = !DILocation(line: 44, column: 1, scope: !1239)
!1245 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !129, file: !129, line: 78, type: !1246, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !124, variables: !1248)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{null, !53}
!1248 = !{!1249}
!1249 = !DILocalVariable(name: "ignore", arg: 1, scope: !1245, file: !129, line: 78, type: !53)
!1250 = !DILocation(line: 78, column: 37, scope: !1245)
