; ModuleID = 'coreutils-8.27/src/touch.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.table = type { i8*, i32, i32 }
%union.YYSTYPE = type { %struct.relative_time }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.timezone = type { i32, i32 }
%struct.parser_control = type { i8*, i64, i32, i32, i64, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i64, i8, i64, i64, i64, i64, i64, i64, i64, i8, i64, [3 x %struct.table] }
%struct.textint = type { i8, i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "change_times", scope: !2, file: !3, line: 53, type: !80, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !25)
!3 = !DIFile(filename: "src/touch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !{!20, !23, !24}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !{!0, !26, !29, !31, !33, !35, !49, !51, !71, !86, !92}
!26 = !DIGlobalVariableExpression(var: !27)
!27 = distinct !DIGlobalVariable(name: "no_create", scope: !2, file: !3, line: 56, type: !28, isLocal: true, isDefinition: true)
!28 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!29 = !DIGlobalVariableExpression(var: !30)
!30 = distinct !DIGlobalVariable(name: "use_ref", scope: !2, file: !3, line: 59, type: !28, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32)
!32 = distinct !DIGlobalVariable(name: "no_dereference", scope: !2, file: !3, line: 62, type: !28, isLocal: true, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34)
!34 = distinct !DIGlobalVariable(name: "amtime_now", scope: !2, file: !3, line: 69, type: !28, isLocal: true, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36)
!36 = distinct !DIGlobalVariable(name: "newtime", scope: !2, file: !3, line: 72, type: !37, isLocal: true, isDefinition: true)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 256, elements: !47)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !39, line: 8, size: 128, elements: !40)
!39 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!40 = !{!41, !45}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !38, file: !39, line: 10, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !43, line: 148, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !38, file: !39, line: 11, baseType: !46, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !43, line: 184, baseType: !44)
!47 = !{!48}
!48 = !DISubrange(count: 2)
!49 = !DIGlobalVariableExpression(var: !50)
!50 = distinct !DIGlobalVariable(name: "ref_file", scope: !2, file: !3, line: 75, type: !23, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52)
!52 = distinct !DIGlobalVariable(name: "infomap", scope: !53, file: !54, line: 632, type: !68, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !54, file: !54, line: 630, type: !55, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !57)
!54 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!55 = !DISubroutineType(types: !56)
!56 = !{null, !20}
!57 = !{!58, !59, !60, !67}
!58 = !DILocalVariable(name: "program", arg: 1, scope: !53, file: !54, line: 630, type: !20)
!59 = !DILocalVariable(name: "node", scope: !53, file: !54, line: 642, type: !20)
!60 = !DILocalVariable(name: "map_prog", scope: !53, file: !54, line: 643, type: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !53, file: !54, line: 632, size: 128, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !63, file: !54, line: 632, baseType: !20, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !63, file: !54, line: 632, baseType: !20, size: 64, offset: 64)
!67 = !DILocalVariable(name: "lc_messages", scope: !53, file: !54, line: 655, type: !20)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 896, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 7)
!71 = !DIGlobalVariableExpression(var: !72)
!72 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 84, type: !73, isLocal: true, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 2048, elements: !84)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !76, line: 50, size: 256, elements: !77)
!76 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!77 = !{!78, !79, !81, !83}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !75, file: !76, line: 52, baseType: !20, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !75, file: !76, line: 55, baseType: !80, size: 32, offset: 64)
!80 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !75, file: !76, line: 56, baseType: !82, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !75, file: !76, line: 57, baseType: !80, size: 32, offset: 192)
!84 = !{!85}
!85 = !DISubrange(count: 8)
!86 = !DIGlobalVariableExpression(var: !87)
!87 = distinct !DIGlobalVariable(name: "time_masks", scope: !2, file: !3, line: 103, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 160, elements: !90)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!90 = !{!91}
!91 = !DISubrange(count: 5)
!92 = !DIGlobalVariableExpression(var: !93)
!93 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 97, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 384, elements: !96)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!96 = !{!97}
!97 = !DISubrange(count: 6)
!98 = !DIGlobalVariableExpression(var: !99)
!99 = distinct !DIGlobalVariable(name: "Version", scope: !100, file: !101, line: 2, type: !20, isLocal: false, isDefinition: true)
!100 = distinct !DICompileUnit(language: DW_LANG_C99, file: !101, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102, globals: !103)
!101 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!102 = !{}
!103 = !{!98}
!104 = !DIGlobalVariableExpression(var: !105)
!105 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !106, file: !111, line: 69, type: !112, isLocal: false, isDefinition: true)
!106 = distinct !DICompileUnit(language: DW_LANG_C99, file: !107, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !108, globals: !110)
!107 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!108 = !{!24, !109}
!109 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!104}
!111 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !113, line: 55, baseType: !114)
!113 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{null}
!117 = !DIGlobalVariableExpression(var: !118)
!118 = distinct !DIGlobalVariable(name: "file_name", scope: !119, file: !124, line: 36, type: !20, isLocal: true, isDefinition: true)
!119 = distinct !DICompileUnit(language: DW_LANG_C99, file: !120, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102, globals: !121)
!120 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!121 = !{!117, !122}
!122 = !DIGlobalVariableExpression(var: !123)
!123 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !119, file: !124, line: 46, type: !28, isLocal: true, isDefinition: true)
!124 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!125 = !DIGlobalVariableExpression(var: !126)
!126 = distinct !DIGlobalVariable(name: "exit_failure", scope: !127, file: !130, line: 24, type: !131, isLocal: false, isDefinition: true)
!127 = distinct !DICompileUnit(language: DW_LANG_C99, file: !128, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102, globals: !129)
!128 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!129 = !{!125}
!130 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!131 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !80)
!132 = !DIGlobalVariableExpression(var: !133)
!133 = distinct !DIGlobalVariable(name: "yypact", scope: !134, file: !153, line: 1069, type: !374, isLocal: true, isDefinition: true)
!134 = distinct !DICompileUnit(language: DW_LANG_C99, file: !135, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !136, retainedTypes: !150, globals: !193)
!135 = !DIFile(filename: "./lib/parse-datetime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!136 = !{!137, !143, !146}
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !138, line: 167, size: 32, elements: !139)
!138 = !DIFile(filename: "parse-datetime.y", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!139 = !{!140, !141, !142}
!140 = !DIEnumerator(name: "MERam", value: 0)
!141 = !DIEnumerator(name: "MERpm", value: 1)
!142 = !DIEnumerator(name: "MER24", value: 2)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !138, line: 1562, size: 32, elements: !144)
!144 = !{!145}
!145 = !DIEnumerator(name: "TZBUFSIZE", value: 100)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !138, line: 169, size: 32, elements: !147)
!147 = !{!148, !149}
!148 = !DIEnumerator(name: "BILLION", value: 1000000000)
!149 = !DIEnumerator(name: "LOG10_BILLION", value: 9)
!150 = !{!151, !190, !80, !191, !24}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !153, line: 900, size: 448, elements: !154)
!153 = !DIFile(filename: "parse-datetime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!154 = !{!155, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !152, file: !153, line: 902, baseType: !156, size: 16)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int16", file: !153, line: 743, baseType: !157)
!157 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !152, file: !153, line: 903, baseType: !159, size: 448)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !153, line: 703, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !153, line: 691, size: 448, elements: !161)
!161 = !{!162, !163, !173, !178}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !160, file: !138, line: 559, baseType: !44, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !160, file: !138, line: 560, baseType: !164, size: 192)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !138, line: 156, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 151, size: 192, elements: !166)
!166 = !{!167, !168, !169}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !165, file: !138, line: 153, baseType: !28, size: 8)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !165, file: !138, line: 154, baseType: !44, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !165, file: !138, line: 155, baseType: !170, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !171, line: 62, baseType: !172)
!171 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!172 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !160, file: !138, line: 561, baseType: !174, size: 128)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !39, line: 8, size: 128, elements: !175)
!175 = !{!176, !177}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !174, file: !39, line: 10, baseType: !42, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !174, file: !39, line: 11, baseType: !46, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !160, file: !138, line: 562, baseType: !179, size: 448)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !138, line: 182, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 172, size: 448, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !189}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !180, file: !138, line: 175, baseType: !44, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !180, file: !138, line: 176, baseType: !44, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !180, file: !138, line: 177, baseType: !44, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !180, file: !138, line: 178, baseType: !44, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !180, file: !138, line: 179, baseType: !44, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !180, file: !138, line: 180, baseType: !188, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_time_t", file: !138, line: 117, baseType: !44)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !180, file: !138, line: 181, baseType: !44, size: 64, offset: 384)
!190 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !192, line: 7, baseType: !42)
!192 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!193 = !{!194, !132, !280, !287, !295, !298, !303, !308, !310, !315, !317, !319, !323, !328, !333, !338, !343, !348, !353, !356, !371}
!194 = !DIGlobalVariableExpression(var: !195)
!195 = distinct !DIGlobalVariable(name: "yyval_default", scope: !196, file: !153, line: 1644, type: !159, isLocal: true, isDefinition: true)
!196 = distinct !DISubprogram(name: "yyparse", scope: !153, file: !153, line: 1635, type: !197, isLocal: false, isDefinition: true, scopeLine: 1636, flags: DIFlagPrototyped, isOptimized: true, unit: !134, variables: !245)
!197 = !DISubroutineType(types: !198)
!198 = !{!80, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !138, line: 253, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 191, size: 2880, elements: !202)
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !201, file: !138, line: 194, baseType: !20, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !201, file: !138, line: 197, baseType: !44, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !201, file: !138, line: 200, baseType: !80, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !201, file: !138, line: 203, baseType: !80, size: 32, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !201, file: !138, line: 206, baseType: !44, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !201, file: !138, line: 209, baseType: !80, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !201, file: !138, line: 212, baseType: !164, size: 192, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !201, file: !138, line: 213, baseType: !44, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !201, file: !138, line: 214, baseType: !44, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !201, file: !138, line: 215, baseType: !44, size: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !201, file: !138, line: 216, baseType: !44, size: 64, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !201, file: !138, line: 217, baseType: !174, size: 128, offset: 768)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !201, file: !138, line: 220, baseType: !179, size: 448, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !201, file: !138, line: 223, baseType: !28, size: 8, offset: 1344)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !201, file: !138, line: 224, baseType: !28, size: 8, offset: 1352)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !201, file: !138, line: 225, baseType: !170, size: 64, offset: 1408)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !201, file: !138, line: 226, baseType: !170, size: 64, offset: 1472)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !201, file: !138, line: 227, baseType: !170, size: 64, offset: 1536)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !201, file: !138, line: 228, baseType: !170, size: 64, offset: 1600)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !201, file: !138, line: 229, baseType: !170, size: 64, offset: 1664)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !201, file: !138, line: 230, baseType: !170, size: 64, offset: 1728)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !201, file: !138, line: 231, baseType: !170, size: 64, offset: 1792)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !201, file: !138, line: 234, baseType: !28, size: 8, offset: 1856)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !201, file: !138, line: 237, baseType: !170, size: 64, offset: 1920)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !201, file: !138, line: 238, baseType: !170, size: 64, offset: 1984)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !201, file: !138, line: 239, baseType: !170, size: 64, offset: 2048)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dsts_seen", scope: !201, file: !138, line: 240, baseType: !170, size: 64, offset: 2112)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !201, file: !138, line: 241, baseType: !170, size: 64, offset: 2176)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !201, file: !138, line: 242, baseType: !170, size: 64, offset: 2240)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !201, file: !138, line: 243, baseType: !170, size: 64, offset: 2304)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !201, file: !138, line: 246, baseType: !28, size: 8, offset: 2368)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "debug_default_input_timezone", scope: !201, file: !138, line: 249, baseType: !44, size: 64, offset: 2432)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !201, file: !138, line: 252, baseType: !236, size: 384, offset: 2496)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 384, elements: !243)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !138, line: 164, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 159, size: 128, elements: !239)
!239 = !{!240, !241, !242}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !238, file: !138, line: 161, baseType: !20, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !238, file: !138, line: 162, baseType: !80, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !238, file: !138, line: 163, baseType: !80, size: 32, offset: 96)
!243 = !{!244}
!244 = !DISubrange(count: 3)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !256, !258, !259, !261, !263, !264, !265, !266, !267, !268, !269, !270, !273, !275, !276, !278}
!246 = !DILocalVariable(name: "pc", arg: 1, scope: !196, file: !153, line: 1635, type: !199)
!247 = !DILocalVariable(name: "yychar", scope: !196, file: !153, line: 1638, type: !80)
!248 = !DILocalVariable(name: "yylval", scope: !196, file: !153, line: 1645, type: !159)
!249 = !DILocalVariable(name: "yynerrs", scope: !196, file: !153, line: 1648, type: !80)
!250 = !DILocalVariable(name: "yystate", scope: !196, file: !153, line: 1650, type: !80)
!251 = !DILocalVariable(name: "yyerrstatus", scope: !196, file: !153, line: 1652, type: !80)
!252 = !DILocalVariable(name: "yyssa", scope: !196, file: !153, line: 1662, type: !253)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 320, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 20)
!256 = !DILocalVariable(name: "yyss", scope: !196, file: !153, line: 1663, type: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!258 = !DILocalVariable(name: "yyssp", scope: !196, file: !153, line: 1664, type: !257)
!259 = !DILocalVariable(name: "yyvsa", scope: !196, file: !153, line: 1667, type: !260)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 8960, elements: !254)
!261 = !DILocalVariable(name: "yyvs", scope: !196, file: !153, line: 1668, type: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!263 = !DILocalVariable(name: "yyvsp", scope: !196, file: !153, line: 1669, type: !262)
!264 = !DILocalVariable(name: "yystacksize", scope: !196, file: !153, line: 1671, type: !172)
!265 = !DILocalVariable(name: "yyn", scope: !196, file: !153, line: 1673, type: !80)
!266 = !DILocalVariable(name: "yyresult", scope: !196, file: !153, line: 1674, type: !80)
!267 = !DILocalVariable(name: "yytoken", scope: !196, file: !153, line: 1676, type: !80)
!268 = !DILocalVariable(name: "yyval", scope: !196, file: !153, line: 1679, type: !159)
!269 = !DILocalVariable(name: "yylen", scope: !196, file: !153, line: 1692, type: !80)
!270 = !DILocalVariable(name: "yysize", scope: !271, file: !153, line: 1720, type: !172)
!271 = distinct !DILexicalBlock(scope: !272, file: !153, line: 1718, column: 5)
!272 = distinct !DILexicalBlock(scope: !196, file: !153, line: 1717, column: 7)
!273 = !DILocalVariable(name: "yyss1", scope: !274, file: !153, line: 1754, type: !257)
!274 = distinct !DILexicalBlock(scope: !271, file: !153, line: 1753, column: 7)
!275 = !DILocalVariable(name: "yyptr", scope: !274, file: !153, line: 1755, type: !151)
!276 = !DILocalVariable(name: "yynewbytes", scope: !277, file: !153, line: 1759, type: !172)
!277 = distinct !DILexicalBlock(scope: !274, file: !153, line: 1759, column: 9)
!278 = !DILocalVariable(name: "yynewbytes", scope: !279, file: !153, line: 1760, type: !172)
!279 = distinct !DILexicalBlock(scope: !274, file: !153, line: 1760, column: 9)
!280 = !DIGlobalVariableExpression(var: !281)
!281 = distinct !DIGlobalVariable(name: "yytranslate", scope: !134, file: !153, line: 979, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 2224, elements: !285)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_uint8", file: !153, line: 725, baseType: !109)
!285 = !{!286}
!286 = !DISubrange(count: 278)
!287 = !DIGlobalVariableExpression(var: !288)
!288 = distinct !DIGlobalVariable(name: "yycheck", scope: !134, file: !153, line: 1139, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 904, elements: !293)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !153, line: 731, baseType: !292)
!292 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!293 = !{!294}
!294 = !DISubrange(count: 113)
!295 = !DIGlobalVariableExpression(var: !296)
!296 = distinct !DIGlobalVariable(name: "yytable", scope: !134, file: !153, line: 1123, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 904, elements: !293)
!298 = !DIGlobalVariableExpression(var: !299)
!299 = distinct !DIGlobalVariable(name: "yydefact", scope: !134, file: !153, line: 1088, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 912, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 114)
!303 = !DIGlobalVariableExpression(var: !304)
!304 = distinct !DIGlobalVariable(name: "yyr2", scope: !134, file: !153, line: 1189, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 736, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 92)
!308 = !DIGlobalVariableExpression(var: !309)
!309 = distinct !DIGlobalVariable(name: "yyr1", scope: !134, file: !153, line: 1174, type: !305, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311)
!311 = distinct !DIGlobalVariable(name: "yypgoto", scope: !134, file: !153, line: 1105, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 208, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 26)
!315 = !DIGlobalVariableExpression(var: !316)
!316 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !134, file: !153, line: 1113, type: !312, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318)
!318 = distinct !DIGlobalVariable(name: "yystos", scope: !134, file: !153, line: 1157, type: !300, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320)
!320 = distinct !DIGlobalVariable(name: "meridian_table", scope: !134, file: !138, line: 982, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 640, elements: !90)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!323 = !DIGlobalVariableExpression(var: !324)
!324 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !134, file: !138, line: 996, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 3200, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 25)
!328 = !DIGlobalVariableExpression(var: !329)
!329 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !134, file: !138, line: 1070, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 512, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 4)
!333 = !DIGlobalVariableExpression(var: !334)
!334 = distinct !DIGlobalVariable(name: "time_zone_table", scope: !134, file: !138, line: 1083, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 6144, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 48)
!338 = !DIGlobalVariableExpression(var: !339)
!339 = distinct !DIGlobalVariable(name: "dst_table", scope: !134, file: !138, line: 991, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 128, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 1)
!343 = !DIGlobalVariableExpression(var: !344)
!344 = distinct !DIGlobalVariable(name: "time_units_table", scope: !134, file: !138, line: 1025, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 1408, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 11)
!348 = !DIGlobalVariableExpression(var: !349)
!349 = distinct !DIGlobalVariable(name: "relative_time_table", scope: !134, file: !138, line: 1041, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 2688, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 21)
!353 = !DIGlobalVariableExpression(var: !354)
!354 = distinct !DIGlobalVariable(name: "military_table", scope: !134, file: !138, line: 1139, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 3328, elements: !313)
!356 = !DIGlobalVariableExpression(var: !357)
!357 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !358, file: !138, line: 333, type: !368, isLocal: true, isDefinition: true)
!358 = distinct !DISubprogram(name: "str_days", scope: !138, file: !138, line: 330, type: !359, isLocal: true, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: true, unit: !134, variables: !361)
!359 = !DISubroutineType(types: !360)
!360 = !{!20, !199, !23, !170}
!361 = !{!362, !363, !364, !365}
!362 = !DILocalVariable(name: "pc", arg: 1, scope: !358, file: !138, line: 330, type: !199)
!363 = !DILocalVariable(name: "buffer", arg: 2, scope: !358, file: !138, line: 330, type: !23)
!364 = !DILocalVariable(name: "n", arg: 3, scope: !358, file: !138, line: 330, type: !170)
!365 = !DILocalVariable(name: "l", scope: !366, file: !138, line: 382, type: !170)
!366 = distinct !DILexicalBlock(scope: !367, file: !138, line: 381, column: 5)
!367 = distinct !DILexicalBlock(scope: !358, file: !138, line: 380, column: 7)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 896, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 14)
!371 = !DIGlobalVariableExpression(var: !372)
!372 = distinct !DIGlobalVariable(name: "days_values", scope: !358, file: !138, line: 349, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 448, elements: !69)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 912, elements: !301)
!375 = !DIGlobalVariableExpression(var: !376)
!376 = distinct !DIGlobalVariable(name: "program_name", scope: !377, file: !381, line: 33, type: !20, isLocal: false, isDefinition: true)
!377 = distinct !DICompileUnit(language: DW_LANG_C99, file: !378, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102, retainedTypes: !379, globals: !380)
!378 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!379 = !{!24, !23}
!380 = !{!375}
!381 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!382 = !DIGlobalVariableExpression(var: !383)
!383 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !384, file: !412, line: 77, type: !445, isLocal: false, isDefinition: true)
!384 = distinct !DICompileUnit(language: DW_LANG_C99, file: !385, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !386, retainedTypes: !407, globals: !409)
!385 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!386 = !{!5, !387, !392}
!387 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !388)
!388 = !{!389, !390, !391}
!389 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!390 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!391 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!392 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !393, line: 46, size: 32, elements: !394)
!393 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!395 = !DIEnumerator(name: "_ISupper", value: 256)
!396 = !DIEnumerator(name: "_ISlower", value: 512)
!397 = !DIEnumerator(name: "_ISalpha", value: 1024)
!398 = !DIEnumerator(name: "_ISdigit", value: 2048)
!399 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!400 = !DIEnumerator(name: "_ISspace", value: 8192)
!401 = !DIEnumerator(name: "_ISprint", value: 16384)
!402 = !DIEnumerator(name: "_ISgraph", value: 32768)
!403 = !DIEnumerator(name: "_ISblank", value: 1)
!404 = !DIEnumerator(name: "_IScntrl", value: 2)
!405 = !DIEnumerator(name: "_ISpunct", value: 4)
!406 = !DIEnumerator(name: "_ISalnum", value: 8)
!407 = !{!80, !408, !170, !23}
!408 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!409 = !{!382, !410, !417, !427, !429, !434, !441, !443}
!410 = !DIGlobalVariableExpression(var: !411)
!411 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !384, file: !412, line: 93, type: !413, isLocal: false, isDefinition: true)
!412 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 320, elements: !415)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!415 = !{!416}
!416 = !DISubrange(count: 10)
!417 = !DIGlobalVariableExpression(var: !418)
!418 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !384, file: !412, line: 1043, type: !419, isLocal: false, isDefinition: true)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !412, line: 57, size: 448, elements: !420)
!420 = !{!421, !422, !423, !425, !426}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !419, file: !412, line: 60, baseType: !5, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !419, file: !412, line: 63, baseType: !80, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !419, file: !412, line: 67, baseType: !424, size: 256, offset: 64)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 256, elements: !84)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !419, file: !412, line: 70, baseType: !20, size: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !419, file: !412, line: 73, baseType: !20, size: 64, offset: 384)
!427 = !DIGlobalVariableExpression(var: !428)
!428 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !384, file: !412, line: 108, type: !419, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430)
!430 = distinct !DIGlobalVariable(name: "slot0", scope: !384, file: !412, line: 834, type: !431, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 256)
!434 = !DIGlobalVariableExpression(var: !435)
!435 = distinct !DIGlobalVariable(name: "slotvec", scope: !384, file: !412, line: 837, type: !436, isLocal: true, isDefinition: true)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !412, line: 826, size: 128, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !437, file: !412, line: 828, baseType: !170, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !437, file: !412, line: 829, baseType: !23, size: 64, offset: 64)
!441 = !DIGlobalVariableExpression(var: !442)
!442 = distinct !DIGlobalVariable(name: "nslots", scope: !384, file: !412, line: 835, type: !80, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444)
!444 = distinct !DIGlobalVariable(name: "slotvec0", scope: !384, file: !412, line: 836, type: !437, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 704, elements: !346)
!446 = !DIGlobalVariableExpression(var: !447)
!447 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !448, file: !451, line: 26, type: !452, isLocal: false, isDefinition: true)
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102, globals: !450)
!449 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!450 = !{!446}
!451 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 376, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 47)
!455 = !DIGlobalVariableExpression(var: !456)
!456 = distinct !DIGlobalVariable(name: "__mon_yday", scope: !457, file: !465, line: 124, type: !476, isLocal: true, isDefinition: true)
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102, retainedTypes: !459, globals: !462)
!458 = !DIFile(filename: "./lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!459 = !{!190, !80, !292, !109, !157, !408, !44, !172, !460, !461}
!460 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!461 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!462 = !{!463, !469, !472, !455}
!463 = !DIGlobalVariableExpression(var: !464, expr: !468)
!464 = distinct !DIGlobalVariable(name: "mktime_min", scope: !457, file: !465, line: 95, type: !466, isLocal: true, isDefinition: true)
!465 = !DIFile(filename: "lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_int", file: !465, line: 68, baseType: !44)
!468 = !DIExpression(DW_OP_constu, 9223372036854775808, DW_OP_stack_value)
!469 = !DIGlobalVariableExpression(var: !470, expr: !471)
!470 = distinct !DIGlobalVariable(name: "mktime_max", scope: !457, file: !465, line: 98, type: !466, isLocal: true, isDefinition: true)
!471 = !DIExpression(DW_OP_constu, 9223372036854775807, DW_OP_stack_value)
!472 = !DIGlobalVariableExpression(var: !473)
!473 = distinct !DIGlobalVariable(name: "localtime_offset", scope: !457, file: !465, line: 462, type: !474, isLocal: true, isDefinition: true)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "mktime_offset_t", file: !475, line: 30, baseType: !191)
!475 = !DIFile(filename: "./lib/mktime-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 416, elements: !478)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!478 = !{!48, !479}
!479 = !DISubrange(count: 13)
!480 = !DIGlobalVariableExpression(var: !481)
!481 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !482, file: !826, line: 120, type: !827, isLocal: true, isDefinition: true)
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !483, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !823, globals: !825)
!483 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!484 = !{!485}
!485 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !486, line: 41, size: 32, elements: !487)
!486 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!488 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!489 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!490 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!491 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!492 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!493 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!494 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!495 = !DIEnumerator(name: "DAY_1", value: 131079)
!496 = !DIEnumerator(name: "DAY_2", value: 131080)
!497 = !DIEnumerator(name: "DAY_3", value: 131081)
!498 = !DIEnumerator(name: "DAY_4", value: 131082)
!499 = !DIEnumerator(name: "DAY_5", value: 131083)
!500 = !DIEnumerator(name: "DAY_6", value: 131084)
!501 = !DIEnumerator(name: "DAY_7", value: 131085)
!502 = !DIEnumerator(name: "ABMON_1", value: 131086)
!503 = !DIEnumerator(name: "ABMON_2", value: 131087)
!504 = !DIEnumerator(name: "ABMON_3", value: 131088)
!505 = !DIEnumerator(name: "ABMON_4", value: 131089)
!506 = !DIEnumerator(name: "ABMON_5", value: 131090)
!507 = !DIEnumerator(name: "ABMON_6", value: 131091)
!508 = !DIEnumerator(name: "ABMON_7", value: 131092)
!509 = !DIEnumerator(name: "ABMON_8", value: 131093)
!510 = !DIEnumerator(name: "ABMON_9", value: 131094)
!511 = !DIEnumerator(name: "ABMON_10", value: 131095)
!512 = !DIEnumerator(name: "ABMON_11", value: 131096)
!513 = !DIEnumerator(name: "ABMON_12", value: 131097)
!514 = !DIEnumerator(name: "MON_1", value: 131098)
!515 = !DIEnumerator(name: "MON_2", value: 131099)
!516 = !DIEnumerator(name: "MON_3", value: 131100)
!517 = !DIEnumerator(name: "MON_4", value: 131101)
!518 = !DIEnumerator(name: "MON_5", value: 131102)
!519 = !DIEnumerator(name: "MON_6", value: 131103)
!520 = !DIEnumerator(name: "MON_7", value: 131104)
!521 = !DIEnumerator(name: "MON_8", value: 131105)
!522 = !DIEnumerator(name: "MON_9", value: 131106)
!523 = !DIEnumerator(name: "MON_10", value: 131107)
!524 = !DIEnumerator(name: "MON_11", value: 131108)
!525 = !DIEnumerator(name: "MON_12", value: 131109)
!526 = !DIEnumerator(name: "AM_STR", value: 131110)
!527 = !DIEnumerator(name: "PM_STR", value: 131111)
!528 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!529 = !DIEnumerator(name: "D_FMT", value: 131113)
!530 = !DIEnumerator(name: "T_FMT", value: 131114)
!531 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!532 = !DIEnumerator(name: "ERA", value: 131116)
!533 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!534 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!535 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!536 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!537 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!538 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!539 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!540 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!541 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!542 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!543 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!544 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!545 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!546 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!547 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!548 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!549 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!550 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!551 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!552 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!553 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!554 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!555 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!556 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!557 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!558 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!559 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!560 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!561 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!562 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!563 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!564 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!565 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!566 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!567 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!568 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!569 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!570 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!571 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!572 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!573 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!574 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!575 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!576 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!577 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!578 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!579 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!580 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!581 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!582 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!583 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!584 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!585 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!586 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!587 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!588 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!589 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!590 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!591 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!592 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!593 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!594 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!595 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!596 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!597 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!598 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!599 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!600 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!601 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!602 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!603 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!604 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!605 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!606 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!607 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!608 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!609 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!610 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!611 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!612 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!613 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!614 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!615 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!616 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!617 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!618 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!619 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!620 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!621 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!622 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!623 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!624 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!625 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!626 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!627 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!628 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!629 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!630 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!631 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!632 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!633 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!634 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!635 = !DIEnumerator(name: "CODESET", value: 14)
!636 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!637 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!638 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!639 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!640 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!641 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!642 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!643 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!644 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!645 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!646 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!647 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!648 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!649 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!650 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!651 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!652 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!653 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!654 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!655 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!656 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!657 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!658 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!659 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!660 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!661 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!662 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!663 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!664 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!665 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!666 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!667 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!668 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!669 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!670 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!671 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!672 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!673 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!674 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!675 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!676 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!677 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!678 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!679 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!680 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!681 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!682 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!683 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!684 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!685 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!686 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!687 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!688 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!689 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!690 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!691 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!692 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!693 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!694 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!695 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!696 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!697 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!698 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!699 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!700 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!701 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!702 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!703 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!704 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!705 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!706 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!707 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!708 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!709 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!710 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!711 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!712 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!713 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!714 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!715 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!716 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!717 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!718 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!719 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!720 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!721 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!722 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!723 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!724 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!725 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!726 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!727 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!728 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!729 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!730 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!731 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!732 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!733 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!734 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!735 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!736 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!737 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!738 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!739 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!740 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!741 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!742 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!743 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!744 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!745 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!746 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!747 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!748 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!749 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!750 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!751 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!752 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!753 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!754 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!755 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!756 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!757 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!758 = !DIEnumerator(name: "THOUSEP", value: 65537)
!759 = !DIEnumerator(name: "__GROUPING", value: 65538)
!760 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!761 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!762 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!763 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!764 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!765 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!766 = !DIEnumerator(name: "__YESSTR", value: 327682)
!767 = !DIEnumerator(name: "__NOSTR", value: 327683)
!768 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!769 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!770 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!771 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!772 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!773 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!774 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!775 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!776 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!777 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!778 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!779 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!780 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!781 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!782 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!783 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!784 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!785 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!786 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!787 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!788 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!789 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!790 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!791 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!792 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!793 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!794 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!795 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!796 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!797 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!798 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!799 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!800 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!801 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!802 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!803 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!804 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!805 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!806 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!807 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!808 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!809 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!810 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!811 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!812 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!813 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!814 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!815 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!816 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!817 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!818 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!819 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!820 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!821 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!822 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!823 = !{!24, !23, !824}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!825 = !{!480}
!826 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!827 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !20)
!828 = distinct !DICompileUnit(language: DW_LANG_C99, file: !829, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102)
!829 = !DIFile(filename: "./lib/fd-reopen.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!830 = distinct !DICompileUnit(language: DW_LANG_C99, file: !831, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102)
!831 = !DIFile(filename: "./lib/fdutimensat.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!832 = distinct !DICompileUnit(language: DW_LANG_C99, file: !833, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102)
!833 = !DIFile(filename: "./lib/gettime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102, retainedTypes: !836)
!835 = !DIFile(filename: "./lib/posixtm.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!836 = !{!191, !190}
!837 = distinct !DICompileUnit(language: DW_LANG_C99, file: !838, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102)
!838 = !DIFile(filename: "./lib/posixver.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!839 = distinct !DICompileUnit(language: DW_LANG_C99, file: !840, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102, retainedTypes: !841)
!840 = !DIFile(filename: "./lib/strftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!841 = !{!20, !190, !170, !24, !842, !80, !109}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !846, retainedTypes: !851)
!845 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!846 = !{!847}
!847 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !848, line: 41, size: 32, elements: !849)
!848 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!849 = !{!850}
!850 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!851 = !{!24}
!852 = distinct !DICompileUnit(language: DW_LANG_C99, file: !853, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !854, retainedTypes: !868)
!853 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!854 = !{!855}
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !857, file: !856, line: 192, size: 32, elements: !866)
!856 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!857 = distinct !DISubprogram(name: "x2nrealloc", scope: !856, file: !856, line: 180, type: !858, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !852, variables: !861)
!858 = !DISubroutineType(types: !859)
!859 = !{!24, !24, !860, !170}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!861 = !{!862, !863, !864, !865}
!862 = !DILocalVariable(name: "p", arg: 1, scope: !857, file: !856, line: 180, type: !24)
!863 = !DILocalVariable(name: "pn", arg: 2, scope: !857, file: !856, line: 180, type: !860)
!864 = !DILocalVariable(name: "s", arg: 3, scope: !857, file: !856, line: 180, type: !170)
!865 = !DILocalVariable(name: "n", scope: !857, file: !856, line: 182, type: !170)
!866 = !{!867}
!867 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!868 = !{!170, !23, !24}
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102)
!870 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!871 = distinct !DICompileUnit(language: DW_LANG_C99, file: !872, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102, retainedTypes: !851)
!872 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!873 = distinct !DICompileUnit(language: DW_LANG_C99, file: !874, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102, retainedTypes: !875)
!874 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!875 = !{!170}
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !878, retainedTypes: !883, globals: !884)
!877 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!878 = !{!879}
!879 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !880, line: 49, size: 32, elements: !881)
!880 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!881 = !{!882}
!882 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119)
!883 = !{!23}
!884 = !{!885}
!885 = !DIGlobalVariableExpression(var: !886)
!886 = distinct !DIGlobalVariable(name: "local_tz", scope: !876, file: !880, line: 54, type: !887, isLocal: true, isDefinition: true)
!887 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !889, line: 594, baseType: !890)
!889 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !892, line: 21, size: 128, elements: !893)
!892 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!893 = !{!894, !895, !896}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !891, file: !892, line: 25, baseType: !890, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !891, file: !892, line: 36, baseType: !22, size: 8, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !891, file: !892, line: 48, baseType: !897, offset: 72)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: -1)
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102)
!901 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!902 = distinct !DICompileUnit(language: DW_LANG_C99, file: !903, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102)
!903 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!904 = distinct !DICompileUnit(language: DW_LANG_C99, file: !905, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102)
!905 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!906 = distinct !DICompileUnit(language: DW_LANG_C99, file: !907, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102, retainedTypes: !851)
!907 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !102, retainedTypes: !851)
!909 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!910 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!911 = !{i32 2, !"Dwarf Version", i32 4}
!912 = !{i32 2, !"Debug Info Version", i32 3}
!913 = !{i32 1, !"wchar_size", i32 4}
!914 = !{i32 7, !"PIC Level", i32 2}
!915 = !{i32 7, !"PIE Level", i32 2}
!916 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 207, type: !917, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !919)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !80}
!919 = !{!920}
!920 = !DILocalVariable(name: "status", arg: 1, scope: !916, file: !3, line: 207, type: !80)
!921 = !DIExpression()
!922 = !DILocation(line: 207, column: 12, scope: !916)
!923 = !DILocation(line: 209, column: 14, scope: !924)
!924 = distinct !DILexicalBlock(scope: !916, file: !3, line: 209, column: 7)
!925 = !DILocation(line: 209, column: 7, scope: !916)
!926 = !DILocation(line: 210, column: 5, scope: !927)
!927 = distinct !DILexicalBlock(scope: !924, file: !3, line: 210, column: 5)
!928 = !{!929, !929, i64 0}
!929 = !{!"any pointer", !930, i64 0}
!930 = !{!"omnipotent char", !931, i64 0}
!931 = !{!"Simple C/C++ TBAA"}
!932 = !DILocation(line: 213, column: 7, scope: !933)
!933 = distinct !DILexicalBlock(scope: !924, file: !3, line: 212, column: 5)
!934 = !DILocation(line: 214, column: 7, scope: !933)
!935 = !DILocation(line: 587, column: 3, scope: !936, inlinedAt: !937)
!936 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !54, file: !54, line: 585, type: !115, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !102)
!937 = distinct !DILocation(line: 224, column: 7, scope: !933)
!938 = !DILocation(line: 226, column: 7, scope: !933)
!939 = !DILocation(line: 232, column: 7, scope: !933)
!940 = !DILocation(line: 238, column: 7, scope: !933)
!941 = !DILocation(line: 245, column: 7, scope: !933)
!942 = !DILocation(line: 246, column: 7, scope: !933)
!943 = !DILocation(line: 247, column: 7, scope: !933)
!944 = !DILocation(line: 642, column: 15, scope: !53, inlinedAt: !945)
!945 = distinct !DILocation(line: 251, column: 7, scope: !933)
!946 = !DILocation(line: 651, column: 3, scope: !53, inlinedAt: !945)
!947 = !DILocation(line: 655, column: 29, scope: !53, inlinedAt: !945)
!948 = !DILocation(line: 655, column: 15, scope: !53, inlinedAt: !945)
!949 = !DILocation(line: 656, column: 7, scope: !950, inlinedAt: !945)
!950 = distinct !DILexicalBlock(scope: !53, file: !54, line: 656, column: 7)
!951 = !DILocation(line: 656, column: 19, scope: !950, inlinedAt: !945)
!952 = !DILocation(line: 656, column: 22, scope: !950, inlinedAt: !945)
!953 = !DILocation(line: 656, column: 7, scope: !53, inlinedAt: !945)
!954 = !DILocation(line: 662, column: 7, scope: !955, inlinedAt: !945)
!955 = distinct !DILexicalBlock(scope: !950, file: !54, line: 657, column: 5)
!956 = !DILocation(line: 664, column: 5, scope: !955, inlinedAt: !945)
!957 = !DILocation(line: 665, column: 3, scope: !53, inlinedAt: !945)
!958 = !DILocation(line: 667, column: 3, scope: !53, inlinedAt: !945)
!959 = !DILocation(line: 253, column: 3, scope: !916)
!960 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 257, type: !961, isLocal: false, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !964)
!961 = !DISubroutineType(types: !962)
!962 = !{!80, !80, !963}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!964 = !{!965, !966, !967, !968, !969, !970, !971, !1002, !1006, !1009, !1010}
!965 = !DILocalVariable(name: "argc", arg: 1, scope: !960, file: !3, line: 257, type: !80)
!966 = !DILocalVariable(name: "argv", arg: 2, scope: !960, file: !3, line: 257, type: !963)
!967 = !DILocalVariable(name: "c", scope: !960, file: !3, line: 259, type: !80)
!968 = !DILocalVariable(name: "date_set", scope: !960, file: !3, line: 260, type: !28)
!969 = !DILocalVariable(name: "ok", scope: !960, file: !3, line: 261, type: !28)
!970 = !DILocalVariable(name: "flex_date", scope: !960, file: !3, line: 262, type: !20)
!971 = !DILocalVariable(name: "ref_stats", scope: !972, file: !3, line: 342, type: !974)
!972 = distinct !DILexicalBlock(scope: !973, file: !3, line: 341, column: 5)
!973 = distinct !DILexicalBlock(scope: !960, file: !3, line: 340, column: 7)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !975, line: 46, size: 1152, elements: !976)
!975 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!976 = !{!977, !979, !981, !983, !985, !987, !989, !990, !991, !993, !995, !997, !998, !999, !1000}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !974, file: !975, line: 48, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !43, line: 133, baseType: !172)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !974, file: !975, line: 53, baseType: !980, size: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !43, line: 136, baseType: !172)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !974, file: !975, line: 61, baseType: !982, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !43, line: 139, baseType: !172)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !974, file: !975, line: 62, baseType: !984, size: 32, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !43, line: 138, baseType: !190)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !974, file: !975, line: 64, baseType: !986, size: 32, offset: 224)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !43, line: 134, baseType: !190)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !974, file: !975, line: 65, baseType: !988, size: 32, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !43, line: 135, baseType: !190)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !974, file: !975, line: 67, baseType: !80, size: 32, offset: 288)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !974, file: !975, line: 69, baseType: !978, size: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !974, file: !975, line: 74, baseType: !992, size: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 140, baseType: !44)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !974, file: !975, line: 78, baseType: !994, size: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !43, line: 162, baseType: !44)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !974, file: !975, line: 80, baseType: !996, size: 64, offset: 512)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !43, line: 167, baseType: !44)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !974, file: !975, line: 91, baseType: !38, size: 128, offset: 576)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !974, file: !975, line: 92, baseType: !38, size: 128, offset: 704)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !974, file: !975, line: 93, baseType: !38, size: 128, offset: 832)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !974, file: !975, line: 106, baseType: !1001, size: 192, offset: 960)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 192, elements: !243)
!1002 = !DILocalVariable(name: "now", scope: !1003, file: !3, line: 364, type: !38)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 363, column: 9)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 362, column: 11)
!1005 = distinct !DILexicalBlock(scope: !973, file: !3, line: 361, column: 5)
!1006 = !DILocalVariable(name: "notnow", scope: !1007, file: !3, line: 379, type: !38)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 376, column: 13)
!1008 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 373, column: 15)
!1009 = !DILocalVariable(name: "notnow1", scope: !1007, file: !3, line: 379, type: !38)
!1010 = !DILocalVariable(name: "tm", scope: !1011, file: !3, line: 402, type: !1015)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 401, column: 9)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 400, column: 11)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 395, column: 5)
!1014 = distinct !DILexicalBlock(scope: !960, file: !3, line: 392, column: 7)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !1018, line: 7, size: 448, elements: !1019)
!1018 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !1017, file: !1018, line: 9, baseType: !80, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !1017, file: !1018, line: 10, baseType: !80, size: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !1017, file: !1018, line: 11, baseType: !80, size: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !1017, file: !1018, line: 12, baseType: !80, size: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !1017, file: !1018, line: 13, baseType: !80, size: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !1017, file: !1018, line: 14, baseType: !80, size: 32, offset: 160)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !1017, file: !1018, line: 15, baseType: !80, size: 32, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !1017, file: !1018, line: 16, baseType: !80, size: 32, offset: 224)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !1017, file: !1018, line: 17, baseType: !80, size: 32, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !1017, file: !1018, line: 20, baseType: !44, size: 64, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !1017, file: !1018, line: 21, baseType: !20, size: 64, offset: 384)
!1031 = !DILocation(line: 257, column: 11, scope: !960)
!1032 = !DILocation(line: 257, column: 24, scope: !960)
!1033 = !DILocation(line: 260, column: 8, scope: !960)
!1034 = !DILocation(line: 261, column: 8, scope: !960)
!1035 = !DILocation(line: 262, column: 15, scope: !960)
!1036 = !DILocation(line: 265, column: 21, scope: !960)
!1037 = !DILocation(line: 265, column: 3, scope: !960)
!1038 = !DILocation(line: 266, column: 3, scope: !960)
!1039 = !DILocation(line: 267, column: 3, scope: !960)
!1040 = !DILocation(line: 268, column: 3, scope: !960)
!1041 = !DILocation(line: 270, column: 3, scope: !960)
!1042 = !DILocation(line: 272, column: 16, scope: !960)
!1043 = !{!1044, !1044, i64 0}
!1044 = !{!"int", !930, i64 0}
!1045 = !DILocation(line: 275, column: 3, scope: !960)
!1046 = !DILocation(line: 275, column: 15, scope: !960)
!1047 = !DILocation(line: 259, column: 7, scope: !960)
!1048 = distinct !{!1048, !1045, !1049}
!1049 = !DILocation(line: 329, column: 5, scope: !960)
!1050 = !DILocation(line: 280, column: 24, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 278, column: 9)
!1052 = distinct !DILexicalBlock(scope: !960, file: !3, line: 276, column: 5)
!1053 = !DILocation(line: 281, column: 11, scope: !1051)
!1054 = !DILocation(line: 285, column: 11, scope: !1051)
!1055 = !DILocation(line: 288, column: 23, scope: !1051)
!1056 = !DILocation(line: 289, column: 11, scope: !1051)
!1057 = !DILocation(line: 296, column: 11, scope: !1051)
!1058 = !DILocation(line: 299, column: 24, scope: !1051)
!1059 = !DILocation(line: 300, column: 11, scope: !1051)
!1060 = !DILocation(line: 304, column: 22, scope: !1051)
!1061 = !DILocation(line: 304, column: 20, scope: !1051)
!1062 = !DILocation(line: 305, column: 11, scope: !1051)
!1063 = !DILocation(line: 308, column: 48, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 308, column: 15)
!1065 = !DILocation(line: 308, column: 17, scope: !1064)
!1066 = !DILocation(line: 308, column: 15, scope: !1051)
!1067 = !DILocation(line: 310, column: 13, scope: !1064)
!1068 = !DILocation(line: 312, column: 30, scope: !1051)
!1069 = !{!1070, !1071, i64 8}
!1070 = !{!"timespec", !1071, i64 0, !1071, i64 8}
!1071 = !{!"long", !930, i64 0}
!1072 = !DILocation(line: 313, column: 24, scope: !1051)
!1073 = !{i64 0, i64 8, !1074, i64 8, i64 8, !1074}
!1074 = !{!1071, !1071, i64 0}
!1075 = !DILocation(line: 315, column: 11, scope: !1051)
!1076 = !DILocation(line: 318, column: 27, scope: !1051)
!1077 = !DILocation(line: 318, column: 24, scope: !1051)
!1078 = !DILocation(line: 320, column: 11, scope: !1051)
!1079 = !DILocation(line: 322, column: 9, scope: !1051)
!1080 = !DILocation(line: 324, column: 9, scope: !1051)
!1081 = !DILocation(line: 327, column: 11, scope: !1051)
!1082 = !DILocation(line: 331, column: 7, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !960, file: !3, line: 331, column: 7)
!1084 = !DILocation(line: 331, column: 20, scope: !1083)
!1085 = !DILocation(line: 331, column: 7, scope: !960)
!1086 = !DILocation(line: 332, column: 18, scope: !1083)
!1087 = !DILocation(line: 332, column: 5, scope: !1083)
!1088 = !DILocation(line: 334, column: 7, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !960, file: !3, line: 334, column: 7)
!1090 = !DILocation(line: 334, column: 16, scope: !1089)
!1091 = !DILocation(line: 334, column: 31, scope: !1089)
!1092 = !DILocation(line: 334, column: 28, scope: !1089)
!1093 = !DILocation(line: 336, column: 20, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 335, column: 5)
!1095 = !DILocation(line: 336, column: 7, scope: !1094)
!1096 = !DILocation(line: 337, column: 7, scope: !1094)
!1097 = !DILocation(line: 340, column: 7, scope: !960)
!1098 = !DILocation(line: 342, column: 7, scope: !972)
!1099 = !DILocation(line: 342, column: 19, scope: !972)
!1100 = !DILocation(line: 345, column: 11, scope: !972)
!1101 = !DILocalVariable(name: "__path", arg: 1, scope: !1102, file: !1103, line: 456, type: !20)
!1102 = distinct !DISubprogram(name: "lstat", scope: !1103, file: !1103, line: 456, type: !1104, isLocal: false, isDefinition: true, scopeLine: 457, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1107)
!1103 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!80, !20, !1106}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!1107 = !{!1101, !1108}
!1108 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1102, file: !1103, line: 456, type: !1106)
!1109 = !DILocation(line: 456, column: 1, scope: !1102, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 345, column: 28, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !972, file: !3, line: 345, column: 11)
!1112 = !DILocation(line: 458, column: 10, scope: !1102, inlinedAt: !1110)
!1113 = !DILocation(line: 345, column: 28, scope: !1111)
!1114 = !DILocation(line: 345, column: 11, scope: !1111)
!1115 = !DILocalVariable(name: "__path", arg: 1, scope: !1116, file: !1103, line: 449, type: !20)
!1116 = distinct !DISubprogram(name: "stat", scope: !1103, file: !1103, line: 449, type: !1104, isLocal: false, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1117)
!1117 = !{!1115, !1118}
!1118 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1116, file: !1103, line: 449, type: !1106)
!1119 = !DILocation(line: 449, column: 1, scope: !1116, inlinedAt: !1120)
!1120 = distinct !DILocation(line: 346, column: 13, scope: !1111)
!1121 = !DILocation(line: 451, column: 10, scope: !1116, inlinedAt: !1120)
!1122 = !DILocation(line: 346, column: 13, scope: !1111)
!1123 = !DILocation(line: 347, column: 9, scope: !1111)
!1124 = !DILocalVariable(name: "st", arg: 1, scope: !1125, file: !1126, line: 112, type: !1129)
!1125 = distinct !DISubprogram(name: "get_stat_atime", scope: !1126, file: !1126, line: 112, type: !1127, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1131)
!1126 = !DIFile(filename: "./lib/stat-time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!38, !1129}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!1131 = !{!1124}
!1132 = !DILocation(line: 112, column: 36, scope: !1125, inlinedAt: !1133)
!1133 = distinct !DILocation(line: 349, column: 20, scope: !972)
!1134 = !DILocation(line: 115, column: 10, scope: !1125, inlinedAt: !1133)
!1135 = !DILocation(line: 349, column: 20, scope: !972)
!1136 = !DILocalVariable(name: "st", arg: 1, scope: !1137, file: !1126, line: 140, type: !1129)
!1137 = distinct !DISubprogram(name: "get_stat_mtime", scope: !1126, file: !1126, line: 140, type: !1127, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1138)
!1138 = !{!1136}
!1139 = !DILocation(line: 140, column: 36, scope: !1137, inlinedAt: !1140)
!1140 = distinct !DILocation(line: 350, column: 20, scope: !972)
!1141 = !DILocation(line: 143, column: 10, scope: !1137, inlinedAt: !1140)
!1142 = !DILocation(line: 350, column: 20, scope: !972)
!1143 = !DILocation(line: 352, column: 11, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !972, file: !3, line: 352, column: 11)
!1145 = !DILocation(line: 352, column: 11, scope: !972)
!1146 = !DILocation(line: 354, column: 15, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1148, file: !3, line: 354, column: 15)
!1148 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 353, column: 9)
!1149 = !DILocation(line: 354, column: 28, scope: !1147)
!1150 = !DILocation(line: 354, column: 15, scope: !1148)
!1151 = !DILocalVariable(name: "result", arg: 1, scope: !1152, file: !3, line: 112, type: !1155)
!1152 = distinct !DISubprogram(name: "get_reldate", scope: !3, file: !3, line: 112, type: !1153, isLocal: true, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1158)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{null, !1155, !20, !1156}
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!1158 = !{!1151, !1159, !1160}
!1159 = !DILocalVariable(name: "flex_date", arg: 2, scope: !1152, file: !3, line: 113, type: !20)
!1160 = !DILocalVariable(name: "now", arg: 3, scope: !1152, file: !3, line: 113, type: !1156)
!1161 = !DILocation(line: 112, column: 31, scope: !1152, inlinedAt: !1162)
!1162 = distinct !DILocation(line: 355, column: 13, scope: !1147)
!1163 = !DILocation(line: 113, column: 26, scope: !1152, inlinedAt: !1162)
!1164 = !DILocation(line: 113, column: 60, scope: !1152, inlinedAt: !1162)
!1165 = !DILocation(line: 115, column: 9, scope: !1166, inlinedAt: !1162)
!1166 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 115, column: 7)
!1167 = !DILocation(line: 115, column: 7, scope: !1152, inlinedAt: !1162)
!1168 = !DILocation(line: 356, column: 15, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1148, file: !3, line: 356, column: 15)
!1170 = !DILocation(line: 116, column: 5, scope: !1166, inlinedAt: !1162)
!1171 = !DILocation(line: 356, column: 28, scope: !1169)
!1172 = !DILocation(line: 356, column: 15, scope: !1148)
!1173 = !DILocation(line: 112, column: 31, scope: !1152, inlinedAt: !1174)
!1174 = distinct !DILocation(line: 357, column: 13, scope: !1169)
!1175 = !DILocation(line: 113, column: 26, scope: !1152, inlinedAt: !1174)
!1176 = !DILocation(line: 113, column: 60, scope: !1152, inlinedAt: !1174)
!1177 = !DILocation(line: 115, column: 9, scope: !1166, inlinedAt: !1174)
!1178 = !DILocation(line: 115, column: 7, scope: !1152, inlinedAt: !1174)
!1179 = !DILocation(line: 116, column: 5, scope: !1166, inlinedAt: !1174)
!1180 = !DILocation(line: 359, column: 5, scope: !973)
!1181 = !DILocation(line: 392, column: 17, scope: !1014)
!1182 = !DILocation(line: 362, column: 11, scope: !1004)
!1183 = !DILocation(line: 362, column: 11, scope: !1005)
!1184 = !DILocation(line: 364, column: 11, scope: !1003)
!1185 = !DILocation(line: 364, column: 27, scope: !1003)
!1186 = !DILocation(line: 365, column: 11, scope: !1003)
!1187 = !DILocation(line: 112, column: 31, scope: !1152, inlinedAt: !1188)
!1188 = distinct !DILocation(line: 366, column: 11, scope: !1003)
!1189 = !DILocation(line: 113, column: 26, scope: !1152, inlinedAt: !1188)
!1190 = !DILocation(line: 113, column: 60, scope: !1152, inlinedAt: !1188)
!1191 = !DILocation(line: 115, column: 9, scope: !1166, inlinedAt: !1188)
!1192 = !DILocation(line: 115, column: 7, scope: !1152, inlinedAt: !1188)
!1193 = !DILocation(line: 116, column: 5, scope: !1166, inlinedAt: !1188)
!1194 = !DILocation(line: 367, column: 24, scope: !1003)
!1195 = !DILocation(line: 373, column: 15, scope: !1008)
!1196 = !DILocation(line: 373, column: 28, scope: !1008)
!1197 = !DILocation(line: 374, column: 15, scope: !1008)
!1198 = !DILocation(line: 374, column: 29, scope: !1008)
!1199 = !{!1070, !1071, i64 0}
!1200 = !DILocation(line: 374, column: 43, scope: !1008)
!1201 = !DILocation(line: 374, column: 36, scope: !1008)
!1202 = !DILocation(line: 375, column: 15, scope: !1008)
!1203 = !DILocation(line: 375, column: 29, scope: !1008)
!1204 = !DILocation(line: 375, column: 44, scope: !1008)
!1205 = !DILocation(line: 375, column: 37, scope: !1008)
!1206 = !DILocation(line: 373, column: 15, scope: !1003)
!1207 = !DILocation(line: 379, column: 15, scope: !1007)
!1208 = !DILocation(line: 380, column: 42, scope: !1007)
!1209 = !DILocation(line: 380, column: 22, scope: !1007)
!1210 = !DILocation(line: 380, column: 29, scope: !1007)
!1211 = !DILocation(line: 381, column: 22, scope: !1007)
