; ModuleID = 'coreutils-8.27/src/unexpand.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert blanks in each FILE to tabs, writing to standard output.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.14 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1
@.str.15 = private unnamed_addr constant [75 x i8] c"\0AMandatory arguments to long options are mandatory for short options too.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 61, type: !57, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !34)
!3 = !DIFile(filename: "src/unexpand.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, size: 32, elements: !7)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!8 = !DIEnumerator(name: "_ISupper", value: 256)
!9 = !DIEnumerator(name: "_ISlower", value: 512)
!10 = !DIEnumerator(name: "_ISalpha", value: 1024)
!11 = !DIEnumerator(name: "_ISdigit", value: 2048)
!12 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!13 = !DIEnumerator(name: "_ISspace", value: 8192)
!14 = !DIEnumerator(name: "_ISprint", value: 16384)
!15 = !DIEnumerator(name: "_ISgraph", value: 32768)
!16 = !DIEnumerator(name: "_ISblank", value: 1)
!17 = !DIEnumerator(name: "_IScntrl", value: 2)
!18 = !DIEnumerator(name: "_ISpunct", value: 4)
!19 = !DIEnumerator(name: "_ISalnum", value: 8)
!20 = !{!21, !23, !24, !25, !30, !31, !32, !33}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !26, line: 112, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !28, line: 62, baseType: !29)
!28 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!29 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !{!35, !0}
!35 = !DIGlobalVariableExpression(var: !36)
!36 = distinct !DIGlobalVariable(name: "infomap", scope: !37, file: !38, line: 632, type: !54, isLocal: true, isDefinition: true)
!37 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !38, file: !38, line: 630, type: !39, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !43)
!38 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!39 = !DISubroutineType(types: !40)
!40 = !{null, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!43 = !{!44, !45, !46, !53}
!44 = !DILocalVariable(name: "program", arg: 1, scope: !37, file: !38, line: 630, type: !41)
!45 = !DILocalVariable(name: "node", scope: !37, file: !38, line: 642, type: !41)
!46 = !DILocalVariable(name: "map_prog", scope: !37, file: !38, line: 643, type: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !37, file: !38, line: 632, size: 128, elements: !50)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !49, file: !38, line: 632, baseType: !41, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !49, file: !38, line: 632, baseType: !41, size: 64, offset: 64)
!53 = !DILocalVariable(name: "lc_messages", scope: !37, file: !38, line: 655, type: !41)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 896, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 7)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 1536, elements: !67)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !60, line: 50, size: 256, elements: !61)
!60 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!61 = !{!62, !63, !64, !66}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !60, line: 52, baseType: !41, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !59, file: !60, line: 55, baseType: !30, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !59, file: !60, line: 56, baseType: !65, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !59, file: !60, line: 57, baseType: !30, size: 32, offset: 192)
!67 = !{!68}
!68 = !DISubrange(count: 6)
!69 = !DIGlobalVariableExpression(var: !70)
!70 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !71, file: !72, line: 32, type: !193, isLocal: false, isDefinition: true)
!71 = distinct !DICompileUnit(language: DW_LANG_C99, file: !72, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !73, retainedTypes: !112, globals: !114)
!72 = !DIFile(filename: "src/expand-common.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!73 = !{!5, !74, !88, !97}
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !75, line: 32, size: 32, elements: !76)
!75 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!77 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!78 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!79 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!80 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!81 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!82 = !DIEnumerator(name: "c_quoting_style", value: 5)
!83 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!84 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!85 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!86 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!87 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 45, size: 32, elements: !90)
!89 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!90 = !{!91, !92, !93, !94, !95, !96}
!91 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!92 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!93 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!94 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!95 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!96 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !99, file: !98, line: 192, size: 32, elements: !110)
!98 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!99 = distinct !DISubprogram(name: "x2nrealloc", scope: !98, file: !98, line: 180, type: !100, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !71, variables: !105)
!100 = !DISubroutineType(types: !101)
!101 = !{!23, !23, !102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !104, line: 62, baseType: !29)
!104 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!105 = !{!106, !107, !108, !109}
!106 = !DILocalVariable(name: "p", arg: 1, scope: !99, file: !98, line: 180, type: !23)
!107 = !DILocalVariable(name: "pn", arg: 2, scope: !99, file: !98, line: 180, type: !102)
!108 = !DILocalVariable(name: "s", arg: 3, scope: !99, file: !98, line: 180, type: !103)
!109 = !DILocalVariable(name: "n", scope: !99, file: !98, line: 182, type: !103)
!110 = !{!111}
!111 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!112 = !{!30, !31, !113, !24, !23, !25}
!113 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!114 = !{!69, !115, !117, !179, !181, !183, !185, !187, !189, !191, !194, !199}
!115 = !DIGlobalVariableExpression(var: !116)
!116 = distinct !DIGlobalVariable(name: "exit_status", scope: !71, file: !72, line: 68, type: !30, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118)
!118 = distinct !DIGlobalVariable(name: "prev_file", scope: !119, file: !72, line: 280, type: !21, isLocal: true, isDefinition: true)
!119 = distinct !DISubprogram(name: "next_file", scope: !72, file: !72, line: 278, type: !120, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, unit: !71, variables: !176)
!120 = !DISubroutineType(types: !121)
!121 = !{!122, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !124, line: 7, baseType: !125)
!124 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !126, line: 241, size: 1728, elements: !127)
!126 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !148, !149, !150, !151, !154, !155, !157, !161, !164, !166, !167, !168, !169, !170, !171, !172}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !125, file: !126, line: 242, baseType: !30, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !125, file: !126, line: 247, baseType: !21, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !125, file: !126, line: 248, baseType: !21, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !125, file: !126, line: 249, baseType: !21, size: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !125, file: !126, line: 250, baseType: !21, size: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !125, file: !126, line: 251, baseType: !21, size: 64, offset: 320)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !125, file: !126, line: 252, baseType: !21, size: 64, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !125, file: !126, line: 253, baseType: !21, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !125, file: !126, line: 254, baseType: !21, size: 64, offset: 512)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !125, file: !126, line: 256, baseType: !21, size: 64, offset: 576)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !125, file: !126, line: 257, baseType: !21, size: 64, offset: 640)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !125, file: !126, line: 258, baseType: !21, size: 64, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !125, file: !126, line: 260, baseType: !141, size: 64, offset: 768)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !126, line: 156, size: 192, elements: !143)
!143 = !{!144, !145, !147}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !142, file: !126, line: 157, baseType: !141, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !142, file: !126, line: 158, baseType: !146, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !142, file: !126, line: 162, baseType: !30, size: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !125, file: !126, line: 262, baseType: !146, size: 64, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !125, file: !126, line: 264, baseType: !30, size: 32, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !125, file: !126, line: 268, baseType: !30, size: 32, offset: 928)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !125, file: !126, line: 270, baseType: !152, size: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !28, line: 140, baseType: !153)
!153 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !125, file: !126, line: 274, baseType: !31, size: 16, offset: 1024)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !125, file: !126, line: 275, baseType: !156, size: 8, offset: 1040)
!156 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !125, file: !126, line: 276, baseType: !158, size: 8, offset: 1048)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 1)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !125, file: !126, line: 280, baseType: !162, size: 64, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !126, line: 150, baseType: null)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !125, file: !126, line: 289, baseType: !165, size: 64, offset: 1152)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !28, line: 141, baseType: !153)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !125, file: !126, line: 297, baseType: !23, size: 64, offset: 1216)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !125, file: !126, line: 298, baseType: !23, size: 64, offset: 1280)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !125, file: !126, line: 299, baseType: !23, size: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !125, file: !126, line: 300, baseType: !23, size: 64, offset: 1408)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !125, file: !126, line: 302, baseType: !103, size: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !125, file: !126, line: 303, baseType: !30, size: 32, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !125, file: !126, line: 305, baseType: !173, size: 160, offset: 1568)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 20)
!176 = !{!177, !178}
!177 = !DILocalVariable(name: "fp", arg: 1, scope: !119, file: !72, line: 278, type: !122)
!178 = !DILocalVariable(name: "file", scope: !119, file: !72, line: 281, type: !21)
!179 = !DIGlobalVariableExpression(var: !180)
!180 = distinct !DIGlobalVariable(name: "max_column_width", scope: !71, file: !72, line: 41, type: !103, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182)
!182 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !71, file: !72, line: 53, type: !103, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184)
!184 = distinct !DIGlobalVariable(name: "tab_list", scope: !71, file: !72, line: 46, type: !24, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186)
!186 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !71, file: !72, line: 49, type: !103, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188)
!188 = distinct !DIGlobalVariable(name: "extend_size", scope: !71, file: !72, line: 38, type: !25, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190)
!190 = distinct !DIGlobalVariable(name: "tab_size", scope: !71, file: !72, line: 35, type: !25, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192)
!192 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !71, file: !72, line: 65, type: !193, isLocal: true, isDefinition: true)
!193 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!194 = !DIGlobalVariableExpression(var: !195)
!195 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !71, file: !72, line: 59, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 2)
!199 = !DIGlobalVariableExpression(var: !200)
!200 = distinct !DIGlobalVariable(name: "file_list", scope: !71, file: !72, line: 56, type: !201, isLocal: true, isDefinition: true)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!202 = !DIGlobalVariableExpression(var: !203)
!203 = distinct !DIGlobalVariable(name: "Version", scope: !204, file: !205, line: 2, type: !41, isLocal: false, isDefinition: true)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, globals: !207)
!205 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!206 = !{}
!207 = !{!202}
!208 = !DIGlobalVariableExpression(var: !209)
!209 = distinct !DIGlobalVariable(name: "file_name", scope: !210, file: !215, line: 36, type: !41, isLocal: true, isDefinition: true)
!210 = distinct !DICompileUnit(language: DW_LANG_C99, file: !211, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, globals: !212)
!211 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!212 = !{!208, !213}
!213 = !DIGlobalVariableExpression(var: !214)
!214 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !210, file: !215, line: 46, type: !193, isLocal: true, isDefinition: true)
!215 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!216 = !DIGlobalVariableExpression(var: !217)
!217 = distinct !DIGlobalVariable(name: "exit_failure", scope: !218, file: !221, line: 24, type: !222, isLocal: false, isDefinition: true)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, globals: !220)
!219 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!220 = !{!216}
!221 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!222 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!223 = !DIGlobalVariableExpression(var: !224)
!224 = distinct !DIGlobalVariable(name: "program_name", scope: !225, file: !229, line: 33, type: !41, isLocal: false, isDefinition: true)
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !227, globals: !228)
!226 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!227 = !{!23, !21}
!228 = !{!223}
!229 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!230 = !DIGlobalVariableExpression(var: !231)
!231 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !232, file: !244, line: 77, type: !279, isLocal: false, isDefinition: true)
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !234, retainedTypes: !240, globals: !241)
!233 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!234 = !{!74, !235, !5}
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !75, line: 242, size: 32, elements: !236)
!236 = !{!237, !238, !239}
!237 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!238 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!239 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!240 = !{!30, !31, !103, !21}
!241 = !{!230, !242, !249, !261, !263, !268, !275, !277}
!242 = !DIGlobalVariableExpression(var: !243)
!243 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !232, file: !244, line: 93, type: !245, isLocal: false, isDefinition: true)
!244 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 320, elements: !247)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!247 = !{!248}
!248 = !DISubrange(count: 10)
!249 = !DIGlobalVariableExpression(var: !250)
!250 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !232, file: !244, line: 1043, type: !251, isLocal: false, isDefinition: true)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !244, line: 57, size: 448, elements: !252)
!252 = !{!253, !254, !255, !259, !260}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !251, file: !244, line: 60, baseType: !74, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !251, file: !244, line: 63, baseType: !30, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !251, file: !244, line: 67, baseType: !256, size: 256, offset: 64)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 256, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 8)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !251, file: !244, line: 70, baseType: !41, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !251, file: !244, line: 73, baseType: !41, size: 64, offset: 384)
!261 = !DIGlobalVariableExpression(var: !262)
!262 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !232, file: !244, line: 108, type: !251, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264)
!264 = distinct !DIGlobalVariable(name: "slot0", scope: !232, file: !244, line: 834, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 256)
!268 = !DIGlobalVariableExpression(var: !269)
!269 = distinct !DIGlobalVariable(name: "slotvec", scope: !232, file: !244, line: 837, type: !270, isLocal: true, isDefinition: true)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !244, line: 826, size: 128, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !271, file: !244, line: 828, baseType: !103, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !271, file: !244, line: 829, baseType: !21, size: 64, offset: 64)
!275 = !DIGlobalVariableExpression(var: !276)
!276 = distinct !DIGlobalVariable(name: "nslots", scope: !232, file: !244, line: 835, type: !30, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278)
!278 = distinct !DIGlobalVariable(name: "slotvec0", scope: !232, file: !244, line: 836, type: !271, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 704, elements: !281)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!281 = !{!282}
!282 = !DISubrange(count: 11)
!283 = !DIGlobalVariableExpression(var: !284)
!284 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !285, file: !288, line: 26, type: !289, isLocal: false, isDefinition: true)
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, globals: !287)
!286 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!287 = !{!283}
!288 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 376, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 47)
!292 = !DIGlobalVariableExpression(var: !293)
!293 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !294, file: !637, line: 120, type: !638, isLocal: true, isDefinition: true)
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !296, retainedTypes: !635, globals: !636)
!295 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!296 = !{!297}
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !298, line: 41, size: 32, elements: !299)
!298 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634}
!300 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!301 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!302 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!303 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!304 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!305 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!306 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!307 = !DIEnumerator(name: "DAY_1", value: 131079)
!308 = !DIEnumerator(name: "DAY_2", value: 131080)
!309 = !DIEnumerator(name: "DAY_3", value: 131081)
!310 = !DIEnumerator(name: "DAY_4", value: 131082)
!311 = !DIEnumerator(name: "DAY_5", value: 131083)
!312 = !DIEnumerator(name: "DAY_6", value: 131084)
!313 = !DIEnumerator(name: "DAY_7", value: 131085)
!314 = !DIEnumerator(name: "ABMON_1", value: 131086)
!315 = !DIEnumerator(name: "ABMON_2", value: 131087)
!316 = !DIEnumerator(name: "ABMON_3", value: 131088)
!317 = !DIEnumerator(name: "ABMON_4", value: 131089)
!318 = !DIEnumerator(name: "ABMON_5", value: 131090)
!319 = !DIEnumerator(name: "ABMON_6", value: 131091)
!320 = !DIEnumerator(name: "ABMON_7", value: 131092)
!321 = !DIEnumerator(name: "ABMON_8", value: 131093)
!322 = !DIEnumerator(name: "ABMON_9", value: 131094)
!323 = !DIEnumerator(name: "ABMON_10", value: 131095)
!324 = !DIEnumerator(name: "ABMON_11", value: 131096)
!325 = !DIEnumerator(name: "ABMON_12", value: 131097)
!326 = !DIEnumerator(name: "MON_1", value: 131098)
!327 = !DIEnumerator(name: "MON_2", value: 131099)
!328 = !DIEnumerator(name: "MON_3", value: 131100)
!329 = !DIEnumerator(name: "MON_4", value: 131101)
!330 = !DIEnumerator(name: "MON_5", value: 131102)
!331 = !DIEnumerator(name: "MON_6", value: 131103)
!332 = !DIEnumerator(name: "MON_7", value: 131104)
!333 = !DIEnumerator(name: "MON_8", value: 131105)
!334 = !DIEnumerator(name: "MON_9", value: 131106)
!335 = !DIEnumerator(name: "MON_10", value: 131107)
!336 = !DIEnumerator(name: "MON_11", value: 131108)
!337 = !DIEnumerator(name: "MON_12", value: 131109)
!338 = !DIEnumerator(name: "AM_STR", value: 131110)
!339 = !DIEnumerator(name: "PM_STR", value: 131111)
!340 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!341 = !DIEnumerator(name: "D_FMT", value: 131113)
!342 = !DIEnumerator(name: "T_FMT", value: 131114)
!343 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!344 = !DIEnumerator(name: "ERA", value: 131116)
!345 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!346 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!347 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!348 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!349 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!350 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!351 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!352 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!353 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!354 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!355 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!356 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!357 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!358 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!359 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!360 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!361 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!362 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!363 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!364 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!365 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!366 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!367 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!368 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!369 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!370 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!371 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!372 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!373 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!374 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!375 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!376 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!377 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!378 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!379 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!380 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!381 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!382 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!383 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!384 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!385 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!386 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!387 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!388 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!389 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!390 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!391 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!392 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!393 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!394 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!395 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!396 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!397 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!398 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!399 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!400 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!401 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!402 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!403 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!404 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!405 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!406 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!407 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!408 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!409 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!410 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!411 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!412 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!413 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!414 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!415 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!416 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!417 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!418 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!419 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!420 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!421 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!422 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!423 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!424 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!425 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!426 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!427 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!428 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!429 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!430 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!431 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!432 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!433 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!434 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!435 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!436 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!437 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!438 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!439 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!440 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!441 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!442 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!443 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!444 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!445 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!446 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!447 = !DIEnumerator(name: "CODESET", value: 14)
!448 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!449 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!450 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!451 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!452 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!453 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!454 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!455 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!456 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!457 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!458 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!459 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!460 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!461 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!462 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!463 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!464 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!465 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!466 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!467 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!468 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!469 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!470 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!471 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!472 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!473 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!474 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!475 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!476 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!477 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!478 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!479 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!480 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!481 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!482 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!483 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!484 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!485 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!486 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!487 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!488 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!489 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!490 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!491 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!492 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!493 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!494 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!495 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!496 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!497 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!498 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!499 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!500 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!501 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!502 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!503 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!504 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!505 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!506 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!507 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!508 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!509 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!510 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!511 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!512 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!513 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!514 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!515 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!516 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!517 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!518 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!519 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!520 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!521 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!522 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!523 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!524 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!525 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!526 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!527 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!528 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!529 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!530 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!531 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!532 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!533 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!534 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!535 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!536 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!537 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!538 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!539 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!540 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!541 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!542 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!543 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!544 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!545 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!546 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!547 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!548 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!549 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!550 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!551 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!552 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!553 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!554 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!555 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!556 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!557 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!558 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!559 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!560 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!561 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!562 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!563 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!564 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!565 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!566 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!567 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!568 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!569 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!570 = !DIEnumerator(name: "THOUSEP", value: 65537)
!571 = !DIEnumerator(name: "__GROUPING", value: 65538)
!572 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!573 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!574 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!575 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!576 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!577 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!578 = !DIEnumerator(name: "__YESSTR", value: 327682)
!579 = !DIEnumerator(name: "__NOSTR", value: 327683)
!580 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!581 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!582 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!583 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!584 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!585 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!586 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!587 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!588 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!589 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!590 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!591 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!592 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!593 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!594 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!595 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!596 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!597 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!598 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!599 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!600 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!601 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!602 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!603 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!604 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!605 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!606 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!607 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!608 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!609 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!610 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!611 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!612 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!613 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!614 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!615 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!616 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!617 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!618 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!619 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!620 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!621 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!622 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!623 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!624 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!625 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!626 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!627 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!628 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!629 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!630 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!631 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!632 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!633 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!634 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!635 = !{!23, !21, !32}
!636 = !{!292}
!637 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!638 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !41)
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !641)
!640 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!641 = !{!88}
!642 = distinct !DICompileUnit(language: DW_LANG_C99, file: !643, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !644, retainedTypes: !649)
!643 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!644 = !{!645}
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !646, line: 41, size: 32, elements: !647)
!646 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!647 = !{!648}
!648 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!649 = !{!23}
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !652, retainedTypes: !660)
!651 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!652 = !{!653}
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !654, file: !98, line: 192, size: 32, elements: !110)
!654 = distinct !DISubprogram(name: "x2nrealloc", scope: !98, file: !98, line: 180, type: !100, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !650, variables: !655)
!655 = !{!656, !657, !658, !659}
!656 = !DILocalVariable(name: "p", arg: 1, scope: !654, file: !98, line: 180, type: !23)
!657 = !DILocalVariable(name: "pn", arg: 2, scope: !654, file: !98, line: 180, type: !102)
!658 = !DILocalVariable(name: "s", arg: 3, scope: !654, file: !98, line: 180, type: !103)
!659 = !DILocalVariable(name: "n", scope: !654, file: !98, line: 182, type: !103)
!660 = !{!103, !21, !23}
!661 = distinct !DICompileUnit(language: DW_LANG_C99, file: !662, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206)
!662 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206)
!664 = !DIFile(filename: "./lib/xstrndup.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !649)
!666 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!667 = distinct !DICompileUnit(language: DW_LANG_C99, file: !668, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206)
!668 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!669 = distinct !DICompileUnit(language: DW_LANG_C99, file: !670, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !649)
!670 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!671 = distinct !DICompileUnit(language: DW_LANG_C99, file: !672, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !649)
!672 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !674, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !675)
!674 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!675 = !{!103}
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206)
!677 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!678 = distinct !DICompileUnit(language: DW_LANG_C99, file: !679, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206)
!679 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!680 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!681 = !{i32 2, !"Dwarf Version", i32 4}
!682 = !{i32 2, !"Debug Info Version", i32 3}
!683 = !{i32 1, !"wchar_size", i32 4}
!684 = !{i32 7, !"PIC Level", i32 2}
!685 = !{i32 7, !"PIE Level", i32 2}
!686 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 72, type: !687, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !689)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !30}
!689 = !{!690}
!690 = !DILocalVariable(name: "status", arg: 1, scope: !686, file: !3, line: 72, type: !30)
!691 = !DIExpression()
!692 = !DILocation(line: 72, column: 12, scope: !686)
!693 = !DILocation(line: 74, column: 14, scope: !694)
!694 = distinct !DILexicalBlock(scope: !686, file: !3, line: 74, column: 7)
!695 = !DILocation(line: 74, column: 7, scope: !686)
!696 = !DILocation(line: 75, column: 5, scope: !697)
!697 = distinct !DILexicalBlock(scope: !694, file: !3, line: 75, column: 5)
!698 = !{!699, !699, i64 0}
!699 = !{!"any pointer", !700, i64 0}
!700 = !{!"omnipotent char", !701, i64 0}
!701 = !{!"Simple C/C++ TBAA"}
!702 = !DILocation(line: 78, column: 7, scope: !703)
!703 = distinct !DILexicalBlock(scope: !694, file: !3, line: 77, column: 5)
!704 = !DILocation(line: 82, column: 7, scope: !703)
!705 = !DILocation(line: 580, column: 3, scope: !706, inlinedAt: !709)
!706 = distinct !DISubprogram(name: "emit_stdin_note", scope: !38, file: !38, line: 578, type: !707, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !206)
!707 = !DISubroutineType(types: !708)
!708 = !{null}
!709 = distinct !DILocation(line: 86, column: 7, scope: !703)
!710 = !DILocation(line: 587, column: 3, scope: !711, inlinedAt: !712)
!711 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !38, file: !38, line: 585, type: !707, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !206)
!712 = distinct !DILocation(line: 87, column: 7, scope: !703)
!713 = !DILocation(line: 89, column: 7, scope: !703)
!714 = !DILocation(line: 95, column: 7, scope: !703)
!715 = !DILocation(line: 96, column: 7, scope: !703)
!716 = !DILocation(line: 642, column: 15, scope: !37, inlinedAt: !717)
!717 = distinct !DILocation(line: 97, column: 7, scope: !703)
!718 = !DILocation(line: 651, column: 3, scope: !37, inlinedAt: !717)
!719 = !DILocation(line: 655, column: 29, scope: !37, inlinedAt: !717)
!720 = !DILocation(line: 655, column: 15, scope: !37, inlinedAt: !717)
!721 = !DILocation(line: 656, column: 7, scope: !722, inlinedAt: !717)
!722 = distinct !DILexicalBlock(scope: !37, file: !38, line: 656, column: 7)
!723 = !DILocation(line: 656, column: 19, scope: !722, inlinedAt: !717)
!724 = !DILocation(line: 656, column: 22, scope: !722, inlinedAt: !717)
!725 = !DILocation(line: 656, column: 7, scope: !37, inlinedAt: !717)
!726 = !DILocation(line: 662, column: 7, scope: !727, inlinedAt: !717)
!727 = distinct !DILexicalBlock(scope: !722, file: !38, line: 657, column: 5)
!728 = !DILocation(line: 664, column: 5, scope: !727, inlinedAt: !717)
!729 = !DILocation(line: 665, column: 3, scope: !37, inlinedAt: !717)
!730 = !DILocation(line: 667, column: 3, scope: !37, inlinedAt: !717)
!731 = !DILocation(line: 99, column: 3, scope: !686)
!732 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 257, type: !733, isLocal: false, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !735)
!733 = !DISubroutineType(types: !734)
!734 = !{!30, !30, !201}
!735 = !{!736, !737, !738, !739, !740, !741}
!736 = !DILocalVariable(name: "argc", arg: 1, scope: !732, file: !3, line: 257, type: !30)
!737 = !DILocalVariable(name: "argv", arg: 2, scope: !732, file: !3, line: 257, type: !201)
!738 = !DILocalVariable(name: "have_tabval", scope: !732, file: !3, line: 259, type: !193)
!739 = !DILocalVariable(name: "tabval", scope: !732, file: !3, line: 260, type: !25)
!740 = !DILocalVariable(name: "c", scope: !732, file: !3, line: 261, type: !30)
!741 = !DILocalVariable(name: "convert_first_only", scope: !732, file: !3, line: 265, type: !193)
!742 = !DILocation(line: 257, column: 11, scope: !732)
!743 = !DILocation(line: 257, column: 24, scope: !732)
!744 = !DILocation(line: 259, column: 8, scope: !732)
!745 = !DILocation(line: 265, column: 8, scope: !732)
!746 = !DILocation(line: 268, column: 21, scope: !732)
!747 = !DILocation(line: 268, column: 3, scope: !732)
!748 = !DILocation(line: 269, column: 3, scope: !732)
!749 = !DILocation(line: 270, column: 3, scope: !732)
!750 = !DILocation(line: 271, column: 3, scope: !732)
!751 = !DILocation(line: 273, column: 3, scope: !732)
!752 = !DILocation(line: 275, column: 3, scope: !732)
!753 = !DILocation(line: 275, column: 15, scope: !732)
!754 = !DILocation(line: 260, column: 13, scope: !732)
!755 = !DILocation(line: 261, column: 7, scope: !732)
!756 = distinct !{!756, !752, !757}
!757 = !DILocation(line: 309, column: 5, scope: !732)
!758 = !DILocation(line: 281, column: 11, scope: !759)
!759 = distinct !DILexicalBlock(scope: !760, file: !3, line: 279, column: 9)
!760 = distinct !DILexicalBlock(scope: !732, file: !3, line: 277, column: 5)
!761 = !DILocation(line: 283, column: 31, scope: !759)
!762 = !{!763, !763, i64 0}
!763 = !{!"_Bool", !700, i64 0}
!764 = !DILocation(line: 284, column: 11, scope: !759)
!765 = !DILocation(line: 286, column: 31, scope: !759)
!766 = !DILocation(line: 287, column: 28, scope: !759)
!767 = !DILocation(line: 287, column: 11, scope: !759)
!768 = !DILocation(line: 288, column: 11, scope: !759)
!769 = !DILocation(line: 293, column: 15, scope: !770)
!770 = distinct !DILexicalBlock(scope: !759, file: !3, line: 293, column: 15)
!771 = !DILocation(line: 293, column: 15, scope: !759)
!772 = !DILocation(line: 294, column: 13, scope: !770)
!773 = !DILocation(line: 297, column: 9, scope: !759)
!774 = !DILocation(line: 298, column: 9, scope: !759)
!775 = !DILocation(line: 300, column: 16, scope: !776)
!776 = distinct !DILexicalBlock(scope: !759, file: !3, line: 300, column: 15)
!777 = !DILocation(line: 300, column: 15, scope: !759)
!778 = !DILocation(line: 305, column: 16, scope: !779)
!779 = distinct !DILexicalBlock(scope: !759, file: !3, line: 305, column: 15)
!780 = !DILocation(line: 305, column: 15, scope: !759)
!781 = !DILocation(line: 306, column: 13, scope: !779)
!782 = !DILocation(line: 311, column: 7, scope: !783)
!783 = distinct !DILexicalBlock(scope: !732, file: !3, line: 311, column: 7)
!784 = !DILocation(line: 311, column: 7, scope: !732)
!785 = !DILocation(line: 312, column: 25, scope: !783)
!786 = !DILocation(line: 312, column: 5, scope: !783)
!787 = !DILocation(line: 314, column: 7, scope: !788)
!788 = distinct !DILexicalBlock(scope: !732, file: !3, line: 314, column: 7)
!789 = !DILocation(line: 314, column: 7, scope: !732)
!790 = !DILocation(line: 315, column: 5, scope: !788)
!791 = !DILocation(line: 317, column: 3, scope: !732)
!792 = !DILocation(line: 319, column: 20, scope: !732)
!793 = !{!794, !794, i64 0}
!794 = !{!"int", !700, i64 0}
!795 = !DILocation(line: 319, column: 27, scope: !732)
!796 = !DILocation(line: 319, column: 38, scope: !732)
!797 = !DILocation(line: 319, column: 19, scope: !732)
!798 = !DILocation(line: 319, column: 3, scope: !732)
!799 = !DILocation(line: 109, column: 14, scope: !800, inlinedAt: !860)
!800 = distinct !DISubprogram(name: "unexpand", scope: !3, file: !3, line: 106, type: !707, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !801)
!801 = !{!802, !843, !844, !846, !847, !848, !849, !850, !851, !852, !853, !857}
!802 = !DILocalVariable(name: "fp", scope: !800, file: !3, line: 109, type: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !124, line: 7, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !126, line: 241, size: 1728, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !805, file: !126, line: 242, baseType: !30, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !805, file: !126, line: 247, baseType: !21, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !805, file: !126, line: 248, baseType: !21, size: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !805, file: !126, line: 249, baseType: !21, size: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !805, file: !126, line: 250, baseType: !21, size: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !805, file: !126, line: 251, baseType: !21, size: 64, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !805, file: !126, line: 252, baseType: !21, size: 64, offset: 384)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !805, file: !126, line: 253, baseType: !21, size: 64, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !805, file: !126, line: 254, baseType: !21, size: 64, offset: 512)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !805, file: !126, line: 256, baseType: !21, size: 64, offset: 576)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !805, file: !126, line: 257, baseType: !21, size: 64, offset: 640)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !805, file: !126, line: 258, baseType: !21, size: 64, offset: 704)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !805, file: !126, line: 260, baseType: !820, size: 64, offset: 768)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !126, line: 156, size: 192, elements: !822)
!822 = !{!823, !824, !826}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !821, file: !126, line: 157, baseType: !820, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !821, file: !126, line: 158, baseType: !825, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !821, file: !126, line: 162, baseType: !30, size: 32, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !805, file: !126, line: 262, baseType: !825, size: 64, offset: 832)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !805, file: !126, line: 264, baseType: !30, size: 32, offset: 896)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !805, file: !126, line: 268, baseType: !30, size: 32, offset: 928)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !805, file: !126, line: 270, baseType: !152, size: 64, offset: 960)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !805, file: !126, line: 274, baseType: !31, size: 16, offset: 1024)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !805, file: !126, line: 275, baseType: !156, size: 8, offset: 1040)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !805, file: !126, line: 276, baseType: !158, size: 8, offset: 1048)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !805, file: !126, line: 280, baseType: !162, size: 64, offset: 1088)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !805, file: !126, line: 289, baseType: !165, size: 64, offset: 1152)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !805, file: !126, line: 297, baseType: !23, size: 64, offset: 1216)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !805, file: !126, line: 298, baseType: !23, size: 64, offset: 1280)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !805, file: !126, line: 299, baseType: !23, size: 64, offset: 1344)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !805, file: !126, line: 300, baseType: !23, size: 64, offset: 1408)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !805, file: !126, line: 302, baseType: !103, size: 64, offset: 1472)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !805, file: !126, line: 303, baseType: !30, size: 32, offset: 1536)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !805, file: !126, line: 305, baseType: !173, size: 160, offset: 1568)
!843 = !DILocalVariable(name: "pending_blank", scope: !800, file: !3, line: 114, type: !21)
!844 = !DILocalVariable(name: "c", scope: !845, file: !3, line: 127, type: !30)
!845 = distinct !DILexicalBlock(scope: !800, file: !3, line: 125, column: 5)
!846 = !DILocalVariable(name: "convert", scope: !845, file: !3, line: 130, type: !193)
!847 = !DILocalVariable(name: "column", scope: !845, file: !3, line: 137, type: !25)
!848 = !DILocalVariable(name: "next_tab_column", scope: !845, file: !3, line: 140, type: !25)
!849 = !DILocalVariable(name: "tab_index", scope: !845, file: !3, line: 143, type: !103)
!850 = !DILocalVariable(name: "one_blank_before_tab_stop", scope: !845, file: !3, line: 146, type: !193)
!851 = !DILocalVariable(name: "prev_blank", scope: !845, file: !3, line: 151, type: !193)
!852 = !DILocalVariable(name: "pending", scope: !845, file: !3, line: 154, type: !103)
!853 = !DILocalVariable(name: "blank", scope: !854, file: !3, line: 166, type: !193)
!854 = distinct !DILexicalBlock(scope: !855, file: !3, line: 165, column: 13)
!855 = distinct !DILexicalBlock(scope: !856, file: !3, line: 164, column: 15)
!856 = distinct !DILexicalBlock(scope: !845, file: !3, line: 160, column: 9)
!857 = !DILocalVariable(name: "last_tab", scope: !858, file: !3, line: 170, type: !193)
!858 = distinct !DILexicalBlock(scope: !859, file: !3, line: 169, column: 17)
!859 = distinct !DILexicalBlock(scope: !854, file: !3, line: 168, column: 19)
!860 = distinct !DILocation(line: 321, column: 3, scope: !732)
!861 = !DILocation(line: 109, column: 9, scope: !800, inlinedAt: !860)
!862 = !DILocation(line: 116, column: 8, scope: !863, inlinedAt: !860)
!863 = distinct !DILexicalBlock(scope: !800, file: !3, line: 116, column: 7)
!864 = !DILocation(line: 116, column: 7, scope: !800, inlinedAt: !860)
!865 = !DILocation(line: 122, column: 28, scope: !800, inlinedAt: !860)
!866 = !{!867, !867, i64 0}
!867 = !{!"long", !700, i64 0}
!868 = !DILocation(line: 122, column: 19, scope: !800, inlinedAt: !860)
!869 = !DILocation(line: 114, column: 9, scope: !800, inlinedAt: !860)
!870 = !DILocation(line: 124, column: 3, scope: !800, inlinedAt: !860)
!871 = !DILocation(line: 130, column: 12, scope: !845, inlinedAt: !860)
!872 = !DILocation(line: 137, column: 17, scope: !845, inlinedAt: !860)
!873 = !DILocation(line: 140, column: 17, scope: !845, inlinedAt: !860)
!874 = !DILocation(line: 143, column: 7, scope: !845, inlinedAt: !860)
!875 = !DILocation(line: 143, column: 14, scope: !845, inlinedAt: !860)
!876 = !DILocation(line: 146, column: 12, scope: !845, inlinedAt: !860)
!877 = !DILocation(line: 151, column: 12, scope: !845, inlinedAt: !860)
!878 = !DILocation(line: 154, column: 14, scope: !845, inlinedAt: !860)
!879 = !DILocation(line: 159, column: 7, scope: !845, inlinedAt: !860)
!880 = distinct !{!880, !881, !882}
!881 = !DILocation(line: 159, column: 7, scope: !845)
!882 = !DILocation(line: 252, column: 23, scope: !845)
!883 = !DILocalVariable(name: "__fp", arg: 1, scope: !884, file: !885, line: 63, type: !803)
!884 = distinct !DISubprogram(name: "getc_unlocked", scope: !885, file: !885, line: 63, type: !886, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !888)
!885 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!886 = !DISubroutineType(types: !887)
!887 = !{!30, !803}
!888 = !{!883}
!889 = !DILocation(line: 63, column: 22, scope: !884, inlinedAt: !890)
!890 = distinct !DILocation(line: 161, column: 23, scope: !856, inlinedAt: !860)
!891 = !DILocation(line: 65, column: 10, scope: !884, inlinedAt: !890)
!892 = !{!893, !699, i64 8}
!893 = !{!"_IO_FILE", !794, i64 0, !699, i64 8, !699, i64 16, !699, i64 24, !699, i64 32, !699, i64 40, !699, i64 48, !699, i64 56, !699, i64 64, !699, i64 72, !699, i64 80, !699, i64 88, !699, i64 96, !699, i64 104, !794, i64 112, !794, i64 116, !867, i64 120, !894, i64 128, !700, i64 130, !700, i64 131, !699, i64 136, !867, i64 144, !699, i64 152, !699, i64 160, !699, i64 168, !699, i64 176, !867, i64 184, !794, i64 192, !700, i64 196}
!894 = !{!"short", !700, i64 0}
!895 = !{!893, !699, i64 16}
!896 = !{!"branch_weights", i32 2000, i32 1}
!897 = distinct !{!897, !898, !899}
!898 = !DILocation(line: 161, column: 11, scope: !856)
!899 = !DILocation(line: 162, column: 13, scope: !856)
!900 = !{!700, !700, i64 0}
!901 = !DILocation(line: 127, column: 11, scope: !845, inlinedAt: !860)
!902 = !DILocation(line: 161, column: 38, scope: !856, inlinedAt: !860)
!903 = !DILocation(line: 161, column: 34, scope: !856, inlinedAt: !860)
!904 = !DILocation(line: 161, column: 47, scope: !856, inlinedAt: !860)
!905 = !DILocation(line: 161, column: 11, scope: !856, inlinedAt: !860)
!906 = !DILocation(line: 164, column: 15, scope: !855, inlinedAt: !860)
!907 = !DILocation(line: 164, column: 15, scope: !856, inlinedAt: !860)
!908 = !DILocation(line: 166, column: 31, scope: !854, inlinedAt: !860)
!909 = !{!894, !894, i64 0}
!910 = !DILocation(line: 166, column: 29, scope: !854, inlinedAt: !860)
!911 = !DILocation(line: 166, column: 20, scope: !854, inlinedAt: !860)
!912 = !DILocation(line: 168, column: 19, scope: !854, inlinedAt: !860)
!913 = !DILocation(line: 170, column: 24, scope: !858, inlinedAt: !860)
!914 = !DILocation(line: 170, column: 19, scope: !858, inlinedAt: !860)
!915 = !DILocation(line: 172, column: 37, scope: !858, inlinedAt: !860)
!916 = !DILocation(line: 175, column: 23, scope: !917, inlinedAt: !860)
!917 = distinct !DILexicalBlock(scope: !858, file: !3, line: 175, column: 23)
!918 = !{i8 0, i8 2}
!919 = !DILocation(line: 175, column: 23, scope: !858, inlinedAt: !860)
!920 = !DILocation(line: 178, column: 23, scope: !921, inlinedAt: !860)
!921 = distinct !DILexicalBlock(scope: !858, file: !3, line: 178, column: 23)
!922 = !DILocation(line: 178, column: 23, scope: !858, inlinedAt: !860)
!923 = !DILocation(line: 180, column: 43, scope: !924, inlinedAt: !860)
!924 = distinct !DILexicalBlock(scope: !925, file: !3, line: 180, column: 27)
!925 = distinct !DILexicalBlock(scope: !921, file: !3, line: 179, column: 21)
!926 = !DILocation(line: 180, column: 27, scope: !925, inlinedAt: !860)
!927 = !DILocation(line: 181, column: 25, scope: !924, inlinedAt: !860)
!928 = !DILocation(line: 183, column: 29, scope: !929, inlinedAt: !860)
!929 = distinct !DILexicalBlock(scope: !925, file: !3, line: 183, column: 27)
!930 = !DILocation(line: 183, column: 27, scope: !925, inlinedAt: !860)
!931 = !DILocation(line: 187, column: 31, scope: !932, inlinedAt: !860)
!932 = distinct !DILexicalBlock(scope: !933, file: !3, line: 187, column: 31)
!933 = distinct !DILexicalBlock(scope: !929, file: !3, line: 184, column: 25)
!934 = !DILocation(line: 187, column: 31, scope: !933, inlinedAt: !860)
!935 = !DILocation(line: 192, column: 33, scope: !936, inlinedAt: !860)
!936 = distinct !DILexicalBlock(scope: !929, file: !3, line: 191, column: 25)
!937 = !DILocation(line: 194, column: 34, scope: !938, inlinedAt: !860)
!938 = distinct !DILexicalBlock(scope: !936, file: !3, line: 194, column: 31)
!939 = !DILocation(line: 194, column: 55, scope: !938, inlinedAt: !860)
!940 = !DILocation(line: 194, column: 45, scope: !938, inlinedAt: !860)
!941 = !DILocation(line: 211, column: 33, scope: !925, inlinedAt: !860)
!942 = !DILocation(line: 212, column: 21, scope: !925, inlinedAt: !860)
!943 = !DILocation(line: 213, column: 17, scope: !859, inlinedAt: !860)
!944 = !DILocation(line: 214, column: 26, scope: !945, inlinedAt: !860)
!945 = distinct !DILexicalBlock(scope: !859, file: !3, line: 214, column: 24)
!946 = !DILocation(line: 214, column: 24, scope: !859, inlinedAt: !860)
!947 = !DILocation(line: 218, column: 30, scope: !948, inlinedAt: !860)
!948 = distinct !DILexicalBlock(scope: !945, file: !3, line: 215, column: 17)
!949 = !DILocation(line: 218, column: 29, scope: !948, inlinedAt: !860)
!950 = !DILocation(line: 218, column: 26, scope: !948, inlinedAt: !860)
!951 = !DILocation(line: 220, column: 34, scope: !948, inlinedAt: !860)
!952 = !DILocation(line: 220, column: 33, scope: !948, inlinedAt: !860)
!953 = !DILocation(line: 220, column: 32, scope: !948, inlinedAt: !860)
!954 = !DILocation(line: 220, column: 29, scope: !948, inlinedAt: !860)
!955 = !DILocation(line: 221, column: 17, scope: !948, inlinedAt: !860)
!956 = !DILocation(line: 224, column: 25, scope: !957, inlinedAt: !860)
!957 = distinct !DILexicalBlock(scope: !945, file: !3, line: 223, column: 17)
!958 = !DILocation(line: 225, column: 24, scope: !959, inlinedAt: !860)
!959 = distinct !DILexicalBlock(scope: !957, file: !3, line: 225, column: 23)
!960 = !DILocation(line: 225, column: 23, scope: !957, inlinedAt: !860)
!961 = !DILocation(line: 226, column: 21, scope: !959, inlinedAt: !860)
!962 = !DILocation(line: 229, column: 19, scope: !854, inlinedAt: !860)
!963 = !DILocation(line: 231, column: 38, scope: !964, inlinedAt: !860)
!964 = distinct !DILexicalBlock(scope: !965, file: !3, line: 231, column: 23)
!965 = distinct !DILexicalBlock(scope: !966, file: !3, line: 230, column: 17)
!966 = distinct !DILexicalBlock(scope: !854, file: !3, line: 229, column: 19)
!967 = !DILocation(line: 231, column: 23, scope: !965, inlinedAt: !860)
!968 = !DILocation(line: 232, column: 38, scope: !964, inlinedAt: !860)
!969 = !DILocation(line: 232, column: 21, scope: !964, inlinedAt: !860)
!970 = !DILocation(line: 233, column: 23, scope: !971, inlinedAt: !860)
!971 = distinct !DILexicalBlock(scope: !965, file: !3, line: 233, column: 23)
!972 = !DILocation(line: 233, column: 66, scope: !971, inlinedAt: !860)
!973 = !DILocation(line: 233, column: 23, scope: !965, inlinedAt: !860)
!974 = !DILocation(line: 234, column: 21, scope: !971, inlinedAt: !860)
!975 = !DILocation(line: 240, column: 26, scope: !854, inlinedAt: !860)
!976 = !DILocation(line: 240, column: 46, scope: !854, inlinedAt: !860)
!977 = !DILocation(line: 240, column: 23, scope: !854, inlinedAt: !860)
!978 = !DILocation(line: 198, column: 35, scope: !979, inlinedAt: !860)
!979 = distinct !DILexicalBlock(scope: !938, file: !3, line: 195, column: 29)
!980 = !DILocation(line: 200, column: 58, scope: !979, inlinedAt: !860)
!981 = !DILocation(line: 200, column: 52, scope: !979, inlinedAt: !860)
!982 = !DILocation(line: 200, column: 31, scope: !979, inlinedAt: !860)
!983 = !DILocation(line: 200, column: 56, scope: !979, inlinedAt: !860)
!984 = !DILocation(line: 243, column: 17, scope: !985, inlinedAt: !860)
!985 = distinct !DILexicalBlock(scope: !856, file: !3, line: 243, column: 15)
!986 = !DILocation(line: 243, column: 15, scope: !856, inlinedAt: !860)
!987 = !DILocation(line: 245, column: 15, scope: !988, inlinedAt: !860)
!988 = distinct !DILexicalBlock(scope: !985, file: !3, line: 244, column: 13)
!989 = !DILocation(line: 253, column: 5, scope: !800, inlinedAt: !860)
!990 = !DILocalVariable(name: "__c", arg: 1, scope: !991, file: !885, line: 105, type: !30)
!991 = distinct !DISubprogram(name: "putchar_unlocked", scope: !885, file: !885, line: 105, type: !992, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !994)
!992 = !DISubroutineType(types: !993)
!993 = !{!30, !30}
!994 = !{!990}
!995 = !DILocation(line: 105, column: 23, scope: !991, inlinedAt: !996)
!996 = distinct !DILocation(line: 249, column: 15, scope: !997, inlinedAt: !860)
!997 = distinct !DILexicalBlock(scope: !856, file: !3, line: 249, column: 15)
!998 = !DILocation(line: 107, column: 10, scope: !991, inlinedAt: !996)
!999 = !{!893, !699, i64 40}
!1000 = !{!893, !699, i64 48}
!1001 = !DILocation(line: 249, column: 15, scope: !856, inlinedAt: !860)
!1002 = !DILocation(line: 249, column: 27, scope: !997, inlinedAt: !860)
!1003 = !DILocation(line: 250, column: 13, scope: !997, inlinedAt: !860)
!1004 = !DILocation(line: 252, column: 16, scope: !845, inlinedAt: !860)
!1005 = !DILocation(line: 251, column: 9, scope: !856, inlinedAt: !860)
!1006 = distinct !{!1006, !1007, !1008}
!1007 = !DILocation(line: 124, column: 3, scope: !800)
!1008 = !DILocation(line: 253, column: 5, scope: !800)
!1009 = !DILocation(line: 323, column: 3, scope: !732)
!1010 = !DILocation(line: 325, column: 10, scope: !732)
!1011 = !DILocation(line: 326, column: 1, scope: !732)
!1012 = distinct !DISubprogram(name: "add_tab_stop", scope: !72, file: !72, line: 74, type: !1013, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, unit: !71, variables: !1015)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !25}
!1015 = !{!1016, !1017, !1018}
!1016 = !DILocalVariable(name: "tabval", arg: 1, scope: !1012, file: !72, line: 74, type: !25)
!1017 = !DILocalVariable(name: "prev_column", scope: !1012, file: !72, line: 76, type: !25)
!1018 = !DILocalVariable(name: "column_width", scope: !1012, file: !72, line: 77, type: !25)
!1019 = !DILocation(line: 74, column: 25, scope: !1012)
!1020 = !DILocation(line: 76, column: 27, scope: !1012)
!1021 = !DILocation(line: 76, column: 44, scope: !1012)
!1022 = !DILocation(line: 76, column: 68, scope: !1012)
!1023 = !DILocation(line: 76, column: 13, scope: !1012)
!1024 = !DILocation(line: 77, column: 40, scope: !1012)
!1025 = !DILocation(line: 77, column: 59, scope: !1012)
!1026 = !DILocation(line: 77, column: 28, scope: !1012)
!1027 = !DILocation(line: 77, column: 13, scope: !1012)
!1028 = !DILocation(line: 79, column: 25, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1012, file: !72, line: 79, column: 7)
!1030 = !DILocation(line: 79, column: 22, scope: !1029)
!1031 = !DILocation(line: 79, column: 7, scope: !1012)
!1032 = !DILocation(line: 81, column: 3, scope: !1012)
!1033 = !DILocation(line: 80, column: 16, scope: !1029)
!1034 = !DILocation(line: 180, column: 19, scope: !99, inlinedAt: !1035)
!1035 = distinct !DILocation(line: 80, column: 16, scope: !1029)
!1036 = !DILocation(line: 180, column: 30, scope: !99, inlinedAt: !1035)
!1037 = !DILocation(line: 180, column: 41, scope: !99, inlinedAt: !1035)
!1038 = !DILocation(line: 182, column: 10, scope: !99, inlinedAt: !1035)
!1039 = !DILocation(line: 184, column: 9, scope: !1040, inlinedAt: !1035)
!1040 = distinct !DILexicalBlock(scope: !99, file: !98, line: 184, column: 7)
!1041 = !DILocation(line: 184, column: 7, scope: !99, inlinedAt: !1035)
!1042 = !DILocation(line: 186, column: 11, scope: !1043, inlinedAt: !1035)
!1043 = distinct !DILexicalBlock(scope: !1040, file: !98, line: 185, column: 5)
!1044 = !DILocation(line: 205, column: 11, scope: !1045, inlinedAt: !1035)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !98, line: 204, column: 11)
!1046 = distinct !DILexicalBlock(scope: !1040, file: !98, line: 199, column: 5)
!1047 = !DILocation(line: 204, column: 11, scope: !1046, inlinedAt: !1035)
!1048 = !DILocation(line: 206, column: 9, scope: !1045, inlinedAt: !1035)
!1049 = !DILocation(line: 207, column: 14, scope: !1046, inlinedAt: !1035)
!1050 = !DILocation(line: 207, column: 18, scope: !1046, inlinedAt: !1035)
!1051 = !DILocation(line: 207, column: 9, scope: !1046, inlinedAt: !1035)
!1052 = !DILocation(line: 210, column: 7, scope: !99, inlinedAt: !1035)
!1053 = !DILocation(line: 211, column: 25, scope: !99, inlinedAt: !1035)
!1054 = !DILocation(line: 211, column: 10, scope: !99, inlinedAt: !1035)
!1055 = !DILocation(line: 80, column: 14, scope: !1029)
!1056 = !DILocation(line: 80, column: 5, scope: !1029)
!1057 = !DILocation(line: 81, column: 26, scope: !1012)
!1058 = !DILocation(line: 81, column: 30, scope: !1012)
!1059 = !DILocation(line: 83, column: 7, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1012, file: !72, line: 83, column: 7)
!1061 = !DILocation(line: 83, column: 24, scope: !1060)
!1062 = !DILocation(line: 83, column: 7, scope: !1012)
!1063 = !DILocation(line: 87, column: 24, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1060, file: !72, line: 84, column: 5)
!1065 = !DILocation(line: 88, column: 5, scope: !1064)
!1066 = !DILocation(line: 89, column: 1, scope: !1012)
!1067 = distinct !DISubprogram(name: "parse_tab_stops", scope: !72, file: !72, line: 111, type: !39, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !71, variables: !1068)
!1068 = !{!1069, !1070, !1071, !1072, !1073, !1074, !1075, !1085}
!1069 = !DILocalVariable(name: "stops", arg: 1, scope: !1067, file: !72, line: 111, type: !41)
!1070 = !DILocalVariable(name: "have_tabval", scope: !1067, file: !72, line: 113, type: !193)
!1071 = !DILocalVariable(name: "tabval", scope: !1067, file: !72, line: 114, type: !25)
!1072 = !DILocalVariable(name: "extend_tabval", scope: !1067, file: !72, line: 115, type: !193)
!1073 = !DILocalVariable(name: "num_start", scope: !1067, file: !72, line: 116, type: !41)
!1074 = !DILocalVariable(name: "ok", scope: !1067, file: !72, line: 117, type: !193)
!1075 = !DILocalVariable(name: "len", scope: !1076, file: !72, line: 160, type: !103)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !72, line: 159, column: 13)
!1077 = distinct !DILexicalBlock(scope: !1078, file: !72, line: 158, column: 15)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !72, line: 149, column: 9)
!1079 = distinct !DILexicalBlock(scope: !1080, file: !72, line: 148, column: 16)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !72, line: 138, column: 16)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !72, line: 121, column: 11)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !72, line: 120, column: 5)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !72, line: 119, column: 3)
!1084 = distinct !DILexicalBlock(scope: !1067, file: !72, line: 119, column: 3)
!1085 = !DILocalVariable(name: "bad_num", scope: !1076, file: !72, line: 161, type: !21)
!1086 = !DILocation(line: 111, column: 30, scope: !1067)
!1087 = !DILocation(line: 113, column: 8, scope: !1067)
!1088 = !DILocation(line: 114, column: 13, scope: !1067)
!1089 = !DILocation(line: 115, column: 8, scope: !1067)
!1090 = !DILocation(line: 116, column: 15, scope: !1067)
!1091 = !DILocation(line: 117, column: 8, scope: !1067)
!1092 = !DILocation(line: 119, column: 3, scope: !1067)
!1093 = !DILocation(line: 119, column: 10, scope: !1083)
!1094 = !DILocation(line: 119, column: 3, scope: !1084)
!1095 = !DILocation(line: 121, column: 28, scope: !1081)
!1096 = !DILocation(line: 121, column: 11, scope: !1082)
!1097 = !DILocation(line: 123, column: 15, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !72, line: 123, column: 15)
!1099 = distinct !DILexicalBlock(scope: !1081, file: !72, line: 122, column: 9)
!1100 = !DILocation(line: 123, column: 15, scope: !1099)
!1101 = !DILocation(line: 125, column: 19, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !72, line: 125, column: 19)
!1103 = distinct !DILexicalBlock(scope: !1098, file: !72, line: 124, column: 13)
!1104 = !DILocation(line: 125, column: 19, scope: !1103)
!1105 = !DILocalVariable(name: "tabval", arg: 1, scope: !1106, file: !72, line: 92, type: !25)
!1106 = distinct !DISubprogram(name: "set_extend_size", scope: !72, file: !72, line: 92, type: !1107, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, unit: !71, variables: !1109)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!193, !25}
!1109 = !{!1105, !1110}
!1110 = !DILocalVariable(name: "ok", scope: !1106, file: !72, line: 94, type: !193)
!1111 = !DILocation(line: 92, column: 28, scope: !1106, inlinedAt: !1112)
!1112 = distinct !DILocation(line: 127, column: 25, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !72, line: 127, column: 23)
!1114 = distinct !DILexicalBlock(scope: !1102, file: !72, line: 126, column: 17)
!1115 = !DILocation(line: 94, column: 8, scope: !1106, inlinedAt: !1112)
!1116 = !DILocation(line: 96, column: 7, scope: !1117, inlinedAt: !1112)
!1117 = distinct !DILexicalBlock(scope: !1106, file: !72, line: 96, column: 7)
!1118 = !DILocation(line: 96, column: 7, scope: !1106, inlinedAt: !1112)
!1119 = !DILocation(line: 103, column: 15, scope: !1106, inlinedAt: !1112)
!1120 = !DILocation(line: 127, column: 23, scope: !1114)
!1121 = !DILocation(line: 99, column: 14, scope: !1122, inlinedAt: !1112)
!1122 = distinct !DILexicalBlock(scope: !1117, file: !72, line: 97, column: 5)
!1123 = !DILocation(line: 98, column: 7, scope: !1122, inlinedAt: !1112)
!1124 = !DILocation(line: 74, column: 25, scope: !1012, inlinedAt: !1125)
!1125 = distinct !DILocation(line: 134, column: 17, scope: !1102)
!1126 = !DILocation(line: 76, column: 27, scope: !1012, inlinedAt: !1125)
!1127 = !DILocation(line: 76, column: 44, scope: !1012, inlinedAt: !1125)
!1128 = !DILocation(line: 76, column: 68, scope: !1012, inlinedAt: !1125)
!1129 = !DILocation(line: 76, column: 13, scope: !1012, inlinedAt: !1125)
!1130 = !DILocation(line: 77, column: 40, scope: !1012, inlinedAt: !1125)
!1131 = !DILocation(line: 77, column: 59, scope: !1012, inlinedAt: !1125)
!1132 = !DILocation(line: 77, column: 28, scope: !1012, inlinedAt: !1125)
!1133 = !DILocation(line: 77, column: 13, scope: !1012, inlinedAt: !1125)
!1134 = !DILocation(line: 79, column: 25, scope: !1029, inlinedAt: !1125)
!1135 = !DILocation(line: 79, column: 22, scope: !1029, inlinedAt: !1125)
!1136 = !DILocation(line: 79, column: 7, scope: !1012, inlinedAt: !1125)
!1137 = !DILocation(line: 81, column: 3, scope: !1012, inlinedAt: !1125)
!1138 = !DILocation(line: 80, column: 16, scope: !1029, inlinedAt: !1125)
!1139 = !DILocation(line: 180, column: 19, scope: !99, inlinedAt: !1140)
!1140 = distinct !DILocation(line: 80, column: 16, scope: !1029, inlinedAt: !1125)
!1141 = !DILocation(line: 180, column: 30, scope: !99, inlinedAt: !1140)
!1142 = !DILocation(line: 180, column: 41, scope: !99, inlinedAt: !1140)
!1143 = !DILocation(line: 182, column: 10, scope: !99, inlinedAt: !1140)
!1144 = !DILocation(line: 184, column: 9, scope: !1040, inlinedAt: !1140)
!1145 = !DILocation(line: 184, column: 7, scope: !99, inlinedAt: !1140)
!1146 = !DILocation(line: 186, column: 11, scope: !1043, inlinedAt: !1140)
!1147 = !DILocation(line: 205, column: 11, scope: !1045, inlinedAt: !1140)
!1148 = !DILocation(line: 204, column: 11, scope: !1046, inlinedAt: !1140)
!1149 = !DILocation(line: 206, column: 9, scope: !1045, inlinedAt: !1140)
!1150 = !DILocation(line: 207, column: 14, scope: !1046, inlinedAt: !1140)
!1151 = !DILocation(line: 207, column: 18, scope: !1046, inlinedAt: !1140)
!1152 = !DILocation(line: 207, column: 9, scope: !1046, inlinedAt: !1140)
!1153 = !DILocation(line: 210, column: 7, scope: !99, inlinedAt: !1140)
!1154 = !DILocation(line: 211, column: 25, scope: !99, inlinedAt: !1140)
!1155 = !DILocation(line: 211, column: 10, scope: !99, inlinedAt: !1140)
!1156 = !DILocation(line: 80, column: 14, scope: !1029, inlinedAt: !1125)
!1157 = !DILocation(line: 80, column: 5, scope: !1029, inlinedAt: !1125)
!1158 = !DILocation(line: 81, column: 26, scope: !1012, inlinedAt: !1125)
!1159 = !DILocation(line: 81, column: 30, scope: !1012, inlinedAt: !1125)
!1160 = !DILocation(line: 83, column: 7, scope: !1060, inlinedAt: !1125)
!1161 = !DILocation(line: 83, column: 24, scope: !1060, inlinedAt: !1125)
!1162 = !DILocation(line: 83, column: 7, scope: !1012, inlinedAt: !1125)
!1163 = !DILocation(line: 87, column: 24, scope: !1064, inlinedAt: !1125)
!1164 = !DILocation(line: 88, column: 5, scope: !1064, inlinedAt: !1125)
!1165 = !DILocation(line: 138, column: 23, scope: !1080)
!1166 = !DILocation(line: 138, column: 16, scope: !1081)
!1167 = !DILocation(line: 140, column: 15, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !72, line: 140, column: 15)
!1169 = distinct !DILexicalBlock(scope: !1080, file: !72, line: 139, column: 9)
!1170 = !DILocation(line: 140, column: 15, scope: !1169)
!1171 = !DILocation(line: 142, column: 28, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1168, file: !72, line: 141, column: 13)
!1173 = !DILocation(line: 143, column: 22, scope: !1172)
!1174 = !DILocation(line: 142, column: 15, scope: !1172)
!1175 = !DILocation(line: 145, column: 13, scope: !1172)
!1176 = !DILocation(line: 138, column: 16, scope: !1080)
!1177 = !DILocation(line: 148, column: 16, scope: !1079)
!1178 = !DILocation(line: 148, column: 16, scope: !1080)
!1179 = !DILocation(line: 150, column: 16, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1078, file: !72, line: 150, column: 15)
!1181 = !DILocation(line: 150, column: 15, scope: !1078)
!1182 = !DILocation(line: 158, column: 16, scope: !1077)
!1183 = !DILocation(line: 158, column: 15, scope: !1078)
!1184 = !DILocation(line: 160, column: 28, scope: !1076)
!1185 = !DILocation(line: 160, column: 22, scope: !1076)
!1186 = !DILocation(line: 161, column: 31, scope: !1076)
!1187 = !DILocation(line: 161, column: 21, scope: !1076)
!1188 = !DILocation(line: 162, column: 28, scope: !1076)
!1189 = !DILocation(line: 162, column: 59, scope: !1076)
!1190 = !DILocation(line: 162, column: 15, scope: !1076)
!1191 = !DILocation(line: 163, column: 15, scope: !1076)
!1192 = !DILocation(line: 165, column: 33, scope: !1076)
!1193 = !DILocation(line: 165, column: 39, scope: !1076)
!1194 = !DILocation(line: 166, column: 13, scope: !1076)
!1195 = !DILocation(line: 170, column: 24, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1079, file: !72, line: 169, column: 9)
!1197 = !DILocation(line: 171, column: 18, scope: !1196)
!1198 = !DILocation(line: 170, column: 11, scope: !1196)
!1199 = !DILocation(line: 173, column: 11, scope: !1196)
!1200 = !DILocation(line: 119, column: 23, scope: !1083)
!1201 = !DILocation(line: 119, column: 3, scope: !1083)
!1202 = distinct !{!1202, !1094, !1203}
!1203 = !DILocation(line: 175, column: 5, scope: !1084)
!1204 = !DILocation(line: 177, column: 10, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1067, file: !72, line: 177, column: 7)
!1206 = !DILocation(line: 179, column: 11, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1208, file: !72, line: 179, column: 11)
!1208 = distinct !DILexicalBlock(scope: !1205, file: !72, line: 178, column: 5)
!1209 = !DILocation(line: 179, column: 11, scope: !1208)
!1210 = !DILocation(line: 92, column: 28, scope: !1106, inlinedAt: !1211)
!1211 = distinct !DILocation(line: 180, column: 15, scope: !1207)
!1212 = !DILocation(line: 94, column: 8, scope: !1106, inlinedAt: !1211)
!1213 = !DILocation(line: 96, column: 7, scope: !1117, inlinedAt: !1211)
!1214 = !DILocation(line: 96, column: 7, scope: !1106, inlinedAt: !1211)
!1215 = !DILocation(line: 99, column: 14, scope: !1122, inlinedAt: !1211)
!1216 = !DILocation(line: 98, column: 7, scope: !1122, inlinedAt: !1211)
!1217 = !DILocation(line: 102, column: 5, scope: !1122, inlinedAt: !1211)
!1218 = !DILocation(line: 103, column: 15, scope: !1106, inlinedAt: !1211)
!1219 = !DILocation(line: 180, column: 9, scope: !1207)
!1220 = !DILocation(line: 74, column: 25, scope: !1012, inlinedAt: !1221)
!1221 = distinct !DILocation(line: 182, column: 9, scope: !1207)
!1222 = !DILocation(line: 76, column: 27, scope: !1012, inlinedAt: !1221)
!1223 = !DILocation(line: 76, column: 44, scope: !1012, inlinedAt: !1221)
!1224 = !DILocation(line: 76, column: 68, scope: !1012, inlinedAt: !1221)
!1225 = !DILocation(line: 76, column: 13, scope: !1012, inlinedAt: !1221)
!1226 = !DILocation(line: 77, column: 40, scope: !1012, inlinedAt: !1221)
!1227 = !DILocation(line: 77, column: 59, scope: !1012, inlinedAt: !1221)
!1228 = !DILocation(line: 77, column: 28, scope: !1012, inlinedAt: !1221)
!1229 = !DILocation(line: 77, column: 13, scope: !1012, inlinedAt: !1221)
!1230 = !DILocation(line: 79, column: 25, scope: !1029, inlinedAt: !1221)
!1231 = !DILocation(line: 79, column: 22, scope: !1029, inlinedAt: !1221)
!1232 = !DILocation(line: 79, column: 7, scope: !1012, inlinedAt: !1221)
!1233 = !DILocation(line: 81, column: 3, scope: !1012, inlinedAt: !1221)
!1234 = !DILocation(line: 80, column: 16, scope: !1029, inlinedAt: !1221)
!1235 = !DILocation(line: 180, column: 19, scope: !99, inlinedAt: !1236)
!1236 = distinct !DILocation(line: 80, column: 16, scope: !1029, inlinedAt: !1221)
!1237 = !DILocation(line: 180, column: 30, scope: !99, inlinedAt: !1236)
!1238 = !DILocation(line: 180, column: 41, scope: !99, inlinedAt: !1236)
!1239 = !DILocation(line: 182, column: 10, scope: !99, inlinedAt: !1236)
!1240 = !DILocation(line: 184, column: 9, scope: !1040, inlinedAt: !1236)
!1241 = !DILocation(line: 184, column: 7, scope: !99, inlinedAt: !1236)
!1242 = !DILocation(line: 186, column: 11, scope: !1043, inlinedAt: !1236)
!1243 = !DILocation(line: 205, column: 11, scope: !1045, inlinedAt: !1236)
!1244 = !DILocation(line: 204, column: 11, scope: !1046, inlinedAt: !1236)
!1245 = !DILocation(line: 206, column: 9, scope: !1045, inlinedAt: !1236)
!1246 = !DILocation(line: 207, column: 14, scope: !1046, inlinedAt: !1236)
!1247 = !DILocation(line: 207, column: 18, scope: !1046, inlinedAt: !1236)
!1248 = !DILocation(line: 207, column: 9, scope: !1046, inlinedAt: !1236)
!1249 = !DILocation(line: 210, column: 7, scope: !99, inlinedAt: !1236)
!1250 = !DILocation(line: 211, column: 25, scope: !99, inlinedAt: !1236)
!1251 = !DILocation(line: 211, column: 10, scope: !99, inlinedAt: !1236)
!1252 = !DILocation(line: 80, column: 14, scope: !1029, inlinedAt: !1221)
!1253 = !DILocation(line: 80, column: 5, scope: !1029, inlinedAt: !1221)
!1254 = !DILocation(line: 81, column: 26, scope: !1012, inlinedAt: !1221)
!1255 = !DILocation(line: 81, column: 30, scope: !1012, inlinedAt: !1221)
!1256 = !DILocation(line: 83, column: 7, scope: !1060, inlinedAt: !1221)
!1257 = !DILocation(line: 83, column: 24, scope: !1060, inlinedAt: !1221)
!1258 = !DILocation(line: 83, column: 7, scope: !1012, inlinedAt: !1221)
!1259 = !DILocation(line: 87, column: 24, scope: !1064, inlinedAt: !1221)
!1260 = !DILocation(line: 88, column: 5, scope: !1064, inlinedAt: !1221)
!1261 = !DILocation(line: 185, column: 9, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1067, file: !72, line: 185, column: 7)
