; ModuleID = 'coreutils-8.27/src/uptime.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION]... [FILE]\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "Version", scope: !2, file: !3, line: 2, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{}
!5 = !{!0}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIGlobalVariableExpression(var: !10)
!10 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !11, file: !40, line: 51, type: !41, isLocal: true, isDefinition: true)
!11 = distinct !DICompileUnit(language: DW_LANG_C99, file: !12, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !39)
!12 = !DIFile(filename: "./lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!13 = !{!14, !15}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !16, line: 24, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types/locale_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !18, line: 42, baseType: !19)
!18 = !DIFile(filename: "/usr/include/bits/types/__locale_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !18, line: 28, size: 1856, elements: !21)
!21 = !{!22, !28, !32, !36, !37}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !20, file: !18, line: 31, baseType: !23, size: 832)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 832, elements: !26)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !18, line: 31, flags: DIFlagFwdDecl)
!26 = !{!27}
!27 = !DISubrange(count: 13)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !20, file: !18, line: 34, baseType: !29, size: 64, offset: 832)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !20, file: !18, line: 35, baseType: !33, size: 64, offset: 896)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !20, file: !18, line: 36, baseType: !33, size: 64, offset: 960)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !20, file: !18, line: 39, baseType: !38, size: 832, offset: 1024)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 832, elements: !26)
!39 = !{!9}
!40 = !DIFile(filename: "lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!41 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !15)
!42 = !DIGlobalVariableExpression(var: !43)
!43 = distinct !DIGlobalVariable(name: "file_name", scope: !44, file: !49, line: 36, type: !6, isLocal: true, isDefinition: true)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !46)
!45 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!46 = !{!42, !47}
!47 = !DIGlobalVariableExpression(var: !48)
!48 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !44, file: !49, line: 46, type: !50, isLocal: true, isDefinition: true)
!49 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!50 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!51 = !DIGlobalVariableExpression(var: !52)
!52 = distinct !DIGlobalVariable(name: "exit_failure", scope: !53, file: !56, line: 24, type: !57, isLocal: false, isDefinition: true)
!53 = distinct !DICompileUnit(language: DW_LANG_C99, file: !54, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !55)
!54 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!55 = !{!51}
!56 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!57 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !35)
!58 = !DIGlobalVariableExpression(var: !59)
!59 = distinct !DIGlobalVariable(name: "long_options", scope: !60, file: !63, line: 33, type: !64, isLocal: true, isDefinition: true)
!60 = distinct !DICompileUnit(language: DW_LANG_C99, file: !61, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !62)
!61 = !DIFile(filename: "./lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!62 = !{!58}
!63 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 768, elements: !74)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !67, line: 50, size: 256, elements: !68)
!67 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!68 = !{!69, !70, !71, !73}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !66, file: !67, line: 52, baseType: !6, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !66, file: !67, line: 55, baseType: !35, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !66, file: !67, line: 56, baseType: !72, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !66, file: !67, line: 57, baseType: !35, size: 32, offset: 192)
!74 = !{!75}
!75 = !DISubrange(count: 3)
!76 = !DIGlobalVariableExpression(var: !77)
!77 = distinct !DIGlobalVariable(name: "program_name", scope: !78, file: !83, line: 33, type: !6, isLocal: false, isDefinition: true)
!78 = distinct !DICompileUnit(language: DW_LANG_C99, file: !79, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !80, globals: !82)
!79 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!80 = !{!81, !14}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !{!76}
!83 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!84 = !DIGlobalVariableExpression(var: !85)
!85 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !86, file: !130, line: 77, type: !166, isLocal: false, isDefinition: true)
!86 = distinct !DICompileUnit(language: DW_LANG_C99, file: !87, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !123, globals: !127)
!87 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!88 = !{!89, !103, !108}
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !90, line: 32, size: 32, elements: !91)
!90 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!92 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!93 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!94 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!95 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!96 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!97 = !DIEnumerator(name: "c_quoting_style", value: 5)
!98 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!99 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!100 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!101 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!102 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !90, line: 242, size: 32, elements: !104)
!104 = !{!105, !106, !107}
!105 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!106 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!107 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !109, line: 46, size: 32, elements: !110)
!109 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!111 = !DIEnumerator(name: "_ISupper", value: 256)
!112 = !DIEnumerator(name: "_ISlower", value: 512)
!113 = !DIEnumerator(name: "_ISalpha", value: 1024)
!114 = !DIEnumerator(name: "_ISdigit", value: 2048)
!115 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!116 = !DIEnumerator(name: "_ISspace", value: 8192)
!117 = !DIEnumerator(name: "_ISprint", value: 16384)
!118 = !DIEnumerator(name: "_ISgraph", value: 32768)
!119 = !DIEnumerator(name: "_ISblank", value: 1)
!120 = !DIEnumerator(name: "_IScntrl", value: 2)
!121 = !DIEnumerator(name: "_ISpunct", value: 4)
!122 = !DIEnumerator(name: "_ISalnum", value: 8)
!123 = !{!35, !31, !124, !14}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !125, line: 62, baseType: !126)
!125 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!126 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!127 = !{!84, !128, !135, !148, !150, !155, !162, !164}
!128 = !DIGlobalVariableExpression(var: !129)
!129 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !86, file: !130, line: 93, type: !131, isLocal: false, isDefinition: true)
!130 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 320, elements: !133)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!133 = !{!134}
!134 = !DISubrange(count: 10)
!135 = !DIGlobalVariableExpression(var: !136)
!136 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !86, file: !130, line: 1043, type: !137, isLocal: false, isDefinition: true)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !130, line: 57, size: 448, elements: !138)
!138 = !{!139, !140, !141, !146, !147}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !137, file: !130, line: 60, baseType: !89, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !137, file: !130, line: 63, baseType: !35, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !137, file: !130, line: 67, baseType: !142, size: 256, offset: 64)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 256, elements: !144)
!143 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!144 = !{!145}
!145 = !DISubrange(count: 8)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !137, file: !130, line: 70, baseType: !6, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !137, file: !130, line: 73, baseType: !6, size: 64, offset: 384)
!148 = !DIGlobalVariableExpression(var: !149)
!149 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !86, file: !130, line: 108, type: !137, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151)
!151 = distinct !DIGlobalVariable(name: "slot0", scope: !86, file: !130, line: 834, type: !152, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 256)
!155 = !DIGlobalVariableExpression(var: !156)
!156 = distinct !DIGlobalVariable(name: "slotvec", scope: !86, file: !130, line: 837, type: !157, isLocal: true, isDefinition: true)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !130, line: 826, size: 128, elements: !159)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !158, file: !130, line: 828, baseType: !124, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !158, file: !130, line: 829, baseType: !14, size: 64, offset: 64)
!162 = !DIGlobalVariableExpression(var: !163)
!163 = distinct !DIGlobalVariable(name: "nslots", scope: !86, file: !130, line: 835, type: !35, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165)
!165 = distinct !DIGlobalVariable(name: "slotvec0", scope: !86, file: !130, line: 836, type: !158, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 704, elements: !168)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!168 = !{!169}
!169 = !DISubrange(count: 11)
!170 = !DIGlobalVariableExpression(var: !171)
!171 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !172, file: !175, line: 26, type: !176, isLocal: false, isDefinition: true)
!172 = distinct !DICompileUnit(language: DW_LANG_C99, file: !173, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !174)
!173 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!174 = !{!170}
!175 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 47)
!179 = !DIGlobalVariableExpression(var: !180)
!180 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !181, file: !526, line: 120, type: !527, isLocal: true, isDefinition: true)
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !522, globals: !525)
!182 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!183 = !{!184}
!184 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !185, line: 41, size: 32, elements: !186)
!185 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521}
!187 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!188 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!189 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!190 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!191 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!192 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!193 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!194 = !DIEnumerator(name: "DAY_1", value: 131079)
!195 = !DIEnumerator(name: "DAY_2", value: 131080)
!196 = !DIEnumerator(name: "DAY_3", value: 131081)
!197 = !DIEnumerator(name: "DAY_4", value: 131082)
!198 = !DIEnumerator(name: "DAY_5", value: 131083)
!199 = !DIEnumerator(name: "DAY_6", value: 131084)
!200 = !DIEnumerator(name: "DAY_7", value: 131085)
!201 = !DIEnumerator(name: "ABMON_1", value: 131086)
!202 = !DIEnumerator(name: "ABMON_2", value: 131087)
!203 = !DIEnumerator(name: "ABMON_3", value: 131088)
!204 = !DIEnumerator(name: "ABMON_4", value: 131089)
!205 = !DIEnumerator(name: "ABMON_5", value: 131090)
!206 = !DIEnumerator(name: "ABMON_6", value: 131091)
!207 = !DIEnumerator(name: "ABMON_7", value: 131092)
!208 = !DIEnumerator(name: "ABMON_8", value: 131093)
!209 = !DIEnumerator(name: "ABMON_9", value: 131094)
!210 = !DIEnumerator(name: "ABMON_10", value: 131095)
!211 = !DIEnumerator(name: "ABMON_11", value: 131096)
!212 = !DIEnumerator(name: "ABMON_12", value: 131097)
!213 = !DIEnumerator(name: "MON_1", value: 131098)
!214 = !DIEnumerator(name: "MON_2", value: 131099)
!215 = !DIEnumerator(name: "MON_3", value: 131100)
!216 = !DIEnumerator(name: "MON_4", value: 131101)
!217 = !DIEnumerator(name: "MON_5", value: 131102)
!218 = !DIEnumerator(name: "MON_6", value: 131103)
!219 = !DIEnumerator(name: "MON_7", value: 131104)
!220 = !DIEnumerator(name: "MON_8", value: 131105)
!221 = !DIEnumerator(name: "MON_9", value: 131106)
!222 = !DIEnumerator(name: "MON_10", value: 131107)
!223 = !DIEnumerator(name: "MON_11", value: 131108)
!224 = !DIEnumerator(name: "MON_12", value: 131109)
!225 = !DIEnumerator(name: "AM_STR", value: 131110)
!226 = !DIEnumerator(name: "PM_STR", value: 131111)
!227 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!228 = !DIEnumerator(name: "D_FMT", value: 131113)
!229 = !DIEnumerator(name: "T_FMT", value: 131114)
!230 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!231 = !DIEnumerator(name: "ERA", value: 131116)
!232 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!233 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!234 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!235 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!236 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!237 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!238 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!239 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!240 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!241 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!242 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!243 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!244 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!245 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!246 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!247 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!248 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!249 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!250 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!251 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!252 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!253 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!254 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!255 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!256 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!257 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!258 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!259 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!260 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!261 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!262 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!263 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!264 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!265 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!266 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!267 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!268 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!269 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!270 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!271 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!272 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!273 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!274 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!275 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!276 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!277 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!278 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!279 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!280 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!281 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!282 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!283 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!284 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!285 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!286 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!287 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!288 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!289 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!290 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!291 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!292 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!293 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!294 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!295 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!296 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!297 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!298 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!299 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!300 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!301 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!302 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!303 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!304 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!305 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!306 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!307 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!308 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!309 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!310 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!311 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!312 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!313 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!314 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!315 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!316 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!317 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!318 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!319 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!320 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!321 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!322 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!323 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!324 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!325 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!326 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!327 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!328 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!329 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!330 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!331 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!332 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!333 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!334 = !DIEnumerator(name: "CODESET", value: 14)
!335 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!336 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!337 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!338 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!339 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!340 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!341 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!342 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!343 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!344 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!345 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!346 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!347 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!348 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!349 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!350 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!351 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!352 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!353 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!354 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!355 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!356 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!357 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!358 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!359 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!360 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!361 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!362 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!363 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!364 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!365 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!366 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!367 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!368 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!369 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!370 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!371 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!372 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!373 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!374 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!375 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!376 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!377 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!378 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!379 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!380 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!381 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!382 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!383 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!384 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!385 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!386 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!387 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!388 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!389 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!390 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!391 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!392 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!393 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!394 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!395 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!396 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!397 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!398 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!399 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!400 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!401 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!402 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!403 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!404 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!405 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!406 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!407 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!408 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!409 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!410 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!411 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!412 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!413 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!414 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!415 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!416 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!417 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!418 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!419 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!420 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!421 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!422 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!423 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!424 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!425 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!426 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!427 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!428 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!429 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!430 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!431 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!432 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!433 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!434 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!435 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!436 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!437 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!438 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!439 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!440 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!441 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!442 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!443 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!444 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!445 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!446 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!447 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!448 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!449 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!450 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!451 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!452 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!453 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!454 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!455 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!456 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!457 = !DIEnumerator(name: "THOUSEP", value: 65537)
!458 = !DIEnumerator(name: "__GROUPING", value: 65538)
!459 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!460 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!461 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!462 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!463 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!464 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!465 = !DIEnumerator(name: "__YESSTR", value: 327682)
!466 = !DIEnumerator(name: "__NOSTR", value: 327683)
!467 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!468 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!469 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!470 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!471 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!472 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!473 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!474 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!475 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!476 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!477 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!478 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!479 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!480 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!481 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!482 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!483 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!484 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!485 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!486 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!487 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!488 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!489 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!490 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!491 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!492 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!493 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!494 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!495 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!496 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!497 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!498 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!499 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!500 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!501 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!502 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!503 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!504 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!505 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!506 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!507 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!508 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!509 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!510 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!511 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!512 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!513 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!514 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!515 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!516 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!517 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!518 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!519 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!520 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!521 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!522 = !{!81, !14, !523}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!525 = !{!179}
!526 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!527 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!528 = !DIGlobalVariableExpression(var: !529)
!529 = distinct !DIGlobalVariable(name: "__mon_yday", scope: !530, file: !541, line: 124, type: !556, isLocal: true, isDefinition: true)
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !532, globals: !538)
!531 = !DIFile(filename: "./lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!532 = !{!143, !35, !533, !524, !534, !31, !535, !126, !536, !537}
!533 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!534 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!535 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!536 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!537 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!538 = !{!539, !545, !548, !528}
!539 = !DIGlobalVariableExpression(var: !540, expr: !544)
!540 = distinct !DIGlobalVariable(name: "mktime_min", scope: !530, file: !541, line: 95, type: !542, isLocal: true, isDefinition: true)
!541 = !DIFile(filename: "lib/mktime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_int", file: !541, line: 68, baseType: !535)
!544 = !DIExpression(DW_OP_constu, 9223372036854775808, DW_OP_stack_value)
!545 = !DIGlobalVariableExpression(var: !546, expr: !547)
!546 = distinct !DIGlobalVariable(name: "mktime_max", scope: !530, file: !541, line: 98, type: !542, isLocal: true, isDefinition: true)
!547 = !DIExpression(DW_OP_constu, 9223372036854775807, DW_OP_stack_value)
!548 = !DIGlobalVariableExpression(var: !549)
!549 = distinct !DIGlobalVariable(name: "localtime_offset", scope: !530, file: !541, line: 462, type: !550, isLocal: true, isDefinition: true)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "mktime_offset_t", file: !551, line: 30, baseType: !552)
!551 = !DIFile(filename: "./lib/mktime-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !553, line: 7, baseType: !554)
!553 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !555, line: 148, baseType: !535)
!555 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 416, elements: !557)
!557 = !{!558, !27}
!558 = !DISubrange(count: 2)
!559 = distinct !DICompileUnit(language: DW_LANG_C99, file: !560, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !561, retainedTypes: !579, globals: !580)
!560 = !DIFile(filename: "src/uptime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!561 = !{!562, !89, !567}
!562 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !563, line: 208, size: 32, elements: !564)
!563 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!564 = !{!565, !566}
!565 = !DIEnumerator(name: "READ_UTMP_CHECK_PIDS", value: 1)
!566 = !DIEnumerator(name: "READ_UTMP_USER_PROCESS", value: 2)
!567 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !569, file: !568, line: 187, size: 32, elements: !577)
!568 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!569 = distinct !DISubprogram(name: "select_plural", scope: !568, file: !568, line: 183, type: !570, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !559, variables: !575)
!570 = !DISubroutineType(types: !571)
!571 = !{!126, !572}
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !573, line: 112, baseType: !574)
!573 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !555, line: 62, baseType: !126)
!575 = !{!576}
!576 = !DILocalVariable(name: "n", arg: 1, scope: !569, file: !568, line: 183, type: !572)
!577 = !{!578}
!578 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000)
!579 = !{!6, !81, !552, !126, !524}
!580 = !{!581}
!581 = !DIGlobalVariableExpression(var: !582)
!582 = distinct !DIGlobalVariable(name: "infomap", scope: !583, file: !568, line: 632, type: !597, isLocal: true, isDefinition: true)
!583 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !568, file: !568, line: 630, type: !584, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !559, variables: !586)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !6}
!586 = !{!587, !588, !589, !596}
!587 = !DILocalVariable(name: "program", arg: 1, scope: !583, file: !568, line: 630, type: !6)
!588 = !DILocalVariable(name: "node", scope: !583, file: !568, line: 642, type: !6)
!589 = !DILocalVariable(name: "map_prog", scope: !583, file: !568, line: 643, type: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !583, file: !568, line: 632, size: 128, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !592, file: !568, line: 632, baseType: !6, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !592, file: !568, line: 632, baseType: !6, size: 64, offset: 64)
!596 = !DILocalVariable(name: "lc_messages", scope: !583, file: !568, line: 655, type: !6)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 896, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 7)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !602)
!601 = !DIFile(filename: "./lib/fprintftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!602 = !{!124, !6, !143, !35, !524}
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !604, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !605, retainedTypes: !610)
!604 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!605 = !{!606}
!606 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !607, line: 41, size: 32, elements: !608)
!607 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!608 = !{!609}
!609 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!610 = !{!81}
!611 = distinct !DICompileUnit(language: DW_LANG_C99, file: !612, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !613, retainedTypes: !627)
!612 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!613 = !{!614}
!614 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !616, file: !615, line: 192, size: 32, elements: !625)
!615 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!616 = distinct !DISubprogram(name: "x2nrealloc", scope: !615, file: !615, line: 180, type: !617, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !611, variables: !620)
!617 = !DISubroutineType(types: !618)
!618 = !{!81, !81, !619, !124}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!620 = !{!621, !622, !623, !624}
!621 = !DILocalVariable(name: "p", arg: 1, scope: !616, file: !615, line: 180, type: !81)
!622 = !DILocalVariable(name: "pn", arg: 2, scope: !616, file: !615, line: 180, type: !619)
!623 = !DILocalVariable(name: "s", arg: 3, scope: !616, file: !615, line: 180, type: !124)
!624 = !DILocalVariable(name: "n", scope: !616, file: !615, line: 182, type: !124)
!625 = !{!626}
!626 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!627 = !{!124, !14, !81}
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !629, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4)
!629 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!630 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !610)
!631 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4)
!633 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !610)
!635 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!636 = distinct !DICompileUnit(language: DW_LANG_C99, file: !637, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !610)
!637 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!638 = distinct !DICompileUnit(language: DW_LANG_C99, file: !639, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !640)
!639 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!640 = !{!124}
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !643, retainedTypes: !651)
!642 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!643 = !{!562, !644}
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !645, file: !615, line: 192, size: 32, elements: !625)
!645 = distinct !DISubprogram(name: "x2nrealloc", scope: !615, file: !615, line: 180, type: !617, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !641, variables: !646)
!646 = !{!647, !648, !649, !650}
!647 = !DILocalVariable(name: "p", arg: 1, scope: !645, file: !615, line: 180, type: !81)
!648 = !DILocalVariable(name: "pn", arg: 2, scope: !645, file: !615, line: 180, type: !619)
!649 = !DILocalVariable(name: "s", arg: 3, scope: !645, file: !615, line: 180, type: !124)
!650 = !DILocalVariable(name: "n", scope: !645, file: !615, line: 182, type: !124)
!651 = !{!14, !81}
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !654, retainedTypes: !659, globals: !660)
!653 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!654 = !{!655}
!655 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !656, line: 49, size: 32, elements: !657)
!656 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!657 = !{!658}
!658 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119)
!659 = !{!14}
!660 = !{!661}
!661 = !DIGlobalVariableExpression(var: !662)
!662 = distinct !DIGlobalVariable(name: "local_tz", scope: !652, file: !656, line: 54, type: !663, isLocal: true, isDefinition: true)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !665, line: 594, baseType: !666)
!665 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !668, line: 21, size: 128, elements: !669)
!668 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!669 = !{!670, !671, !672}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !667, file: !668, line: 25, baseType: !666, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !667, file: !668, line: 36, baseType: !8, size: 8, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !667, file: !668, line: 48, baseType: !673, offset: 72)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: -1)
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4)
!677 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!678 = distinct !DICompileUnit(language: DW_LANG_C99, file: !679, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4)
!679 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!680 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!681 = !{i32 2, !"Dwarf Version", i32 4}
!682 = !{i32 2, !"Debug Info Version", i32 3}
!683 = !{i32 1, !"wchar_size", i32 4}
!684 = !{i32 7, !"PIC Level", i32 2}
!685 = !{i32 7, !"PIE Level", i32 2}
!686 = distinct !DISubprogram(name: "usage", scope: !560, file: !560, line: 193, type: !687, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !559, variables: !689)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !35}
!689 = !{!690}
!690 = !DILocalVariable(name: "status", arg: 1, scope: !686, file: !560, line: 193, type: !35)
!691 = !DIExpression()
!692 = !DILocation(line: 193, column: 12, scope: !686)
!693 = !DILocation(line: 195, column: 14, scope: !694)
!694 = distinct !DILexicalBlock(scope: !686, file: !560, line: 195, column: 7)
!695 = !DILocation(line: 195, column: 7, scope: !686)
!696 = !DILocation(line: 196, column: 5, scope: !697)
!697 = distinct !DILexicalBlock(scope: !694, file: !560, line: 196, column: 5)
!698 = !{!699, !699, i64 0}
!699 = !{!"any pointer", !700, i64 0}
!700 = !{!"omnipotent char", !701, i64 0}
!701 = !{!"Simple C/C++ TBAA"}
!702 = !DILocation(line: 199, column: 7, scope: !703)
!703 = distinct !DILexicalBlock(scope: !694, file: !560, line: 198, column: 5)
!704 = !DILocation(line: 200, column: 7, scope: !703)
!705 = !DILocation(line: 209, column: 7, scope: !703)
!706 = !DILocation(line: 215, column: 7, scope: !703)
!707 = !DILocation(line: 219, column: 7, scope: !703)
!708 = !DILocation(line: 220, column: 7, scope: !703)
!709 = !DILocation(line: 642, column: 15, scope: !583, inlinedAt: !710)
!710 = distinct !DILocation(line: 221, column: 7, scope: !703)
!711 = !DILocation(line: 651, column: 3, scope: !583, inlinedAt: !710)
!712 = !DILocation(line: 655, column: 29, scope: !583, inlinedAt: !710)
!713 = !DILocation(line: 655, column: 15, scope: !583, inlinedAt: !710)
!714 = !DILocation(line: 656, column: 7, scope: !715, inlinedAt: !710)
!715 = distinct !DILexicalBlock(scope: !583, file: !568, line: 656, column: 7)
!716 = !DILocation(line: 656, column: 19, scope: !715, inlinedAt: !710)
!717 = !DILocation(line: 656, column: 22, scope: !715, inlinedAt: !710)
!718 = !DILocation(line: 656, column: 7, scope: !583, inlinedAt: !710)
!719 = !DILocation(line: 662, column: 7, scope: !720, inlinedAt: !710)
!720 = distinct !DILexicalBlock(scope: !715, file: !568, line: 657, column: 5)
!721 = !DILocation(line: 664, column: 5, scope: !720, inlinedAt: !710)
!722 = !DILocation(line: 665, column: 3, scope: !583, inlinedAt: !710)
!723 = !DILocation(line: 667, column: 3, scope: !583, inlinedAt: !710)
!724 = !DILocation(line: 223, column: 3, scope: !686)
!725 = distinct !DISubprogram(name: "main", scope: !560, file: !560, line: 227, type: !726, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, unit: !559, variables: !729)
!726 = !DISubroutineType(types: !727)
!727 = !{!35, !35, !728}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!729 = !{!730, !731}
!730 = !DILocalVariable(name: "argc", arg: 1, scope: !725, file: !560, line: 227, type: !35)
!731 = !DILocalVariable(name: "argv", arg: 2, scope: !725, file: !560, line: 227, type: !728)
!732 = !DILocation(line: 227, column: 11, scope: !725)
!733 = !DILocation(line: 227, column: 24, scope: !725)
!734 = !DILocation(line: 230, column: 21, scope: !725)
!735 = !DILocation(line: 230, column: 3, scope: !725)
!736 = !DILocation(line: 231, column: 3, scope: !725)
!737 = !DILocation(line: 232, column: 3, scope: !725)
!738 = !DILocation(line: 233, column: 3, scope: !725)
!739 = !DILocation(line: 235, column: 3, scope: !725)
!740 = !DILocation(line: 237, column: 63, scope: !725)
!741 = !DILocation(line: 237, column: 3, scope: !725)
!742 = !DILocation(line: 239, column: 7, scope: !743)
!743 = distinct !DILexicalBlock(scope: !725, file: !560, line: 239, column: 7)
!744 = !DILocation(line: 239, column: 48, scope: !743)
!745 = !DILocation(line: 239, column: 7, scope: !725)
!746 = !DILocation(line: 240, column: 5, scope: !743)
!747 = !DILocation(line: 242, column: 18, scope: !725)
!748 = !{!749, !749, i64 0}
!749 = !{!"int", !700, i64 0}
!750 = !DILocation(line: 242, column: 16, scope: !725)
!751 = !DILocation(line: 242, column: 3, scope: !725)
!752 = !DILocation(line: 245, column: 7, scope: !753)
!753 = distinct !DILexicalBlock(scope: !725, file: !560, line: 243, column: 5)
!754 = !DILocation(line: 246, column: 7, scope: !753)
!755 = !DILocation(line: 249, column: 15, scope: !753)
!756 = !DILocation(line: 249, column: 7, scope: !753)
!757 = !DILocation(line: 250, column: 7, scope: !753)
!758 = !DILocation(line: 253, column: 20, scope: !753)
!759 = !DILocation(line: 253, column: 55, scope: !753)
!760 = !DILocation(line: 253, column: 62, scope: !753)
!761 = !DILocation(line: 253, column: 50, scope: !753)
!762 = !DILocation(line: 253, column: 43, scope: !753)
!763 = !DILocation(line: 253, column: 7, scope: !753)
!764 = !DILocation(line: 254, column: 7, scope: !753)
!765 = !DILocation(line: 257, column: 3, scope: !725)
!766 = distinct !DISubprogram(name: "uptime", scope: !560, file: !560, line: 177, type: !767, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, unit: !559, variables: !769)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !6, !35}
!769 = !{!770, !771, !772, !773}
!770 = !DILocalVariable(name: "filename", arg: 1, scope: !766, file: !560, line: 177, type: !6)
!771 = !DILocalVariable(name: "options", arg: 2, scope: !766, file: !560, line: 177, type: !35)
!772 = !DILocalVariable(name: "n_users", scope: !766, file: !560, line: 179, type: !124)
!773 = !DILocalVariable(name: "utmp_buf", scope: !766, file: !560, line: 180, type: !774)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !563, line: 146, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !777, line: 55, size: 3072, elements: !778)
!777 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!778 = !{!779, !780, !782, !786, !790, !791, !792, !797, !799, !804, !806}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !776, file: !777, line: 57, baseType: !534, size: 16)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !776, file: !777, line: 58, baseType: !781, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !555, line: 142, baseType: !35)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !776, file: !777, line: 59, baseType: !783, size: 256, offset: 64)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !776, file: !777, line: 60, baseType: !787, size: 32, offset: 320)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 4)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !776, file: !777, line: 61, baseType: !783, size: 256, offset: 352)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !776, file: !777, line: 62, baseType: !152, size: 2048, offset: 608)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !776, file: !777, line: 63, baseType: !793, size: 32, offset: 2656)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !777, line: 42, size: 32, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !793, file: !777, line: 45, baseType: !534, size: 16)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !793, file: !777, line: 46, baseType: !534, size: 16, offset: 16)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !776, file: !777, line: 70, baseType: !798, size: 32, offset: 2688)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !555, line: 40, baseType: !35)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !776, file: !777, line: 75, baseType: !800, size: 64, offset: 2720)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !776, file: !777, line: 71, size: 64, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !800, file: !777, line: 73, baseType: !798, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !800, file: !777, line: 74, baseType: !798, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !776, file: !777, line: 80, baseType: !805, size: 128, offset: 2784)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 128, elements: !788)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !776, file: !777, line: 81, baseType: !807, size: 160, offset: 2912)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 20)
!810 = !DILocalVariable(name: "avg", scope: !811, file: !560, line: 61, type: !905)
!811 = distinct !DISubprogram(name: "print_uptime", scope: !560, file: !560, line: 51, type: !812, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, unit: !559, variables: !816)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !124, !814}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !810, !842, !843, !893, !899, !900, !903}
!817 = !DILocalVariable(name: "n", arg: 1, scope: !811, file: !560, line: 51, type: !124)
!818 = !DILocalVariable(name: "this", arg: 2, scope: !811, file: !560, line: 51, type: !814)
!819 = !DILocalVariable(name: "entries", scope: !811, file: !560, line: 53, type: !124)
!820 = !DILocalVariable(name: "boot_time", scope: !811, file: !560, line: 54, type: !552)
!821 = !DILocalVariable(name: "time_now", scope: !811, file: !560, line: 55, type: !552)
!822 = !DILocalVariable(name: "uptime", scope: !811, file: !560, line: 56, type: !552)
!823 = !DILocalVariable(name: "updays", scope: !811, file: !560, line: 57, type: !535)
!824 = !DILocalVariable(name: "uphours", scope: !811, file: !560, line: 58, type: !35)
!825 = !DILocalVariable(name: "upmins", scope: !811, file: !560, line: 59, type: !35)
!826 = !DILocalVariable(name: "tmn", scope: !811, file: !560, line: 60, type: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !829, line: 7, size: 448, elements: !830)
!829 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !828, file: !829, line: 9, baseType: !35, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !828, file: !829, line: 10, baseType: !35, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !828, file: !829, line: 11, baseType: !35, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !828, file: !829, line: 12, baseType: !35, size: 32, offset: 96)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !828, file: !829, line: 13, baseType: !35, size: 32, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !828, file: !829, line: 14, baseType: !35, size: 32, offset: 160)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !828, file: !829, line: 15, baseType: !35, size: 32, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !828, file: !829, line: 16, baseType: !35, size: 32, offset: 224)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !828, file: !829, line: 17, baseType: !35, size: 32, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !828, file: !829, line: 20, baseType: !535, size: 64, offset: 320)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !828, file: !829, line: 21, baseType: !6, size: 64, offset: 384)
!842 = !DILocalVariable(name: "loads", scope: !811, file: !560, line: 62, type: !35)
!843 = !DILocalVariable(name: "fp", scope: !811, file: !560, line: 64, type: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !846, line: 7, baseType: !847)
!846 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !848, line: 241, size: 1728, elements: !849)
!848 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !870, !871, !872, !873, !875, !876, !877, !881, !884, !886, !887, !888, !889, !890, !891, !892}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !847, file: !848, line: 242, baseType: !35, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !847, file: !848, line: 247, baseType: !14, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !847, file: !848, line: 248, baseType: !14, size: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !847, file: !848, line: 249, baseType: !14, size: 64, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !847, file: !848, line: 250, baseType: !14, size: 64, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !847, file: !848, line: 251, baseType: !14, size: 64, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !847, file: !848, line: 252, baseType: !14, size: 64, offset: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !847, file: !848, line: 253, baseType: !14, size: 64, offset: 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !847, file: !848, line: 254, baseType: !14, size: 64, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !847, file: !848, line: 256, baseType: !14, size: 64, offset: 576)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !847, file: !848, line: 257, baseType: !14, size: 64, offset: 640)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !847, file: !848, line: 258, baseType: !14, size: 64, offset: 704)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !847, file: !848, line: 260, baseType: !863, size: 64, offset: 768)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !848, line: 156, size: 192, elements: !865)
!865 = !{!866, !867, !869}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !864, file: !848, line: 157, baseType: !863, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !864, file: !848, line: 158, baseType: !868, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !864, file: !848, line: 162, baseType: !35, size: 32, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !847, file: !848, line: 262, baseType: !868, size: 64, offset: 832)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !847, file: !848, line: 264, baseType: !35, size: 32, offset: 896)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !847, file: !848, line: 268, baseType: !35, size: 32, offset: 928)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !847, file: !848, line: 270, baseType: !874, size: 64, offset: 960)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !555, line: 140, baseType: !535)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !847, file: !848, line: 274, baseType: !31, size: 16, offset: 1024)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !847, file: !848, line: 275, baseType: !533, size: 8, offset: 1040)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !847, file: !848, line: 276, baseType: !878, size: 8, offset: 1048)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 1)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !847, file: !848, line: 280, baseType: !882, size: 64, offset: 1088)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !848, line: 150, baseType: null)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !847, file: !848, line: 289, baseType: !885, size: 64, offset: 1152)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !555, line: 141, baseType: !535)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !847, file: !848, line: 297, baseType: !81, size: 64, offset: 1216)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !847, file: !848, line: 298, baseType: !81, size: 64, offset: 1280)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !847, file: !848, line: 299, baseType: !81, size: 64, offset: 1344)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !847, file: !848, line: 300, baseType: !81, size: 64, offset: 1408)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !847, file: !848, line: 302, baseType: !124, size: 64, offset: 1472)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !847, file: !848, line: 303, baseType: !35, size: 32, offset: 1536)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !847, file: !848, line: 305, baseType: !807, size: 160, offset: 1568)
!893 = !DILocalVariable(name: "buf", scope: !894, file: !560, line: 69, type: !896)
!894 = distinct !DILexicalBlock(scope: !895, file: !560, line: 68, column: 5)
!895 = distinct !DILexicalBlock(scope: !811, file: !560, line: 67, column: 7)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 65536, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 8192)
!899 = !DILocalVariable(name: "b", scope: !894, file: !560, line: 70, type: !14)
!900 = !DILocalVariable(name: "end_ptr", scope: !901, file: !560, line: 73, type: !14)
!901 = distinct !DILexicalBlock(scope: !902, file: !560, line: 72, column: 9)
!902 = distinct !DILexicalBlock(scope: !894, file: !560, line: 71, column: 11)
!903 = !DILocalVariable(name: "upsecs", scope: !901, file: !560, line: 74, type: !904)
!904 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 192, elements: !74)
!906 = !DILocation(line: 61, column: 10, scope: !811, inlinedAt: !907)
!907 = distinct !DILocation(line: 187, column: 3, scope: !766)
!908 = !DILocation(line: 69, column: 12, scope: !894, inlinedAt: !907)
!909 = !DILocation(line: 177, column: 21, scope: !766)
!910 = !DILocation(line: 177, column: 35, scope: !766)
!911 = !DILocation(line: 179, column: 3, scope: !766)
!912 = !DILocation(line: 180, column: 3, scope: !766)
!913 = !DILocation(line: 180, column: 16, scope: !766)
!914 = !DILocation(line: 179, column: 10, scope: !766)
!915 = !DILocation(line: 183, column: 7, scope: !916)
!916 = distinct !DILexicalBlock(scope: !766, file: !560, line: 183, column: 7)
!917 = !DILocation(line: 183, column: 58, scope: !916)
!918 = !DILocation(line: 183, column: 7, scope: !766)
!919 = !DILocation(line: 184, column: 5, scope: !916)
!920 = !DILocation(line: 187, column: 17, scope: !766)
!921 = !{!922, !922, i64 0}
!922 = !{!"long", !700, i64 0}
!923 = !DILocation(line: 187, column: 26, scope: !766)
!924 = !DILocation(line: 51, column: 22, scope: !811, inlinedAt: !907)
!925 = !DILocation(line: 51, column: 44, scope: !811, inlinedAt: !907)
!926 = !DILocation(line: 53, column: 10, scope: !811, inlinedAt: !907)
!927 = !DILocation(line: 54, column: 10, scope: !811, inlinedAt: !907)
!928 = !DILocation(line: 55, column: 3, scope: !811, inlinedAt: !907)
!929 = !DILocation(line: 56, column: 10, scope: !811, inlinedAt: !907)
!930 = !DILocation(line: 61, column: 3, scope: !811, inlinedAt: !907)
!931 = !DILocation(line: 66, column: 8, scope: !811, inlinedAt: !907)
!932 = !DILocation(line: 64, column: 9, scope: !811, inlinedAt: !907)
!933 = !DILocation(line: 67, column: 10, scope: !895, inlinedAt: !907)
!934 = !DILocation(line: 67, column: 7, scope: !811, inlinedAt: !907)
!935 = !DILocation(line: 69, column: 7, scope: !894, inlinedAt: !907)
!936 = !DILocation(line: 70, column: 17, scope: !894, inlinedAt: !907)
!937 = !DILocation(line: 70, column: 13, scope: !894, inlinedAt: !907)
!938 = !DILocation(line: 71, column: 13, scope: !902, inlinedAt: !907)
!939 = !DILocation(line: 71, column: 11, scope: !894, inlinedAt: !907)
!940 = !DILocation(line: 73, column: 11, scope: !901, inlinedAt: !907)
!941 = !DILocation(line: 73, column: 17, scope: !901, inlinedAt: !907)
!942 = !DILocation(line: 74, column: 27, scope: !901, inlinedAt: !907)
!943 = !DILocation(line: 74, column: 18, scope: !901, inlinedAt: !907)
!944 = !DILocation(line: 75, column: 22, scope: !945, inlinedAt: !907)
!945 = distinct !DILexicalBlock(scope: !901, file: !560, line: 75, column: 15)
!946 = !DILocation(line: 75, column: 19, scope: !945, inlinedAt: !907)
!947 = !DILocation(line: 75, column: 15, scope: !901, inlinedAt: !907)
!948 = !DILocation(line: 76, column: 25, scope: !945, inlinedAt: !907)
!949 = !DILocation(line: 76, column: 45, scope: !945, inlinedAt: !907)
!950 = !DILocation(line: 76, column: 35, scope: !945, inlinedAt: !907)
!951 = !DILocation(line: 76, column: 22, scope: !945, inlinedAt: !907)
!952 = !DILocation(line: 76, column: 13, scope: !945, inlinedAt: !907)
!953 = !DILocation(line: 78, column: 9, scope: !902, inlinedAt: !907)
!954 = !DILocation(line: 78, column: 9, scope: !901, inlinedAt: !907)
!955 = !DILocation(line: 80, column: 7, scope: !894, inlinedAt: !907)
!956 = !DILocation(line: 81, column: 5, scope: !895, inlinedAt: !907)
!957 = !DILocation(line: 81, column: 5, scope: !894, inlinedAt: !907)
!958 = !DILocation(line: 108, column: 3, scope: !811, inlinedAt: !907)
!959 = !DILocation(line: 108, column: 11, scope: !811, inlinedAt: !907)
!960 = !DILocation(line: 110, column: 18, scope: !961, inlinedAt: !907)
!961 = distinct !DILexicalBlock(scope: !811, file: !560, line: 109, column: 5)
!962 = !{!700, !700, i64 0}
!963 = !{!964, !965, i64 0}
!964 = !{!"utmpx", !965, i64 0, !749, i64 4, !700, i64 8, !700, i64 40, !700, i64 44, !700, i64 76, !966, i64 332, !749, i64 336, !967, i64 340, !700, i64 348, !700, i64 364}
!965 = !{!"short", !700, i64 0}
!966 = !{!"__exit_status", !965, i64 0, !965, i64 2}
!967 = !{!"", !749, i64 0, !749, i64 4}
!968 = !DILocation(line: 110, column: 15, scope: !961, inlinedAt: !907)
!969 = !DILocation(line: 111, column: 11, scope: !970, inlinedAt: !907)
!970 = distinct !DILexicalBlock(scope: !961, file: !560, line: 111, column: 11)
!971 = !DILocation(line: 111, column: 11, scope: !961, inlinedAt: !907)
!972 = !DILocation(line: 112, column: 21, scope: !970, inlinedAt: !907)
!973 = !{!964, !749, i64 340}
!974 = !DILocation(line: 112, column: 9, scope: !970, inlinedAt: !907)
!975 = !DILocation(line: 120, column: 14, scope: !811, inlinedAt: !907)
!976 = !DILocation(line: 55, column: 10, scope: !811, inlinedAt: !907)
!977 = !DILocation(line: 120, column: 12, scope: !811, inlinedAt: !907)
!978 = !DILocation(line: 122, column: 14, scope: !979, inlinedAt: !907)
!979 = distinct !DILexicalBlock(scope: !811, file: !560, line: 122, column: 7)
!980 = !DILocation(line: 122, column: 7, scope: !811, inlinedAt: !907)
!981 = !DILocation(line: 125, column: 21, scope: !982, inlinedAt: !907)
!982 = distinct !DILexicalBlock(scope: !983, file: !560, line: 125, column: 11)
!983 = distinct !DILexicalBlock(scope: !979, file: !560, line: 124, column: 5)
!984 = !DILocation(line: 125, column: 11, scope: !983, inlinedAt: !907)
!985 = !DILocation(line: 126, column: 9, scope: !982, inlinedAt: !907)
!986 = !DILocation(line: 127, column: 25, scope: !983, inlinedAt: !907)
!987 = !DILocation(line: 128, column: 5, scope: !983, inlinedAt: !907)
!988 = !DILocation(line: 129, column: 19, scope: !811, inlinedAt: !907)
!989 = !DILocation(line: 57, column: 12, scope: !811, inlinedAt: !907)
!990 = !DILocation(line: 130, column: 21, scope: !811, inlinedAt: !907)
!991 = !DILocation(line: 130, column: 41, scope: !811, inlinedAt: !907)
!992 = !DILocation(line: 130, column: 13, scope: !811, inlinedAt: !907)
!993 = !DILocation(line: 58, column: 7, scope: !811, inlinedAt: !907)
!994 = !DILocation(line: 131, column: 41, scope: !811, inlinedAt: !907)
!995 = !DILocation(line: 131, column: 39, scope: !811, inlinedAt: !907)
!996 = !DILocation(line: 131, column: 59, scope: !811, inlinedAt: !907)
!997 = !DILocation(line: 131, column: 12, scope: !811, inlinedAt: !907)
!998 = !DILocation(line: 59, column: 7, scope: !811, inlinedAt: !907)
!999 = !DILocation(line: 132, column: 9, scope: !811, inlinedAt: !907)
!1000 = !DILocation(line: 60, column: 14, scope: !811, inlinedAt: !907)
!1001 = !DILocation(line: 135, column: 7, scope: !1002, inlinedAt: !907)
!1002 = distinct !DILexicalBlock(scope: !811, file: !560, line: 135, column: 7)
!1003 = !DILocation(line: 135, column: 7, scope: !811, inlinedAt: !907)
!1004 = !DILocation(line: 137, column: 18, scope: !1002, inlinedAt: !907)
!1005 = !DILocation(line: 137, column: 26, scope: !1002, inlinedAt: !907)
!1006 = !DILocation(line: 137, column: 5, scope: !1002, inlinedAt: !907)
!1007 = !DILocation(line: 139, column: 5, scope: !1002, inlinedAt: !907)
!1008 = !DILocation(line: 140, column: 14, scope: !1009, inlinedAt: !907)
!1009 = distinct !DILexicalBlock(scope: !811, file: !560, line: 140, column: 7)
!1010 = !DILocation(line: 140, column: 7, scope: !811, inlinedAt: !907)
!1011 = !DILocation(line: 141, column: 5, scope: !1009, inlinedAt: !907)
!1012 = !DILocation(line: 144, column: 13, scope: !1013, inlinedAt: !907)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !560, line: 144, column: 11)
!1014 = distinct !DILexicalBlock(scope: !1009, file: !560, line: 143, column: 5)
!1015 = !DILocation(line: 144, column: 11, scope: !1014, inlinedAt: !907)
!1016 = !DILocation(line: 145, column: 9, scope: !1013, inlinedAt: !907)
!1017 = !DILocation(line: 150, column: 9, scope: !1013, inlinedAt: !907)
!1018 = !DILocation(line: 152, column: 3, scope: !811, inlinedAt: !907)
!1019 = !DILocation(line: 155, column: 23, scope: !811, inlinedAt: !907)
!1020 = !DILocation(line: 155, column: 11, scope: !811, inlinedAt: !907)
!1021 = !DILocation(line: 62, column: 7, scope: !811, inlinedAt: !907)
!1022 = !DILocation(line: 157, column: 13, scope: !1023, inlinedAt: !907)
!1023 = distinct !DILexicalBlock(scope: !811, file: !560, line: 157, column: 7)
!1024 = !DILocation(line: 157, column: 7, scope: !811, inlinedAt: !907)
!1025 = !DILocalVariable(name: "__c", arg: 1, scope: !1026, file: !1027, line: 105, type: !35)
!1026 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1027, file: !1027, line: 105, type: !1028, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !559, variables: !1030)
!1027 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!35, !35}
!1030 = !{!1025}
!1031 = !DILocation(line: 105, column: 23, scope: !1026, inlinedAt: !1032)
!1032 = distinct !DILocation(line: 158, column: 5, scope: !1023, inlinedAt: !907)
!1033 = !DILocation(line: 107, column: 10, scope: !1026, inlinedAt: !1032)
!1034 = !{!1035, !699, i64 40}
!1035 = !{!"_IO_FILE", !749, i64 0, !699, i64 8, !699, i64 16, !699, i64 24, !699, i64 32, !699, i64 40, !699, i64 48, !699, i64 56, !699, i64 64, !699, i64 72, !699, i64 80, !699, i64 88, !699, i64 96, !699, i64 104, !749, i64 112, !749, i64 116, !922, i64 120, !965, i64 128, !700, i64 130, !700, i64 131, !699, i64 136, !922, i64 144, !699, i64 152, !699, i64 160, !699, i64 168, !699, i64 176, !922, i64 184, !749, i64 192, !700, i64 196}
!1036 = !{!1035, !699, i64 48}
!1037 = !{!"branch_weights", i32 2000, i32 1}
!1038 = !DILocation(line: 161, column: 17, scope: !1039, inlinedAt: !907)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !560, line: 161, column: 11)
!1040 = distinct !DILexicalBlock(scope: !1023, file: !560, line: 160, column: 5)
!1041 = !DILocation(line: 161, column: 11, scope: !1040, inlinedAt: !907)
!1042 = !DILocation(line: 162, column: 9, scope: !1039, inlinedAt: !907)
!1043 = !{!1044, !1044, i64 0}
!1044 = !{!"double", !700, i64 0}
!1045 = !DILocation(line: 163, column: 17, scope: !1046, inlinedAt: !907)
!1046 = distinct !DILexicalBlock(scope: !1040, file: !560, line: 163, column: 11)
!1047 = !DILocation(line: 163, column: 11, scope: !1040, inlinedAt: !907)
!1048 = !DILocation(line: 164, column: 9, scope: !1046, inlinedAt: !907)
!1049 = !DILocation(line: 165, column: 17, scope: !1050, inlinedAt: !907)
!1050 = distinct !DILexicalBlock(scope: !1040, file: !560, line: 165, column: 11)
!1051 = !DILocation(line: 165, column: 11, scope: !1040, inlinedAt: !907)
!1052 = !DILocation(line: 166, column: 9, scope: !1050, inlinedAt: !907)
!1053 = !DILocation(line: 105, column: 23, scope: !1026, inlinedAt: !1054)
!1054 = distinct !DILocation(line: 168, column: 9, scope: !1055, inlinedAt: !907)
!1055 = distinct !DILexicalBlock(scope: !1040, file: !560, line: 167, column: 11)
!1056 = !DILocation(line: 107, column: 10, scope: !1026, inlinedAt: !1054)
!1057 = !DILocation(line: 170, column: 1, scope: !811, inlinedAt: !907)
!1058 = !DILocation(line: 190, column: 1, scope: !766)
!1059 = !DILocation(line: 113, column: 7, scope: !961, inlinedAt: !907)
!1060 = distinct !{!1060, !1061, !1062}
!1061 = !DILocation(line: 108, column: 3, scope: !811)
!1062 = !DILocation(line: 114, column: 5, scope: !811)
!1063 = distinct !DISubprogram(name: "c_strtod", scope: !40, file: !40, line: 66, type: !1064, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, unit: !11, variables: !1066)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!904, !6, !728}
!1066 = !{!1067, !1068, !1069, !1070}
!1067 = !DILocalVariable(name: "nptr", arg: 1, scope: !1063, file: !40, line: 66, type: !6)
!1068 = !DILocalVariable(name: "endptr", arg: 2, scope: !1063, file: !40, line: 66, type: !728)
!1069 = !DILocalVariable(name: "r", scope: !1063, file: !40, line: 68, type: !904)
!1070 = !DILocalVariable(name: "locale", scope: !1063, file: !40, line: 72, type: !15)
!1071 = !DILocation(line: 66, column: 23, scope: !1063)
!1072 = !DILocation(line: 66, column: 36, scope: !1063)
!1073 = !DILocation(line: 58, column: 8, scope: !1074, inlinedAt: !1078)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !40, line: 58, column: 7)
!1075 = distinct !DISubprogram(name: "c_locale", scope: !40, file: !40, line: 56, type: !1076, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !11, variables: !4)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!15}
!1078 = distinct !DILocation(line: 72, column: 21, scope: !1063)
!1079 = !DILocation(line: 58, column: 7, scope: !1075, inlinedAt: !1078)
!1080 = !DILocation(line: 59, column: 22, scope: !1074, inlinedAt: !1078)
!1081 = !DILocation(line: 59, column: 20, scope: !1074, inlinedAt: !1078)
!1082 = !DILocation(line: 59, column: 5, scope: !1074, inlinedAt: !1078)
!1083 = !DILocation(line: 60, column: 10, scope: !1075, inlinedAt: !1078)
!1084 = !DILocation(line: 72, column: 12, scope: !1063)
!1085 = !DILocation(line: 73, column: 8, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1063, file: !40, line: 73, column: 7)
!1087 = !DILocation(line: 73, column: 7, scope: !1063)
!1088 = !DILocation(line: 75, column: 11, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !40, line: 75, column: 11)
!1090 = distinct !DILexicalBlock(scope: !1086, file: !40, line: 74, column: 5)
!1091 = !DILocation(line: 75, column: 11, scope: !1090)
!1092 = !DILocation(line: 76, column: 17, scope: !1089)
!1093 = !DILocation(line: 76, column: 9, scope: !1089)
!1094 = !DILocation(line: 80, column: 7, scope: !1063)
!1095 = !DILocation(line: 68, column: 10, scope: !1063)
!1096 = !DILocation(line: 111, column: 3, scope: !1063)
!1097 = !DILocation(line: 112, column: 1, scope: !1063)
!1098 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !49, file: !49, line: 41, type: !584, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, unit: !44, variables: !1099)
!1099 = !{!1100}
!1100 = !DILocalVariable(name: "file", arg: 1, scope: !1098, file: !49, line: 41, type: !6)
!1101 = !DILocation(line: 41, column: 41, scope: !1098)
!1102 = !DILocation(line: 43, column: 13, scope: !1098)
!1103 = !DILocation(line: 44, column: 1, scope: !1098)
!1104 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !49, file: !49, line: 78, type: !1105, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !44, variables: !1107)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{null, !50}
!1107 = !{!1108}
!1108 = !DILocalVariable(name: "ignore", arg: 1, scope: !1104, file: !49, line: 78, type: !50)
!1109 = !DILocation(line: 78, column: 37, scope: !1104)
!1110 = !DILocation(line: 80, column: 16, scope: !1104)
!1111 = !{!1112, !1112, i64 0}
!1112 = !{!"_Bool", !700, i64 0}
!1113 = !DILocation(line: 81, column: 1, scope: !1104)
!1114 = distinct !DISubprogram(name: "close_stdout", scope: !49, file: !49, line: 107, type: !1115, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, unit: !44, variables: !1117)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{null}
!1117 = !{!1118}
!1118 = !DILocalVariable(name: "write_error", scope: !1119, file: !49, line: 112, type: !6)
!1119 = distinct !DILexicalBlock(scope: !1120, file: !49, line: 111, column: 5)
!1120 = distinct !DILexicalBlock(scope: !1114, file: !49, line: 109, column: 7)
!1121 = !DILocation(line: 109, column: 21, scope: !1120)
!1122 = !DILocation(line: 109, column: 7, scope: !1120)
!1123 = !DILocation(line: 109, column: 29, scope: !1120)
!1124 = !DILocation(line: 110, column: 7, scope: !1120)
!1125 = !DILocation(line: 110, column: 12, scope: !1120)
!1126 = !{i8 0, i8 2}
!1127 = !DILocation(line: 114, column: 19, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1119, file: !49, line: 113, column: 11)
!1129 = !DILocation(line: 110, column: 25, scope: !1120)
!1130 = !DILocation(line: 110, column: 28, scope: !1120)
!1131 = !DILocation(line: 110, column: 34, scope: !1120)
!1132 = !DILocation(line: 109, column: 7, scope: !1114)
!1133 = !DILocation(line: 112, column: 33, scope: !1119)
!1134 = !DILocation(line: 112, column: 19, scope: !1119)
!1135 = !DILocation(line: 113, column: 11, scope: !1128)
!1136 = !DILocation(line: 113, column: 11, scope: !1119)
!1137 = !DILocation(line: 114, column: 36, scope: !1128)
!1138 = !DILocation(line: 114, column: 9, scope: !1128)
!1139 = !DILocation(line: 117, column: 9, scope: !1128)
!1140 = !DILocation(line: 119, column: 14, scope: !1119)
!1141 = !DILocation(line: 119, column: 7, scope: !1119)
!1142 = !DILocation(line: 122, column: 22, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1114, file: !49, line: 122, column: 8)
!1144 = !DILocation(line: 122, column: 8, scope: !1143)
!1145 = !DILocation(line: 122, column: 30, scope: !1143)
!1146 = !DILocation(line: 122, column: 8, scope: !1114)
!1147 = !DILocation(line: 123, column: 13, scope: !1143)
!1148 = !DILocation(line: 123, column: 6, scope: !1143)
!1149 = !DILocation(line: 124, column: 1, scope: !1114)
!1150 = distinct !DISubprogram(name: "fprintftime", scope: !1151, file: !1151, line: 422, type: !1152, isLocal: false, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: true, unit: !600, variables: !1216)
!1151 = !DIFile(filename: "./lib/strftime.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!124, !1154, !6, !1194, !1209, !35}
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !846, line: 7, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !848, line: 241, size: 1728, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1156, file: !848, line: 242, baseType: !35, size: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1156, file: !848, line: 247, baseType: !14, size: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1156, file: !848, line: 248, baseType: !14, size: 64, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1156, file: !848, line: 249, baseType: !14, size: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1156, file: !848, line: 250, baseType: !14, size: 64, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1156, file: !848, line: 251, baseType: !14, size: 64, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1156, file: !848, line: 252, baseType: !14, size: 64, offset: 384)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1156, file: !848, line: 253, baseType: !14, size: 64, offset: 448)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1156, file: !848, line: 254, baseType: !14, size: 64, offset: 512)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1156, file: !848, line: 256, baseType: !14, size: 64, offset: 576)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1156, file: !848, line: 257, baseType: !14, size: 64, offset: 640)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1156, file: !848, line: 258, baseType: !14, size: 64, offset: 704)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1156, file: !848, line: 260, baseType: !1171, size: 64, offset: 768)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !848, line: 156, size: 192, elements: !1173)
!1173 = !{!1174, !1175, !1177}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1172, file: !848, line: 157, baseType: !1171, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1172, file: !848, line: 158, baseType: !1176, size: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1172, file: !848, line: 162, baseType: !35, size: 32, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1156, file: !848, line: 262, baseType: !1176, size: 64, offset: 832)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1156, file: !848, line: 264, baseType: !35, size: 32, offset: 896)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1156, file: !848, line: 268, baseType: !35, size: 32, offset: 928)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1156, file: !848, line: 270, baseType: !874, size: 64, offset: 960)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1156, file: !848, line: 274, baseType: !31, size: 16, offset: 1024)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1156, file: !848, line: 275, baseType: !533, size: 8, offset: 1040)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1156, file: !848, line: 276, baseType: !878, size: 8, offset: 1048)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1156, file: !848, line: 280, baseType: !882, size: 64, offset: 1088)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1156, file: !848, line: 289, baseType: !885, size: 64, offset: 1152)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1156, file: !848, line: 297, baseType: !81, size: 64, offset: 1216)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1156, file: !848, line: 298, baseType: !81, size: 64, offset: 1280)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1156, file: !848, line: 299, baseType: !81, size: 64, offset: 1344)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1156, file: !848, line: 300, baseType: !81, size: 64, offset: 1408)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1156, file: !848, line: 302, baseType: !124, size: 64, offset: 1472)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1156, file: !848, line: 303, baseType: !35, size: 32, offset: 1536)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1156, file: !848, line: 305, baseType: !807, size: 160, offset: 1568)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !829, line: 7, size: 448, elements: !1197)
!1197 = !{!1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !1196, file: !829, line: 9, baseType: !35, size: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !1196, file: !829, line: 10, baseType: !35, size: 32, offset: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !1196, file: !829, line: 11, baseType: !35, size: 32, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !1196, file: !829, line: 12, baseType: !35, size: 32, offset: 96)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !1196, file: !829, line: 13, baseType: !35, size: 32, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !1196, file: !829, line: 14, baseType: !35, size: 32, offset: 160)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !1196, file: !829, line: 15, baseType: !35, size: 32, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !1196, file: !829, line: 16, baseType: !35, size: 32, offset: 224)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !1196, file: !829, line: 17, baseType: !35, size: 32, offset: 256)
