; ModuleID = 'coreutils-8.27/src/wc.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.Tokens = type { i64, i8**, i64*, %struct.obstack, %struct.obstack, %struct.obstack }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.argv_iterator = type { %struct._IO_FILE*, i64, i8*, i64, i8**, i8** }
%struct.fstatus = type { i32, %struct.stat }
%struct.__mbstate_t = type { i32, %union.anon.2 }
%union.anon.2 = type { i32 }
%struct.mbchar = type { i8*, i64, i8, i32, [24 x i8] }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !50, globals: !60)
!3 = !DIFile(filename: "src/wc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!4 = !{!5, !19, !26, !35}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, size: 32, elements: !7)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!9 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!10 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!11 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!12 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!13 = !DIEnumerator(name: "c_quoting_style", value: 5)
!14 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!15 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!16 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!17 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!18 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "argv_iter_err", file: !20, line: 25, size: 32, elements: !21)
!20 = !DIFile(filename: "./lib/argv-iter.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "AI_ERR_OK", value: 1)
!23 = !DIEnumerator(name: "AI_ERR_EOF", value: 2)
!24 = !DIEnumerator(name: "AI_ERR_MEM", value: 3)
!25 = !DIEnumerator(name: "AI_ERR_READ", value: 4)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 45, size: 32, elements: !28)
!27 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!30 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!31 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!32 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!33 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!34 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 46, size: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!38 = !DIEnumerator(name: "_ISupper", value: 256)
!39 = !DIEnumerator(name: "_ISlower", value: 512)
!40 = !DIEnumerator(name: "_ISalpha", value: 1024)
!41 = !DIEnumerator(name: "_ISdigit", value: 2048)
!42 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!43 = !DIEnumerator(name: "_ISspace", value: 8192)
!44 = !DIEnumerator(name: "_ISprint", value: 16384)
!45 = !DIEnumerator(name: "_ISgraph", value: 32768)
!46 = !DIEnumerator(name: "_ISblank", value: 1)
!47 = !DIEnumerator(name: "_IScntrl", value: 2)
!48 = !DIEnumerator(name: "_ISpunct", value: 4)
!49 = !DIEnumerator(name: "_ISalnum", value: 8)
!50 = !{!51, !53, !54, !57, !58, !59}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 62, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!56 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !{!61, !255, !260, !262, !264, !266, !268, !270, !272, !274, !276, !278, !280, !0, !282, !304, !318}
!61 = !DIGlobalVariableExpression(var: !62)
!62 = distinct !DIGlobalVariable(name: "stdin_only", scope: !63, file: !3, line: 765, type: !254, isLocal: true, isDefinition: true)
!63 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 648, type: !64, isLocal: false, isDefinition: true, scopeLine: 649, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !67)
!64 = !DISubroutineType(types: !65)
!65 = !{!57, !57, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!67 = !{!68, !69, !70, !72, !73, !74, !75, !76, !122, !182, !183, !186, !241, !242, !243, !247, !248, !249}
!68 = !DILocalVariable(name: "argc", arg: 1, scope: !63, file: !3, line: 648, type: !57)
!69 = !DILocalVariable(name: "argv", arg: 2, scope: !63, file: !3, line: 648, type: !66)
!70 = !DILocalVariable(name: "ok", scope: !63, file: !3, line: 650, type: !71)
!71 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!72 = !DILocalVariable(name: "optc", scope: !63, file: !3, line: 651, type: !57)
!73 = !DILocalVariable(name: "nfiles", scope: !63, file: !3, line: 652, type: !54)
!74 = !DILocalVariable(name: "files", scope: !63, file: !3, line: 653, type: !66)
!75 = !DILocalVariable(name: "files_from", scope: !63, file: !3, line: 654, type: !51)
!76 = !DILocalVariable(name: "fstatus", scope: !63, file: !3, line: 655, type: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fstatus", file: !3, line: 78, size: 1216, elements: !79)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !78, file: !3, line: 82, baseType: !57, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !78, file: !3, line: 85, baseType: !82, size: 1152, offset: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !83, line: 46, size: 1152, elements: !84)
!83 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!84 = !{!85, !88, !90, !92, !95, !97, !99, !100, !101, !104, !106, !108, !116, !117, !118}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !82, file: !83, line: 48, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !87, line: 133, baseType: !56)
!87 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!88 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !82, file: !83, line: 53, baseType: !89, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !87, line: 136, baseType: !56)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !82, file: !83, line: 61, baseType: !91, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !87, line: 139, baseType: !56)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !82, file: !83, line: 62, baseType: !93, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !87, line: 138, baseType: !94)
!94 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !82, file: !83, line: 64, baseType: !96, size: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !87, line: 134, baseType: !94)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !82, file: !83, line: 65, baseType: !98, size: 32, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !87, line: 135, baseType: !94)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !82, file: !83, line: 67, baseType: !57, size: 32, offset: 288)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !82, file: !83, line: 69, baseType: !86, size: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !82, file: !83, line: 74, baseType: !102, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !87, line: 140, baseType: !103)
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !82, file: !83, line: 78, baseType: !105, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !87, line: 162, baseType: !103)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !82, file: !83, line: 80, baseType: !107, size: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !87, line: 167, baseType: !103)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !82, file: !83, line: 91, baseType: !109, size: 128, offset: 576)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !110, line: 8, size: 128, elements: !111)
!110 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!111 = !{!112, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !109, file: !110, line: 10, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !87, line: 148, baseType: !103)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !109, file: !110, line: 11, baseType: !115, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !87, line: 184, baseType: !103)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !82, file: !83, line: 92, baseType: !109, size: 128, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !82, file: !83, line: 93, baseType: !109, size: 128, offset: 832)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !82, file: !83, line: 106, baseType: !119, size: 192, offset: 960)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 192, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 3)
!122 = !DILocalVariable(name: "tok", scope: !63, file: !3, line: 656, type: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !124, line: 28, size: 2304, elements: !125)
!124 = !DIFile(filename: "./lib/readtokens0.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!125 = !{!126, !127, !128, !130, !180, !181}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !123, file: !124, line: 30, baseType: !54, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !123, file: !124, line: 31, baseType: !66, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !123, file: !124, line: 32, baseType: !129, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !123, file: !124, line: 33, baseType: !131, size: 704, offset: 192)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !132, line: 174, size: 704, elements: !133)
!132 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!133 = !{!134, !135, !145, !146, !147, !148, !153, !154, !165, !176, !177, !178, !179}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !131, file: !132, line: 176, baseType: !54, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !131, file: !132, line: 177, baseType: !136, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !132, line: 167, size: 128, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !137, file: !132, line: 169, baseType: !51, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !132, line: 170, baseType: !136, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !137, file: !132, line: 171, baseType: !142, offset: 128)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: -1)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !131, file: !132, line: 178, baseType: !51, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !131, file: !132, line: 179, baseType: !51, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !131, file: !132, line: 180, baseType: !51, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !131, file: !132, line: 185, baseType: !149, size: 64, offset: 320)
!149 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !132, line: 181, size: 64, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !149, file: !132, line: 183, baseType: !54, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !149, file: !132, line: 184, baseType: !53, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !131, file: !132, line: 186, baseType: !54, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !131, file: !132, line: 193, baseType: !155, size: 64, offset: 448)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !132, line: 189, size: 64, elements: !156)
!156 = !{!157, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !155, file: !132, line: 191, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!53, !54}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !155, file: !132, line: 192, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!53, !53, !54}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !131, file: !132, line: 198, baseType: !166, size: 64, offset: 512)
!166 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !132, line: 194, size: 64, elements: !167)
!167 = !{!168, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !166, file: !132, line: 196, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !53}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !166, file: !132, line: 197, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !53, !53}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !131, file: !132, line: 200, baseType: !53, size: 64, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !131, file: !132, line: 201, baseType: !94, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !131, file: !132, line: 202, baseType: !94, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !131, file: !132, line: 206, baseType: !94, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !123, file: !124, line: 34, baseType: !131, size: 704, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !123, file: !124, line: 35, baseType: !131, size: 704, offset: 1600)
!182 = !DILocalVariable(name: "read_tokens", scope: !63, file: !3, line: 714, type: !71)
!183 = !DILocalVariable(name: "ai", scope: !63, file: !3, line: 715, type: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !20, line: 23, flags: DIFlagFwdDecl)
!186 = !DILocalVariable(name: "stream", scope: !187, file: !3, line: 718, type: !189)
!187 = distinct !DILexicalBlock(scope: !188, file: !3, line: 717, column: 5)
!188 = distinct !DILexicalBlock(scope: !63, file: !3, line: 716, column: 7)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !191, line: 7, baseType: !192)
!191 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !193, line: 241, size: 1728, elements: !194)
!193 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !215, !216, !217, !218, !219, !220, !222, !226, !229, !231, !232, !233, !234, !235, !236, !237}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !192, file: !193, line: 242, baseType: !57, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !192, file: !193, line: 247, baseType: !51, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !192, file: !193, line: 248, baseType: !51, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !192, file: !193, line: 249, baseType: !51, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !192, file: !193, line: 250, baseType: !51, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !192, file: !193, line: 251, baseType: !51, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !192, file: !193, line: 252, baseType: !51, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !192, file: !193, line: 253, baseType: !51, size: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !192, file: !193, line: 254, baseType: !51, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !192, file: !193, line: 256, baseType: !51, size: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !192, file: !193, line: 257, baseType: !51, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !192, file: !193, line: 258, baseType: !51, size: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !192, file: !193, line: 260, baseType: !208, size: 64, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !193, line: 156, size: 192, elements: !210)
!210 = !{!211, !212, !214}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !209, file: !193, line: 157, baseType: !208, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !209, file: !193, line: 158, baseType: !213, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !209, file: !193, line: 162, baseType: !57, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !192, file: !193, line: 262, baseType: !213, size: 64, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !192, file: !193, line: 264, baseType: !57, size: 32, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !192, file: !193, line: 268, baseType: !57, size: 32, offset: 928)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !192, file: !193, line: 270, baseType: !102, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !192, file: !193, line: 274, baseType: !58, size: 16, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !192, file: !193, line: 275, baseType: !221, size: 8, offset: 1040)
!221 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !192, file: !193, line: 276, baseType: !223, size: 8, offset: 1048)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 1)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !192, file: !193, line: 280, baseType: !227, size: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !193, line: 150, baseType: null)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !192, file: !193, line: 289, baseType: !230, size: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !87, line: 141, baseType: !103)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !192, file: !193, line: 297, baseType: !53, size: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !192, file: !193, line: 298, baseType: !53, size: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !192, file: !193, line: 299, baseType: !53, size: 64, offset: 1344)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !192, file: !193, line: 300, baseType: !53, size: 64, offset: 1408)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !192, file: !193, line: 302, baseType: !54, size: 64, offset: 1472)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !192, file: !193, line: 303, baseType: !57, size: 32, offset: 1536)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !192, file: !193, line: 305, baseType: !238, size: 160, offset: 1568)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 160, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 20)
!241 = !DILocalVariable(name: "st", scope: !187, file: !3, line: 742, type: !82)
!242 = !DILocalVariable(name: "i", scope: !63, file: !3, line: 777, type: !57)
!243 = !DILocalVariable(name: "skip_file", scope: !244, file: !3, line: 781, type: !71)
!244 = distinct !DILexicalBlock(scope: !245, file: !3, line: 780, column: 5)
!245 = distinct !DILexicalBlock(scope: !246, file: !3, line: 779, column: 3)
!246 = distinct !DILexicalBlock(scope: !63, file: !3, line: 779, column: 3)
!247 = !DILocalVariable(name: "ai_err", scope: !244, file: !3, line: 782, type: !19)
!248 = !DILocalVariable(name: "file_name", scope: !244, file: !3, line: 783, type: !51)
!249 = !DILocalVariable(name: "file_number", scope: !250, file: !3, line: 824, type: !56)
!250 = distinct !DILexicalBlock(scope: !251, file: !3, line: 820, column: 13)
!251 = distinct !DILexicalBlock(scope: !252, file: !3, line: 817, column: 15)
!252 = distinct !DILexicalBlock(scope: !253, file: !3, line: 812, column: 9)
!253 = distinct !DILexicalBlock(scope: !244, file: !3, line: 811, column: 11)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !224)
!255 = !DIGlobalVariableExpression(var: !256)
!256 = distinct !DIGlobalVariable(name: "total_lines", scope: !2, file: !3, line: 58, type: !257, isLocal: true, isDefinition: true)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !258, line: 112, baseType: !259)
!258 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !87, line: 62, baseType: !56)
!260 = !DIGlobalVariableExpression(var: !261)
!261 = distinct !DIGlobalVariable(name: "total_words", scope: !2, file: !3, line: 59, type: !257, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263)
!263 = distinct !DIGlobalVariable(name: "total_chars", scope: !2, file: !3, line: 60, type: !257, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265)
!265 = distinct !DIGlobalVariable(name: "total_bytes", scope: !2, file: !3, line: 61, type: !257, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267)
!267 = distinct !DIGlobalVariable(name: "max_line_length", scope: !2, file: !3, line: 62, type: !257, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269)
!269 = distinct !DIGlobalVariable(name: "print_lines", scope: !2, file: !3, line: 65, type: !71, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271)
!271 = distinct !DIGlobalVariable(name: "print_words", scope: !2, file: !3, line: 65, type: !71, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273)
!273 = distinct !DIGlobalVariable(name: "print_chars", scope: !2, file: !3, line: 65, type: !71, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275)
!275 = distinct !DIGlobalVariable(name: "print_bytes", scope: !2, file: !3, line: 65, type: !71, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277)
!277 = distinct !DIGlobalVariable(name: "print_linelength", scope: !2, file: !3, line: 66, type: !71, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279)
!279 = distinct !DIGlobalVariable(name: "number_width", scope: !2, file: !3, line: 69, type: !57, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281)
!281 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 72, type: !71, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283)
!283 = distinct !DIGlobalVariable(name: "infomap", scope: !284, file: !285, line: 632, type: !301, isLocal: true, isDefinition: true)
!284 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !285, file: !285, line: 630, type: !286, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !290)
!285 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!290 = !{!291, !292, !293, !300}
!291 = !DILocalVariable(name: "program", arg: 1, scope: !284, file: !285, line: 630, type: !288)
!292 = !DILocalVariable(name: "node", scope: !284, file: !285, line: 642, type: !288)
!293 = !DILocalVariable(name: "map_prog", scope: !284, file: !285, line: 643, type: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !284, file: !285, line: 632, size: 128, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !296, file: !285, line: 632, baseType: !288, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !296, file: !285, line: 632, baseType: !288, size: 64, offset: 64)
!300 = !DILocalVariable(name: "lc_messages", scope: !284, file: !285, line: 655, type: !288)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 896, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 7)
!304 = !DIGlobalVariableExpression(var: !305)
!305 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 95, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 2304, elements: !316)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !309, line: 50, size: 256, elements: !310)
!309 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!310 = !{!311, !312, !313, !315}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !309, line: 52, baseType: !288, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !308, file: !309, line: 55, baseType: !57, size: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !308, file: !309, line: 56, baseType: !314, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !308, file: !309, line: 57, baseType: !57, size: 32, offset: 192)
!316 = !{!317}
!317 = !DISubrange(count: 9)
!318 = !DIGlobalVariableExpression(var: !319)
!319 = distinct !DIGlobalVariable(name: "format_sp_int", scope: !320, file: !3, line: 160, type: !335, isLocal: true, isDefinition: true)
!320 = distinct !DISubprogram(name: "write_counts", scope: !3, file: !3, line: 153, type: !321, isLocal: true, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !323)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !257, !257, !257, !257, !257, !288}
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331}
!324 = !DILocalVariable(name: "lines", arg: 1, scope: !320, file: !3, line: 153, type: !257)
!325 = !DILocalVariable(name: "words", arg: 2, scope: !320, file: !3, line: 154, type: !257)
!326 = !DILocalVariable(name: "chars", arg: 3, scope: !320, file: !3, line: 155, type: !257)
!327 = !DILocalVariable(name: "bytes", arg: 4, scope: !320, file: !3, line: 156, type: !257)
!328 = !DILocalVariable(name: "linelength", arg: 5, scope: !320, file: !3, line: 157, type: !257)
!329 = !DILocalVariable(name: "file", arg: 6, scope: !320, file: !3, line: 158, type: !288)
!330 = !DILocalVariable(name: "format_int", scope: !320, file: !3, line: 161, type: !288)
!331 = !DILocalVariable(name: "buf", scope: !320, file: !3, line: 162, type: !332)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 168, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 21)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 40, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 5)
!338 = !DIGlobalVariableExpression(var: !339)
!339 = distinct !DIGlobalVariable(name: "Version", scope: !340, file: !341, line: 2, type: !288, isLocal: false, isDefinition: true)
!340 = distinct !DICompileUnit(language: DW_LANG_C99, file: !341, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, globals: !343)
!341 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!342 = !{}
!343 = !{!338}
!344 = !DIGlobalVariableExpression(var: !345)
!345 = distinct !DIGlobalVariable(name: "file_name", scope: !346, file: !351, line: 36, type: !288, isLocal: true, isDefinition: true)
!346 = distinct !DICompileUnit(language: DW_LANG_C99, file: !347, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, globals: !348)
!347 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!348 = !{!344, !349}
!349 = !DIGlobalVariableExpression(var: !350)
!350 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !346, file: !351, line: 46, type: !71, isLocal: true, isDefinition: true)
!351 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!352 = !DIGlobalVariableExpression(var: !353)
!353 = distinct !DIGlobalVariable(name: "exit_failure", scope: !354, file: !357, line: 24, type: !358, isLocal: false, isDefinition: true)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, globals: !356)
!355 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!356 = !{!352}
!357 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!358 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !57)
!359 = !DIGlobalVariableExpression(var: !360)
!360 = distinct !DIGlobalVariable(name: "is_basic_table", scope: !361, file: !365, line: 28, type: !366, isLocal: false, isDefinition: true)
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, retainedTypes: !363, globals: !364)
!362 = !DIFile(filename: "./lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!363 = !{!59}
!364 = !{!359}
!365 = !DIFile(filename: "lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 256, elements: !368)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!368 = !{!369}
!369 = !DISubrange(count: 8)
!370 = !DIGlobalVariableExpression(var: !371)
!371 = distinct !DIGlobalVariable(name: "program_name", scope: !372, file: !376, line: 33, type: !288, isLocal: false, isDefinition: true)
!372 = distinct !DICompileUnit(language: DW_LANG_C99, file: !373, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, retainedTypes: !374, globals: !375)
!373 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!374 = !{!53, !51}
!375 = !{!370}
!376 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!377 = !DIGlobalVariableExpression(var: !378)
!378 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !379, file: !391, line: 77, type: !424, isLocal: false, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !381, retainedTypes: !387, globals: !388)
!380 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!381 = !{!5, !382, !35}
!382 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, size: 32, elements: !383)
!383 = !{!384, !385, !386}
!384 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!385 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!386 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!387 = !{!57, !58, !54, !51}
!388 = !{!377, !389, !396, !406, !408, !413, !420, !422}
!389 = !DIGlobalVariableExpression(var: !390)
!390 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !379, file: !391, line: 93, type: !392, isLocal: false, isDefinition: true)
!391 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 320, elements: !394)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!394 = !{!395}
!395 = !DISubrange(count: 10)
!396 = !DIGlobalVariableExpression(var: !397)
!397 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !379, file: !391, line: 1043, type: !398, isLocal: false, isDefinition: true)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !391, line: 57, size: 448, elements: !399)
!399 = !{!400, !401, !402, !404, !405}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !398, file: !391, line: 60, baseType: !5, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !398, file: !391, line: 63, baseType: !57, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !398, file: !391, line: 67, baseType: !403, size: 256, offset: 64)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 256, elements: !368)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !398, file: !391, line: 70, baseType: !288, size: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !398, file: !391, line: 73, baseType: !288, size: 64, offset: 384)
!406 = !DIGlobalVariableExpression(var: !407)
!407 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !379, file: !391, line: 108, type: !398, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409)
!409 = distinct !DIGlobalVariable(name: "slot0", scope: !379, file: !391, line: 834, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 2048, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 256)
!413 = !DIGlobalVariableExpression(var: !414)
!414 = distinct !DIGlobalVariable(name: "slotvec", scope: !379, file: !391, line: 837, type: !415, isLocal: true, isDefinition: true)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !391, line: 826, size: 128, elements: !417)
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !416, file: !391, line: 828, baseType: !54, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !416, file: !391, line: 829, baseType: !51, size: 64, offset: 64)
!420 = !DIGlobalVariableExpression(var: !421)
!421 = distinct !DIGlobalVariable(name: "nslots", scope: !379, file: !391, line: 835, type: !57, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423)
!423 = distinct !DIGlobalVariable(name: "slotvec0", scope: !379, file: !391, line: 836, type: !416, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 704, elements: !426)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!426 = !{!427}
!427 = !DISubrange(count: 11)
!428 = !DIGlobalVariableExpression(var: !429)
!429 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !430, file: !433, line: 26, type: !434, isLocal: false, isDefinition: true)
!430 = distinct !DICompileUnit(language: DW_LANG_C99, file: !431, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, globals: !432)
!431 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!432 = !{!428}
!433 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 376, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 47)
!437 = !DIGlobalVariableExpression(var: !438)
!438 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !439, file: !443, line: 351, type: !444, isLocal: false, isDefinition: true)
!439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, retainedTypes: !441, globals: !442)
!440 = !DIFile(filename: "./lib/obstack.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!441 = !{!51, !53}
!442 = !{!437}
!443 = !DIFile(filename: "lib/obstack.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{null}
!447 = !DIGlobalVariableExpression(var: !448)
!448 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !449, file: !793, line: 120, type: !794, isLocal: true, isDefinition: true)
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !451, retainedTypes: !790, globals: !792)
!450 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!451 = !{!452}
!452 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !453, line: 41, size: 32, elements: !454)
!453 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789}
!455 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!456 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!457 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!458 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!459 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!460 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!461 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!462 = !DIEnumerator(name: "DAY_1", value: 131079)
!463 = !DIEnumerator(name: "DAY_2", value: 131080)
!464 = !DIEnumerator(name: "DAY_3", value: 131081)
!465 = !DIEnumerator(name: "DAY_4", value: 131082)
!466 = !DIEnumerator(name: "DAY_5", value: 131083)
!467 = !DIEnumerator(name: "DAY_6", value: 131084)
!468 = !DIEnumerator(name: "DAY_7", value: 131085)
!469 = !DIEnumerator(name: "ABMON_1", value: 131086)
!470 = !DIEnumerator(name: "ABMON_2", value: 131087)
!471 = !DIEnumerator(name: "ABMON_3", value: 131088)
!472 = !DIEnumerator(name: "ABMON_4", value: 131089)
!473 = !DIEnumerator(name: "ABMON_5", value: 131090)
!474 = !DIEnumerator(name: "ABMON_6", value: 131091)
!475 = !DIEnumerator(name: "ABMON_7", value: 131092)
!476 = !DIEnumerator(name: "ABMON_8", value: 131093)
!477 = !DIEnumerator(name: "ABMON_9", value: 131094)
!478 = !DIEnumerator(name: "ABMON_10", value: 131095)
!479 = !DIEnumerator(name: "ABMON_11", value: 131096)
!480 = !DIEnumerator(name: "ABMON_12", value: 131097)
!481 = !DIEnumerator(name: "MON_1", value: 131098)
!482 = !DIEnumerator(name: "MON_2", value: 131099)
!483 = !DIEnumerator(name: "MON_3", value: 131100)
!484 = !DIEnumerator(name: "MON_4", value: 131101)
!485 = !DIEnumerator(name: "MON_5", value: 131102)
!486 = !DIEnumerator(name: "MON_6", value: 131103)
!487 = !DIEnumerator(name: "MON_7", value: 131104)
!488 = !DIEnumerator(name: "MON_8", value: 131105)
!489 = !DIEnumerator(name: "MON_9", value: 131106)
!490 = !DIEnumerator(name: "MON_10", value: 131107)
!491 = !DIEnumerator(name: "MON_11", value: 131108)
!492 = !DIEnumerator(name: "MON_12", value: 131109)
!493 = !DIEnumerator(name: "AM_STR", value: 131110)
!494 = !DIEnumerator(name: "PM_STR", value: 131111)
!495 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!496 = !DIEnumerator(name: "D_FMT", value: 131113)
!497 = !DIEnumerator(name: "T_FMT", value: 131114)
!498 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!499 = !DIEnumerator(name: "ERA", value: 131116)
!500 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!501 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!502 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!503 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!504 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!505 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!506 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!507 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!508 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!509 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!510 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!511 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!512 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!513 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!514 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!515 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!516 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!517 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!518 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!519 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!520 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!521 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!522 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!523 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!524 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!525 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!526 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!527 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!528 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!529 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!530 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!531 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!532 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!533 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!534 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!535 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!536 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!537 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!538 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!539 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!540 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!541 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!542 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!543 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!544 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!545 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!546 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!547 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!548 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!549 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!550 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!551 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!552 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!553 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!554 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!555 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!556 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!557 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!558 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!559 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!560 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!561 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!562 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!563 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!564 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!565 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!566 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!567 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!568 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!569 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!570 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!571 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!572 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!573 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!574 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!575 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!576 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!577 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!578 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!579 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!580 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!581 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!582 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!583 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!584 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!585 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!586 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!587 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!588 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!589 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!590 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!591 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!592 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!593 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!594 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!595 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!596 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!597 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!598 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!599 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!600 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!601 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!602 = !DIEnumerator(name: "CODESET", value: 14)
!603 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!604 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!605 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!606 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!607 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!608 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!609 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!610 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!611 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!612 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!613 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!614 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!615 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!616 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!617 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!618 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!619 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!620 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!621 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!622 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!623 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!624 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!625 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!626 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!627 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!628 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!629 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!630 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!631 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!632 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!633 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!634 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!635 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!636 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!637 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!638 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!639 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!640 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!641 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!642 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!643 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!644 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!645 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!646 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!647 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!648 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!649 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!650 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!651 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!652 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!653 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!654 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!655 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!656 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!657 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!658 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!659 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!660 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!661 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!662 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!663 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!664 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!665 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!666 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!667 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!668 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!669 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!670 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!671 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!672 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!673 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!674 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!675 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!676 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!677 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!678 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!679 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!680 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!681 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!682 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!683 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!684 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!685 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!686 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!687 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!688 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!689 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!690 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!691 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!692 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!693 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!694 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!695 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!696 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!697 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!698 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!699 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!700 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!701 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!702 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!703 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!704 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!705 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!706 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!707 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!708 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!709 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!710 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!711 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!712 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!713 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!714 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!715 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!716 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!717 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!718 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!719 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!720 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!721 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!722 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!723 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!724 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!725 = !DIEnumerator(name: "THOUSEP", value: 65537)
!726 = !DIEnumerator(name: "__GROUPING", value: 65538)
!727 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!728 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!729 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!730 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!731 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!732 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!733 = !DIEnumerator(name: "__YESSTR", value: 327682)
!734 = !DIEnumerator(name: "__NOSTR", value: 327683)
!735 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!736 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!737 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!738 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!739 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!740 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!741 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!742 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!743 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!744 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!745 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!746 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!747 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!748 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!749 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!750 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!751 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!752 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!753 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!754 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!755 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!756 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!757 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!758 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!759 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!760 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!761 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!762 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!763 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!764 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!765 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!766 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!767 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!768 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!769 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!770 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!771 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!772 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!773 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!774 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!775 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!776 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!777 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!778 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!779 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!780 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!781 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!782 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!783 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!784 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!785 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!786 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!787 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!788 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!789 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!790 = !{!53, !51, !791}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!792 = !{!447}
!793 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!794 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !288)
!795 = distinct !DICompileUnit(language: DW_LANG_C99, file: !796, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !797, retainedTypes: !798)
!796 = !DIFile(filename: "./lib/argv-iter.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!797 = !{!19}
!798 = !{!53}
!799 = distinct !DICompileUnit(language: DW_LANG_C99, file: !800, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !801)
!800 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!801 = !{!26}
!802 = distinct !DICompileUnit(language: DW_LANG_C99, file: !803, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, retainedTypes: !804)
!803 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!804 = !{!257}
!805 = distinct !DICompileUnit(language: DW_LANG_C99, file: !806, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !807, retainedTypes: !1026)
!806 = !DIFile(filename: "./lib/physmem.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!807 = !{!808}
!808 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !809, line: 71, size: 32, elements: !810)
!809 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
!811 = !DIEnumerator(name: "_SC_ARG_MAX", value: 0)
!812 = !DIEnumerator(name: "_SC_CHILD_MAX", value: 1)
!813 = !DIEnumerator(name: "_SC_CLK_TCK", value: 2)
!814 = !DIEnumerator(name: "_SC_NGROUPS_MAX", value: 3)
!815 = !DIEnumerator(name: "_SC_OPEN_MAX", value: 4)
!816 = !DIEnumerator(name: "_SC_STREAM_MAX", value: 5)
!817 = !DIEnumerator(name: "_SC_TZNAME_MAX", value: 6)
!818 = !DIEnumerator(name: "_SC_JOB_CONTROL", value: 7)
!819 = !DIEnumerator(name: "_SC_SAVED_IDS", value: 8)
!820 = !DIEnumerator(name: "_SC_REALTIME_SIGNALS", value: 9)
!821 = !DIEnumerator(name: "_SC_PRIORITY_SCHEDULING", value: 10)
!822 = !DIEnumerator(name: "_SC_TIMERS", value: 11)
!823 = !DIEnumerator(name: "_SC_ASYNCHRONOUS_IO", value: 12)
!824 = !DIEnumerator(name: "_SC_PRIORITIZED_IO", value: 13)
!825 = !DIEnumerator(name: "_SC_SYNCHRONIZED_IO", value: 14)
!826 = !DIEnumerator(name: "_SC_FSYNC", value: 15)
!827 = !DIEnumerator(name: "_SC_MAPPED_FILES", value: 16)
!828 = !DIEnumerator(name: "_SC_MEMLOCK", value: 17)
!829 = !DIEnumerator(name: "_SC_MEMLOCK_RANGE", value: 18)
!830 = !DIEnumerator(name: "_SC_MEMORY_PROTECTION", value: 19)
!831 = !DIEnumerator(name: "_SC_MESSAGE_PASSING", value: 20)
!832 = !DIEnumerator(name: "_SC_SEMAPHORES", value: 21)
!833 = !DIEnumerator(name: "_SC_SHARED_MEMORY_OBJECTS", value: 22)
!834 = !DIEnumerator(name: "_SC_AIO_LISTIO_MAX", value: 23)
!835 = !DIEnumerator(name: "_SC_AIO_MAX", value: 24)
!836 = !DIEnumerator(name: "_SC_AIO_PRIO_DELTA_MAX", value: 25)
!837 = !DIEnumerator(name: "_SC_DELAYTIMER_MAX", value: 26)
!838 = !DIEnumerator(name: "_SC_MQ_OPEN_MAX", value: 27)
!839 = !DIEnumerator(name: "_SC_MQ_PRIO_MAX", value: 28)
!840 = !DIEnumerator(name: "_SC_VERSION", value: 29)
!841 = !DIEnumerator(name: "_SC_PAGESIZE", value: 30)
!842 = !DIEnumerator(name: "_SC_RTSIG_MAX", value: 31)
!843 = !DIEnumerator(name: "_SC_SEM_NSEMS_MAX", value: 32)
!844 = !DIEnumerator(name: "_SC_SEM_VALUE_MAX", value: 33)
!845 = !DIEnumerator(name: "_SC_SIGQUEUE_MAX", value: 34)
!846 = !DIEnumerator(name: "_SC_TIMER_MAX", value: 35)
!847 = !DIEnumerator(name: "_SC_BC_BASE_MAX", value: 36)
!848 = !DIEnumerator(name: "_SC_BC_DIM_MAX", value: 37)
!849 = !DIEnumerator(name: "_SC_BC_SCALE_MAX", value: 38)
!850 = !DIEnumerator(name: "_SC_BC_STRING_MAX", value: 39)
!851 = !DIEnumerator(name: "_SC_COLL_WEIGHTS_MAX", value: 40)
!852 = !DIEnumerator(name: "_SC_EQUIV_CLASS_MAX", value: 41)
!853 = !DIEnumerator(name: "_SC_EXPR_NEST_MAX", value: 42)
!854 = !DIEnumerator(name: "_SC_LINE_MAX", value: 43)
!855 = !DIEnumerator(name: "_SC_RE_DUP_MAX", value: 44)
!856 = !DIEnumerator(name: "_SC_CHARCLASS_NAME_MAX", value: 45)
!857 = !DIEnumerator(name: "_SC_2_VERSION", value: 46)
!858 = !DIEnumerator(name: "_SC_2_C_BIND", value: 47)
!859 = !DIEnumerator(name: "_SC_2_C_DEV", value: 48)
!860 = !DIEnumerator(name: "_SC_2_FORT_DEV", value: 49)
!861 = !DIEnumerator(name: "_SC_2_FORT_RUN", value: 50)
!862 = !DIEnumerator(name: "_SC_2_SW_DEV", value: 51)
!863 = !DIEnumerator(name: "_SC_2_LOCALEDEF", value: 52)
!864 = !DIEnumerator(name: "_SC_PII", value: 53)
!865 = !DIEnumerator(name: "_SC_PII_XTI", value: 54)
!866 = !DIEnumerator(name: "_SC_PII_SOCKET", value: 55)
!867 = !DIEnumerator(name: "_SC_PII_INTERNET", value: 56)
!868 = !DIEnumerator(name: "_SC_PII_OSI", value: 57)
!869 = !DIEnumerator(name: "_SC_POLL", value: 58)
!870 = !DIEnumerator(name: "_SC_SELECT", value: 59)
!871 = !DIEnumerator(name: "_SC_UIO_MAXIOV", value: 60)
!872 = !DIEnumerator(name: "_SC_IOV_MAX", value: 60)
!873 = !DIEnumerator(name: "_SC_PII_INTERNET_STREAM", value: 61)
!874 = !DIEnumerator(name: "_SC_PII_INTERNET_DGRAM", value: 62)
!875 = !DIEnumerator(name: "_SC_PII_OSI_COTS", value: 63)
!876 = !DIEnumerator(name: "_SC_PII_OSI_CLTS", value: 64)
!877 = !DIEnumerator(name: "_SC_PII_OSI_M", value: 65)
!878 = !DIEnumerator(name: "_SC_T_IOV_MAX", value: 66)
!879 = !DIEnumerator(name: "_SC_THREADS", value: 67)
!880 = !DIEnumerator(name: "_SC_THREAD_SAFE_FUNCTIONS", value: 68)
!881 = !DIEnumerator(name: "_SC_GETGR_R_SIZE_MAX", value: 69)
!882 = !DIEnumerator(name: "_SC_GETPW_R_SIZE_MAX", value: 70)
!883 = !DIEnumerator(name: "_SC_LOGIN_NAME_MAX", value: 71)
!884 = !DIEnumerator(name: "_SC_TTY_NAME_MAX", value: 72)
!885 = !DIEnumerator(name: "_SC_THREAD_DESTRUCTOR_ITERATIONS", value: 73)
!886 = !DIEnumerator(name: "_SC_THREAD_KEYS_MAX", value: 74)
!887 = !DIEnumerator(name: "_SC_THREAD_STACK_MIN", value: 75)
!888 = !DIEnumerator(name: "_SC_THREAD_THREADS_MAX", value: 76)
!889 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKADDR", value: 77)
!890 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKSIZE", value: 78)
!891 = !DIEnumerator(name: "_SC_THREAD_PRIORITY_SCHEDULING", value: 79)
!892 = !DIEnumerator(name: "_SC_THREAD_PRIO_INHERIT", value: 80)
!893 = !DIEnumerator(name: "_SC_THREAD_PRIO_PROTECT", value: 81)
!894 = !DIEnumerator(name: "_SC_THREAD_PROCESS_SHARED", value: 82)
!895 = !DIEnumerator(name: "_SC_NPROCESSORS_CONF", value: 83)
!896 = !DIEnumerator(name: "_SC_NPROCESSORS_ONLN", value: 84)
!897 = !DIEnumerator(name: "_SC_PHYS_PAGES", value: 85)
!898 = !DIEnumerator(name: "_SC_AVPHYS_PAGES", value: 86)
!899 = !DIEnumerator(name: "_SC_ATEXIT_MAX", value: 87)
!900 = !DIEnumerator(name: "_SC_PASS_MAX", value: 88)
!901 = !DIEnumerator(name: "_SC_XOPEN_VERSION", value: 89)
!902 = !DIEnumerator(name: "_SC_XOPEN_XCU_VERSION", value: 90)
!903 = !DIEnumerator(name: "_SC_XOPEN_UNIX", value: 91)
!904 = !DIEnumerator(name: "_SC_XOPEN_CRYPT", value: 92)
!905 = !DIEnumerator(name: "_SC_XOPEN_ENH_I18N", value: 93)
!906 = !DIEnumerator(name: "_SC_XOPEN_SHM", value: 94)
!907 = !DIEnumerator(name: "_SC_2_CHAR_TERM", value: 95)
!908 = !DIEnumerator(name: "_SC_2_C_VERSION", value: 96)
!909 = !DIEnumerator(name: "_SC_2_UPE", value: 97)
!910 = !DIEnumerator(name: "_SC_XOPEN_XPG2", value: 98)
!911 = !DIEnumerator(name: "_SC_XOPEN_XPG3", value: 99)
!912 = !DIEnumerator(name: "_SC_XOPEN_XPG4", value: 100)
!913 = !DIEnumerator(name: "_SC_CHAR_BIT", value: 101)
!914 = !DIEnumerator(name: "_SC_CHAR_MAX", value: 102)
!915 = !DIEnumerator(name: "_SC_CHAR_MIN", value: 103)
!916 = !DIEnumerator(name: "_SC_INT_MAX", value: 104)
!917 = !DIEnumerator(name: "_SC_INT_MIN", value: 105)
!918 = !DIEnumerator(name: "_SC_LONG_BIT", value: 106)
!919 = !DIEnumerator(name: "_SC_WORD_BIT", value: 107)
!920 = !DIEnumerator(name: "_SC_MB_LEN_MAX", value: 108)
!921 = !DIEnumerator(name: "_SC_NZERO", value: 109)
!922 = !DIEnumerator(name: "_SC_SSIZE_MAX", value: 110)
!923 = !DIEnumerator(name: "_SC_SCHAR_MAX", value: 111)
!924 = !DIEnumerator(name: "_SC_SCHAR_MIN", value: 112)
!925 = !DIEnumerator(name: "_SC_SHRT_MAX", value: 113)
!926 = !DIEnumerator(name: "_SC_SHRT_MIN", value: 114)
!927 = !DIEnumerator(name: "_SC_UCHAR_MAX", value: 115)
!928 = !DIEnumerator(name: "_SC_UINT_MAX", value: 116)
!929 = !DIEnumerator(name: "_SC_ULONG_MAX", value: 117)
!930 = !DIEnumerator(name: "_SC_USHRT_MAX", value: 118)
!931 = !DIEnumerator(name: "_SC_NL_ARGMAX", value: 119)
!932 = !DIEnumerator(name: "_SC_NL_LANGMAX", value: 120)
!933 = !DIEnumerator(name: "_SC_NL_MSGMAX", value: 121)
!934 = !DIEnumerator(name: "_SC_NL_NMAX", value: 122)
!935 = !DIEnumerator(name: "_SC_NL_SETMAX", value: 123)
!936 = !DIEnumerator(name: "_SC_NL_TEXTMAX", value: 124)
!937 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFF32", value: 125)
!938 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126)
!939 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127)
!940 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128)
!941 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129)
!942 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130)
!943 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131)
!944 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132)
!945 = !DIEnumerator(name: "_SC_BARRIERS", value: 133)
!946 = !DIEnumerator(name: "_SC_BASE", value: 134)
!947 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135)
!948 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136)
!949 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!950 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!951 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!952 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!953 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!954 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!955 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!956 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!957 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!958 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!959 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!960 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!961 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!962 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!963 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!964 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!965 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!966 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!967 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!968 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!969 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!970 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!971 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!972 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!973 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!974 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!975 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!976 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!977 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!978 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!979 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!980 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!981 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!982 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!983 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!984 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!985 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!986 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!987 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!988 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!989 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!990 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!991 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!992 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!993 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!994 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!995 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!996 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!997 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!998 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!999 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!1000 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!1001 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!1002 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!1003 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!1004 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!1005 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!1006 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!1007 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!1008 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!1009 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!1010 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!1011 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!1012 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!1013 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!1014 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!1015 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!1016 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!1017 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!1018 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!1019 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!1020 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!1021 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!1022 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!1023 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!1024 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!1025 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!1026 = !{!1027}
!1027 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1028 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1029, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, retainedTypes: !1030)
!1029 = !DIFile(filename: "./lib/readtokens0.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1030 = !{!53, !51, !54, !1031}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1034 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1035, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1036)
!1035 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1036 = !{!1037}
!1037 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1039, file: !1038, line: 62, size: 32, elements: !1053)
!1038 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1039 = distinct !DISubprogram(name: "safe_read", scope: !1038, file: !1038, line: 56, type: !1040, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, unit: !1034, variables: !1042)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!54, !57, !53, !54}
!1042 = !{!1043, !1044, !1045, !1046}
!1043 = !DILocalVariable(name: "fd", arg: 1, scope: !1039, file: !1038, line: 56, type: !57)
!1044 = !DILocalVariable(name: "buf", arg: 2, scope: !1039, file: !1038, line: 56, type: !53)
!1045 = !DILocalVariable(name: "count", arg: 3, scope: !1039, file: !1038, line: 56, type: !54)
!1046 = !DILocalVariable(name: "result", scope: !1047, file: !1038, line: 66, type: !1050)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !1038, line: 65, column: 5)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !1038, line: 64, column: 3)
!1049 = distinct !DILexicalBlock(scope: !1039, file: !1038, line: 64, column: 3)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !1051, line: 109, baseType: !1052)
!1051 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !87, line: 181, baseType: !103)
!1053 = !{!1054}
!1054 = !DIEnumerator(name: "BUGGY_READ_MAXIMUM", value: 2147475456)
!1055 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1056, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1057, retainedTypes: !798)
!1056 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1057 = !{!1058}
!1058 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1059, line: 41, size: 32, elements: !1060)
!1059 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1060 = !{!1061}
!1061 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!1062 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1063, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1064, retainedTypes: !1077)
!1063 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1064 = !{!1065}
!1065 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1067, file: !1066, line: 192, size: 32, elements: !1075)
!1066 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1067 = distinct !DISubprogram(name: "x2nrealloc", scope: !1066, file: !1066, line: 180, type: !1068, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !1062, variables: !1070)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!53, !53, !129, !54}
!1070 = !{!1071, !1072, !1073, !1074}
!1071 = !DILocalVariable(name: "p", arg: 1, scope: !1067, file: !1066, line: 180, type: !53)
!1072 = !DILocalVariable(name: "pn", arg: 2, scope: !1067, file: !1066, line: 180, type: !129)
!1073 = !DILocalVariable(name: "s", arg: 3, scope: !1067, file: !1066, line: 180, type: !54)
!1074 = !DILocalVariable(name: "n", scope: !1067, file: !1066, line: 182, type: !54)
!1075 = !{!1076}
!1076 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1077 = !{!54, !51, !53}
!1078 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1079, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342)
!1079 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1080 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1081, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, retainedTypes: !798)
!1081 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1082 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1083, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342)
!1083 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1084 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1085, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, retainedTypes: !798)
!1085 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1086 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1087, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, retainedTypes: !798)
!1087 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1088 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1089, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, retainedTypes: !1090)
!1089 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1090 = !{!54}
!1091 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1092, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342)
!1092 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1093 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1094, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342)
!1094 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1095 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!1096 = !{i32 2, !"Dwarf Version", i32 4}
!1097 = !{i32 2, !"Debug Info Version", i32 3}
!1098 = !{i32 1, !"wchar_size", i32 4}
!1099 = !{i32 7, !"PIC Level", i32 2}
!1100 = !{i32 7, !"PIE Level", i32 2}
!1101 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 109, type: !1102, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !1104)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{null, !57}
!1104 = !{!1105}
!1105 = !DILocalVariable(name: "status", arg: 1, scope: !1101, file: !3, line: 109, type: !57)
!1106 = !DIExpression()
!1107 = !DILocation(line: 109, column: 12, scope: !1101)
!1108 = !DILocation(line: 111, column: 14, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 111, column: 7)
!1110 = !DILocation(line: 111, column: 7, scope: !1101)
!1111 = !DILocation(line: 112, column: 5, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 112, column: 5)
!1113 = !{!1114, !1114, i64 0}
!1114 = !{!"any pointer", !1115, i64 0}
!1115 = !{!"omnipotent char", !1116, i64 0}
!1116 = !{!"Simple C/C++ TBAA"}
!1117 = !DILocation(line: 115, column: 7, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 114, column: 5)
!1119 = !DILocation(line: 120, column: 7, scope: !1118)
!1120 = !DILocation(line: 580, column: 3, scope: !1121, inlinedAt: !1122)
!1121 = distinct !DISubprogram(name: "emit_stdin_note", scope: !285, file: !285, line: 578, type: !445, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !342)
!1122 = distinct !DILocation(line: 126, column: 7, scope: !1118)
!1123 = !DILocation(line: 128, column: 7, scope: !1118)
!1124 = !DILocation(line: 136, column: 7, scope: !1118)
!1125 = !DILocation(line: 143, column: 7, scope: !1118)
!1126 = !DILocation(line: 144, column: 7, scope: !1118)
!1127 = !DILocation(line: 642, column: 15, scope: !284, inlinedAt: !1128)
!1128 = distinct !DILocation(line: 145, column: 7, scope: !1118)
!1129 = !DILocation(line: 651, column: 3, scope: !284, inlinedAt: !1128)
!1130 = !DILocation(line: 655, column: 29, scope: !284, inlinedAt: !1128)
!1131 = !DILocation(line: 655, column: 15, scope: !284, inlinedAt: !1128)
!1132 = !DILocation(line: 656, column: 7, scope: !1133, inlinedAt: !1128)
!1133 = distinct !DILexicalBlock(scope: !284, file: !285, line: 656, column: 7)
!1134 = !DILocation(line: 656, column: 19, scope: !1133, inlinedAt: !1128)
!1135 = !DILocation(line: 656, column: 22, scope: !1133, inlinedAt: !1128)
!1136 = !DILocation(line: 656, column: 7, scope: !284, inlinedAt: !1128)
!1137 = !DILocation(line: 662, column: 7, scope: !1138, inlinedAt: !1128)
!1138 = distinct !DILexicalBlock(scope: !1133, file: !285, line: 657, column: 5)
!1139 = !DILocation(line: 664, column: 5, scope: !1138, inlinedAt: !1128)
!1140 = !DILocation(line: 665, column: 3, scope: !284, inlinedAt: !1128)
!1141 = !DILocation(line: 667, column: 3, scope: !284, inlinedAt: !1128)
!1142 = !DILocation(line: 147, column: 3, scope: !1101)
!1143 = !DILocation(line: 648, column: 11, scope: !63)
!1144 = !DILocation(line: 648, column: 24, scope: !63)
!1145 = !DILocation(line: 654, column: 9, scope: !63)
!1146 = !DILocation(line: 656, column: 3, scope: !63)
!1147 = !DILocation(line: 659, column: 21, scope: !63)
!1148 = !DILocation(line: 659, column: 3, scope: !63)
!1149 = !DILocation(line: 660, column: 3, scope: !63)
!1150 = !DILocation(line: 661, column: 3, scope: !63)
!1151 = !DILocation(line: 662, column: 3, scope: !63)
!1152 = !DILocation(line: 664, column: 3, scope: !63)
!1153 = !DILocation(line: 666, column: 15, scope: !63)
!1154 = !DILocation(line: 666, column: 13, scope: !63)
!1155 = !{!1156, !1156, i64 0}
!1156 = !{!"long", !1115, i64 0}
!1157 = !DILocation(line: 669, column: 12, scope: !63)
!1158 = !DILocation(line: 669, column: 3, scope: !63)
!1159 = !DILocation(line: 673, column: 75, scope: !63)
!1160 = !DILocation(line: 673, column: 57, scope: !63)
!1161 = !DILocation(line: 673, column: 43, scope: !63)
!1162 = !DILocation(line: 673, column: 29, scope: !63)
!1163 = !DILocation(line: 673, column: 15, scope: !63)
!1164 = !DILocation(line: 675, column: 3, scope: !63)
!1165 = !DILocation(line: 675, column: 18, scope: !63)
!1166 = !DILocation(line: 651, column: 7, scope: !63)
!1167 = !DILocation(line: 680, column: 9, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !63, file: !3, line: 677, column: 7)
!1169 = !DILocation(line: 688, column: 9, scope: !1168)
!1170 = !DILocation(line: 692, column: 9, scope: !1168)
!1171 = !DILocation(line: 696, column: 9, scope: !1168)
!1172 = distinct !{!1172, !1164, !1173}
!1173 = !DILocation(line: 708, column: 7, scope: !63)
!1174 = !DILocation(line: 699, column: 22, scope: !1168)
!1175 = !DILocation(line: 700, column: 9, scope: !1168)
!1176 = !DILocation(line: 702, column: 7, scope: !1168)
!1177 = !DILocation(line: 704, column: 7, scope: !1168)
!1178 = !DILocation(line: 707, column: 9, scope: !1168)
!1179 = !DILocation(line: 710, column: 22, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !63, file: !3, line: 710, column: 7)
!1181 = !DILocation(line: 710, column: 37, scope: !1180)
!1182 = !DILocation(line: 710, column: 52, scope: !1180)
!1183 = !DILocation(line: 711, column: 10, scope: !1180)
!1184 = !DILocation(line: 710, column: 7, scope: !63)
!1185 = !DILocation(line: 712, column: 5, scope: !1180)
!1186 = !DILocation(line: 714, column: 8, scope: !63)
!1187 = !DILocation(line: 716, column: 7, scope: !188)
!1188 = !{!1189, !1189, i64 0}
!1189 = !{!"int", !1115, i64 0}
!1190 = !DILocation(line: 716, column: 7, scope: !63)
!1191 = !DILocation(line: 722, column: 11, scope: !187)
!1192 = !DILocation(line: 724, column: 24, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 723, column: 9)
!1194 = distinct !DILexicalBlock(scope: !187, file: !3, line: 722, column: 11)
!1195 = !DILocation(line: 724, column: 47, scope: !1193)
!1196 = !DILocation(line: 724, column: 11, scope: !1193)
!1197 = !DILocation(line: 725, column: 11, scope: !1193)
!1198 = !DILocation(line: 727, column: 11, scope: !1193)
!1199 = !DILocation(line: 730, column: 11, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !187, file: !3, line: 730, column: 11)
!1201 = !DILocation(line: 730, column: 11, scope: !187)
!1202 = !DILocation(line: 731, column: 18, scope: !1200)
!1203 = !DILocation(line: 718, column: 13, scope: !187)
!1204 = !DILocation(line: 731, column: 9, scope: !1200)
!1205 = !DILocation(line: 734, column: 20, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1200, file: !3, line: 733, column: 9)
!1207 = !DILocation(line: 735, column: 22, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1206, file: !3, line: 735, column: 15)
!1209 = !DILocation(line: 735, column: 15, scope: !1206)
!1210 = !DILocation(line: 736, column: 13, scope: !1208)
!1211 = !DILocation(line: 742, column: 7, scope: !187)
!1212 = !DILocation(line: 743, column: 18, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !187, file: !3, line: 743, column: 11)
!1214 = !DILocation(line: 742, column: 19, scope: !187)
!1215 = !DILocalVariable(name: "__fd", arg: 1, scope: !1216, file: !1217, line: 463, type: !57)
!1216 = distinct !DISubprogram(name: "fstat", scope: !1217, file: !1217, line: 463, type: !1218, isLocal: false, isDefinition: true, scopeLine: 464, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1221)
!1217 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!57, !57, !1220}
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!1221 = !{!1215, !1222}
!1222 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1216, file: !1217, line: 463, type: !1220)
!1223 = !DILocation(line: 463, column: 1, scope: !1216, inlinedAt: !1224)
!1224 = distinct !DILocation(line: 743, column: 11, scope: !1213)
!1225 = !DILocation(line: 465, column: 10, scope: !1216, inlinedAt: !1224)
!1226 = !DILocation(line: 743, column: 40, scope: !1213)
!1227 = !DILocation(line: 744, column: 11, scope: !1213)
!1228 = !DILocation(line: 744, column: 14, scope: !1213)
!1229 = !{!1230, !1189, i64 24}
!1230 = !{!"stat", !1156, i64 0, !1156, i64 8, !1156, i64 16, !1189, i64 24, !1189, i64 28, !1189, i64 32, !1189, i64 36, !1156, i64 40, !1156, i64 48, !1156, i64 56, !1156, i64 64, !1231, i64 72, !1231, i64 88, !1231, i64 104, !1115, i64 120}
!1231 = !{!"timespec", !1156, i64 0, !1156, i64 8}
!1232 = !DILocation(line: 745, column: 11, scope: !1213)
!1233 = !DILocation(line: 745, column: 17, scope: !1213)
!1234 = !{!1230, !1156, i64 48}
!1235 = !DILocation(line: 745, column: 14, scope: !1213)
!1236 = !DILocation(line: 745, column: 28, scope: !1213)
!1237 = !DILocation(line: 745, column: 25, scope: !1213)
!1238 = !DILocation(line: 743, column: 11, scope: !187)
!1239 = !DILocation(line: 656, column: 17, scope: !63)
!1240 = !DILocation(line: 748, column: 11, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1213, file: !3, line: 746, column: 9)
!1242 = !DILocation(line: 749, column: 17, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1241, file: !3, line: 749, column: 15)
!1244 = !DILocation(line: 749, column: 44, scope: !1243)
!1245 = !DILocation(line: 749, column: 47, scope: !1243)
!1246 = !DILocation(line: 749, column: 63, scope: !1243)
!1247 = !DILocation(line: 749, column: 15, scope: !1241)
!1248 = !DILocation(line: 750, column: 13, scope: !1243)
!1249 = !DILocation(line: 752, column: 23, scope: !1241)
!1250 = !{!1251, !1114, i64 8}
!1251 = !{!"Tokens", !1156, i64 0, !1114, i64 8, !1114, i64 16, !1252, i64 24, !1252, i64 112, !1252, i64 200}
