; ModuleID = 'coreutils-8.27/src/who.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!17 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!18 = !DIEnumerator(name: "c_quoting_style", value: 5)
!19 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!20 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!21 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!22 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!23 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!24 = !{!25, !27, !28, !32, !33}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !29, line: 7, baseType: !30)
!29 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !31, line: 148, baseType: !32)
!31 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!32 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!33 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!34 = !{!35, !38, !40, !42, !44, !46, !48, !50, !52, !54, !56, !58, !60, !62, !64, !66, !70, !73, !0, !93, !125, !231, !235, !246, !251, !278, !288, !290}
!35 = !DIGlobalVariableExpression(var: !36)
!36 = distinct !DIGlobalVariable(name: "do_lookup", scope: !2, file: !3, line: 102, type: !37, isLocal: true, isDefinition: true)
!37 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!38 = !DIGlobalVariableExpression(var: !39)
!39 = distinct !DIGlobalVariable(name: "short_list", scope: !2, file: !3, line: 107, type: !37, isLocal: true, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41)
!41 = distinct !DIGlobalVariable(name: "short_output", scope: !2, file: !3, line: 110, type: !37, isLocal: true, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43)
!43 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 115, type: !37, isLocal: true, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45)
!45 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 118, type: !37, isLocal: true, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47)
!47 = distinct !DIGlobalVariable(name: "include_mesg", scope: !2, file: !3, line: 122, type: !37, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49)
!49 = distinct !DIGlobalVariable(name: "include_exit", scope: !2, file: !3, line: 125, type: !37, isLocal: true, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51)
!51 = distinct !DIGlobalVariable(name: "need_boottime", scope: !2, file: !3, line: 128, type: !37, isLocal: true, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53)
!53 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !2, file: !3, line: 131, type: !37, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55)
!55 = distinct !DIGlobalVariable(name: "need_login", scope: !2, file: !3, line: 134, type: !37, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57)
!57 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !2, file: !3, line: 137, type: !37, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59)
!59 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !2, file: !3, line: 140, type: !37, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61)
!61 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !2, file: !3, line: 143, type: !37, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63)
!63 = distinct !DIGlobalVariable(name: "need_users", scope: !2, file: !3, line: 146, type: !37, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65)
!65 = distinct !DIGlobalVariable(name: "my_line_only", scope: !2, file: !3, line: 149, type: !37, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariableExpression(var: !67)
!67 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 153, type: !68, isLocal: true, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!70 = !DIGlobalVariableExpression(var: !71)
!71 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 154, type: !72, isLocal: true, isDefinition: true)
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !DIGlobalVariableExpression(var: !74)
!74 = distinct !DIGlobalVariable(name: "infomap", scope: !75, file: !76, line: 632, type: !90, isLocal: true, isDefinition: true)
!75 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !76, file: !76, line: 630, type: !77, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !79)
!76 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!77 = !DISubroutineType(types: !78)
!78 = !{null, !68}
!79 = !{!80, !81, !82, !89}
!80 = !DILocalVariable(name: "program", arg: 1, scope: !75, file: !76, line: 630, type: !68)
!81 = !DILocalVariable(name: "node", scope: !75, file: !76, line: 642, type: !68)
!82 = !DILocalVariable(name: "map_prog", scope: !75, file: !76, line: 643, type: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !75, file: !76, line: 632, size: 128, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !85, file: !76, line: 632, baseType: !68, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !85, file: !76, line: 632, baseType: !68, size: 64, offset: 64)
!89 = !DILocalVariable(name: "lc_messages", scope: !75, file: !76, line: 655, type: !68)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 896, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 7)
!93 = !DIGlobalVariableExpression(var: !94)
!94 = distinct !DIGlobalVariable(name: "mesg", scope: !95, file: !3, line: 249, type: !122, isLocal: true, isDefinition: true)
!95 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !96, isLocal: true, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !98)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !72, !68, !69, !72, !68, !68, !68, !68, !68, !68}
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !114, !118, !119, !120}
!99 = !DILocalVariable(name: "userlen", arg: 1, scope: !95, file: !3, line: 244, type: !72)
!100 = !DILocalVariable(name: "user", arg: 2, scope: !95, file: !3, line: 244, type: !68)
!101 = !DILocalVariable(name: "state", arg: 3, scope: !95, file: !3, line: 244, type: !69)
!102 = !DILocalVariable(name: "linelen", arg: 4, scope: !95, file: !3, line: 245, type: !72)
!103 = !DILocalVariable(name: "line", arg: 5, scope: !95, file: !3, line: 245, type: !68)
!104 = !DILocalVariable(name: "time_str", arg: 6, scope: !95, file: !3, line: 246, type: !68)
!105 = !DILocalVariable(name: "idle", arg: 7, scope: !95, file: !3, line: 246, type: !68)
!106 = !DILocalVariable(name: "pid", arg: 8, scope: !95, file: !3, line: 246, type: !68)
!107 = !DILocalVariable(name: "comment", arg: 9, scope: !95, file: !3, line: 247, type: !68)
!108 = !DILocalVariable(name: "exitstr", arg: 10, scope: !95, file: !3, line: 247, type: !68)
!109 = !DILocalVariable(name: "buf", scope: !95, file: !3, line: 250, type: !25)
!110 = !DILocalVariable(name: "x_idle", scope: !95, file: !3, line: 251, type: !111)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 8)
!114 = !DILocalVariable(name: "x_pid", scope: !95, file: !3, line: 252, type: !115)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 104, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 13)
!118 = !DILocalVariable(name: "x_exitstr", scope: !95, file: !3, line: 253, type: !25)
!119 = !DILocalVariable(name: "err", scope: !95, file: !3, line: 254, type: !72)
!120 = !DILocalVariable(name: "p", scope: !121, file: !3, line: 303, type: !25)
!121 = distinct !DILexicalBlock(scope: !95, file: !3, line: 301, column: 3)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 24, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 3)
!125 = !DIGlobalVariableExpression(var: !126)
!126 = distinct !DIGlobalVariable(name: "hoststr", scope: !127, file: !3, line: 339, type: !25, isLocal: true, isDefinition: true)
!127 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !128, isLocal: true, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !170)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !130, !28}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !6, line: 146, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !134, line: 55, size: 3072, elements: !135)
!134 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!135 = !{!136, !137, !139, !143, !147, !148, !152, !157, !159, !164, !166}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !133, file: !134, line: 57, baseType: !33, size: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !133, file: !134, line: 58, baseType: !138, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !31, line: 142, baseType: !72)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !133, file: !134, line: 59, baseType: !140, size: 256, offset: 64)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 256, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !133, file: !134, line: 60, baseType: !144, size: 32, offset: 320)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 4)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !133, file: !134, line: 61, baseType: !140, size: 256, offset: 352)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !133, file: !134, line: 62, baseType: !149, size: 2048, offset: 608)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !133, file: !134, line: 63, baseType: !153, size: 32, offset: 2656)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !134, line: 42, size: 32, elements: !154)
!154 = !{!155, !156}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !153, file: !134, line: 45, baseType: !33, size: 16)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !153, file: !134, line: 46, baseType: !33, size: 16, offset: 16)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !133, file: !134, line: 70, baseType: !158, size: 32, offset: 2688)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !31, line: 40, baseType: !72)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !133, file: !134, line: 75, baseType: !160, size: 64, offset: 2720)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !133, file: !134, line: 71, size: 64, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !160, file: !134, line: 73, baseType: !158, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !160, file: !134, line: 74, baseType: !158, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !133, file: !134, line: 80, baseType: !165, size: 128, offset: 2784)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 128, elements: !145)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !133, file: !134, line: 81, baseType: !167, size: 160, offset: 2912)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 20)
!170 = !{!171, !172, !173, !210, !211, !212, !214, !218, !219, !223, !229, !230}
!171 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !127, file: !3, line: 333, type: !130)
!172 = !DILocalVariable(name: "boottime", arg: 2, scope: !127, file: !3, line: 333, type: !28)
!173 = !DILocalVariable(name: "stats", scope: !127, file: !3, line: 335, type: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !175, line: 46, size: 1152, elements: !176)
!175 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!176 = !{!177, !180, !182, !184, !187, !189, !191, !192, !193, !195, !197, !199, !206, !207, !208}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !174, file: !175, line: 48, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !31, line: 133, baseType: !179)
!179 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !174, file: !175, line: 53, baseType: !181, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !31, line: 136, baseType: !179)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !174, file: !175, line: 61, baseType: !183, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !31, line: 139, baseType: !179)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !174, file: !175, line: 62, baseType: !185, size: 32, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !31, line: 138, baseType: !186)
!186 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !174, file: !175, line: 64, baseType: !188, size: 32, offset: 224)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !31, line: 134, baseType: !186)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !174, file: !175, line: 65, baseType: !190, size: 32, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !31, line: 135, baseType: !186)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !174, file: !175, line: 67, baseType: !72, size: 32, offset: 288)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !174, file: !175, line: 69, baseType: !178, size: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !174, file: !175, line: 74, baseType: !194, size: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !31, line: 140, baseType: !32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !174, file: !175, line: 78, baseType: !196, size: 64, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !31, line: 162, baseType: !32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !174, file: !175, line: 80, baseType: !198, size: 64, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !31, line: 167, baseType: !32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !174, file: !175, line: 91, baseType: !200, size: 128, offset: 576)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !201, line: 8, size: 128, elements: !202)
!201 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !200, file: !201, line: 10, baseType: !30, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !200, file: !201, line: 11, baseType: !205, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !31, line: 184, baseType: !32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !174, file: !175, line: 92, baseType: !200, size: 128, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !174, file: !175, line: 93, baseType: !200, size: 128, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !174, file: !175, line: 106, baseType: !209, size: 192, offset: 960)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 192, elements: !123)
!210 = !DILocalVariable(name: "last_change", scope: !127, file: !3, line: 336, type: !28)
!211 = !DILocalVariable(name: "mesg", scope: !127, file: !3, line: 337, type: !26)
!212 = !DILocalVariable(name: "idlestr", scope: !127, file: !3, line: 338, type: !213)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 56, elements: !91)
!214 = !DILocalVariable(name: "line", scope: !127, file: !3, line: 347, type: !215)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 304, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 38)
!218 = !DILocalVariable(name: "p", scope: !127, file: !3, line: 348, type: !25)
!219 = !DILocalVariable(name: "pidstr", scope: !127, file: !3, line: 349, type: !220)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 96, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 12)
!223 = !DILocalVariable(name: "ut_host", scope: !224, file: !3, line: 377, type: !226)
!224 = distinct !DILexicalBlock(scope: !225, file: !3, line: 376, column: 5)
!225 = distinct !DILexicalBlock(scope: !127, file: !3, line: 375, column: 7)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2056, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 257)
!229 = !DILocalVariable(name: "host", scope: !224, file: !3, line: 378, type: !25)
!230 = !DILocalVariable(name: "display", scope: !224, file: !3, line: 379, type: !25)
!231 = !DIGlobalVariableExpression(var: !232)
!232 = distinct !DIGlobalVariable(name: "hostlen", scope: !127, file: !3, line: 341, type: !233, isLocal: true, isDefinition: true)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !234, line: 62, baseType: !179)
!234 = !DIFile(filename: "/usr/lib/clang/5.0.1/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!235 = !DIGlobalVariableExpression(var: !236)
!236 = distinct !DIGlobalVariable(name: "now", scope: !237, file: !3, line: 190, type: !28, isLocal: true, isDefinition: true)
!237 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !238, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !240)
!238 = !DISubroutineType(types: !239)
!239 = !{!68, !28, !28}
!240 = !{!241, !242, !243}
!241 = !DILocalVariable(name: "when", arg: 1, scope: !237, file: !3, line: 188, type: !28)
!242 = !DILocalVariable(name: "boottime", arg: 2, scope: !237, file: !3, line: 188, type: !28)
!243 = !DILocalVariable(name: "seconds_idle", scope: !244, file: !3, line: 197, type: !72)
!244 = distinct !DILexicalBlock(scope: !245, file: !3, line: 196, column: 5)
!245 = distinct !DILexicalBlock(scope: !237, file: !3, line: 195, column: 7)
!246 = !DIGlobalVariableExpression(var: !247)
!247 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !237, file: !3, line: 202, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 48, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 6)
!251 = !DIGlobalVariableExpression(var: !252)
!252 = distinct !DIGlobalVariable(name: "buf", scope: !253, file: !3, line: 220, type: !275, isLocal: true, isDefinition: true)
!253 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !254, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !256)
!254 = !DISubroutineType(types: !255)
!255 = !{!68, !130}
!256 = !{!257, !258, !259}
!257 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !253, file: !3, line: 218, type: !130)
!258 = !DILocalVariable(name: "t", scope: !253, file: !3, line: 228, type: !28)
!259 = !DILocalVariable(name: "tmp", scope: !253, file: !3, line: 229, type: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !262, line: 7, size: 448, elements: !263)
!262 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !261, file: !262, line: 9, baseType: !72, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !261, file: !262, line: 10, baseType: !72, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !261, file: !262, line: 11, baseType: !72, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !261, file: !262, line: 12, baseType: !72, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !261, file: !262, line: 13, baseType: !72, size: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !261, file: !262, line: 14, baseType: !72, size: 32, offset: 160)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !261, file: !262, line: 15, baseType: !72, size: 32, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !261, file: !262, line: 16, baseType: !72, size: 32, offset: 224)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !261, file: !262, line: 17, baseType: !72, size: 32, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !261, file: !262, line: 20, baseType: !32, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !261, file: !262, line: 21, baseType: !68, size: 64, offset: 384)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 264, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 33)
!278 = !DIGlobalVariableExpression(var: !279)
!279 = distinct !DIGlobalVariable(name: "runlevline", scope: !280, file: !3, line: 515, type: !25, isLocal: true, isDefinition: true)
!280 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 513, type: !281, isLocal: true, isDefinition: true, scopeLine: 514, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !283)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !130}
!283 = !{!284, !285, !287}
!284 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !280, file: !3, line: 513, type: !130)
!285 = !DILocalVariable(name: "last", scope: !280, file: !3, line: 516, type: !286)
!286 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!287 = !DILocalVariable(name: "curr", scope: !280, file: !3, line: 517, type: !286)
!288 = !DIGlobalVariableExpression(var: !289)
!289 = distinct !DIGlobalVariable(name: "comment", scope: !280, file: !3, line: 515, type: !25, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291)
!291 = distinct !DIGlobalVariable(name: "exitstr", scope: !292, file: !3, line: 460, type: !25, isLocal: true, isDefinition: true)
!292 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 458, type: !281, isLocal: true, isDefinition: true, scopeLine: 459, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !293)
!293 = !{!294, !295, !296}
!294 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !292, file: !3, line: 458, type: !130)
!295 = !DILocalVariable(name: "comment", scope: !292, file: !3, line: 461, type: !25)
!296 = !DILocalVariable(name: "pidstr", scope: !292, file: !3, line: 462, type: !220)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 4608, elements: !307)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !300, line: 50, size: 256, elements: !301)
!300 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!301 = !{!302, !303, !304, !306}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !300, line: 52, baseType: !68, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !299, file: !300, line: 55, baseType: !72, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !299, file: !300, line: 56, baseType: !305, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !299, file: !300, line: 57, baseType: !72, size: 32, offset: 192)
!307 = !{!308}
!308 = !DISubrange(count: 18)
!309 = !DIGlobalVariableExpression(var: !310)
!310 = distinct !DIGlobalVariable(name: "Version", scope: !311, file: !312, line: 2, type: !68, isLocal: false, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, globals: !314)
!312 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!313 = !{}
!314 = !{!309}
!315 = !DIGlobalVariableExpression(var: !316)
!316 = distinct !DIGlobalVariable(name: "last_cherror", scope: !317, file: !323, line: 28, type: !72, isLocal: true, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, globals: !319)
!318 = !DIFile(filename: "./lib/canon-host.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!319 = !{!320, !315}
!320 = !DIGlobalVariableExpression(var: !321)
!321 = distinct !DIGlobalVariable(name: "hints", scope: !322, file: !323, line: 63, type: !332, isLocal: true, isDefinition: true)
!322 = distinct !DISubprogram(name: "canon_host_r", scope: !323, file: !323, line: 60, type: !324, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, unit: !317, variables: !326)
!323 = !DIFile(filename: "lib/canon-host.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!324 = !DISubroutineType(types: !325)
!325 = !{!25, !68, !305}
!326 = !{!327, !328, !329, !330, !357}
!327 = !DILocalVariable(name: "host", arg: 1, scope: !322, file: !323, line: 60, type: !68)
!328 = !DILocalVariable(name: "cherror", arg: 2, scope: !322, file: !323, line: 60, type: !305)
!329 = !DILocalVariable(name: "retval", scope: !322, file: !323, line: 62, type: !25)
!330 = !DILocalVariable(name: "res", scope: !322, file: !323, line: 64, type: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !333, line: 565, size: 384, elements: !334)
!333 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!334 = !{!335, !336, !337, !338, !339, !343, !355, !356}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !332, file: !333, line: 567, baseType: !72, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !332, file: !333, line: 568, baseType: !72, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !332, file: !333, line: 569, baseType: !72, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !332, file: !333, line: 570, baseType: !72, size: 32, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !332, file: !333, line: 571, baseType: !340, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !341, line: 33, baseType: !342)
!341 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !31, line: 198, baseType: !186)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !332, file: !333, line: 572, baseType: !344, size: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !341, line: 174, size: 128, elements: !346)
!346 = !{!347, !351}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !345, file: !341, line: 176, baseType: !348, size: 16)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !349, line: 28, baseType: !350)
!349 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!350 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !345, file: !341, line: 177, baseType: !352, size: 112, offset: 16)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 112, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 14)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !332, file: !333, line: 573, baseType: !25, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !332, file: !333, line: 574, baseType: !331, size: 64, offset: 320)
!357 = !DILocalVariable(name: "status", scope: !322, file: !323, line: 65, type: !72)
!358 = !DIGlobalVariableExpression(var: !359)
!359 = distinct !DIGlobalVariable(name: "file_name", scope: !360, file: !365, line: 36, type: !68, isLocal: true, isDefinition: true)
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, globals: !362)
!361 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!362 = !{!358, !363}
!363 = !DIGlobalVariableExpression(var: !364)
!364 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !360, file: !365, line: 46, type: !37, isLocal: true, isDefinition: true)
!365 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!366 = !DIGlobalVariableExpression(var: !367)
!367 = distinct !DIGlobalVariable(name: "exit_failure", scope: !368, file: !371, line: 24, type: !372, isLocal: false, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, globals: !370)
!369 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!370 = !{!366}
!371 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!372 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !72)
!373 = !DIGlobalVariableExpression(var: !374)
!374 = distinct !DIGlobalVariable(name: "program_name", scope: !375, file: !379, line: 33, type: !68, isLocal: false, isDefinition: true)
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !377, globals: !378)
!376 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!377 = !{!27, !25}
!378 = !{!373}
!379 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!380 = !DIGlobalVariableExpression(var: !381)
!381 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !382, file: !409, line: 77, type: !439, isLocal: false, isDefinition: true)
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !384, retainedTypes: !405, globals: !406)
!383 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!384 = !{!10, !385, !390}
!385 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !11, line: 242, size: 32, elements: !386)
!386 = !{!387, !388, !389}
!387 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!388 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!389 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!390 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !391, line: 46, size: 32, elements: !392)
!391 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!393 = !DIEnumerator(name: "_ISupper", value: 256)
!394 = !DIEnumerator(name: "_ISlower", value: 512)
!395 = !DIEnumerator(name: "_ISalpha", value: 1024)
!396 = !DIEnumerator(name: "_ISdigit", value: 2048)
!397 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!398 = !DIEnumerator(name: "_ISspace", value: 8192)
!399 = !DIEnumerator(name: "_ISprint", value: 16384)
!400 = !DIEnumerator(name: "_ISgraph", value: 32768)
!401 = !DIEnumerator(name: "_ISblank", value: 1)
!402 = !DIEnumerator(name: "_IScntrl", value: 2)
!403 = !DIEnumerator(name: "_ISpunct", value: 4)
!404 = !DIEnumerator(name: "_ISalnum", value: 8)
!405 = !{!72, !350, !233, !25}
!406 = !{!380, !407, !414, !424, !426, !428, !435, !437}
!407 = !DIGlobalVariableExpression(var: !408)
!408 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !382, file: !409, line: 93, type: !410, isLocal: false, isDefinition: true)
!409 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 320, elements: !412)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!412 = !{!413}
!413 = !DISubrange(count: 10)
!414 = !DIGlobalVariableExpression(var: !415)
!415 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !382, file: !409, line: 1043, type: !416, isLocal: false, isDefinition: true)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !409, line: 57, size: 448, elements: !417)
!417 = !{!418, !419, !420, !422, !423}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !416, file: !409, line: 60, baseType: !10, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !416, file: !409, line: 63, baseType: !72, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !416, file: !409, line: 67, baseType: !421, size: 256, offset: 64)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 256, elements: !112)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !416, file: !409, line: 70, baseType: !68, size: 64, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !416, file: !409, line: 73, baseType: !68, size: 64, offset: 384)
!424 = !DIGlobalVariableExpression(var: !425)
!425 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !382, file: !409, line: 108, type: !416, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427)
!427 = distinct !DIGlobalVariable(name: "slot0", scope: !382, file: !409, line: 834, type: !149, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429)
!429 = distinct !DIGlobalVariable(name: "slotvec", scope: !382, file: !409, line: 837, type: !430, isLocal: true, isDefinition: true)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !409, line: 826, size: 128, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !431, file: !409, line: 828, baseType: !233, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !431, file: !409, line: 829, baseType: !25, size: 64, offset: 64)
!435 = !DIGlobalVariableExpression(var: !436)
!436 = distinct !DIGlobalVariable(name: "nslots", scope: !382, file: !409, line: 835, type: !72, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438)
!438 = distinct !DIGlobalVariable(name: "slotvec0", scope: !382, file: !409, line: 836, type: !431, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 704, elements: !441)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!441 = !{!442}
!442 = !DISubrange(count: 11)
!443 = !DIGlobalVariableExpression(var: !444)
!444 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !445, file: !448, line: 26, type: !449, isLocal: false, isDefinition: true)
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, globals: !447)
!446 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!447 = !{!443}
!448 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 376, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 47)
!452 = !DIGlobalVariableExpression(var: !453)
!453 = distinct !DIGlobalVariable(name: "charset_aliases", scope: !454, file: !798, line: 120, type: !799, isLocal: true, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !456, retainedTypes: !795, globals: !797)
!455 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!456 = !{!457}
!457 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !458, line: 41, size: 32, elements: !459)
!458 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794}
!460 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!461 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!462 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!463 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!464 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!465 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!466 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!467 = !DIEnumerator(name: "DAY_1", value: 131079)
!468 = !DIEnumerator(name: "DAY_2", value: 131080)
!469 = !DIEnumerator(name: "DAY_3", value: 131081)
!470 = !DIEnumerator(name: "DAY_4", value: 131082)
!471 = !DIEnumerator(name: "DAY_5", value: 131083)
!472 = !DIEnumerator(name: "DAY_6", value: 131084)
!473 = !DIEnumerator(name: "DAY_7", value: 131085)
!474 = !DIEnumerator(name: "ABMON_1", value: 131086)
!475 = !DIEnumerator(name: "ABMON_2", value: 131087)
!476 = !DIEnumerator(name: "ABMON_3", value: 131088)
!477 = !DIEnumerator(name: "ABMON_4", value: 131089)
!478 = !DIEnumerator(name: "ABMON_5", value: 131090)
!479 = !DIEnumerator(name: "ABMON_6", value: 131091)
!480 = !DIEnumerator(name: "ABMON_7", value: 131092)
!481 = !DIEnumerator(name: "ABMON_8", value: 131093)
!482 = !DIEnumerator(name: "ABMON_9", value: 131094)
!483 = !DIEnumerator(name: "ABMON_10", value: 131095)
!484 = !DIEnumerator(name: "ABMON_11", value: 131096)
!485 = !DIEnumerator(name: "ABMON_12", value: 131097)
!486 = !DIEnumerator(name: "MON_1", value: 131098)
!487 = !DIEnumerator(name: "MON_2", value: 131099)
!488 = !DIEnumerator(name: "MON_3", value: 131100)
!489 = !DIEnumerator(name: "MON_4", value: 131101)
!490 = !DIEnumerator(name: "MON_5", value: 131102)
!491 = !DIEnumerator(name: "MON_6", value: 131103)
!492 = !DIEnumerator(name: "MON_7", value: 131104)
!493 = !DIEnumerator(name: "MON_8", value: 131105)
!494 = !DIEnumerator(name: "MON_9", value: 131106)
!495 = !DIEnumerator(name: "MON_10", value: 131107)
!496 = !DIEnumerator(name: "MON_11", value: 131108)
!497 = !DIEnumerator(name: "MON_12", value: 131109)
!498 = !DIEnumerator(name: "AM_STR", value: 131110)
!499 = !DIEnumerator(name: "PM_STR", value: 131111)
!500 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!501 = !DIEnumerator(name: "D_FMT", value: 131113)
!502 = !DIEnumerator(name: "T_FMT", value: 131114)
!503 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!504 = !DIEnumerator(name: "ERA", value: 131116)
!505 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!506 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!507 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!508 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!509 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!510 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!511 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!512 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!513 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!514 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!515 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!516 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!517 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!518 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!519 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!520 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!521 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!522 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!523 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!524 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!525 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!526 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!527 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!528 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!529 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!530 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!531 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!532 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!533 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!534 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!535 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!536 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!537 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!538 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!539 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!540 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!541 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!542 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!543 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!544 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!545 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!546 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!547 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!548 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!549 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!550 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!551 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!552 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!553 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!554 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!555 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!556 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!557 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!558 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!559 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!560 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!561 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!562 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!563 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!564 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!565 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!566 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!567 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!568 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!569 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!570 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!571 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!572 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!573 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!574 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!575 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!576 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!577 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!578 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!579 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!580 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!581 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!582 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!583 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!584 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!585 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!586 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!587 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!588 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!589 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!590 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!591 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!592 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!593 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!594 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!595 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!596 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!597 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!598 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!599 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!600 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!601 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!602 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!603 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!604 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!605 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!606 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!607 = !DIEnumerator(name: "CODESET", value: 14)
!608 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!609 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!610 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!611 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!612 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!613 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!614 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!615 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!616 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!617 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!618 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!619 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!620 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!621 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!622 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!623 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!624 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!625 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!626 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!627 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!628 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!629 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!630 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!631 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!632 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!633 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!634 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!635 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!636 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!637 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!638 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!639 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!640 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!641 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!642 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!643 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!644 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!645 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!646 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!647 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!648 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!649 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!650 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!651 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!652 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!653 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!654 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!655 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!656 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!657 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!658 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!659 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!660 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!661 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!662 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!663 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!664 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!665 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!666 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!667 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!668 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!669 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!670 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!671 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!672 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!673 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!674 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!675 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!676 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!677 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!678 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!679 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!680 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!681 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!682 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!683 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!684 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!685 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!686 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!687 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!688 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!689 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!690 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!691 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!692 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!693 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!694 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!695 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!696 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!697 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!698 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!699 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!700 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!701 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!702 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!703 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!704 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!705 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!706 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!707 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!708 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!709 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!710 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!711 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!712 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!713 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!714 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!715 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!716 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!717 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!718 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!719 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!720 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!721 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!722 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!723 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!724 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!725 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!726 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!727 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!728 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!729 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!730 = !DIEnumerator(name: "THOUSEP", value: 65537)
!731 = !DIEnumerator(name: "__GROUPING", value: 65538)
!732 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!733 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!734 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!735 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!736 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!737 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!738 = !DIEnumerator(name: "__YESSTR", value: 327682)
!739 = !DIEnumerator(name: "__NOSTR", value: 327683)
!740 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!741 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!742 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!743 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!744 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!745 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!746 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!747 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!748 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!749 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!750 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!751 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!752 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!753 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!754 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!755 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!756 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!757 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!758 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!759 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!760 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!761 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!762 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!763 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!764 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!765 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!766 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!767 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!768 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!769 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!770 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!771 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!772 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!773 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!774 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!775 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!776 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!777 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!778 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!779 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!780 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!781 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!782 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!783 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!784 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!785 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!786 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!787 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!788 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!789 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!790 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!791 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!792 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!793 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!794 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!795 = !{!27, !25, !796}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!797 = !{!452}
!798 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!799 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !68)
!800 = distinct !DICompileUnit(language: DW_LANG_C99, file: !801, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313)
!801 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!802 = distinct !DICompileUnit(language: DW_LANG_C99, file: !803, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !804)
!803 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !806, line: 111, baseType: !807)
!806 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !31, line: 61, baseType: !32)
!808 = distinct !DICompileUnit(language: DW_LANG_C99, file: !809, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !810, retainedTypes: !815)
!809 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!810 = !{!811}
!811 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !812, line: 41, size: 32, elements: !813)
!812 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!813 = !{!814}
!814 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2017)
!815 = !{!27}
!816 = distinct !DICompileUnit(language: DW_LANG_C99, file: !817, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !818, retainedTypes: !832)
!817 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!818 = !{!819}
!819 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !821, file: !820, line: 192, size: 32, elements: !830)
!820 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!821 = distinct !DISubprogram(name: "x2nrealloc", scope: !820, file: !820, line: 180, type: !822, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !816, variables: !825)
!822 = !DISubroutineType(types: !823)
!823 = !{!27, !27, !824, !233}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!825 = !{!826, !827, !828, !829}
!826 = !DILocalVariable(name: "p", arg: 1, scope: !821, file: !820, line: 180, type: !27)
!827 = !DILocalVariable(name: "pn", arg: 2, scope: !821, file: !820, line: 180, type: !824)
!828 = !DILocalVariable(name: "s", arg: 3, scope: !821, file: !820, line: 180, type: !233)
!829 = !DILocalVariable(name: "n", scope: !821, file: !820, line: 182, type: !233)
!830 = !{!831}
!831 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!832 = !{!233, !25, !27}
!833 = distinct !DICompileUnit(language: DW_LANG_C99, file: !834, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313)
!834 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!835 = distinct !DICompileUnit(language: DW_LANG_C99, file: !836, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !815)
!836 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!837 = distinct !DICompileUnit(language: DW_LANG_C99, file: !838, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !839)
!838 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!839 = !{!233}
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !842, retainedTypes: !850)
!841 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!842 = !{!5, !843}
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !844, file: !820, line: 192, size: 32, elements: !830)
!844 = distinct !DISubprogram(name: "x2nrealloc", scope: !820, file: !820, line: 180, type: !822, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !840, variables: !845)
!845 = !{!846, !847, !848, !849}
!846 = !DILocalVariable(name: "p", arg: 1, scope: !844, file: !820, line: 180, type: !27)
!847 = !DILocalVariable(name: "pn", arg: 2, scope: !844, file: !820, line: 180, type: !824)
!848 = !DILocalVariable(name: "s", arg: 3, scope: !844, file: !820, line: 180, type: !233)
!849 = !DILocalVariable(name: "n", scope: !844, file: !820, line: 182, type: !233)
!850 = !{!25, !27}
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313)
!852 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !854, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313)
!854 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !815)
!856 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "clang version 5.0.1 (tags/RELEASE_501/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !815)
!858 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!859 = !{!"clang version 5.0.1 (tags/RELEASE_501/final)"}
!860 = !{i32 2, !"Dwarf Version", i32 4}
!861 = !{i32 2, !"Debug Info Version", i32 3}
!862 = !{i32 1, !"wchar_size", i32 4}
!863 = !{i32 7, !"PIC Level", i32 2}
!864 = !{i32 7, !"PIE Level", i32 2}
!865 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 637, type: !866, isLocal: false, isDefinition: true, scopeLine: 638, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, variables: !868)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !72}
!868 = !{!869}
!869 = !DILocalVariable(name: "status", arg: 1, scope: !865, file: !3, line: 637, type: !72)
!870 = !DIExpression()
!871 = !DILocation(line: 637, column: 12, scope: !865)
!872 = !DILocation(line: 639, column: 14, scope: !873)
!873 = distinct !DILexicalBlock(scope: !865, file: !3, line: 639, column: 7)
!874 = !DILocation(line: 639, column: 7, scope: !865)
!875 = !DILocation(line: 640, column: 5, scope: !876)
!876 = distinct !DILexicalBlock(scope: !873, file: !3, line: 640, column: 5)
!877 = !{!878, !878, i64 0}
!878 = !{!"any pointer", !879, i64 0}
!879 = !{!"omnipotent char", !880, i64 0}
!880 = !{!"Simple C/C++ TBAA"}
!881 = !DILocation(line: 643, column: 7, scope: !882)
!882 = distinct !DILexicalBlock(scope: !873, file: !3, line: 642, column: 5)
!883 = !DILocation(line: 644, column: 7, scope: !882)
!884 = !DILocation(line: 647, column: 7, scope: !882)
!885 = !DILocation(line: 654, column: 7, scope: !882)
!886 = !DILocation(line: 657, column: 7, scope: !882)
!887 = !DILocation(line: 662, column: 7, scope: !882)
!888 = !DILocation(line: 668, column: 7, scope: !882)
!889 = !DILocation(line: 674, column: 7, scope: !882)
!890 = !DILocation(line: 675, column: 7, scope: !882)
!891 = !DILocation(line: 676, column: 7, scope: !882)
!892 = !DILocation(line: 642, column: 15, scope: !75, inlinedAt: !893)
!893 = distinct !DILocation(line: 681, column: 7, scope: !882)
!894 = !DILocation(line: 651, column: 3, scope: !75, inlinedAt: !893)
!895 = !DILocation(line: 655, column: 29, scope: !75, inlinedAt: !893)
!896 = !DILocation(line: 655, column: 15, scope: !75, inlinedAt: !893)
!897 = !DILocation(line: 656, column: 7, scope: !898, inlinedAt: !893)
!898 = distinct !DILexicalBlock(scope: !75, file: !76, line: 656, column: 7)
!899 = !DILocation(line: 656, column: 19, scope: !898, inlinedAt: !893)
!900 = !DILocation(line: 656, column: 22, scope: !898, inlinedAt: !893)
!901 = !DILocation(line: 656, column: 7, scope: !75, inlinedAt: !893)
!902 = !DILocation(line: 662, column: 7, scope: !903, inlinedAt: !893)
!903 = distinct !DILexicalBlock(scope: !898, file: !76, line: 657, column: 5)
!904 = !DILocation(line: 664, column: 5, scope: !903, inlinedAt: !893)
!905 = !DILocation(line: 665, column: 3, scope: !75, inlinedAt: !893)
!906 = !DILocation(line: 667, column: 3, scope: !75, inlinedAt: !893)
!907 = !DILocation(line: 683, column: 3, scope: !865)
!908 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 687, type: !909, isLocal: false, isDefinition: true, scopeLine: 688, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !912)
!909 = !DISubroutineType(types: !910)
!910 = !{!72, !72, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!912 = !{!913, !914, !915, !916}
!913 = !DILocalVariable(name: "argc", arg: 1, scope: !908, file: !3, line: 687, type: !72)
!914 = !DILocalVariable(name: "argv", arg: 2, scope: !908, file: !3, line: 687, type: !911)
!915 = !DILocalVariable(name: "optc", scope: !908, file: !3, line: 689, type: !72)
!916 = !DILocalVariable(name: "assumptions", scope: !908, file: !3, line: 690, type: !37)
!917 = !DILocation(line: 687, column: 11, scope: !908)
!918 = !DILocation(line: 687, column: 24, scope: !908)
!919 = !DILocation(line: 690, column: 8, scope: !908)
!920 = !DILocation(line: 693, column: 21, scope: !908)
!921 = !DILocation(line: 693, column: 3, scope: !908)
!922 = !DILocation(line: 694, column: 3, scope: !908)
!923 = !DILocation(line: 695, column: 3, scope: !908)
!924 = !DILocation(line: 696, column: 3, scope: !908)
!925 = !DILocation(line: 698, column: 3, scope: !908)
!926 = !DILocation(line: 700, column: 3, scope: !908)
!927 = !DILocation(line: 700, column: 18, scope: !908)
!928 = !DILocation(line: 689, column: 7, scope: !908)
!929 = !DILocation(line: 717, column: 11, scope: !930)
!930 = distinct !DILexicalBlock(scope: !931, file: !3, line: 704, column: 9)
!931 = distinct !DILexicalBlock(scope: !908, file: !3, line: 702, column: 5)
!932 = !DILocation(line: 729, column: 11, scope: !930)
!933 = !DILocation(line: 733, column: 11, scope: !930)
!934 = !DILocation(line: 739, column: 11, scope: !930)
!935 = !DILocation(line: 743, column: 11, scope: !930)
!936 = !DILocation(line: 748, column: 11, scope: !930)
!937 = !DILocation(line: 752, column: 11, scope: !930)
!938 = !DILocation(line: 758, column: 11, scope: !930)
!939 = !DILocation(line: 762, column: 11, scope: !930)
!940 = !DILocation(line: 767, column: 11, scope: !930)
!941 = !DILocation(line: 772, column: 11, scope: !930)
!942 = !DILocation(line: 778, column: 11, scope: !930)
!943 = !DILocation(line: 782, column: 11, scope: !930)
!944 = !DILocation(line: 784, column: 9, scope: !930)
!945 = !DILocation(line: 786, column: 9, scope: !930)
!946 = !DILocation(line: 789, column: 11, scope: !930)
!947 = distinct !{!947, !926, !948}
!948 = !DILocation(line: 791, column: 5, scope: !908)
!949 = !DILocation(line: 793, column: 7, scope: !950)
!950 = distinct !DILexicalBlock(scope: !908, file: !3, line: 793, column: 7)
!951 = !DILocation(line: 793, column: 7, scope: !908)
!952 = !DILocation(line: 797, column: 5, scope: !953)
!953 = distinct !DILexicalBlock(scope: !950, file: !3, line: 794, column: 5)
!954 = !DILocation(line: 799, column: 7, scope: !908)
!955 = !DILocation(line: 802, column: 5, scope: !956)
!956 = distinct !DILexicalBlock(scope: !957, file: !3, line: 800, column: 5)
!957 = distinct !DILexicalBlock(scope: !908, file: !3, line: 799, column: 7)
!958 = !DILocation(line: 804, column: 7, scope: !959)
!959 = distinct !DILexicalBlock(scope: !908, file: !3, line: 804, column: 7)
!960 = !DILocation(line: 804, column: 7, scope: !908)
!961 = !{!962, !962, i64 0}
!962 = !{!"int", !879, i64 0}
!963 = !DILocation(line: 815, column: 18, scope: !908)
!964 = !DILocation(line: 815, column: 16, scope: !908)
!965 = !DILocation(line: 815, column: 3, scope: !908)
!966 = !DILocation(line: 818, column: 7, scope: !967)
!967 = distinct !DILexicalBlock(scope: !908, file: !3, line: 816, column: 5)
!968 = !DILocation(line: 822, column: 7, scope: !967)
!969 = !DILocation(line: 823, column: 7, scope: !967)
!970 = !DILocation(line: 826, column: 12, scope: !967)
!971 = !DILocation(line: 826, column: 7, scope: !967)
!972 = !DILocation(line: 827, column: 7, scope: !967)
!973 = !DILocation(line: 830, column: 20, scope: !967)
!974 = !DILocation(line: 830, column: 55, scope: !967)
!975 = !DILocation(line: 830, column: 62, scope: !967)
!976 = !DILocation(line: 830, column: 50, scope: !967)
!977 = !DILocation(line: 830, column: 43, scope: !967)
!978 = !DILocation(line: 830, column: 7, scope: !967)
!979 = !DILocation(line: 831, column: 7, scope: !967)
!980 = !DILocation(line: 834, column: 3, scope: !908)
!981 = distinct !DISubprogram(name: "who", scope: !3, file: !3, line: 620, type: !982, isLocal: true, isDefinition: true, scopeLine: 621, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !984)
!982 = !DISubroutineType(types: !983)
!983 = !{null, !68, !72}
!984 = !{!985, !986, !987, !988}
!985 = !DILocalVariable(name: "filename", arg: 1, scope: !981, file: !3, line: 620, type: !68)
!986 = !DILocalVariable(name: "options", arg: 2, scope: !981, file: !3, line: 620, type: !72)
!987 = !DILocalVariable(name: "n_users", scope: !981, file: !3, line: 622, type: !233)
!988 = !DILocalVariable(name: "utmp_buf", scope: !981, file: !3, line: 623, type: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!990 = !DILocation(line: 338, column: 8, scope: !127, inlinedAt: !991)
!991 = distinct !DILocation(line: 592, column: 13, scope: !992, inlinedAt: !1004)
!992 = distinct !DILexicalBlock(scope: !993, file: !3, line: 591, column: 15)
!993 = distinct !DILexicalBlock(scope: !994, file: !3, line: 590, column: 9)
!994 = distinct !DILexicalBlock(scope: !995, file: !3, line: 587, column: 11)
!995 = distinct !DILexicalBlock(scope: !996, file: !3, line: 586, column: 5)
!996 = distinct !DISubprogram(name: "scan_entries", scope: !3, file: !3, line: 568, type: !997, isLocal: true, isDefinition: true, scopeLine: 569, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !999)
!997 = !DISubroutineType(types: !998)
!998 = !{null, !233, !130}
!999 = !{!1000, !1001, !1002, !1003}
!1000 = !DILocalVariable(name: "n", arg: 1, scope: !996, file: !3, line: 568, type: !233)
!1001 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !996, file: !3, line: 568, type: !130)
!1002 = !DILocalVariable(name: "ttyname_b", scope: !996, file: !3, line: 570, type: !25)
!1003 = !DILocalVariable(name: "boottime", scope: !996, file: !3, line: 571, type: !28)
!1004 = distinct !DILocation(line: 631, column: 5, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !981, file: !3, line: 628, column: 7)
!1006 = !DILocation(line: 347, column: 8, scope: !127, inlinedAt: !991)
!1007 = !DILocation(line: 349, column: 3, scope: !127, inlinedAt: !991)
!1008 = !DILocation(line: 377, column: 12, scope: !224, inlinedAt: !991)
!1009 = !DILocation(line: 620, column: 18, scope: !981)
!1010 = !DILocation(line: 620, column: 32, scope: !981)
!1011 = !DILocation(line: 622, column: 3, scope: !981)
!1012 = !DILocation(line: 623, column: 3, scope: !981)
!1013 = !DILocation(line: 622, column: 10, scope: !981)
!1014 = !DILocation(line: 623, column: 16, scope: !981)
!1015 = !DILocation(line: 625, column: 7, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !981, file: !3, line: 625, column: 7)
!1017 = !DILocation(line: 625, column: 58, scope: !1016)
!1018 = !DILocation(line: 625, column: 7, scope: !981)
!1019 = !DILocation(line: 626, column: 5, scope: !1016)
!1020 = !{!1021, !1021, i64 0}
!1021 = !{!"long", !879, i64 0}
!1022 = !DILocation(line: 628, column: 7, scope: !981)
!1023 = !DILocalVariable(name: "n", arg: 1, scope: !1024, file: !3, line: 536, type: !233)
!1024 = distinct !DISubprogram(name: "list_entries_who", scope: !3, file: !3, line: 536, type: !997, isLocal: true, isDefinition: true, scopeLine: 537, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1025)
!1025 = !{!1023, !1026, !1027, !1028, !1029}
!1026 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !1024, file: !3, line: 536, type: !130)
!1027 = !DILocalVariable(name: "entries", scope: !1024, file: !3, line: 538, type: !179)
!1028 = !DILocalVariable(name: "separator", scope: !1024, file: !3, line: 539, type: !68)
!1029 = !DILocalVariable(name: "trimmed_name", scope: !1030, file: !3, line: 545, type: !25)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 544, column: 9)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 543, column: 11)
!1032 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 542, column: 5)
!1033 = !DILocation(line: 536, column: 26, scope: !1024, inlinedAt: !1034)
!1034 = distinct !DILocation(line: 629, column: 5, scope: !1005)
!1035 = !DILocation(line: 536, column: 48, scope: !1024, inlinedAt: !1034)
!1036 = !DILocation(line: 538, column: 21, scope: !1024, inlinedAt: !1034)
!1037 = !DILocation(line: 539, column: 15, scope: !1024, inlinedAt: !1034)
!1038 = !DILocation(line: 541, column: 3, scope: !1024, inlinedAt: !1034)
!1039 = !DILocation(line: 541, column: 11, scope: !1024, inlinedAt: !1034)
!1040 = !DILocation(line: 543, column: 11, scope: !1031, inlinedAt: !1034)
!1041 = !{!879, !879, i64 0}
!1042 = !{!1043, !1044, i64 0}
!1043 = !{!"utmpx", !1044, i64 0, !962, i64 4, !879, i64 8, !879, i64 40, !879, i64 44, !879, i64 76, !1045, i64 332, !962, i64 336, !1046, i64 340, !879, i64 348, !879, i64 364}
!1044 = !{!"short", !879, i64 0}
!1045 = !{!"__exit_status", !1044, i64 0, !1044, i64 2}
!1046 = !{!"", !962, i64 0, !962, i64 4}
!1047 = !DILocation(line: 543, column: 11, scope: !1032, inlinedAt: !1034)
!1048 = !DILocation(line: 547, column: 26, scope: !1030, inlinedAt: !1034)
!1049 = !DILocation(line: 545, column: 17, scope: !1030, inlinedAt: !1034)
!1050 = !DILocation(line: 549, column: 11, scope: !1030, inlinedAt: !1034)
!1051 = !DILocation(line: 550, column: 11, scope: !1030, inlinedAt: !1034)
!1052 = !DILocation(line: 552, column: 18, scope: !1030, inlinedAt: !1034)
!1053 = !DILocation(line: 553, column: 9, scope: !1030, inlinedAt: !1034)
!1054 = !DILocation(line: 554, column: 15, scope: !1032, inlinedAt: !1034)
!1055 = distinct !{!1055, !1056, !1057}
!1056 = !DILocation(line: 541, column: 3, scope: !1024)
!1057 = !DILocation(line: 555, column: 5, scope: !1024)
!1058 = !DILocation(line: 556, column: 3, scope: !1024, inlinedAt: !1034)
!1059 = !DILocation(line: 629, column: 5, scope: !1005)
!1060 = !DILocation(line: 462, column: 3, scope: !292, inlinedAt: !1061)
!1061 = distinct !DILocation(line: 607, column: 13, scope: !1062, inlinedAt: !1004)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 606, column: 20)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 604, column: 20)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 602, column: 20)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 600, column: 20)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 595, column: 20)
!1067 = distinct !DILexicalBlock(scope: !992, file: !3, line: 593, column: 20)
!1068 = !DILocalVariable(name: "pidstr", scope: !1069, file: !3, line: 484, type: !220)
!1069 = distinct !DISubprogram(name: "print_login", scope: !3, file: !3, line: 481, type: !281, isLocal: true, isDefinition: true, scopeLine: 482, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1070)
!1070 = !{!1071, !1072, !1068}
!1071 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !1069, file: !3, line: 481, type: !130)
!1072 = !DILocalVariable(name: "comment", scope: !1069, file: !3, line: 483, type: !25)
!1073 = !DILocation(line: 484, column: 3, scope: !1069, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 605, column: 13, scope: !1063, inlinedAt: !1004)
!1075 = !DILocalVariable(name: "pidstr", scope: !1076, file: !3, line: 497, type: !220)
!1076 = distinct !DISubprogram(name: "print_initspawn", scope: !3, file: !3, line: 494, type: !281, isLocal: true, isDefinition: true, scopeLine: 495, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1077)
!1077 = !{!1078, !1079, !1075}
!1078 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !1076, file: !3, line: 494, type: !130)
!1079 = !DILocalVariable(name: "comment", scope: !1076, file: !3, line: 496, type: !25)
!1080 = !DILocation(line: 497, column: 3, scope: !1076, inlinedAt: !1081)
!1081 = distinct !DILocation(line: 603, column: 13, scope: !1064, inlinedAt: !1004)
!1082 = !DILocation(line: 568, column: 22, scope: !996, inlinedAt: !1004)
!1083 = !DILocation(line: 568, column: 44, scope: !996, inlinedAt: !1004)
!1084 = !DILocation(line: 571, column: 10, scope: !996, inlinedAt: !1004)
!1085 = !DILocation(line: 573, column: 7, scope: !996, inlinedAt: !1004)
!1086 = !DILocation(line: 562, column: 19, scope: !1087, inlinedAt: !1090)
!1087 = distinct !DISubprogram(name: "print_heading", scope: !3, file: !3, line: 560, type: !1088, isLocal: true, isDefinition: true, scopeLine: 561, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !313)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{null}
!1090 = distinct !DILocation(line: 574, column: 5, scope: !1091, inlinedAt: !1004)
!1091 = distinct !DILexicalBlock(scope: !996, file: !3, line: 573, column: 7)
!1092 = !DILocation(line: 562, column: 39, scope: !1087, inlinedAt: !1090)
!1093 = !DILocation(line: 562, column: 50, scope: !1087, inlinedAt: !1090)
!1094 = !DILocation(line: 562, column: 61, scope: !1087, inlinedAt: !1090)
!1095 = !DILocation(line: 563, column: 15, scope: !1087, inlinedAt: !1090)
!1096 = !DILocation(line: 563, column: 25, scope: !1087, inlinedAt: !1090)
!1097 = !DILocation(line: 563, column: 39, scope: !1087, inlinedAt: !1090)
!1098 = !DILocation(line: 562, column: 3, scope: !1087, inlinedAt: !1090)
!1099 = !DILocation(line: 574, column: 5, scope: !1091, inlinedAt: !1004)
!1100 = !DILocation(line: 576, column: 7, scope: !996, inlinedAt: !1004)
!1101 = !DILocation(line: 578, column: 19, scope: !1102, inlinedAt: !1004)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 577, column: 5)
!1103 = distinct !DILexicalBlock(scope: !996, file: !3, line: 576, column: 7)
!1104 = !DILocation(line: 570, column: 9, scope: !996, inlinedAt: !1004)
!1105 = !DILocation(line: 579, column: 12, scope: !1106, inlinedAt: !1004)
!1106 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 579, column: 11)
!1107 = !DILocation(line: 579, column: 11, scope: !1102, inlinedAt: !1004)
!1108 = !DILocation(line: 581, column: 11, scope: !1109, inlinedAt: !1004)
!1109 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 581, column: 11)
!1110 = !DILocation(line: 581, column: 64, scope: !1109, inlinedAt: !1004)
!1111 = !DILocation(line: 582, column: 19, scope: !1109, inlinedAt: !1004)
!1112 = !DILocation(line: 581, column: 11, scope: !1102, inlinedAt: !1004)
!1113 = !DILocation(line: 585, column: 3, scope: !996, inlinedAt: !1004)
!1114 = !DILocation(line: 585, column: 11, scope: !996, inlinedAt: !1004)
!1115 = !DILocation(line: 588, column: 11, scope: !994, inlinedAt: !1004)
!1116 = !DILocation(line: 588, column: 14, scope: !994, inlinedAt: !1004)
!1117 = !DILocation(line: 587, column: 11, scope: !995, inlinedAt: !1004)
!1118 = !DILocation(line: 591, column: 26, scope: !992, inlinedAt: !1004)
!1119 = !DILocation(line: 591, column: 29, scope: !992, inlinedAt: !1004)
!1120 = !DILocation(line: 591, column: 15, scope: !993, inlinedAt: !1004)
!1121 = !DILocation(line: 333, column: 32, scope: !127, inlinedAt: !991)
!1122 = !DILocation(line: 333, column: 49, scope: !127, inlinedAt: !991)
!1123 = !DILocation(line: 335, column: 3, scope: !127, inlinedAt: !991)
!1124 = !DILocation(line: 338, column: 3, scope: !127, inlinedAt: !991)
!1125 = !DILocation(line: 347, column: 3, scope: !127, inlinedAt: !991)
!1126 = !DILocation(line: 348, column: 9, scope: !127, inlinedAt: !991)
!1127 = !{!1043, !962, i64 4}
!1128 = !DILocation(line: 354, column: 10, scope: !1129, inlinedAt: !991)
!1129 = distinct !DILexicalBlock(scope: !127, file: !3, line: 354, column: 8)
!1130 = !DILocation(line: 354, column: 8, scope: !127, inlinedAt: !991)
!1131 = !DILocation(line: 355, column: 9, scope: !1129, inlinedAt: !991)
!1132 = !DILocalVariable(name: "src_end", scope: !1133, file: !76, line: 739, type: !68)
!1133 = distinct !DISubprogram(name: "stzncpy", scope: !76, file: !76, line: 737, type: !1134, isLocal: true, isDefinition: true, scopeLine: 738, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1138)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!25, !1136, !1137, !233}
!1136 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !25)
!1137 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!1138 = !{!1139, !1140, !1141, !1132}
!1139 = !DILocalVariable(name: "dest", arg: 1, scope: !1133, file: !76, line: 737, type: !1136)
!1140 = !DILocalVariable(name: "src", arg: 2, scope: !1133, file: !76, line: 737, type: !1137)
!1141 = !DILocalVariable(name: "len", arg: 3, scope: !1133, file: !76, line: 737, type: !233)
!1142 = !DIExpression(DW_OP_plus_uconst, 40, DW_OP_stack_value)
!1143 = !DILocation(line: 739, column: 15, scope: !1133, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 356, column: 3, scope: !127, inlinedAt: !991)
!1145 = !DILocation(line: 737, column: 25, scope: !1133, inlinedAt: !1144)
!1146 = !DILocation(line: 737, column: 52, scope: !1133, inlinedAt: !1144)
!1147 = !DILocation(line: 740, column: 24, scope: !1133, inlinedAt: !1144)
!1148 = !DILocation(line: 740, column: 3, scope: !1133, inlinedAt: !1144)
!1149 = !DILocation(line: 739, column: 29, scope: !1133, inlinedAt: !1144)
!1150 = !DILocation(line: 741, column: 19, scope: !1133, inlinedAt: !1144)
!1151 = !DILocation(line: 741, column: 10, scope: !1133, inlinedAt: !1144)
!1152 = !DILocation(line: 741, column: 13, scope: !1133, inlinedAt: !1144)
!1153 = !{!1154}
!1154 = distinct !{!1154, !1155, !"stzncpy: argument 0"}
!1155 = distinct !{!1155, !"stzncpy"}
!1156 = !{!1157}
!1157 = distinct !{!1157, !1155, !"stzncpy: argument 1"}
!1158 = !DILocation(line: 740, column: 14, scope: !1133, inlinedAt: !1144)
!1159 = distinct !{!1159, !1160, !1161}
!1160 = !DILocation(line: 740, column: 3, scope: !1133)
!1161 = !DILocation(line: 741, column: 19, scope: !1133)
!1162 = !DILocation(line: 740, column: 27, scope: !1133, inlinedAt: !1144)
!1163 = !DILocation(line: 742, column: 9, scope: !1133, inlinedAt: !1144)
!1164 = !DILocation(line: 335, column: 15, scope: !127, inlinedAt: !991)
!1165 = !DILocalVariable(name: "__path", arg: 1, scope: !1166, file: !1167, line: 449, type: !68)
!1166 = distinct !DISubprogram(name: "stat", scope: !1167, file: !1167, line: 449, type: !1168, isLocal: false, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1171)
!1167 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/decomp/testdata/coreutils/coreutils-8.27")
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!72, !68, !1170}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!1171 = !{!1165, !1172}
!1172 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1166, file: !1167, line: 449, type: !1170)
!1173 = !DILocation(line: 449, column: 1, scope: !1166, inlinedAt: !1174)
!1174 = distinct !DILocation(line: 358, column: 7, scope: !1175, inlinedAt: !991)
!1175 = distinct !DILexicalBlock(scope: !127, file: !3, line: 358, column: 7)
!1176 = !DILocation(line: 451, column: 10, scope: !1166, inlinedAt: !1174)
!1177 = !DILocation(line: 358, column: 27, scope: !1175, inlinedAt: !991)
!1178 = !DILocation(line: 358, column: 7, scope: !127, inlinedAt: !991)
!1179 = !DILocalVariable(name: "pstat", arg: 1, scope: !1180, file: !3, line: 317, type: !1183)
!1180 = distinct !DISubprogram(name: "is_tty_writable", scope: !3, file: !3, line: 317, type: !1181, isLocal: true, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1185)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!37, !1183}
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!1185 = !{!1179}
!1186 = !DILocation(line: 317, column: 37, scope: !1180, inlinedAt: !1187)
!1187 = distinct !DILocation(line: 360, column: 14, scope: !1188, inlinedAt: !991)
!1188 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 359, column: 5)
!1189 = !DILocation(line: 327, column: 17, scope: !1180, inlinedAt: !1187)
!1190 = !{!1191, !962, i64 24}
!1191 = !{!"stat", !1021, i64 0, !1021, i64 8, !1021, i64 16, !962, i64 24, !962, i64 28, !962, i64 32, !962, i64 36, !1021, i64 40, !1021, i64 48, !1021, i64 56, !1021, i64 64, !1192, i64 72, !1192, i64 88, !1192, i64 104, !879, i64 120}
!1192 = !{!"timespec", !1021, i64 0, !1021, i64 8}
!1193 = !DILocation(line: 360, column: 14, scope: !1188, inlinedAt: !991)
!1194 = !DILocation(line: 337, column: 8, scope: !127, inlinedAt: !991)
!1195 = !DILocation(line: 361, column: 27, scope: !1188, inlinedAt: !991)
!1196 = !{!1191, !1021, i64 72}
!1197 = !DILocation(line: 336, column: 10, scope: !127, inlinedAt: !991)
!1198 = !DILocation(line: 369, column: 7, scope: !1199, inlinedAt: !991)
!1199 = distinct !DILexicalBlock(scope: !127, file: !3, line: 369, column: 7)
!1200 = !DILocation(line: 369, column: 7, scope: !127, inlinedAt: !991)
!1201 = !DILocation(line: 188, column: 21, scope: !237, inlinedAt: !1202)
!1202 = distinct !DILocation(line: 370, column: 5, scope: !1199, inlinedAt: !991)
!1203 = !DILocation(line: 188, column: 34, scope: !237, inlinedAt: !1202)
!1204 = !DILocation(line: 192, column: 7, scope: !1205, inlinedAt: !1202)
!1205 = distinct !DILexicalBlock(scope: !237, file: !3, line: 192, column: 7)
!1206 = !DILocation(line: 192, column: 11, scope: !1205, inlinedAt: !1202)
!1207 = !DILocation(line: 192, column: 7, scope: !237, inlinedAt: !1202)
!1208 = !DILocation(line: 193, column: 5, scope: !1205, inlinedAt: !1202)
!1209 = !DILocation(line: 195, column: 16, scope: !245, inlinedAt: !1202)
!1210 = !DILocation(line: 195, column: 23, scope: !245, inlinedAt: !1202)
!1211 = !DILocation(line: 195, column: 26, scope: !245, inlinedAt: !1202)
!1212 = !DILocation(line: 195, column: 30, scope: !245, inlinedAt: !1202)
!1213 = !DILocation(line: 195, column: 45, scope: !245, inlinedAt: !1202)
!1214 = !DILocation(line: 195, column: 60, scope: !245, inlinedAt: !1202)
!1215 = !DILocation(line: 195, column: 52, scope: !245, inlinedAt: !1202)
!1216 = !DILocation(line: 197, column: 30, scope: !244, inlinedAt: !1202)
!1217 = !DILocation(line: 197, column: 26, scope: !244, inlinedAt: !1202)
!1218 = !DILocation(line: 197, column: 11, scope: !244, inlinedAt: !1202)
!1219 = !DILocation(line: 198, column: 24, scope: !1220, inlinedAt: !1202)
!1220 = distinct !DILexicalBlock(scope: !244, file: !3, line: 198, column: 11)
!1221 = !DILocation(line: 198, column: 11, scope: !244, inlinedAt: !1202)
!1222 = !DILocation(line: 205, column: 11, scope: !1223, inlinedAt: !1202)
!1223 = distinct !DILexicalBlock(scope: !1224, file: !3, line: 205, column: 11)
!1224 = distinct !DILexicalBlock(scope: !1225, file: !3, line: 205, column: 11)
!1225 = distinct !DILexicalBlock(scope: !1220, file: !3, line: 201, column: 9)
!1226 = !DILocation(line: 205, column: 11, scope: !1224, inlinedAt: !1202)
!1227 = !DILocation(line: 206, column: 11, scope: !1225, inlinedAt: !1202)
!1228 = !DILocation(line: 209, column: 11, scope: !1225, inlinedAt: !1202)
!1229 = !DILocation(line: 213, column: 10, scope: !237, inlinedAt: !1202)
!1230 = !DILocation(line: 213, column: 3, scope: !237, inlinedAt: !1202)
!1231 = !DILocation(line: 370, column: 5, scope: !1199, inlinedAt: !991)
!1232 = !DILocation(line: 372, column: 5, scope: !1199, inlinedAt: !991)
!1233 = !DILocation(line: 375, column: 7, scope: !225, inlinedAt: !991)
!1234 = !DILocation(line: 375, column: 7, scope: !127, inlinedAt: !991)
!1235 = !DILocation(line: 377, column: 7, scope: !224, inlinedAt: !991)
!1236 = !DILocation(line: 378, column: 13, scope: !224, inlinedAt: !991)
!1237 = !DILocation(line: 379, column: 13, scope: !224, inlinedAt: !991)
!1238 = !DILocation(line: 739, column: 29, scope: !1133, inlinedAt: !1239)
!1239 = distinct !DILocation(line: 382, column: 7, scope: !224, inlinedAt: !991)
!1240 = !DILocation(line: 739, column: 15, scope: !1133, inlinedAt: !1239)
!1241 = !DILocation(line: 737, column: 25, scope: !1133, inlinedAt: !1239)
!1242 = !DILocation(line: 737, column: 52, scope: !1133, inlinedAt: !1239)
!1243 = !DILocation(line: 740, column: 3, scope: !1133, inlinedAt: !1239)
!1244 = !DILocation(line: 741, column: 19, scope: !1133, inlinedAt: !1239)
!1245 = !DILocation(line: 741, column: 10, scope: !1133, inlinedAt: !1239)
!1246 = !DILocation(line: 741, column: 13, scope: !1133, inlinedAt: !1239)
!1247 = !{!1248}
!1248 = distinct !{!1248, !1249, !"stzncpy: argument 0"}
!1249 = distinct !{!1249, !"stzncpy"}
!1250 = !{!1251}
!1251 = distinct !{!1251, !1249, !"stzncpy: argument 1"}
!1252 = !DILocation(line: 740, column: 14, scope: !1133, inlinedAt: !1239)
!1253 = !DILocation(line: 740, column: 24, scope: !1133, inlinedAt: !1239)
!1254 = !DILocation(line: 740, column: 27, scope: !1133, inlinedAt: !1239)
!1255 = !DILocation(line: 742, column: 9, scope: !1133, inlinedAt: !1239)
!1256 = !DILocation(line: 385, column: 17, scope: !224, inlinedAt: !991)
!1257 = !DILocation(line: 386, column: 11, scope: !1258, inlinedAt: !991)
!1258 = distinct !DILexicalBlock(scope: !224, file: !3, line: 386, column: 11)
!1259 = !DILocation(line: 386, column: 11, scope: !224, inlinedAt: !991)
!1260 = !DILocation(line: 387, column: 17, scope: !1258, inlinedAt: !991)
